[{"title":"The Rebellious Villainess Doesn’t Want To Be Swayed By The Obsessive Prince!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Rebellious Villainess Doesn’t Want To Be Swayed By The Obsessive Prince!"]},{"title":"Tyrant wants a better life","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Tyrant wants a better life / The Tyrant Wants To Live Honestly / The Tyrant Wants to Live a Virtuous Life","Dorothy has always been discriminated against and ignored by others. In the end, she decided to kill all her brothers and take the throne.\nShe received no response from the son she loved. In the end, she was widely criticized as a tyrant and was executed.\nBut when she opened her eyes, she found herself back in her childhood.\n“Can’t just let it end like this.”\nShe was determined not to let the same fate repeat two lives. Definitely live a good life this time. That was her goal."]},{"title":"Today the Villainess has Fun Again","tags":["Fantasy","Historical","Isekai","Josei","Magic","Reincarnation","Romance","Time travel","Villainess"],"disc":["Read manga Today the Villainess has Fun Again / The Villainess is Happy Today / Another Happy Day for the Villainess / 악녀는 오늘도 즐겁다\nMy friend stole my boyfriend and then dared to hand me a wedding invitation with a smile?\nHa! I had a blast enjoying my revenge and came home and fell asleep but…\nWhen I woke up I was in the body of the Villainess of a Romance Fantasy novel who has everything, appearance, assets, and intelligence.\nThe only thing this girl lacked was the insight to judge a man.\nThrow the bastard Prince away to the main female lead and let us just enjoy the luxury of power and money!"]},{"title":"Player Super Justice","tags":["Action","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Player Super Justice / Wanjia Chao Zhengyi / 玩家超正义"]},{"title":"I Want to Be You, Just For A Day","tags":["Fantasy","Historical","Manhwa","Mystery","Psychological","Romance","Webtoons"],"disc":["Read manga I Want to Be You, Just For A Day / I Wanna Be U / Seu Trono / Your Throne / 하루만 네가 되고 싶어 / To Be You, Even Just for a Day\nThe count’s daughter, Lady Psyche, is a soul loved by everyone. She easily gets anything she wants, and stole everything from me. I want to be her, just for a day."]},{"title":"Misfortune at Work","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Misfortune at Work , It’s Just Business, Неудача босса, 상사불상사","Absolute obedience to the word of the boss!This is what Ha Eun-ho, a fifth-year Korean worker believes wholeheartedly.’As long as I have a solid career, I don’t need a relationship.’But what’s in store for her as a new recruit? What happens when an old flame starts flirting with her again? What will she do?A sweet office romance comedy!"]},{"title":"Unaware His Majesty Is A Girl","tags":["Comedy","Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Unaware His Majesty Is A Girl / 不知陛下是女郎 / Buzhi Bixia Shi Nülang / Hoàng đế bệ hạ là nữ lang / ဘုရင်ကြီးကမိန်းကလေးမှန်းမသိခဲ့ဘူး","The new emperor, Qi Nian, acceded to the throne many years ago. He kept refusing the requests by his officials to choose a consort, brushing them off by saying “the affairs of state are important, and I am busy with my work”. But Qi Nian finally relented as rumors that “the emperor is impotent” spread ever more widely.Yu Dingdang was a particularly dim-witted girl, but born to a prestigious family. This led many to say: “Madame Yu exchanged her brain for her looks”. Who could have expected that Yu would be selected by the emperor to be his empress consort?A happy and dramatic girl-girl romantic comedy set in the imperial palace. Yu couldn’t have expected that this lofty emperor up on high was actually a girl?!"]},{"title":"Holy Night: The Zero","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Holy Night: The Zero / 거룩한 밤 : 더 제로","Brothers Kang Bau and Joseph were raised together in an ordinary orphanage, but their paths would drastically diverge. Joseph, who became an exorcist priest, descends into darkness and brutally slaughters the orphanage family that raised them, transforming into Lucifer, the great demon. Armed with nothing but his superhuman strength and bare fists, Bau swears vengeance and hunts down Joseph’s trail. Yet even Bau’s extraordinary abilities pale before Joseph’s incomprehensible demonic powers. As threats mount and darkness closes in, can Bau overcome his inner turmoil to stop Lucifer’s diabolic scheme and save humanity?"," "]},{"title":"Genius Archer’s Streaming","tags":["Action","Adventure"],"disc":["Read manhwa Genius Archer’s Streaming / 천재 궁수의 스트리밍\n","Yoo Sanghyun, once the youngest champion in a national archery competition and a highly promising talent, saw his dreams shattered by a tragic accident that rendered him unable to handle a bow ever again. Now, as a fallen prodigy, he faced the additional setback of being fired from the company he had joined. In order to make a living, he took on the persona of Almond and embarked on a new path as a gaming streamer. [You have selected the bow.] *Swish! Thunk!* [Headshot!] Are bosses supposed to be defeated in a single shot? His exceptional talent once again shines through! Returning as a streaming genius, he sets off on an entertaining journey of rebellion!"]},{"title":"Poor Cambion","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Poor Cambion / 가엾은 캄비온","Lian, a 30-year-old running a perfume business in the US, is searching for an assistant when she meets Eunseo, a young student studying abroad. Despite their significant age difference and Eunseo’s bold flirting from the start, they end up going to a hotel together. Once there, Eunseo reveals a shocking secret and begins to slowly strangle the terrified Lian. How will their dangerous yet irresistible relationship unfold? A spin-off of 340 Days of Grace"]},{"title":"The Student Guardians Are Obsessed With Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Student Guardians Are Obsessed With Me / 학부모들이 내게 집착한다","Death from overwork after working as an entrance exam cram school instructor. When I opened my eyes, I reincarnated as a wealthy count’s daughter.","In this life, I was going to not work, and live a comfortable life, however!","I came to teach my twin older brother too well. Inquiries about entrance exam counseling are pouring in.","***","“Teacher, what is your ideal type?”","“About that… I surely like a good-looking, rich, and kind person.”","“That’s great. My uncle is exactly like that.”","The students who are trying to dig up something when there is just spare time are also a bit suspicious, but the more strange thing is their guardians.","“You have no awareness too much about how pretty you are. That’s why the one who’s always uneasy is surely me.”","Doesn’t the childhood friend who always not crossed the ambiguous line suddenly changed his attitude 180 degrees,","“The student guardian’s face-to-face talk was an excuse. I came here because I wanted to see you, so just sit down.”","The Duke, who was like an ice sculpture, got his cheeks blushed, and,","“The Lady is fun. I keep getting greedy, but surely what I’m saying is that I don’t know whether this is a really good sign.”","What was even worse, I became tangled up with the Imperial Crown Prince, whose face had never been seen.","Somehow, I became a teacher, and when I came to my senses, I became a CEO. Now that I’ve become like this, I tried to work hard earning money, but the student’s guardians won’t let me go.","“I’m sorry, but because I’m going to focus only on my work for the time being.”","I’m busy to death because of work, yet I’m in trouble because a reverse harem that wasn’t even in my destiny suddenly unfolds."]},{"title":"As My Husband Said, I Brought in A Lover","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa As My Husband Said, I Brought in A Lover  / 남편의 말대로 정부를 들였다"]},{"title":"I’m Sure It’s My Baby","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Sure It’s My Baby / My Child Is Clear / He’s Definitely My Son / たしかに私の子供です / 肯定是我的孩子 / 这肯定是我的孩子 / 내 아이가 분명해","She was hit by a reincarnation truck and was reborn as the eldest daughter of the baron.\nShe is a harmonious family, a lovely little sister. rustic estate.\nShe was going to live without a job all her life, sucking honey, and living as an unemployed person.","“How the hell did this happen?”\n“Can’t you remember?”\n“I’m fine. I mean, I don’t know how it went that way.”\n” … …Who’s to say.”","She made a mistake with the Duke as one of the three most prestigious families of the Empire.\nwhat good It could be. The mistakes were inevitable.","But she found her sister involved in a something dangerous that day.\n“Everyone will die if it becomes known that I saw them. You have to run away, sister.”","It’s not because of you that I ran away, is it?","***","“Anyway, it’s clear that’s my child, but do you think you can deceive me by lying like that?”\n“Are you claiming that I raised my child as her sister’s child to pretend not to be pregnant?”\n“I didn’t say that! I’m telling you to admit that it’s my child!”","It’s been 5 years, isn’t it time to throw away those mistakes?\nI’m going crazy just with this.","“Still, it’s not my son’s fault, so I’ll pay for child support in moderation. Go back to the countryside.”\nProspective mother-in-law holds out her envelope.","“I was very curious. Who was the one who took my pale blue dress from the Duke’s room?”\nThe flower of the society is barking.","“It’s the union of Clausener and Aren… … It’s too dangerous.”\nThe Empress is hostile.","I wanted to live quietly and earn money, but I think I will have to kill them all to protect my cubs."]},{"title":"The Price of Breaking Up","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Price of Breaking Up / The Cost of Breaking Up / The Cost of Breaking this marriage / The Price of Breaking Up this Marriage / The Price of a Broken Engagement / 파혼의 대가","The Price of Breaking Up Clearly, it was a joke made by God. “The companion of His Royal Highness, the Crown Prince is the precious daughter of Marquis Lurhtella.” How could the oracle be mistaken? As soon as I was born, I was chosen to be the Crown Princess and have lived there, but everything changed overnight. Power, status, and the perspective of people. I thought only his love wouldn’t change. However, he did not hesitate to notify me of the annulment of marriage, and that is how it ended between us. Giving up everything was a lot easier than I thought. But… “It’s a pleasure to meet you, Princess Pesentria.” “……” “Speaking of the owner of the temple, I wonder if you remember me.” He, who had the greatest divine power in the Empire, reached out to me. Can I hold his hand?"]},{"title":"My God Is a Lustful Man","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life","Supernatural"],"disc":["Read manhwa My God Is a Lustful Man / 나의 신은 욕망꾸러기 / My God Is A Desire Maker","Hye-sal, a timid ethics teacher who has lived her whole life without desires, finds that a neighbor who exudes desire and pleasure has moved in next door. With a sexy appearance and a fatal scent, his name is Dionysus, shortened to Dio.When Dio makes divine wine, the essential ingredient required is the deep desires that humans have never fulfilled in their lifetime. The one who possesses that is Hye-sal! All she desires is her repetitive peaceful daily life, without any other dreams or desires.Dio begins relentlessly pestering her, using even divine abilities to awaken the deep desires within Hye-sal."]},{"title":"A Barbarian Was Admitted to the Academy","tags":["Action","Drama","Fantasy"],"disc":["Read manhwa A Barbarian Was Admitted to the Academy / Alternative A Barbarian Entered the Academy / Варвар поступил в академию / アカデミーにオランケが入学した / 아카데미에 오랑캐가 입학했다","The protagonist is Lee Soo-jin, a college student who loved playing a role-playing game called “Academy of Magic”. One day, he wakes up in the body of Rina, a secondary character in the game who was a barbarian warrior from a savage tribe. He discovers that Rina was destined to come to a bad end, being captured and tortured by the evil empress. She decides to escape this fate and enroll in the magic academy, where she meets several characters from the game, including the crown prince, the black knight, the white wizard and the empress herself."," "]},{"title":"Return of the Frozen Player","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Return of the Frozen Player, 얼어붙은 플레이어의 귀환\n5 years after the world changed, the final boss appeared. [The final boss for area Earth, the Frost Queen, has appeared.] The final boss! If we can just defeat her, our lives will go back to normal! The top five players in the world, including Specter Seo Jun-ho, finally defeated the Frost Queen… But they fell into a deep slumber. 25 years passed. “A second floor? It didn’t end when the Frost Queen died? Specter awakes from his slumber."]},{"title":"The Emperor is a Woman","tags":["Adventure","Comedy","Drama","Fantasy","Historical","Isekai","Manhua","Martial Arts","Romance","Slice of Life"],"disc":["Read manga The Emperor is a Woman\nAfter finally confessing to the male god, you are about to usher in a sweet first love, but you have crossed into the world of cultivating immortals because of an electric shock? ! I wanted to find a chance to go home, but I suddenly added a plug-in, how could I not make good use of it? ! The brothers with flowers and jade elder brothers have been very tired to fight monsters and upgrade. They are all very interested in me? Isn’t a peerless fairy so bad? ! Which senior brother’s brand will you turn over tonight? This fairy needs to consider…\nching chong / The Emperor is a Woman / The Tyrannical Lady Has a Cheat! / 爷就是开挂少女"]},{"title":"Black Corporation: Joseon","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Reincarnation"],"disc":["Read manhwa Black Corporation: Joseon / 블랙기업조선"]},{"title":"Inso’s Law","tags":["Comedy","Drama","Fantasy","Manhua","Romance","School Life","Shoujo","Slice of Life","Webtoons"],"disc":["Read manga Inso’s Law / My Life as an Internet Novel / Inso’s Law / Aturan dalam Web Novel / La Ley Del Inso / Law of Insomnia / Les Lois de la Web-romance / Net Shousetsu no Housoku / Закон Бессонницы / ネット小説の法則 / 网络小说的法则 / 인소의 법칙\n“I just want to live a normal life, why is this happening to me!” Your average student Ham Dan, whose hobby was reading “Law of Insomnia” wakes up to a beautiful novel like heroine. But even in the world of fantasy novels, her role is no different. Stuck as the childhood friend of the heroine, her normal everyday life comes to an end, becoming more twisted by her strong character."]}]