[{"title":"High School Musical Genius Is Paganini Reincarnated","tags":["Drama","Fantasy","Manhwa"],"disc":["Read manhwa High School Musical Genius Is Paganini Reincarnated / 예술고 음악천재는 환생한 파가니니","The Rebirth of Paganini, Joo-won Moon. He was once a gifted violinist, but due to an injury, he gradually distanced himself from music and lived the life of a regular high school student. “I don’t pursue music.” However, perhaps the irony of fate… Joo-won Moon accidentally transferred to the music class of an arts high school, he picked up the violin… Will Joo-won Moon be able to overcome his psychological trauma? And is there a chance for him to be reborn as a true violinist?"," "]},{"title":"In The Night, At The Duke’s Mansion","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa In The Night, At The Duke’s Mansion","Aristasia, a noble lady of the Verdick family, who’s loved by the cold blooded duke and the sword master. Long after her debutante, she didn’t have a significant lover. She was curious about sex and her body became heated, and while she avoided her brother’s eyes, she waited for a gigolo and her brother Evan came. ‘I see, Aris. You were curious about what you would do with a gigolo, but I don’t like that a gigolo will come. So wouldn’t it do if I, your brother, just told you?’ After that night, her brother’s view of Aristasia changed."," "]},{"title":"Aerie’s Legend","tags":["Drama","Romance"],"disc":["Read manhwa Aerie’s Legend","**”If she is my wife, then I must gladly welcome her.”** At the border of Hyeon-guk, where the enemy is close by. “I requested that reinforcements be sent quickly—what they sent with such care is a finely painted woman.” The one who received the emperor’s decree to welcome his wife without ceremony was Ha Mu-jin, the commander of the Hongla army and a king. This wedding, which stirred his anger, felt like a prank meant to give the emperor a sense of victory. Thus, even if they set up a bridal chamber in such a barren battlefield, it didn’t matter who the bride was. “I have received His Majesty’s decree… to, to marry the Grand Commander…” Even if I stutter while saying it. “So, you are saying that His Gracious Majesty the Emperor has bestowed upon Ha Mu-jin my wife. In that case, I shall gladly welcome her.” However, even if it were just So-rang, she must cry to relieve his anger. “Crying women are truly terrible, so you should cry with your whole body and take all my resentment.”"]},{"title":"You’re a Cat, But You’ve Been Adopted by a Wolf Family?","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa You’re a Cat, But You’ve Been Adopted by a Wolf Family? / I’m a Cat, but I Was Adopted by a Wolf Family? / 猫なのにオオカミ一家の養子になりました / 고양이인데, 늑대 가문에 입양당했다?"]},{"title":"There Is No Need To Be Obsessed","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa There Is No Need To Be Obsessed / 집착은 사양합니다 / Please Don’t Obsess Me Anymore\n“I died… again?”\n“Is this the old Cliff Empire?!”\nThe protagonist, murdered on their way home from work, finds themselves back in a world they once visited. Back then, they had been the head of the top merchant guild in the empire, so they thought there was nothing to worry about… until they looked in the mirror.\n“This… is me?”\nThey had returned to the body of Yureia Craysia, the daughter of a viscount, now buried in debt.\n“Well, I succeeded last time with my exceptional adaptability, so I’ll just reclaim my position again!”\nHowever…\n“You remind me of that person.”\n“Promise me you won’t leave.”\nAs the protagonist draws closer to their goal, old connections from the past begin to gather around them, and a shocking truth about their death is revealed!"]},{"title":"Nano Machine","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts","Webtoons"],"disc":["Read manhwa Nano Machine / Nano Mashin / 喇勞 魔神 / 奈米魔神 / 某天成为魔神 / 나노마신","After being held in disdain and having his life put in danger, an orphan from the Demonic Cult, Cheon Yeo-Woon, has an unexpected visit from his descendant from the future who inserts a nano machine into Cheon Yeo-Woon’s body, which drastically changes Cheon Yeo-Woon’s life after its activation. The story of Cheon Yeo-Woon’s journey of bypassing the Demonic Cult and rising to become the best martial artist has just begun."]},{"title":"Infinite Level Up in Murim","tags":["Action","Adventure","Isekai","Manhwa"],"disc":["Read Infinite Level Up in Murim / Unlimited level-ups in murim / 무한 레벨 업 in 무림\nTang Yoo Sung, a junior warrior with no talent or low level of training, died on the battlefield.\nBut when he opened his eyes and thought what kind of underworld it was! He returned to his childhood past to change the future!\nThe moment of death, the greatest moment of life you find! [Welcome to Murim Online, a world that rises as much as you perform your mission and strive.] [Would you like to log in now?] [Yes/No] Click. [complete. Then have a good time.] No more envy of gold spoons! Because this life has a definite price for hard work! Infinite Mission! Infinite level up! Muri soil spoon’s endless effort!"]},{"title":"Return of the Disaster-Class Hero","tags":["Action","Adventure","Fantasy","Magic","Manhwa"],"disc":["Read manhwa Return of the Disaster-Class Hero / The Disaster Class Hero has Returned / 재앙급 영웅님이 귀환하셨다"]},{"title":"Solo Leveling: Ragnarok","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Solo Leveling: Ragnarok / 나 혼자만 레벨업 : 라그나로크","The Earth’s existence is under threat once more as Itarim, the gods of other universes, seek to fill the void left by the Absolute Being. Sung Jinwoo has no choice but to send Beru, the shadow ant king, to awaken his son’s powers and start him on the journey he once took. Suho must conquer the shadow dungeon and earn his place in the world of hunters as he navigates through a new world against a new evil looking to swallow the world whole."]},{"title":"The Return of the Mythical Archmage","tags":["Action","Adventure","Fantasy"],"disc":["Read The Return of the Mythical Archmage","“So, I’m an AI misfit?The pinnacle of modern magic technology, an unfit person unable to integrate artificial intelligence. Shin Hayul, the genius magician who’s been cast aside.Before him appears a book.‘To the descendant who can hear this voice, who possesses the same constitution as mine, I, Ray Bell Bytner, leave this book.’Alongside the book left by the legendary archmage,the halted time of a genius begins to move once more.”"]},{"title":"Stuck in the Tower","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Stuck in the Tower / The Tower’s Trapped Hunter / Trapped in the Tower / 탑에 갇혀 고인물","A world where gates open and monsters come out to play— Hyunsoo longs to enter the tower and take on the role a sa hunter. But in reality, he works as a porter and meat shield of E Class Hunters who are worse than gangsters. Moreover, he was taken advantage by this hunters to the point where he was about to meet death. As soon as he thought that he was dead, he was summoned to the tower, was revived back from the dead, and began climbing up the tower to become a hunter that he had been longing to be. Depending on how much coins one has, the tower offers them the chance to challenge it. Hyunsoo looks at the number of coins he has…. [You have an infinite number of coins!] “Then I’ll awaken myself in the 100th floor and go home!!!” Hyunsoo, who is stucked in the tower, begins his conquer!"]},{"title":"Pick Me Up","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Pick Me Up / Infinite Gacha","In the mobile gacha game infamous for its atrocious difficulty, , the Master ranked 5th in the world, ‘Loki’, loses consciousness while raiding the Dungeon. ‘What? I’m a game character now?’ After waking up, ‘Loki’ realizes he has turned into a Level 1, 1-Star Hero—’Han Yslat’. To return to Earth, he must lead the newbie Master and heroes and clear the 100th floor of the Dungeon! ‘You messed with the wrong guy.’ This is the story of hard carrying by Master Loki who never accepts even a single defeat."]},{"title":"Put Me To Sleep","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Put Me To Sleep / Let me sleep / 나를 재워줘","“From the embrace of the golden lion, the sun’s destined companion shall arise.”","On the day Eira Goldwyn was born, a prophecy foretold she would become the Empress. But on her wedding night with the Crown Prince…","“Are you truly the woman of the prophecy?”","The golden mark, said to appear only on the chosen one, fails to manifest. Cast aside and humiliated, Eira is unilaterally rejected by the Crown Prince.","With rumors branding her as an illegitimate child, relatives scheming to seize her family’s legacy while her father lies gravely ill, and relentless headaches and insomnia leaving her vulnerable, Eira’s life spirals into chaos.","Until one fateful evening. At the Twinveil social club in the capital, Eira encounters a man who holds the cure to her afflictions.","“I’ve found him. My remedy.”","With his help, Eira vows to reclaim everything she lost—her honor, her family’s legacy, and her rightful place in the prophecy."]},{"title":"The Baby’s Future Dream Is To Become The Mastermind","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Baby’s Future Dream Is To Become The Mastermind / 아기님의 장래희망은 흑막 / The Baby’s Future Dream is to Become a Villain"]},{"title":"The Princess Reincarnation","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Princess Reincarnation / 환생 공녀님","“It is said that a mermaid’s tears will become a mysterious jewel.”\nAisha, a girl who never sheds tears despite being bullied. The day she ran away from the village, she became a mermaid.\nGrand Duke Hayden Elikin visited.\n“We are family, Aisha Elikin.”\nOvernight, her life gradually changed. Hayden took good care of Aisha and told her that she was his old sister, but that was clearly a lie…\nAisha, who has learned the way of life of a mermaid and a dazzling princess. Will she be able to stay with him despite knowing Hayden’s secret? Tears of the jewel is Aisha or Hayden?"]},{"title":"Necromancer Academy and the Genius Summoner","tags":["Action","Adventure","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa Necromancer Academy and the Genius Summoner / Necromancer Academy’s Genius Summoner / ネクロマンサー学園の天才召喚士 / 네크로맨서 학교의 소환천재","Necromancers have built a name for themselves as fearsome practitioners of magic capable of dropping entire empires to their knees. Simon Follentia is a necromancer with incredible latent talent! After being scouted for the necromancer’s academy, this genius is ready to be nurtured and taken to the next level. But could Simon’s insane talents attract some unforeseen consequences?"]},{"title":"Mistaken for a Wicked Woman!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Mistaken for a Wicked Woman! / Mistaken For a Villainess! /  I’m Not the Villainess! / 그 악녀가 아니야!","Iris moves to the capital to pursue her dreams but is mistaken for her infamous twin sister, a notorious villainess who has been missing. She faces misunderstandings and confrontations from those who knew her sister, including an ex-fiancé and a scorned woman. The only one who recognizes her true identity is the crown prince, who offers his help."," "]},{"title":"When The Phone Rings","tags":["Drama","Fantasy","Manhwa","Mystery","Romance"],"disc":["Read manhwa When The Phone Rings / 지금 거신 전화는 / The Call You Just Made Is"]},{"title":"My Otherworldly Marriage","tags":["Drama","Fantasy","Historical","Manhwa","Mystery","Romance"],"disc":["Read manhwa My Otherworldly Marriage / I Didn’t Want to Get Married, So I Ran Away to the Second Male Lead / 政略結婚が嫌でサブ主人公に逃げたのに / 팔려가는 결혼이 싫어 서브남주에게 도망쳤는데","Determined to escape her fate in the novel of being sold off to a loathsome man by her father, Beatrice Arosha runs off to the second male lead, Duke Ruslan Etenas, and proposes a contract marriage. After he immediately agrees, Beatrice moves into Etenas Castle, built on a sealed spirit gate and staffed by ghosts! But as she grows closer to the duke and experiences visions of the original Beatrice, she begins to realize the haunted castle may not be the strangest thing about her marriage…"]},{"title":"I Am Selling the Main Character’s Shares","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Am Selling the Main Character’s Shares / Heroine’s Shares for Sale / 주인공의 주식을 팝니다"," "]}]