[{"title":"The Tyrannical Girl’s Sadistic Prince","tags":["Comedy","School Life"],"disc":["As the leader of a debt collecting company, An Yamo threatens people and acts cute. When she acts pitiful, nobody can resist her. Once she takes action, there is no debt she cannot collect. But one day, she meets a tough opponent. Since phone calls don’t work, she brings her men to knock on his door, only to discover that he is a super handsome boy who is actually her schoolmate! Handsome boy: If you don’t want to be exposed, become my slave~ Thus, the school life of the tyrannical girl and the sadistic prince, which is full of battles and clashes, begins.","恶霸少女的腹黑王子"]},{"title":"The Prince Consort Is Passing","tags":["Comedy","Fantasy","Isekai","Romance","School Life","Slice of Life"],"disc":["Read manga The Prince Consort Is Passing","A lively girl, Tao Xiaoyao was isekaied and became the run-away wife of the regent king. After she was caught by her husband, he sent her to the royal family’s academy for discipline! Why do I, a prince’s consort, have to suffer, when other prince consorts receive lots of doting?! The dumb Tao Xiaoyao cries in pain and copies notes—I will definitely have love and study under my control"]},{"title":"Phantom Night","tags":["Drama","Shoujo","Supernatural"],"disc":["[KK Original Contribution Plan] I came across a job posting by chance, which made Ye Lian an assistant to the rookie charm hunter Qianyu Festival, and came into contact with the existence of such a strange creature as the monster. In the process of hunting monsters, Ye Lian met several boys with different appearances and personalities. With their help, Ye Lian gradually uncovered the secrets behind the monsters and charm hunters…..","Mèi Yǐng Zhī Yè\nPhantom Night\n魅影之夜"]},{"title":"A Butterfly Metamorphoses Three Times","tags":["Drama","Manhwa","Romance","Slice of Life","Webtoons"],"disc":["Read manhwa A Butterfly Metamorphoses Three Times / The Butterfly Metamorphs Thrice / Transformasi Sang Kupu-Kupu / 나비는 세번 변태한다\nBy a turn of events, Jin Naye ended up kissing her co-worker’s boyfriend, not to mention she keeps hearing a maleficent voice which nobody else can hear… At home, she’s a pitiful daughter who didn’t even get married yet, and at work she’s a weak-willed pushover. Day by day, Naye is forced to live a life full of torment. In order to defy her mother’s wish to meet a marriage prospect on her own birthday, she attends a party and gets herself some drinks – actions which are unlike her. There, she ended up having her first kiss, but with her co-worker’s boyfriend?! From that day onward, Naye’s life started to change bit by bit…"]},{"title":"I Just Had To Pick Up A Female Disciple","tags":["Action","Adventure","Comedy","Fantasy","Isekai","Martial Arts"],"disc":["I, Who Was Cultivating To Become An Immortal, Only Wanted To Raise A Female Disciple ; Xiu Lian Cheng Xian De Wo Zhi Xiang Yang Cheng Nu Tu Di ; 修炼成仙的我只想养成女徒弟\nOn my path in cultivation to reach immortality, I had only wanted a female disciple. But this disciple may have something to do with my wife of my previous life!"]},{"title":"Ashes of Love","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Ashes of Love / 香蜜沉沉","The Fire God and second son of Heavenly Emperor—Xufeng—was ambushed and trespassed to the Reflection Space in the Flower Realm. Suffering from injuries, he was rescued and treated by the clumsy Jinmi. Jinmi was then brought back to the Heavens by Xufeng, without realizing Xufeng’s true identity. Over a hundred years had passed, Xufeng had developed feelings for Jinmi—so did the Night God, Runyu. Runyu then used Jinmi as Xufeng’s weakness to threaten Xufeng’s position as the Crown Prince amidst the chaos caused by the war at the Demon Realm. At the very boundary between the Heavens and Demon Realm—River of Oblivion—was where both of the princes suffered the greatest loss of their lives. He achieved Nirvana and met a Grape Sprite. Is she actually a Grape Sprite? Juggling romance and the burden he shoulders, will this couple have a happy ending? How does one…quantify love?"," "]},{"title":"The Ultimate Guide to Becoming a Successful Makeup Artist","tags":["Romance"],"disc":["Read manga The Ultimate Guide to Becoming a Successful Makeup Artist / 盛世妆娘：妆者攻略\nWhat happens when you’re caught off guard and thrust into a beauty game with its own psyche, where doing skincare increases buff, applying makeup increases attack power? Wu Xiaowei’s goal is very simple: stay alive, go through the levels quickly, pass missions, purchase a large variety of lipsticks and eyeshadows that she cannot afford in the real world, as well as apply skincare products from luxurious brands. Limited items are not rejected but welcomed. The more discontinued limited items she owns, the better. She wants to survive in style in this fantasy world."]},{"title":"Sorry, I’m Engaged","tags":["Yaoi"],"disc":[]},{"title":"Rebirth: The Turnabout of a Mistreated Concubine","tags":["Comedy","Historical","Manhua","Romance","Slice of Life"],"disc":["Read manga Rebirth: The Turnabout of a Mistreated Concubine","After traveling through time, she finds herself in Prince Xuan’s bed, and has inexplicably become his maid whom he could sleep with at will. While filling her world with whispers of love, the romantic, dissolute prince turned a blind eye to the misdeeds of several other concubines, which includes framing her for adultery, disfiguring her, as well as imposing an extreme penalty against her. When she opens her eyes again, instead of travelling through time, she is reborn as a drop-dead gorgeous lady. In possession of vast wealth and surrounded by all sorts of good-looking men, she decides that she will no longer keep her nose clean. As for that liar, Prince Xuan, should still put on a show of love and affection in front of her?"]},{"title":"Second Miss, Please Don’t Do This!","tags":["Historical","Romance"],"disc":["Read manga Second Miss, Please Don’t Do This! / 二小姐使不得啊\nSuddenly transmigrating~ ah ah ah, house fight face slapping~ smack smack smack, falling in love~ muah muah muah, making a fortune~ ha ha ha. Transmigrating as a slave maidservant with a weak and powerless master, let’s see how the maidservant Youli leads her crybaby Second Miss to the pinnacle of life. But there’s always this little handsome boy that forces her to rob the cradle. She doesn’t even have the time… Wait, Second Miss, please don’t do this! Put that water barrel down!"]},{"title":"Missy’s geek residing plan","tags":["Comedy","Drama","Manhwa","Romance"],"disc":["Read Missy’s geek residing plan","What is the experience of a campus hottie chasing the campus belle? He Fengqi transformed from a dead fat geek into a handsome guy, and was rejected by the goddess! But accidentally discovered that the goddess likes the geek! How will the campus hottie chase her? anxious! Waiting for an answer! Why does the goddess have a unique taste? Is it human nature distorted or forced by life? Read to find out!"]},{"title":"The Wolf Lies","tags":["Drama","Romance","Shoujo"],"disc":["Read manga The Wolf Lies / 狼的谎言 / Wolf’s Lies","In the flashy entertainment industry, drama and rumors explode on the daily, inciting public opinion. Behind the battle for public opinion, backstage players use sharp strategies to reverse and subvert situations. These players are called PR Crisis Agents! The female lead Zuo Bing is one of the best PR Agents in the world. During befuddling situations, she can always hunt down the lying “wolf” and reverse the situation. She’s gone through hundreds of these PR battles. But, on one fated PR battle, she met an opponent that toppled her from her throne…"," "]},{"title":"The Drifting Star","tags":["Gender Bender","Manhua","Romance","Shoujo","Webtoon"],"disc":["After an awkward encounter on her vacation, Wei Lan swapped bodies with a boy named Bai Yuan! Is this heaven’s plan, or a trick of fate? Their strings of destiny follow the drifting star in the water."]},{"title":"Professional Fan","tags":["Romance"],"disc":["Read Professional Fan\n#OTP #InspirationalIn the entertainment industry, there’s a certain profession called “professional fans”. Professional fans earn their living through chasing stars. When a novelist Zhu Xiaotong who lost her direction in life met a singer Li Xixing who managed to fulfill her dreams, Zhu Xiaotong decided to become a “professional fan” for Li Xixing and her shield. This time, Zhu Xiaotong will use her own ways to lead everyone onto the correct path of chasing a star, creating this chaotic Li Xixing support squad!"]},{"title":"Please Save My Husband","tags":["Action","Adventure","Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa Please Save My Husband / 시월드 게임 / Sea World Game / The Newlywed Game: How to Save My Husband","The ideal husband; a romantic wedding day; a perfect honeymoon… Everything looks as if it’s going in the right direction, but instead I’m suddenly living a fantasy?!! Hahahaha, what the hell’s going on?!","Every time I fail a quest, I’m thrown right back to the beginning of the mission! Where exactly is this heading!?","To protect my husband, Yeoyun, and stop travelling back in time, I must control this marriage and the in-laws!"]},{"title":"Becoming the Only Memory of the Male Lead","tags":["Drama","Fantasy","Historical","Isekai","Reincarnation","Romance"],"disc":["The body was possessed before the start of the novel.\nAlso, she, the daughter of a Count, is an extra who is bound to be murdered.","She didn’t want to die like this, so she went in search of the male lead who’s filled with the energy of life.\nThe problem is that, due to his curse, he can’t remember others.\nAs the next best solution, she even tried to target his subordinates.","“It’s been long, Loreina.”","What? Why does this person remember me?\nIt was unexpectedly due to an exception of the curse.\nUm. Well, I’ll help you until the female lead appears.\nThe only one who can break the curse is the female lead, so that it doesn’t deviate from the original story.","…Yeah, that’s exactly what she thought.","•••","Kiss.","I felt a soft touch on my cheek along with an unfamiliar sound. A tiny kiss landed on my cheek.","“…Le-Leonard.”\n“Stay still. It’s interfering with the treatment.”\n“No, but that’s…”","I understand that you’re healing the injured area with the energy of life.","“Is there any other way than this? You can just touch the injured area with your hand…”\n“No.”","Leonard just cut me off.\n…No, there’s no such thing!"]},{"title":"Scandal","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa The Scandal / 스캔들","What if your husband was the protagonist in the scandal of the most popular actress of the time?\nJi-woo quits her job as a reporter, after their newlywed life is destroyed by her husband’s affair, and leaves for the United States. However her ex-husband comes up with an offer that cannot be rejected…"]},{"title":"Please Don’t Be So Conceited","tags":["Romance","Webtoon"],"disc":["Read manga Please Don’t Be So Conceited","Male polytechnic honor student He Zhizhou and airheaded yet lovable female idiot Shen Xi had their bodies swapped in an accident. From the ever-present issues of misplaced youth to the supernatural chance encounters, the two of their lives have changed a lot from their past. He Zhizhou was forced to live in the female dorms, and Shen Xi had no choice but to adapt to the life of a man This fresh new take on the school-life slice-of-life romcom is about to begin!"]},{"title":"Military Phoenix","tags":["Action","Fantasy","Historical","Isekai","Manhua","Romance"],"disc":["Read Military Phoenix / Arms Female Phoenix / Armed Phoenix","As a military commander, I crossed over to the Sky Spirit Continent due to an accident. After opening my eyes, I encountered an inexplicable assassination. To that, I just wanted to say, “You messed with the wrong person!” I signed the system on the front foot, awakened the top spiritual power on the back foot, carrying a bazooka to do in the real culprit, stirring him up! The only thing that hurts is that there are too many people who are interested in me, so can I get to that actual perpetrator, huh?"]},{"title":"My horse is a Vixen","tags":["Fantasy","Romance"],"disc":["The super dedicated emperor that “only loves his kingdom and dislikes beauties”, and the unfortunate vixen that “decided to use beauty to ruin the kingdom”. Hu Xiaocha, a vixen who wants to seduce the emperor of the Qian Kingdom, transformed into horse to sneak into the imperial palace. When she’s a horse, the emperor, Bai Liang, treats her with much love. However, when she transform back into a human, Bai Liang turns a blind eye on her… Hey, hey! A vixen also needs to preserve their reputation, okay?!\nMy Hoarse, My Fairy, My Hoarse Is A Vixen, ?????"]}]