[{"title":"Zhen Zhen Nan Wei","tags":["Comedy","Drama","Fantasy","Historical","Isekai","Manhua","Reincarnation","Romance"],"disc":["Read manhua Zhen Zhen Nan Wei , 真真难为 , Zhēn Zhēn Nán Wéi , How Difficult , It’s Really Difficult","Transmigrated into a harem game, Li Zhenzhen became Luxian Peak’s most popular disciple. Practicing the sword with assertive male disciples, having heart-to-heart conversations with warm-hearted female disciples, solving everyone’s problems… whether the capture targets are gentle or strong, express their love directly or indirectly, Li Zhenzhen must raise their affections in order to survive. But she never would have thought the consequences of raising affections would be so serious…!"]},{"title":"Love and Wifi in The Palace","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Love and Wifi in The Palace / Love WiFi-Palace / 러브 WiFi-궁","Sohyang, a court lady from Joseon era, and Taepung, a webtoon author who needs inspiration for his new work. There was a 200 years difference between them but an old drawer connected the two. The story of Sohyang, who is trying to get the king’s heart with the help of Taepung, will soon become the idea for Taepung’s new webtoon. What would happen to both of them, who live in different era?"," "]},{"title":"A Concubine’s Daughter and Her Tactics","tags":["Drama","Fantasy","Historical","Manhua","Reincarnation","Romance"],"disc":["Read manhwa A Concubine’s Daughter and Her Tactics / 庶女攻略 / Shù nǚ gōnglüè","During the Great Yan dynasty (756-763), The Eleventh Miss Luo was forced to marry her brother-in-law as a second wife. She thought it was an arranged marriage, but for the benefit of the family, she unexpectedly became the true favorite of this man’s heart. Even though she is a concubine’s daughter, why should she be bullied? Let’s see how the little concubine’s daughter finally became the mistress of the house!"]},{"title":"Return of the Elemental Lord","tags":["Action","Drama","Manhwa"],"disc":["Read manwha Return of the Elemental Lord / 정령군주"]},{"title":"The Duke’s Redemption","tags":["Action","Adventure","Fantasy","Isekai","Manhwa"],"disc":["Read The Duke’s Redemption manhwa / 공작님, 회개해주세요! / Duke, Please Repent!\nI transmigrated into a novel and became an aide to the final boss of the story.\nThe final boss dies in the novel, but only after the world falls to ruin.\nWhat if the final boss doesn’t go down the wrong path?\nI have no choice but to try to redeem the soon-to-be final boss before it’s too late!"]},{"title":"French Photo Gallery","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa French Photo Gallery / A French Photo Studio / Bullanseo Photo Studio / French Photo Studio","",""]},{"title":"Can I have a date with the Crown Prince again?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Can I have a date with the Crown Prince again? / 다시 황태자님과 썸 탈 수 있을까요?","As she aspired to become an idol like that, the day when she could stand on stage as a group XUM came near when it became unclear where her dream came from. While practicing ahead of her debut, she suddenly shakes the ground, and her wall collapses and she enters this world through the main gate of the clock tower. The time when Baek Ah fell into a fairy tale book is the point when she suddenly falls asleep under her spell after being engaged to her Prince Philip. Therefore, the world in the fairy tale has become chaotic. In fact, Kairos, the country of Princess Sua, was just a small country without a princess. Therefore, without the support of the empire, it was on the verge of collapse. Philip took special care of Kairos in his own right and waited for Sua to wake up. However, Baek-ah wakes up and disappoints Philip because she can’t remember the world in the book. Disappointed, he even brings up the story of breaking up. The imperial family held a ball. It was ostensibly a place to socialize with the princesses of the vassal state, but in fact, it is a ‘place of confrontation’ to find her fiancée again… . King Anno of Kairos asks Baek-ah to save the kingdom and pushes Baek-ah, who has not yet understood the situation, to attend the imperial ball. Baek-a goes there with her maid, Lindsey. In the atmosphere of the ballroom, which is held like a survival program, Baek Ah said that if you are an idol, you should catch everyone’s eyes in other worlds as well."]},{"title":"The Crown Prince’s Fiancée","tags":["Action","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Crown Prince’s Fiancée / 황태자의 약혼녀 / The Crown Prince‘s Fiance / Tunangan Putra Mahkota","A secret that I, a maid of the imperial palace, accidentally heard… that the runaway fiancée of the prince was actually a man?!","“Please spare my life! I’ll do anything!”\n“Anything?”","As I desperately nodded my head, the prince gave a chilling smile. There’s only one way to not get silenced permanently!","“Then I choose you.”\n“For what?”\n“To be my fiancée.”","To become the fiancée (replacement) of the prince."]},{"title":"Joseon Fox Scandal","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Supernatural"],"disc":["Read manhwa Joseon Fox Scandal / 조선여우스캔들/ 狐狸的绯闻 /RUBAH YANG SELALU MENJAGAKU","The traditional fairy tale we all know is actually a crime drama about the shapeshifters who fled from the sky! This story is about a fox sent down from the sky and Joseon’s greatest gisaeng swindler, Choran. Many skillful storytellers turn the gears of fairy tales around to talk about the evil gods and goblins who torment humankind, but let us now start a true story of love that will make even the sky tear."]},{"title":"The Villain’s Aesthetics","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read 악당의 미학 / The Aesthetic of A Villain / A Villain’s Aesthetic","One day, while eating chicken, Sehyeon was transported into the novel she had written in the spur of a moment. She immediately became the idiotic princess, Ione. What else would happen today that would influence the fate of Ione’s life and death? In order to survive, she had to make sure the Emperor wasn’t killed! As she dashed away to prevent the incident, she ran straight into a man. A man loosely gripping a sword dripping with blood. Nickname: King Regent Kimchi Real name: Aenard Ibn Bonaparte. “You’re an author?” She was screwed. The first thing she had to encounter just happened to be a villain who knew how to read her mind! “I’m the only person who knows that I can read minds.” Sehyun’s breathing quickened. “So, who are you?” A tight-knit fantasy romance with a menacing villain!"]},{"title":"How the Villainess Becomes a Saint: Escaping Certain Death!","tags":["Drama","Fantasy","Historical","Isekai","Reincarnation","Shoujo"],"disc":["How the Villainess Becomes a Saint: Escaping Certain Death! manga, Akuyaku Reijou desuga Shibou Flag Kaihi no Tame ni Seijo ni Natte Kenryoku wo Koushi Shiyou to Omoimasu , 悪役令嬢ですが死亡フラグ回避のために聖女になって権力を行使しようと思います\nShe was just a regular office worker living a regular life, but one day, she gets reincarnated as a villainess in a game that she’s been playing… Now she’s a villainess (6 years old) whose death is a compulsory event no matter which route she takes! While being smothered by her father’s love, she uses her knowledge from her previous life to great effect! ♪ She’s going to use any means possible to avoid dying!"]},{"title":"The king Is Back","tags":["Action","Drama","Fantasy","Manhua"],"disc":["Read manhua The king Is Back / 稳住别浪","Heaven is closed, hell is full. The king of the underworld, Chen Yan Luo, died and became a high school student! “I wanted to be a normal person, flirting with the school girl and going to my father-in-law’s house for dinner, but there are always rivals who come uninvited, so fuck it, I’m going to show my cards! ah shit, here we again!”"]},{"title":"Fragrant Office Life","tags":["Romance","Shoujo"],"disc":["Read Fragrant Office Life / 향기로운 회사생활","Men stink. Inah Jung can literally smell a sour man from a mile away. While the men in her life so far smell like crap cologne, a perfect gentleman who’s also her hot team leader can’t resist her adorable innocence. And he smells like heaven. Inah follows her nose past brutal enemies who want her new boo, a sarcastic CEO and boozy roommate with an unstoppable sense of humor. Will Inah finally know career and romantic success?"," "]},{"title":"990k Ex-Life Hunter","tags":["Action","Adventure","Manhwa"],"disc":["990k Ex-Life Hunter manhwa 99만 전생이 날 도와줘\nThe ordinary F-rank hunter, Gang HyeonJoon, had always prayed for the strength to change his life. One day, his prayers were answered… [The Final Sword Saint praises your bravery.][The Master in the Shadows is your….] “Enough! This is too much!” 990 thousand past lives appeared in front of him!"]},{"title":"Golden Time","tags":["Drama","Historical","Romance","Tragedy","Webtoons"],"disc":["Read manhwa  Golden Time / 빛과 그림자 + 골든 타임 / 골든 타임","The hit series “Light and Shadow” continues with “Golden Time,” a new adventure that follows Alex, the eldest son of Duchess Edna and Duke Eli, as he sets out to experience the world on his own. While gathering his travel companions, Alex feels strangely drawn to a shabby young boy named Kenny, not realizing that they’ve met before. That’s because Kenny is actually Yessica Solveg, the second princess of the Kingdom of Northian… and fiancée to their future king, the violent Duke Frederick. With her identity hidden, the two royals form a bond. But when budding love could ignite the flames of war, will this reunion cause more pain than bliss?"]},{"title":"I became the sister in law of my ex fiance","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I became the sister in law of my ex fiance / Sofia Has New Plans for Marriage I Became The Sister In Law Of My Ex Fiance / I Became the Sister in Law of My Ex-fiancé / Gyakkou Reijou no Fukushuu Keikaku / 逆行令嬢の復讐計画 / 전 약혼남의 형수가 되었다","She is Princess Sofia. Her fiancé Prince Reynard (2nd), and her best friend Bellatrix collaborated to murder her and her family.\nShe returns two years ago and has a chance for revenge.\nThe only person who can help Sophia is Reynard’s brother, Alexis. People call him – “Hero of Misfortune”. He also lost his life to his brother’s plot.\n… I was thinking…\n“Still alive!”\nSophia tries to save Alexis and stop Reynard’s ambitions.\nHer revenge begins by changing her fiancé."]},{"title":"The boss is three and a half years old","tags":["Reincarnation","Romance","Shoujo"],"disc":["Read manhwa The boss is three and a half years old / Our Pampered Sister’s Secretly a Big Boss Comics / Three and A Half Year Old Boss / 团宠大佬三岁半","Across thousands of years a soul has come through and this turns out to be the daughter of an emperor?! I’m not afraid! Whoever put me in this “spoiled kid’s” body, you’ll see! I’ll have Baba and the big brothers wrapped around my finger! It’s just that… whenever I’m being with them why does the big brother look at me funny? Is there something wrong?"]},{"title":"The Peach of June","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Peach of June / June Peach / 6月的水蜜桃 / Peach of June / 六月の桃 / 유월의 복숭아","Leah has been dreaming of a happy marriage. She had two relapses, but both times her happy marriage was over. When she made her third regression, she was determined that she would never marry again. Even though she is so determined, she keeps seeing a man named Julien whom she talked to before her marriage. Julien’s proposal, approached by his handsome face and kind side, eventually shook her up. Then she wrote her vows and got married again. After her marriage, while she was enjoying her honeymoon in Julien’s mansion, she discovers traces of herself that she did not know as she enters Julien’s secret room that he had been hiding from her and her curiosity."]},{"title":"Solo Leveling","tags":["Action","Adventure","Manhua","Manhwa","Shounen"],"disc":["Read Solo Leveling /  나 혼자만 레벨업 / Na Honjaman Level Up, I Level Up Alone","10 years ago, after “the Gate” that connected the real world with the monster world opened, some of the ordinary, everyday people received the power to hunt monsters within the Gate. They are known as “Hunters“. However, not all Hunters are powerful. My name is Sung Jin-Woo, an E-rank Hunter. I’m someone who has to risk his life in the lowliest of dungeons, the “World’s Weakest“. Having no skills whatsoever to display, I barely earned the required money by fighting in low-leveled dungeons… at least until I found a hidden dungeon with the hardest difficulty within the D-rank dungeons! In the end, as I was accepting death, I suddenly received a strange power, a quest log that only I could see, a secret to leveling up that only I know about! If I trained in accordance with my quests and hunted monsters, my level would rise. Changing from the weakest Hunter to the strongest S-rank Hunter!"]},{"title":"Concubine Walkthrough","tags":["Fantasy","Historical","Isekai","Romance"],"disc":["Read manhwa Concubine Walkthrough / Royal Game / 후궁공략","At first, Yona gave some major side-eye to the popular game “Concubine Walkthrough” until she got sucked into it—literally! Now stuck as the villain, she has her hands full facing the infamously cruel king, shaking off scheming concubines, and befriending NPCs. There’s only one way the Game Master will let her out and that’s to become the Queen! Will she be able to stay true to her honest and straightforward self despite the palace’s intrigues? One extra problem: she’s got competition…"]}]