[{"title":"It’s My Destiny To Be The Hero’s Saviour","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa It’s My Destiny To Be The Hero’s Saviour , Destined to be the Savior of the Protagonist, I’m Destined to Be the Savior of the Male Lead, 주인공의 구원자가 될 운명입니다","I remember the memory of my previous life when I was abused by my father for the experiment.\nAnd I realized.\nAccording to my previous life\nThis is the world of fantasy fiction I’ve read\nThat she was born with a minor role who died before the novel even started.\nAriadne thought calmly.\n‘I am screwed’.She was also screwed on a global basis.\n‘This novel has a bad ending.’\nThe end of this 10-volume Munchkin(over powered) fantasy novel is,\nIt was the failure of the protagonist and the destruction of the world."]},{"title":"Predatory Marriage","tags":["Adaptation","Drama","Fantasy","Historical","Josei","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Predatory Marriage / Predatory Soul / 약탈혼","Princess Leah wrote a suicide note before her wedding.\nShe was in fact certain of dying after","the wedding night; a miserable end for a princess who dedicated her life to the country and the royal family.","But before giving up her life, Leah planned her final revenge on the family, one that would surely leave them in ruins even after she became a cold corpse.","She would bring shame to them by being a non-virgin bride.","“Why are you wasting your first experience? Don’t you just want to run away?”\n“I…I want to die.”","Leah impulsively confided in the man she slept with for one night."]},{"title":"I’m Repaying The Kindness That Raised Me With Obsession","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Repaying The Kindness That Raised Me With Obsession / How Can You Pay Back The Kindness I Raised With Obsession? / Do You Repay the Kindness I Raised You With Your Obsession? / 키워준 은혜를 집착으로 갚으시다니요","I transmigrated into the body of an evil witch in a fairytale. While I was drowning in loneliness, hated by everyone, I happened to pick up and raise a pair of siblings who were eating my candy house… “Hazel the Witch, you’re sentenced to execution for kidnapping!” Who would have known that I’d be falsely accused of kidnapping the Grand Duke’s younger siblings! Thankfully, before she knew it, Hazel became a nanny in the Grand Duchy with the help of the children. However, her employer once said… “A Grand Duke doesn’t marry witches. Nor nannies, of course.” and gulped down kimchi soup. I don’t have no intention of getting marrying either, you know? Especially not to you, your Grace! I’ll just raise the kids and then quit!"]},{"title":"The Child Who Draws Dragons","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Child Who Draws Dragons / 용을 그리는 아이","The only choice: to save you. Yoo Seoha, the “Child of the Dragon,” possesses a mystical ability to foresee the destiny of those destined to rule. [“The Child of the Dragon envisions a *righteous king* and pleads to abandon the *warlord*.”] To protect the one she loves, Seoha makes an irreversible decision. As a result, Wu is branded a traitor and forced to flee, while Myung ascends to the throne and claims Seoha as his own. Ten years later, Wu resurfaces to reclaim what was taken from him, while Myung is determined not to let anything slip through his grasp again…"]},{"title":"Mr Devourer, Please Act Like a Final Boss","tags":["Action","Adventure","Comedy","Fantasy","Supernatural"],"disc":["Read manhwa Mr Devourer, Please Act Like a Final Boss / The Unbeatable Dungeon’s Lazy Boss Monster / 보스 몹답게 행동하세요, 스왈로우 씨!","[By the studio that brought you Solo Leveling with Redice studio!]\nThe era of dungeon raids has finally arrived. The Seven Great Evil Dungeons— the seven strongest dungeons that are considered impossible to conquer. Deep within the most infamous dungeon, Primordial Core, lives the worst boss monster of all time, the “Devourer.” “Does it make any sense that the dungeon boss was dozing off until the humans were right in front of him?!?!” Because of the constant visits from humans, the doorsteps of the Primordial Core never dry up, and the nagging the Devourer hears never stops…?! “Ha… I don’t want to do this.”"]},{"title":"The Double Life of a Daydreaming Actress","tags":["Comedy","Drama","Josei","Mature","Romance"],"disc":["Read manhwa The Double Life of a Daydreaming Actress / Delusional Actress! / Mousou Akutoresu! / Untoward Actress Spinning a Daydream / เมื่อยัยเพ้อมาเจอรัก / 妄想アクトレス！","She’s spent her life daydreaming, and now she’s a loser who’s given up on love. Nao is a thirty-year-old woman who daydreams to escape from her harsh reality, but a mistake she makes at work forces her into a situation where she has to prostitute herself! She’s toyed with by the handsome CEO of a porn production company, encouraged by an effeminate porn star, and bullied by a gyaru. While interacting with many others, she finds herself facing her reality head-on. She’ll become an amazing woman, just you wait and see!"," "]},{"title":"Surviving with an SSS-Rank Inventory","tags":["Action","Adventure","Fantasy"],"disc":["Read Surviving with an SSS-Rank Inventory","‘One day, I became a ‘Storage Character’ within a game!’\nA no-life gamer with seven max-level characters is stuck within the highest-difficulty Virtual Reality game, .\nUnfortunately for him, he just had to get stuck when he was on his level 10 ‘Storage Character’.\nIt might be a shabby start to his new life, but at least he can take comfort in his abundance of items, right?"," "]},{"title":"Absolute Dominion","tags":["Action","Adventure","Fantasy"],"disc":["Read Absolute Dominion / 절대군림","From the Author of Reborn as the heavenly demon and Absolute Regression.","“I shall devour this Jianghu!”","Says a mysterious son of the fruit merchant, holding the Monarch Sword in his left hand, and the Hell Blade on his right.","Possessing not only eloquence but even an overwhelming martial prowess, what could be his ultimate goal?","The delightful journey of the twenty year old youth, ‘ Jeok Leegeon’, who dreams of dominating the martial world, begins!"]},{"title":"Living as the Enemy Prince","tags":["Action","Adventure","Comedy","Fantasy","Manhwa"],"disc":["Read manhwa Living as the Enemy Prince / 적국의 왕자로 사는 법 / Reborn as the Enemy Prince","Imagine being kin to your sworn enemy. Killed in battle while defending his country, Bern wakes up in the body of the enemy prince, Kalian, and vows to avenge his people. But between taming an abusive half-brother and surviving his mother’s deadly web of intrigue, sweet revenge seems to slip further beyond his grasp at every turn."]},{"title":"Male Lead, I’ll Respect Your Taste","tags":["Action","Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Male Lead, I’ll Respect Your Taste / 남주님, 취향 존중해드릴게요 /I Respect the Male Lead’s Taste / Male Protagonist, I Will Respect Your Taste / For a Fairytale Ending","I was possessed by the devastating BL . Just before the historical event of the two main characters took place. Unfortunately, I can see how they both argue, but, I can’t do anything about it… “A moment! How is it that these two end up falling in love?” My main goal is to try to avoid being the villain murdered at the hands of the protagonist. That’s why I have to let the love of both of you be comfortable. But, for some reason, the strongest obsessive protagonist of all time has become a gentle sheep, who acts as if he wants to please me. “Alice… Do you think I’m pretty too?”"]},{"title":"Now Come and Regret","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Now Come and Regret / 이제 와 후회해봤자","n a world where power dictates fate, Princess Ines of a fallen kingdom is ensnared by Ryan, a captivating yet ambitious captor. Despite his efforts to dominate her spirit, Ines resists, challenging his every move with a fiery defiance that slowly transforms disdain into obsession. As their tumultuous dynamic unfolds, a brush with death shifts everything. Ryan, confronted by the depth of his feelings, faces a choice that could redefine them both.\nTheir story of power, resistance, and the unforeseen force of love questions whether hearts hardened by ambition can truly change.\nWill Ines’ near escape bring them closer, or will it be the catalyst that tears their world apart?"]},{"title":"The Dame In Shining Armor","tags":["Adaptation","Drama","Fantasy","Manhwa","Mystery","Romance"],"disc":["Read manhwa The Dame In Shining Armor / 백마 탄 레이디의 반격 / The Revenge of the Lady on the White Horse","Sentenced to death for adultery, Evelyn Cordelia stands before a crowd that calls her a witch. “Only God knows the truth. I have never done anything to be ashamed of.” Before the blade swings, she sees someone smiling in the crowd… is it her dead husband? When she opens her eyes again, she is transported to a time long before her marriage. Who is her ex-husband who feigned his own death? Who drove her family to ruin? Who accused her of adultery and infidelity? She must find out everything, even if it means she has to become the villainess of her own story."]},{"title":"Acting Genius, TOP Idol!","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Acting Genius, TOP Idol! / 연기 천재, TOP 아이돌!","“The brilliant actor, famous Baekhyun, before he dies, encounters a miracle and travels back in time! But there’s nothing free about time travel. His lifespan ends at thirty, and he has only ten years left. To return as an actor and stay alive, he must become an ‘idol’! Experience the journey of the talented performance star as he rises to the top ranks of idols, an exciting story awaits!”"]},{"title":"The King of Dead Souls","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The King of Dead Souls / Death King Karnak / Monarch of Death / 사령왕 카르나크","I was a being that ruled over death.","It took me a hundred years to come to a realization.","A human should live a human life. One shouldn’t rule over something like that."]},{"title":"The Extra’s Academy Survival Guide","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Extra’s Academy Survival Guide","I possessed a third-rate extra villain character in my favorite game. I have no ambitions and I just want to live a quiet life. But sheesh, this world is a hard place to survive in. I will survive to the ending of this story, in a way the protagonist cannot. I will survive in the way of a third-rate villainous character."]},{"title":"I Rely on My Invincibility to Deal Tons of Damage Passively!","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua I Rely on My Invincibility to Deal Tons of Damage Passively! / 我靠无敌被动打出成吨伤害！","“In his previous life, Cheng Qianmo attained the prestigious title of ‘God’ across all professions in the game ‘Genesis,’ poised to ascend to the pinnacle of the gaming world. However, just when he stood on the cusp of becoming the game’s top player, he suffered a regrettable defeat. Yet, fate granted Cheng Qianmo a second chance as he unexpectedly traversed into a world with a setting eerily identical to ‘Genesis,’ a world where everyone could switch professions freely. Armed with the god-tier title across all professions, he resolves to rectify his past regrets, embarking on a path no one has ever tread before.”"," "]},{"title":"The Saintess Became the Northern Grand Duke’s Daughter","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Saintess Became the Northern Grand Duke’s Daughter / 성녀는 북부 대공의 딸이 되었습니다","Born Again to Escape, and to Heal a Broken Heart Liriette, blessed with divine power that could heal others through her blood, had spent her short life as nothing more than a tool for a cruel High Priest. Her end came quietly, used and discarded. But one day, she opened her eyes… and she was 10 years old again. “This time, I will never let the horrors of my past repeat themselves.” Determined to escape the clutches of the High Priest, Liriette sought refuge in the farthest corner of the empire, with none other than Duke Windsorice, the ruler of the cold and mysterious North. “I can heal your eyes. Please, let me stay by your side.” At first, it was simply a desperate attempt to escape her dreadful fate. Yet, as time passed, her hopes and dreams began to grow beyond mere survival. “Would you… become my daughter?” With trembling hands and a soft voice, Liriette asked, “What would you gain from me as your daughter?” The Duke’s lips curled into the faintest smile. “A kind and beautiful daughter.” Follow the heartwarming journey of a lonely girl who finds her home and happiness as the beloved daughter of the empire’s coldest Duke. Watch as the once-unfeeling ruler becomes the ultimate doting father, melting the icy North with his newfound love…"]},{"title":"Evolution from Carp to Divine Dragon","tags":["Action","Adventure","Fantasy"],"disc":["Evolution from Carp to Divine Dragon","The photographer Lin Hao was on a shooting assignment in the ancient city of Lintian when he was attacked and killed by “ET No. 002”.\nAfter being reborn, he found himself transformed into a koi living in the Dragon Transformation Pond in the neighboring ancient city.\nHe awakened the Dragon Cultivation System, which promised him a chance to become a true dragon by following the system’s prompts to devour and evolve continuously."]},{"title":"It’s Time to Stop Looking for a New Family","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manhwa It’s Time to Stop Looking for a New Family / 이제 그만 새가족을 찾으려 합니다","I wanted to become the head of the family. Laetitia, left in the cold because she was an illegitimate child of the duke, was used as a successor. Her dedication to that was thwarted by Sujin, a foster daughter from that world. Her death was due to false charges. But after her final moments, she wakes up as an eleven year old girl again. ‘In this life, I’ll pave my own way forward.’ “I’m going to leave the family.” Laetitia rids herself of the forsaken family and heads north. There, she meets the blood-and-iron minded Countess Winter, and offers a deal. “Please sponsor me, Countess.” “What is a duke’s daughter able to do for the Winters, if the Winters shelter you?” “In exchange for a contract, I will undo the curse lying on the Winters’ dominion.” In this second life, the more I try to avoid it, the more I get entangled in these dangerous but enchanting relationships… “Acting as you please. You shouldn’t have saved me, if you weren’t going to look back at me.” “Please leave the archmage, and take me as your husband.” A turbulent second life. Will Laetitia be able to find a new family?"]},{"title":"I Became the Male Lead’s Adopted Daughter","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Became the Male Lead’s Adopted Daughter / I Became the Male Lead’s Adopted Daughter /  The Male Lead’s Little Lion Daughter / 成为男主的养女 / 남주의 입양딸이 되었습니다"]}]