[{"title":"Becoming King After Being Bitten","tags":["Action","Manhua"],"disc":["Read manga Becoming King After Being Bitten","After rebirth, the world has changed. The blood race has become the master of the world, and humans have completely accepted this life and are proud to be blood dependents, as the saying goes: humans who have not been sucked by the blood race are not good humans. Wang Zhe wanted to repair the regrets left in his previous life and make a better life, but…."," "]},{"title":"Red and Mad","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Red and Mad / 레드 앤 매드","Lee Ye-joo, a lone female college student, has a secret. A special ability to leap over time beyond the unknown door! But the uncontrolled ability is just a curse, and what she faced one day after moving for as many as a thousand years was a mad world in which the absolute red-eyed ran wild. An unidentified man who causes earthquakes and lightning by beckoning only refers to her as a “timer” and makes her his target of extermination for that reason.","In a hurry to survive and return to the past, she lies without even knowing what the meaning of “timer” is.","“Take me to the other humans and I’ll tell you where to live!”","The contractual relationship tied in exchange for the reserved death, but the man’s back was stronger and warmer than expected.","Is that why? She didn’t plan it.","I want to melt the frozen future…","“Not only do you live, but you’ve also created feelings that I don’t know.”","An omnipotent obsession with a woman who was tied up in the future to avoid death, and a chasing romance that risked her life."]},{"title":"My Butler, Not Lover","tags":["Comedy","Drama","Romance"],"disc":["Read manhwa My Butler, Not Lover /  Do as I Say!, Act Like You Love Me!, Obedient Not Pure, Sunjeongmalgo sunjong, Sunjeongmalgosunjong, 순정말고 순종, 순정말고순종","Dealing with three jobs daily. A mountain of stress and a pigsty to call home are the only things waiting for twenty-five-year old Jiun at the end of her work. Until one day, a stuffed doll finds her way into her arms– and with this, she’s able spoil herself with the housekeeping of Nam Doyoon, South Korea’s top actor…?!\nAct Like You Love Me!"]},{"title":"Obey Me","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Obey Me / Kneel Before Me / Please Obey Me","In the storm sleeps a giant… When the unfaithful crown prince calls off their marriage, Lady Kyrie is exiled to a remote cottage. On the way, she discovers a hidden village while avoiding a snowstorm. It’s there “the end” is awakened… and it’s starting to become obsessed with her."]},{"title":"Flash Sword","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Flash Sword / A Blade at a Time / 一忽刀 / 일홀도 / The All-Destroying Sword!"]},{"title":"Eternal Saint","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Eternal Saint / 万古圣尊"]},{"title":"A Dangerous Lie","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Dangerous Lie / Dangerous Lies / 위험한 거짓말","Chae Yi-seo, a woman who distrusts men and lives alone, and Han Do-jin, a man who deceives himself for revenge.“Let’s take it lightly and just use each other.” Two people who don’t want to marry someone they absolutely hate, only have a passionate relationship when other people’s eyes are on them! “I do not remember? “We decided to be friends.” However, the dangerous man who should never be trusted suddenly changed! Yi-seo is confused by Do-jin’s sudden declaration of friendship and at the same time becoming crazy friendly to her. “You can be on guard. “But let us be friends in the end.” Can we trust this man’s unpredictable lies?"]},{"title":"God’s Contempt","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua God’s Contempt / 神之蔑 / Contempt of The Rulers"]},{"title":"Empress’ Husband is Actually Invincible","tags":["Action","Drama","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read manhua Empress’ Husband is Actually Invincible / 完了啊！女帝的软饭丈夫居然无敌 / Wanliao Ah! Nvdi De Ruan Fan Zhangfu Juran Wudi","Xiao Tian, a human on earth, was summoned by Empress Zi Ruoyan to the Great Yan Dynasty to become her husband at the time of life and death, and got a “Strongest Supreme System”, but Xiao Tian only wanted to be the ultimate soft rice prince of the Empress! So he resolutely rejected the system, but he didn’t expect that the strong system’s style of painting would suddenly change into a “dog-licking system”? ! 【You are a creature from the super high-dimensional plane Earth! 】【This system can only be your slave! 】【Master, please control yourself, you may accidentally kill this system!"]},{"title":"The Greatest Sword Hero Returns After 69420 Years","tags":["Action","Adventure","Fantasy"],"disc":["Read The Greatest Sword Hero Returns After 69420 Years","Kim Mincheol was a regular side character in someone else’s story, a character made to die at the very beginning to pave the way for the main character. He wasn’t able to save his sick mother. He wasn’t able to keep his younger sister alive long enough for her talent to blossom. He wasn’t able to achieve his life goals… But fate gave him another chance. Kim Mincheol woke up to a system with a set of overpowered abilities, 69420 years back in a different past. A world that throws obstacle after obstacle at him, but rewards him equally too. This is the beginning of Kim Mincheol’s story."]},{"title":"Your Owner","tags":["Manhwa","Romance"],"disc":["Read manhwa Your Owner / 당신의 소유주","Once a successful method actor, she has now fallen from grace and become a struggling owner. Enter Han Tae-kyung, a male Rapunzel, who approaches her with a proposal for a fake engagement acting role, accompanied by a substantial amount of money."]},{"title":"Really Truly Getting a Divorce","tags":["Comedy","Drama","Josei","Manhwa","Romance"],"disc":["Really Truly Getting a Divorce manhwa, Really Really Divorced , Really Really Getting Divorced , Truly Indeed Getting a Divorce , 진짜 진짜 이혼해\nGo Baekhee had a hard time carrying her head when she was the main character of the “Storm Strong Kick” meme. In order to leave Korea, she will get a fake marriage on the premise of getting divorced with Hangyul, a permanent resident of Australia. However, to be accepted, one must prove the “true love” between the two. What is true love? True love is not easy. And it’s also not easy to keep a relationship undiscovered which is a fraud itself!"]},{"title":"Kill My Husband","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Kill My Husband / Please Kill My Husband","The Duchess, who was painting the scenery of her hometown, is awakened by a man outside the house of new desires.\n‘I want to paint a man’s nude, forbidden by the times!’\nAnd men who want to monopolize her like that!\nAnd the murder happened.\nWhat happened behind the scenes?"]},{"title":"My Brothers Dote On Me","tags":["Manhua","Reverse harem","Romance","Time travel"],"disc":["Read My Brothers Dote On Me","When she woke up in a new life, she became a poor little girl who was sent to the mental hospital by her own brothers. So with the painful memories of the original owner in the previous life, Pei Yun Ge began to fight back and fight against villains from all walks of life! All the way she abuses the scums, all the way she feels cool! However, she suddenly found her three former scum older brothers have become spoiled sister devils? Not only that, she gained another strong and powerful ” older brother”, the more the older brother’ spoiled her, the more she suspicious Is this the path of spoiling that can never be recovered/returned?"]},{"title":"How to Diet as a Lady","tags":["Manhwa","Romance"],"disc":["Read manhwa How to Diet as a Lady Bahkan Wanita Bangsawan pun Melakukan Diet Even Noble Ladies Go on a Diet Too 贵族恋爱也要减肥 귀족 영애도 다이어트합니다 귀족영애도 다이어트 합니다"]},{"title":"My Classmates Are Vampire","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Classmates Are Vampire / 내 짝꿍은 뱀파이어!","What?! Me? The Vampire Queen?!! My name is Han Yeseul, I’m an ordinary human living in a world where humans and vampires coexist, I was about to enter my dream high school when… because of an error with my application form, I was transferred to an exclusive vampires school. I couldn’t let them know that I was a human, so I dyed my hair and put contact lenses to pass unnoticed…. However, everyone in the school now sees me as one of the Legendary vampires that are “pure blood” and even call me their queen!!! I have been faking successfully for now, I just need to maintain it for a year so I can transfer to the highschool of my dreams as I was supposed to. Or at least, that’s what I was pretending to do until one of my vampire classmates Changyeol discovers my true identity after hearing me talking alone in the bathroom, Will I really be able to survive this School full of blood sucking demons for a year and stop getting involved in more bizarre situations?!"]},{"title":"I Raised My Younger Sister Beautifully","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Raised My Younger Sister Beautifully / My Beloved Baby Sister / You raised your little sister well / I Raised My Little Sis Beautifully Raising My Little Sister Prettily 妹を可愛く育てたら大公 様に溺愛されました 동생을 예쁘게 키웠다","The imperial family collapsed during one night by the basilisk, the summoned beast of darkness which was summoned by the cursed princess, Fleta. “If there is a next life, then… Can I really be your younger sister?” If I had approached you a little earlier, would it have been different from now? The last time everyone regretted it, the time miraculously returned to 6 years ago. If this is the second chance we’ve been given…"]},{"title":"The Deviless’s Impression of a Princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Deviless’s Impression of a Princess","How to catch a knight? Impersonate a princess!\nLilith the Demon Queen longs to meet a knight like the ones she reads about in books. In order to lure one to her castle, she kidnaps a princess and waits. Much to her delight, the knight who shows up is exactly as she pictured him! She decides to disguise herself as the princess to capture his heart…"]},{"title":"Love Rebooted","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Sci-fi"],"disc":["Read manhwa Love Rebooted / Cold Human / Love Rebooted / 차가운 인간"]},{"title":"Reborn As The Strongest Swordsman","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts"],"disc":["Reborn As The Strongest Swordsman manhua, Rebirth of the Strongest Sword God, 重生之最强剑神 | Reincarnation Of The Strongest Sword God\nShi Feng, the top master in “God’s Domain”, was betrayed by the top online gamers in “God’s Domain”. Shi Feng, who was drinking to relieve his worries, found himself back in ten years ago, and plans to become the top player in the online game. Shi Feng, who has ten years of game experience, recalls the past, starting from scratch, and his system will help him move forward."]}]