[{"title":"My Husband Is My Choice","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Husband Is My Choice /  내 남편은 내가 정한다 / I Decide My Husband / I’ll Decide who I’ll Marry","She died three times at the hands of the emperor. Then, her fourth life began. All I had left was evil and vengeance. I can’t take it anymore. Now it is my turn to get revenge on those who have wronged me. “However, the person whom I will be marrying is not His highness, the second prince.” The surroundings became quiet as if I had poured cold water on them with my words. The nobles looked at each other in bewilderment, and the face of the second prince was brutally twisted. The faces of the crown prince and empress, as well as other princes and queens, were clearly embarrassed. A situation in which everyone is watching me, holding back their breath. “Then who on earth is it?” When asked by the emperor, I smiled brightly and pointed to the boy at the end of the prince’s row. “This is the man who I am going to marry.”"]},{"title":"Your Highness, Enchanted By Me!","tags":["Historical","Manhua","Romance"],"disc":["Read manga Your Highness, Enchanted By Me!","I time travelled. I died on the first day. What the heck, system? !\nSorry, host! Let’s start one more time!\nLian Qi, an ordinary high school student, time travelled to be Princess Yunying with a useless system. Her mission is to help the forth prince, Prince XuanYu, ascend the crown and make him fall in love with herself.\nEa…sy?! But Prince Xuanyu mistakes me for the assassin he met before…\nDon’t worry! You are the assassin!\nFine… What?!!!"]},{"title":"The Duchess Who Sees Ghosts","tags":["Fantasy","Historical","Romance","Supernatural"],"disc":["Read manhwa The Duchess Who Sees Ghosts / 귀신보는 공작부인 / 幽霊の見える公爵夫人 / 看见鬼怪的公爵夫人 / ดัชเชสผู้มองเห็นวิญญาณ / El don de la duquesa","Blessed with the ability to see and communicate with ghosts, Lady Julia Robinharts is always trying to make a quick buck off of her talents. For this self-employed entrepreneur, there is always money to be made in the industry of the supernatural. When Julia sells one of her talismans to a stranger who seemed to be weighed down by an apparition, she learns that kindness isn’t always repaid in coins, as the mysterious man asks to marry her in return. This man is actually Duke Leo Sirius Epesia, one of the most influential noblemen in the Floren Kingdom, and he seems to recognize her from 10 years ago. In the end, Julia is swayed into working as the duke’s personal ghostbuster, in exchange for a handsome reward. After all, what good is a loveless marriage compared to cold, hard cash?"]},{"title":"A Very Normal Ending","tags":["Comedy","Drama","Fantasy","Romance","Shoujo","Slice of Life","Supernatural"],"disc":["Read manhwa A Very Normal Ending / 베리노말엔딩\nThe matchmaker meets her match! Sayoung Lee is a travel consultant who helps others find their soulmates while they’re visiting new places. Though she has no interest in finding a love of her own, her whole world is turned upside-down when the mysterious and hunky Seowan shows up in this riotous rom-com!"]},{"title":"Lady Scarlet","tags":["Fantasy","Historical","Romance"],"disc":["Read manhwa Lady Scarlet / 레이디 스칼렛 / レディースカーレット / 思凯乐小姐的忠犬侯爵","Scarlet Marica is the eldest daughter of the bankrupt Baron Marica. She decides to go to the capital with the ambition of becoming the most recognized piano teacher. 3 years later, Scarlet fell in love with Edward Hart instead of pursuing her dream. She thought that she would get married in the future. But then she found out that her lover had a fiancée all along! Eventually, the richest man of the empire and the notorious marquis, Kellan Black approached her. “I have a lot of debt to pay him back. Lady Scarlet, would you like to take revenge on him?”"]},{"title":"Lady Edita","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lady Edita / 레이디 에디타","When Edita Lutensbach finally wakes up after an accident, her loved ones let out a sigh of relief. But unfortunately, the person who has woken up inside Edita is someone from a different dimension. Feigning amnesia, Edita learns that her doting father is an emperor. However, she is his illegitimate child, which puts her in a precarious position. She also discovers that her fiancé has died and that the noble Duke Brant Albrenovich has promised to take on that role. Edita wants to get along with her mysterious new fiancé, but his abrupt changes in behavior are enough to give her whiplash. The two seem to share a complicated history that, unfortunately, Edita can’t recall…"]},{"title":"My Boss is My Biggest Fan!","tags":["Adaptation","Comedy","Drama","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa My Boss is My Biggest Fan! / My Boss Teases Me / 상사가 나를 덕질한다","By day, Naeul Ju is an unassuming pushover at J&H Tab House. By night, she is Author Juna, a popular writer known for her web novel, Love Shot. No one knows about her secret double life except for her two closest friends. Hiding behind her taglines, she struggles to speak up while working for her ignorant boss, Dobin Kwon. She finds comfort in her cyberfriend, Dobi, who has always been there to support her. Workplace drama, pen names, and hidden identities… what will Naeul do when she realizes that Dobi is actually her ruthless boss, Dobin?"," "]},{"title":"I am the supreme villain","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I am the supreme villain / 我是至尊大反派\nHe crossed over and became the royal son of the Sun Immortal Dynasty. He has a Dao bone and outstanding talent. At the age of three, he took away someone else’s dao bone, at the age of eight, he seized the qi of a dynasty, at the age of thirteen, he ruined the father of a protagonist… Wait, wrong wrong wrong! I’m not a loser, I’m the bully! What kind of trope is this. hehe! What if I get into a fight with the son of luck? wait and find out, coming soon!"]},{"title":"Lord of Mana","tags":["Action","Fantasy","Magic","Manhwa"],"disc":["Read manhwa Lord of Mana","Ian Han, a hunter burdened by a lifetime of neglect due to his inability to wield mana, now stood on the verge of death."," ","As regret consumed him, he lamented, “If I had known things would end up like this, I would’ve never made such a choice…”"," ","Yet, in that desperate moment, something inexplicable occurred. Confusion gripped him as he questioned, “What is…?”"," ","A sequence of messages started to echo in his mind."," ","[You have awakened.]","[You have cleared the tutorial.]","[As a reward for clearing the tutorial, you will be given a unique trait.]","[With the completion of the tutorial, you will now be transported to the next training ground,]","[The continent of Panthea.]"]},{"title":"Beast World’s Wild Consort","tags":["Fantasy","Harem","Romance"],"disc":["Read Beast World Crazy Concubine / 兽世狂妃：不当异界女海王 / The World of Beasts: I’m not the king of the sea","Ji Mo travelled to the Orc Continent, and there are handsome male beasts who can fly in animal skins and long legs. She has become the most admired female in the entire Orc Continent. Every male wants Ji Mo to give birth to cubs. . “No! Let go of me! My ideal is not to lie down and give birth every day!” Ji Mo struggled in the arms of the handsome male beast."]},{"title":"A Close Call Romance","tags":["Comedy","Drama","Josei","Mystery","Office Workers","Romance"],"disc":["Read manga A Close Call Romance / 구사일생 로맨스","An obscure actress named Kim Eun-hong, who alternates between minor roles and extras.\nOn her way home drunk after being dumped by her boyfriend of nine years, Kim Eun-Hong became involved in an accident with Lee Kang-il, the CEO of LJ Pharmaceutical.\nBut then Kang-il suddenly asks me to act like his fiancée. You’re giving me a billion won just for getting engaged? Why me?\n“I can’t live without Kim Eun-hong.”\nI’m pretending to be his fake fiancée to avoid being thrown into jail…\nCan Eun-hong be reborn as a veiled French girl with a gold spoon? And will she be able to keep her contract with Kang-il, who harbors a lot of secrets?\nA man who dies if he’s not confident?! And Eun-hong’s life-threatening (?) romance act for him!"]},{"title":"Between Yearning and Obsession","tags":["Fantasy","Historical","Magic","Romance"],"disc":["Read Between Yearning and Obsession","Julia, a lowly servant from the marquess’ estate, has no idea how she lost the ability to speak. With no memories before the age of twelve, she’s simply been told a certain incident traumatized her. While everyone treats her harshly at the estate, Julia has been able to barely survive with the help of Camille, the second son of the marquess. Camille even helps her speak again using his special power, “Arcana.” However, that’s when the jealous servants plot against Julia and throw her out of the estate. The duke’s eldest son, Glen, stumbles upon injured Julia and takes care of her. Now, between Camille’s obsessive passion and Glen’s genuine affection, which one would Julia choose?"," "]},{"title":"I Led the Male Lead and Antagonist Astray","tags":["Comedy","Drama","Fantasy","Isekai","Josei","Manhua","Reincarnation"],"disc":["Read manhua I Led the Male Lead and Antagonist Astray / I Want To Raise Kids But They Like Me I Led the Male Lead and Antagonist Astray manhua, I Have Raised Both the Protagonist and the Antagonist Crookedly我把男主和反派都养歪了 I Want To Raise Kids But They Like Me","Fu Sang is a yin being that was formed from the resentment of the dead. By chance, she received the opportunity to be reborn as a human again. Bound by a trash system, the system tells her that she must raise the protagonist and the villain well so that they won’t be rivals due to the female lead in the future. By doing this, she will complete the mission. But Fu Sang only has the word “resentment” in her eyes. Raising kids = nourishing pure resentment. Not bad! And so Fu Sang began her journey of raising these kids, but she finds out that things may not be so easy."]},{"title":"I Raised A Black Dragon","tags":["Adaptation","Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","Mystery","Romance","Shoujo","Tragedy","Webtoons"],"disc":["Read manhwa I Raise a Black Dragon / 흑막용을 키우게 되었다 / I Raise a Black Dragon","The witch, Eleonora Asil, has fifteen previous convictions. And the transmigrator, Noah Park, had no intentions of being involved in the novel’s original plot of the dragon beheading the villainess. With that thought in mind, she abandoned her titles as The Wicked Witch and sought to live a long and peaceful life. So she heads down to the countryside wrought with deep remorse for all her misdeeds. And all should be happy… or she thought. “Please raise me!” And so it would seem that she stumbled upon the heroine’s pet dragon — the black-haired kid that would turn ballistic and obsessive later on — imprinted the villainess as his mother. And to make matters worse, the male lead suspects her as the prime culprit of stealing the dragon. “How long should I keep up with you?” She thought he’d arrest her right away, but seems like the male lead was slowly becoming the dragon’s butler. “Can I hug you?” “No.” “Then… can you hold me?” The villainess believes that the dragon needs a bit of taming. ‘Oh, male lead, won’t you sign a life contract as a real butler?’"]},{"title":"I Became The Sacrificial Princess","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhua I Became the Sacrificial Princess / The Day l Woke up as the Sacrificial Princess [Official] / ecoming a Sacrificial Princess One Day / Can This Life Be Loved? / Ibeon Saeng’eun Sarangbad’eul Su Iss’eulggayo? / Mou Tian Chengwei Ji Pin Gongzhu / Mǒu Tiān Chéngwéi Jì Pǐn Gōngzhǔ / One day I Became a Sacrificial Princess / 某天成为祭品公主 / 生贄姫のリベンジ〜殺されるのはごめんです〜 / 이번 생은 사랑받을 수 있을까요? / 제물 황녀로 살아남겠습니다","Unknowingly swapped upon birth, Princess Brianna lost her identity as a princess and became a vagrant orphan. One day, her Imperial Father suddenly sought her back, reinstating her back to her rightful identity as the nation’s princess. However, what awaited her was not a family reunion nor was it an extravagant life, but instead, she was to become a sacrifice for the god. Reincarnated into the body of Princess Brianna, our main character only wants to change her fate of death, yet realises that the best way to do so is to become the sacrifice. The only way she can live is by becoming the sacrifice, as hidden scheming along with its causes and effects, slowly unravel in front of her eyes."]},{"title":"Protect the Fake Saint!","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa Protect the Fake Saint! / 가짜 성녀를 지켜"]},{"title":"Concentration of Malice","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Smut","Webtoon"],"disc":["Read manga Concentration of Malice / Depths of Malice / 악의의 농도 / 悪意の濃度","“Proud Carter, my life has been ruined for him!” Rita, an aristocratic young girl, became a tavern housekeeper because of him. Days when you want revenge, but don’t have a blade to hold on to. A foreign shaman proposed to Rita. “I will trade your old body for a new one.” With the magic of the shaman, Rita, the Countess’s daughter, was able to be reborn as Bertha Alberta."]},{"title":"A Golden World to you","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Golden World to you / 황 금 의 세계를 너 에 게","A world divided in two, the ‘Lunar Kingdom’ where humans live and the ‘Sun Kingdom’ where demons live. Estelle, a knight of the Moon Kingdom, loses her family in an attack by demon tribes, gets involved with a strange demon tribe girl, and is sentenced to a life sentence. Live To do so, you must go to the northern tower. A timid girl-knight, a slave boy, and a demon king who became a ghost. The story of three people who embark on an adventure to find their lives."]},{"title":"Relationship Once Done","tags":["Comedy","Manhwa","Romance"],"disc":["Read manga Relationship Once Done / Once Done / One More Try! / 한 번 해본 사이\nHow about we have dinner together today?\nWe did it once, couldn’t get it…. Again?\nJuu-in On, whose dream and pride is a jewelry designer,. But from having an idea stolen to a real estate scam! She lived a life full of unhappiness. On top of that, she heard that HU, the company she was working for, was sold to Ondo International, a famous jewelry company.\nFortunately, they also decided with her. She took a deep breath and started her new job…\nOn the first day, she made the big mistake of dropping her bag on the CEO’s head! Furthermore, she knew this man. It was Jae-heon Do, her ex-husband, whom she broke up with after her contract marriage.\nShe can’t quit her new job so easily, so she decides to hold her heart tight, keep her distance from Jae-heon and try to get used to their new relationship….\nBut Jaeheon started approaching Juu-in from both inside and outside the company without noticing it?!"]},{"title":"Divine Perspective","tags":["Action","Fantasy","Manhua"],"disc":["Read Divine Perspective / 神级透视","An accident gave Ye Han an amazing perspective ability. Since then, his life has become rich and colorful, pioneering the strongest business empire, dominating the world of gambling, rejuvenating with one-handed medical skills, and becoming a master of medical ethics. Sitting on billions of fortunes, Loli, Yujie, Jinghua, and the goddess rushed towards him. As a man, but also a limited edition man, Ye Han was under great pressure and had to explore with several grave robbers. However, , A shocking secret that has been traced from ancient times to the present has gradually"," "]}]