[{"title":"I want to be your girl","tags":["Comedy","Drama","Fantasy","Josei","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I want to be your girl / 我想成为你的女人 / 당신의 여자가 되고 싶어요","The first place in Sung Ha-Yoon’s heart, is none other than the person she wants, Moon Shin-Hwi! He’s kind but when it comes to romance, there is no iron wall that’s stronger than Shin-Hwi’s. Tactical Ha-Yoon’s outrageous plans begin to unfold."," "]},{"title":"I Don’t Want the Obsession of a Twisted Archduke","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Don’t Want the Obsession of a Twisted Archduke / 흑막 대공님의 집착은 싫어요","I reincarnated as the wife of a cursed archduke in my own twisted novel. As the author, I took responsibility and set things right by lifting the curse, which was the key to returning home. I thought my job was done, and just when I was finally trying to go back, the archduke asked me, “Did you really think I wouldn’t know that you’re planning on returning to your fiance?” He had completely misunderstood! “Whether you like it or not, I’m still your husband. I’m never letting you go back to that bastard.” All I want is for him to please let me go home!"]},{"title":"Slow-Healing Heart","tags":["Comedy","Drama","Josei","Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhwa Slow-Healing Heart / It’s Uncomfortable, Sir! / 불편해요, 선배님!\nWhy does he look like my ex…? After a traumatic first love, Mijung is determined to put her past behind her and start fresh in college. But when she enters school, she meets an upperclassman with the exact same face as her first love! Will she be able to heal her past scars and learn to love again?"]},{"title":"The Stairway of Time","tags":["Drama","Fantasy","Manhwa","Romance","School Life","Shoujo"],"disc":["Read manhwa The Stairway of Time / 시간의 계단 / Sigan-ui Gyedan / Лестница времени / Les Marches du temps"]},{"title":"Assistant Teacher In a Magical Girls School","tags":["Action","Fantasy","Harem"],"disc":["Assistant Teacher In a Magical Girls School manga, Magic Girls Academy Assistant Teacher Mahou Shoujo Gakuen no Suketto Kyoushi, 魔法女子学園の助っ人教師\nLou Brandel is a magician who possesses talents that can only be found in one person every few thousand years. One day, he saves the beautiful and noble young woman, Fran. As the principal of Magical Girls Academy, she appoints him to work there with her! His “interesting” life of being a powerful magician teacher now begins!"]},{"title":"How to Serve a Devil Prince","tags":["Manhua","Romance"],"disc":["Read manhua How to Serve a Devil Prince / 恶魔王子饲养法则","I was going to confess to the male god, but a strange man slammed in through the window. Why is this arrogant man, who calls himself a demon prince, forcing me to live with him and ordering me to be his personal maid?! There is no way I’d take him in, I’m so angry!"]},{"title":"Zero Hunting","tags":["Mystery","Romance","Shounen Ai","Yaoi"],"disc":["Read manga My Vampire My Hunter / Hunting The Vampire","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nA submissive, quick-tempered hunter and a sly, dominant vampire! The genius hunter, Bai Mu, a little-known celebrity, accidentally got captured. He soon realized the one who captured him was a young vampire, who also turned out to be his childhood best friend. Since then, he was unable to escape, nor hide away, since all the possessive vampire wanted was to make Bai Mu his. “Mu, I’ll give everything I have, just to make you mine again."," "]},{"title":"Saya, the Fallen Deity","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Saya, the Fallen Deity / Saya (사야)","Saya Danmok wakes up in an unfamiliar palace with no memory of her past. She’s told that she is the last survivor of a terrible accident that took the lives of her family, but something doesn’t feel right. Even her wounds seems to heal too quickly. She bumps into Je-cheon, an imperial guard, and starts discovering the real truth behind her past."]},{"title":"Feelings In A Dream","tags":["Action","Adaptation","Adventure","Comedy","Cooking","Drama","Fantasy","Historical","Horror","Isekai","Liexing","Magic","Manhwa","Ping Ping Jun","Reincarnation","Romance","School Life","Thriller","Tragedy","Webtoons"],"disc":["Read manhwa Feelings In A Dream\nAn experimental drug to connect dreams made with the intention of meeting Daniel. It was the prince she loved unrequitedly, even though she had only met him in a dream.\nHowever, it was her opponent, Kaiden, who drank the reagent, and wasn’t that a one-time thing?\nLizen, who has perfect grades and physical skills, is bright and strong on the outside, but inside she hides a broken heart.\nKaiden, a man who is frank and cold, but warmer than anyone else.\nLizen is connected to Kaiden through dreams every day, and is not only entangled in a giant conspiracy surrounding the throne, but also feels confused with his feelings….\nA strange encounter constantly in their dreams. Was it because it was just a dream that easily passed as a joke, or became sincere feelings because of the dream.\n“It doesn’t make any sense anymore.\nI already have a crush on you. Now I like you even when I don’t dream about you.”"]},{"title":"A Relationship Of Intended Carelessness","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa A Relationship Of Intended Carelessness / Accidentally in Love / 미필적 고의에 의한 관계 / Mipiljeog Gouie Uihan Gwangye","Won’t a kabe-don usually be followed by a kiss? But instead of a kiss, the man in front of her looked at Eungyeol with an intense look, and their eyes became intertwined. “You were the one who seduced me first…” Was it just yesterday that his voice changed? It was the voice of a flawless man. “I even threw aside everything.” On top of that, he’s a bit overbearing. “Is this what they call dine and dash?”. Eungyeol returned a year ago to get her ex-boyfriend back but instead, got tangled with her best friend’s brother.","A relationship that seems intentional yet at the same time isn’t—their relationship of intended carelessness."]},{"title":"Her Atypical Story","tags":["Action","Comedy","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Her Atypical Story / Nu Zhu Ni Ren She Bengle / Heroine, Your Man Is Acting Out Of Character / Nữ Chủ Người Đàn Ông Của Bạn Bị Hỏng Rồi / 女主你的人设崩了","Died from choking on cream, Su Mo is given the choice to transport into the universe of books instead of reincarnating as a hen. Do you think that her fate will change and hit the peak of her life? Too naive! Turns out she enters into a super weird story! The male lead is an eccentric masochist, and she needs to win him over while keeping up with her preset characteristics! Someone, please tell the poor girl what to do!"]},{"title":"Flower Of The Beast","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Flower Of The Beast / 폐월화 : 야수의 꽃 1화"]},{"title":"This Man is a Little Mischievous","tags":["Comedy","Drama","Manhua","Romance"],"disc":["Read manhua This Man is a Little Mischievous / 这个男神有点皮","The 25 years old Tong Hua is once again harrassed by her parents to go to a marriage interview, and this time the guy supposedly is a noble? Little does she know, this man dressed in rags during their first meeting is not who he seems to be at all…"]},{"title":"As The Lady Wishes","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa As The Lady Wishes / 아가씨 뜻대로","Hyun Eun Suh, age 7. She was taken care of by the CEO Cha Deok Man, who regarded her great-grandfather as a great benefactor. 15 years later, CEO Cha collapsed after falling ill, and so wanted her to marry one of his grand-sons?! The conglomerate’s future depends on Eun-Suh who was loved more than CEO Cha’s own descendants! During this time, Cha Jin Ha who was like her real older brother dropped a huge announcement? “Miss, are you still considering who you want to marry? Of course, you have to marry me.” A man who she cares for most in the world and yet someone whose feelings remain indecipherable, can she trust him?"]},{"title":"My Bad Younger Man","tags":["Comedy","Romance","Shoujo"],"disc":["Read manhwa My Bad Younger Man / Berondong Nakalku / 나의 나쁜 연하남","When Sol receives an engagement party invitation from Minji, the girl who stole her first love, she’s determined to attend just to prove how great she’s doing. But she needs to find a hot boyfriend first, when her dating life’s been nonexistent! The only viable candidate she can find is her younger brother’s friend, Joohyuk, who has had a major glow-up since his scrawny teenage years. “I’m not a little kid anymore. You’d better watch out.” The tall, sexy Joohyuk seems like trouble…but desperate times call for desperate measures. As long as she can see Minji’s jaw drop in shock, Sol is willing to put up with his demands. Little does she know that Joohyuk is actually out to get her for ruining his life in high school! Will Sol be able to make this rocky partnership work in her favor, or will the plan backfire on her?"]},{"title":"Bank Lady","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Bank Lady / The Lady Bank / 은행의 공녀님","Adriana, a beautiful princess who was called the flower of the social world and the fairy god.\nHaving met a man she loved and dreamed of a happy life, she was caught up in a conspiracy and lost her family and was killed miserably by her husband’s affair partner.\nShe opened her eyes to the sense of freedom that this pain was finally over, and she was back eight years ago.","“I can’t repeat that miserable life again!“","Adriana hides her identity and hides into a family-owned bank to reveal the plot surrounding her family!\nAll the banks that barely entered were branches that were collapsing, and customers couldn’t afford to lose.\nBesides, the bank’s escort is a suspicious swordmaster who has been associated with in the past?","Will Adriana be able to live happily in this life?"]},{"title":"Black Dragon Romance","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Black Dragon Romance / 흑룡연인 / 甜心总裁娇妻控 / เสน่ห์รักมังกรดำ / 黒龍恋人 / Les Amants du Dragon Noir / Die Liebhaber des Schwarzen Drachen / Black Dragon‘s Lover","The wealthy Black Dragon clan rules Shanghai, and their power knows no bounds. But for three ordinary young Koreans, life in the city is very different. Pyung-an, an art enthusiast, is working her dream job in a prestigious gallery. Yeo-rae, a talented cellist at the Music Institute, is grafting hard to make ends meet. And Jin-hwan is looking for inspiration after his dream of being a taekwondo star foundered. For these three, the vast metropolis teems with potential romance, excitement…and danger. As they become mixed up with the formidable Black Dragon family, their lives are turned upside down.Source of collecting images:bato.to/series/79717Notices:Rating 15+. This series involves a crime business and eventually will get darker, so please note that you may encounter some violence throughout the series."]},{"title":"I Got Married To A Villain","tags":["Action","Adventure","Drama","Fantasy","Historical","Isekai","Psychological","Reincarnation","Romance","Survival"],"disc":["Read manhwa I Got Married To A Villain / 악역에게 청혼받았습니다 / I Got A Proposal From A Villain / I’ve been Proposed to by a Villain / I Was Proposed to by a Villain","I witnessed the novel’s villain murdering someone – and even got caught witnessing it! I can practically hear the bell signalling the end of my life ringing. However, what he gave me was… “Marry me.” A ring. One with a huge gem at that! What’s going on here?! Is this not better than dying, My Lady? Let’s get married. My newly-wed life with the villainous lead begins now!"]},{"title":"Cheerful Countess Sisters","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Cheerful Countess Sisters / Countess and the Blade / 명랑자매백서","The heart-racing and hot-blooded romances for sisters Ice Princess Charlotte and the strongest knight Kara! The Count’s lovely yet unfortunate granddaughter, Young Miss Charlotte. After her grandfather passes away, she inherits his entire fortune and title instead of her worthless father. That’s how she thought her life was going to be in full bloom, but her father wouldn’t let go of the inheritance and brings forward Kara, a younger sister she’s never seen nor heard of before… “It’s good that you’ve become the lady of the Ferol household, and that I am able to share the inheritance.” And in the midst of it all, she also has to deal with their King who’s targeting her fortune by trying to force her into marriage with his own vassal! To Charlotte, who has to stand against all of these stupid troubles, Kara extends a hand. “In situations like these, you should say that they’re ‘crazy bastards’! You should curse them at least this much.” “Crazy bastard?” “Good.”"]},{"title":"Kiss Me: Seal Lips Tightly","tags":["Drama","Manhua","Romance","Webtoons"],"disc":["Read manhua Kiss Me: Seal Lips Tightly / 以唇封缄\nHer inferiority and humiliation in her previous life in exchange for the conspiracy and betrayal of those around her. This life she came back, she was strong and she had to make the people who bullied her pay! How can this “queen” reverse the miserable life and win the hearts of the talented leader?"]}]