[{"title":"Until the Real One Shows Up","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Until the Real One Shows Up / Before the Real Heroine Steps In / 진짜가 나타나기 전까지만","[A tale of altering a fate ruined by love, once again]","I dared to surpass the protagonist, even as an extra in the novel.","I thought that with the power of love, I could change fate.\nBut it was all a delusion, and everyone ended up dead.","‘If I could go back, I would never fall in love with you.’","Perhaps my desperate wish was heard, as I returned to a year before the original story began.\nBut the problem is, this body belongs to ‘Anastasia’, the infamous worst villainess!","‘If I continue like this, the heroine will appear, and I’ll be beheaded.’","I have to figure out a way to save my life, and I must not fall in love with the male lead.\nI planned to live decently and leave before the real heroine appears.\nHowever…","“I won’t divorce my wife.”\n“Anastasia will be the empress of Rosenberg till her death.”","I shouldn’t harbor such poignant feelings.\nThe original story, it seems to be changing once again."]},{"title":"The Count’s Secret Maid","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa The Count’s Secret Maid / 백작가의 비밀스런 시녀님","마신의 Paula, a horribly ugly girl born into a poor family, is unexpectedly hired as a servant for the esteemed Count Velunita’s household. However, her master, Sir Vincent Velunita, has been confined to his room, gripped by fear after losing his sight… Until the day he can return to the world, Paula must attend to him alone. In utmost secrecy."]},{"title":"The Investor Who Sees the Future","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The Investor Who Sees the Future / 미래를 보는 투자자","Kang Jin-hoo gains an extraordinary ability to foresee the future after a life-changing accident during his military service. Armed with this unique power, he dives into the world of investments, targeting companies and financial markets to amass wealth and become the world’s top investor. But his vision extends beyond just making money. Kang Jin-hoo’s foresight begins to influence the global economy, political systems, major corporations, and even the course of globalization itself. Now, with his sights set on reshaping the world of finance and beyond, he is about to rewrite the rules of the future."]},{"title":"Solo Eating","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Solo Eating / Solo Eating To Overpowered / Becoming Overpowered by Solo Eating / 혼자 다 해 먹는 먼치킨"]},{"title":"Ice Lord","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Ice Lord","At the young age of twenty, Seol Mudok, a master swordsman, became the Lord of the Northern Sea Ice Palace. Plunged into despair after the death of his lover, he discovers that with the legendary flower, the “Lotus of Love,” that his deceased lover has been reincarnated. In his quest, he descends into another world…"]},{"title":"I Was Born As The Second Daughter","tags":["Drama","Fantasy","Manhua","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Was Born As The Second Daughter / I Was Born as a Daughter for the Second Time / 번째 딸로 태어났습니다","I was born as my first daughter and died at the age of 5, but my second life was also born in your arms. my mother, who died when i was 7 years old. a man with pink hair that he encountered after he went out on the road with a piece of paper that his mother had left as a keepsake. are you my dad? even the emperor? do you have three orabunnies? mummy… can i get along well with my new family?"]},{"title":"Becoming Best Friends With the Icy Male Lead","tags":["Adaptation","Adventure","Fantasy","Isekai","Manhwa","Shoujo"],"disc":["Read manhwa Becoming Best Friends With the Icy Male Lead / Becoming Bestfriends With the Cold Male Lead / 얼어붙은 남주와 절친까지만 되려 했는데"]},{"title":"Please Fulfill Your End of the Bargain, My Grace!","tags":["Drama","Fantasy","Manga","MANGA","Romance"],"disc":["Read manga Please Fulfill Your End of the Bargain, My Grace! / Promise Me a Life With Three Meals and a Nap, Duke / Sansho Kuhirune-tsuki Seikatsu Oyakusoku Shite Kudasai, Koushaku-sama / Sanshoku Hirune Tsuki Seikatsu o Yakusoku Shite Kudasai, Koushaku-sama / Sanshoku Hirune Tsuki Seikatsu wo Yakusoku Shite Kudasai, Koushaku-sama / Sanshoku Hirune-tsuki Seikatsu wo Yakusoku Shite Kudasai, Koushaku-sama / 三食昼寝付き生活を約束してください、公爵様 / 삼시 세끼 낮잠이 보장된 생활을 약속해 주세요, 공작님","Please fulfill your end of our bargain, my Grace! Liscia, abused day and night by her stepmother, wishes for nothing but freedom. One day, she receives a shocking proposal for marriage from none other than a well-known, handsome noble, Duke Lindberd. Upon discussing his intentions, Liscia realizes that he’s planning to have a fake wedding with someone who will not interfere with his privacy, just to get people off his back. Liscia agrees to marry him under one condition: Promise her a life with bare necessities, including three meals daily and a nap time! And now, let this be the first page of the duchess’ diary of struggles, fighting for a life where she just wants to eat and sleep!"]},{"title":"World’s Strongest Troll","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read World’s Strongest Troll (The Game’s Top Troll)","The most probabilistic game in the world.\nAjin Electronics. Silicorp Industry. Corporation Argos.\nIt was the first virtual reality game made by the world’s leading conglomerates — Arcadia.[Welcome to the fantastical world of Arcadia.]\nThe crazy stories of that world will now unfold!"]},{"title":"College Student Empress","tags":["Action","Comedy","Drama","Fantasy","Harem","Romance","Webtoons"],"disc":["College Student Empress / Empress Palace College Student / 唯有套路得帝心 / 皇后は体育会系！？ / 황후궁 체대생 / Girl Jock Empress","Haesol Shin a beautiful college student who lives her life to the fullest but when she opened her eyes, she’s suddenly transported into a world she only heard of and became the Empress!"," "]},{"title":"Our Fate Starts With the Notebook","tags":["Fantasy","Romance"],"disc":["Read Our Fate Starts With the Notebook","Vivian, the daughter of a count, is rumored in society to be a “cold-blooded lady.” One day, her fiancé—chosen by her stepmother—calls off their engagement, accusing her of infidelity. Vivian doesn’t fight back and allows the engagement to unravel without a care. Then, young Duke Silvestre appears, having returned from another kingdom. For some reason, this man—whose status and appearance are the envy of all—draws close to her, proposes, forces her into marriage, and begins doting on her! Where will the romance between the noblewoman who has lost her emotions and this captivating duke lead?"]},{"title":"What Happens When the Second Male Lead Goes on Strike","tags":["Adaptation","Comedy","Drama","Fantasy","Manhwa"],"disc":["Read manhwa What Happens When the Sub Male Lead Goes on Strike / When the Third Wheel Strikes Back / What Happens When the Second Male Lead Powers Up / 섭남파업 / 서브 남주가 파업하면 생기는 일","I was transported into the romantic fantasy novel my younger sister was reading, not as the male lead but as the second male lead. If I remember correctly, this punk is fated to go into war in the future and die in the male lead’s place. Okay, I’ve made up my mind. Let’s not go anywhere near the main characters and stay healthy until I can go home."]},{"title":"Don’t Be Carelessly Friendly","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Don’t Be Carelessly Friendly / 함부로 친절하지 말라","For centuries, celebrated as a genius knight of the Caleta Empire, ‘Lustica Zenas,’ who battled the ‘Barrier’ and unending wars, saw all her strength vanish overnight, as if it were a lie.","After four years of seclusion, a mysterious man named ‘Hayden’ appears before her, with whom she spent a sweet night, yet his true identity remains unknown. Hayden seems to remember the past Lustica.","Meanwhile, the Emperor of Caleta summons her, now living like a pauper, and dispatches her as a diplomat to the longstanding enemy, the Perseta Empire, beyond the crumbling barrier.","Will the former knight Lustica, who has lost all her strength, be able to reclaim her past self?"]},{"title":"The Villain’s Daughter-in-Law has limited time","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga The Villain’s Daughter-in-Law has limited time / The Archvillain’s Daughter in Law /시한부라서 흑막의 며느리가 되었는데 / Because She Had A Time Limit, She Became The Villain’s Daughter-in-law\nThe final villain is being deceived by his young time-limited daughter in law who was possessed. If I die at the right time, I will marry his son. The problem is, I already know the cure! And I don’t want to die, but if I don’t get killed now, then I won’t die quietly. “Daddy, I love you so much. You are the most handsome man in the world. Cough, cough!” “Evan, shall we read a fairy tale book together until we fall asleep?” She will have to act a little better to let his guard down. Then, she would be able to do a great job. I think I’ll have to leave secretly after I get better. I have to make a lot of money and buy land under borrowed names— “Call all the council members on the continent. My daughter-in-law has to live.” Father? Shouldn’t I be thrown away…? “If you die, I’ll follow you unconditionally. I can’t live in a world without you.” Husband? You’re acting strange, too… You don’t love anyone, do you? Even— “Who is this, Kyle Ravonis? The man who seduced my daughter-in-law deserves to die.” “Even if you cheated on me with another man, I will never break up with you.” You must have misunderstood my other name! “When did this start, huh? You said you wanted to live as a sweet couple, but you tried to run away by creating a new identity behind our back?” I want to quietly disappear, not die! I didn’t know my husband, who has been like a friend to me ever since we were young, would come to me with such sore eyes. “You’re still my wife on paper. Live as my wife, and die as my wife.” “Evan?” “You’ve shown me both heaven and hell…” His reddened eyes locked me up. “You’ll never get away from me no matter where you go.”"]},{"title":"Say the spell, Rose!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Say the spell, Rose!\nEven if you roll around in a dog poop, you’ll feel better…\n“Sa, save me! Anyone!”\n“I don’t want to die in vain like this!!”\nThe moment I thought I was dead, I woke up in a luxurious mansion.\n“One week. Then I’ll take you back to the original world.”\n“… Me! … I’m a slave.”\n“…If you don’t catch fish in the snowy mountains in the middle of winter, you’ll be beaten until you pass out.\nI don’t want to go back to that kind of life! ”\n“I want to live!”\n“Accept me as your disciple!”\nIt will never be broken this time."]},{"title":"The Crazy Genius Composer Returns","tags":["Action","Adventure","Fantasy"],"disc":["Read The Crazy Genius Composer Returns","The Crazy Genius Composer Returns synopsis: Success, fame, family… In an instant, the genius composer, Min Hyunseung, lost it all. On the brink of death… he wanted to live a different life, one where all those continuous misfortunes couldn’t just be claimed as karma. “How did this happen…?” He was given another chance to live."]},{"title":"The hero proposed to me","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa The hero proposed to me / The Male Lead Proposed to Me / The Protagonist Proposed to Me / 남자주인공이 내게 청혼했다","Male lead, why are you proposing to the villainess and not the heroine? Having the strongest man in the empire as her father, the most beautiful woman as her mother, and three arrogant brothers, she had immense beauty, power, and irreducible wealth. I came to possess the villainess who had all these things in a romance novel; “Cielle Valentine.” In the original novel, the heroine was the adopted sister of Cielle, who had an unrequited love for the prince who loved her sister. Blinded by jealousy, Cielle harassed the heroine and was consequently executed by the male lead. Being jealous and tormenting others caused my downfall, so I tried to matchmake my sister and the male lead… “Please marry me, Lady Cielle.” Male lead, why are you proposing to me?"]},{"title":"I am with the music immortals","tags":["Drama"],"disc":["Read manhwa  I am with the music immortals","Though he had no talent, he wanted to succeed as a singer. Death came to him on the day he thought was his last chance, but the music immortals did not forsake him. ‘If the music immortals don’t abandon you, can you really do it?’ With the immortals of music by his side, he started a new life"]},{"title":"Protect Me from Despair","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Protect Me from Despair/ 절망을 수호하는 당신에게","The Blooming estate was in an uproar when nineteen year old Rowena Blooming suddenly went missing, only to be discovered without any recollection of what happened. Rowena was the most confused, left with no memories, but the faint lingering traces of a feeling, or dream she had. Soon, she discovers that something else is lingering around her: a specter of a man who only she can see and hear that identifies itself as Enoch Claude, a member of the notorious Margraves house of Claude. Enoch also claims he is hailing from four years into the future, and is entangled with Rowena in this past timeline an incorporeal spirit that can occasionally make contact with her, physically and emotionally. The caring Rowena attempts to help Enoch get back to his own life, while his presence as her guardian spirit grows stronger by day While the ghostly lord with a dark past is clearly hiding that the two of them are acquainted in the future on bad terms, he grows closer to the Rowena of the past, as they discover more about the reason for their entanglement. Why was Enoch sent back to be her guardian spirit? What is the secret he is hiding? What new future lies for this pair, divided time?"]},{"title":"Queen of the Veil","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance"],"disc":["Queen of the Veil / 面纱下的女王","After being reincarnated, Sai decided to take revenge on her foster mother."]}]