[{"title":"I was just trying to prevent the breakup of the main characters","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I was just trying to prevent the breakup of the main characters / The Matchmaker Gets Matched / I Was Just Trying to Prevent the Break Up of the Main Characters / 部の公爵は炎の令嬢なしでは生きられない / 주인공들의 파혼을 막으려 했을 뿐인데"]},{"title":"Dear My Liar","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Dear My Liar / 디어 마이 라이어","If everything I thought was a lie, what should I do?”\nThat’s what Enkana Mattiola, the commander of the knights that everyone respects.\nEnkana begins to vibrate when hearing a surprise comment from her best friend Evony, and as her doubts grow, she begins to see things close around her and soon after… Evony was killed, And the man she loves has been charged."]},{"title":"Truthfully, They Only Remembered Her","tags":["Action","Adventure","Drama","Fantasy","Historical","Romance","Webtoons"],"disc":["Read manga Truthfully, They Only Remembered Her / In Fact They Only Remembered Her / They Only Remembered Her / 사실, 그들은 오직 그녀만을 기억하고 있었습니다\n“I’m leaving.” “Really? I’m sure the people who fought together with you in the war will miss you.” “Nobody will remember me. ” At the end of the war, a commoner knight, Clarence Holton, left everything behind and ran away, including the promised honor and happiness she could have received after winning the war. But– “Where the hell did Clarence go?” Contrary to the expectations that no one would remember her, the imperial prince, the taciturn knight, and the genius wizard, all rose to the temple at the news that she had left. And the chase for her disappearance began."]},{"title":"Ladies Prefer Menservants","tags":["Drama","Josei","Manhua","Romance"],"disc":["Read manhua Ladies Prefer Menservants / Ladies Prefer Menservants manhua / Don’t Marry the President, Marry the Houseboy / 不嫁总裁嫁男仆 / 눈떠보니 네가 왜","A plot created by her sister’s cunning planning led to her reputation being ruined, her fiance stolen and she was even forced to marry an unknown one-night stand. What? Her husband’s the…"]},{"title":"Popular Princess","tags":["Drama","Historical","Romance"],"disc":["Reading manhua Popular Princess / Cute Beads on the Palm / Zhang Shang Meng Zhu / Zhǎng Shàng Méng Zhū / 掌上萌珠 / 親バカ暴君の溺愛日記 / 황제의 최고 귀한 딸이랍니다"]},{"title":"When the Dragon King Falls for the Loli Alchemist","tags":["Historical","Romance"],"disc":["Read manhua When the Dragon King Falls for the Loli Alchemist / Dragon King Chasing After His Wife / The Demonic King Chases His Wife – The Rebellious Good-for-Nothing Miss/ The Demonic King Chases His Wife / 邪王追妻 废材逆天小姐","Zhui Yu, an elite mercenary, transmigrated to another world as the unwanted daughter of a family of alchemists, trampled, and bullied by everyone. Nonetheless, Zhui Yu decided to live strong in place of her body’s original owner, and destroy every person who ever bullied her!"]},{"title":"Whispers of the Devil","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Whispers of the Devil","Jing Qiao and Jin Yan Shen exchanged vows in the wedding, but underlying the seems like a happy marriage was the darkest truth. On the first night of the marriage, suffering from the humiliation and the abuse of Jin Yan Shen, Jing Qiao slowly remembered what happened in the past… A shipwreck made her the murderer forever. And the appearance of him only pushed her deeper into hell. — Xing Qiao, you can’t escape from me! — Jin Yan Shen, we have no debt and no favour to repay! You have your way, I have mine."]},{"title":"The Strongest Pick-Up System","tags":["Action","Adaptation","Comedy","Fantasy","Harem","Manhua","Romance","School Life"],"disc":["Read The Strongest Pick-Up System","A poor college student suddenly awakes the bloodline of “Lord of Flowers”. If he hasn’t practiced the “The Fortune of Flowers”, he will die before 20. The only way is to gather the true love of different types of top-notch beauties. Check the pure college student ML, and what will be his adventure after having the strongest pick-up system ever?!"]},{"title":"Debussy Lover","tags":["Drama","Fantasy","Manhua","Office Workers","Romance","Shoujo"],"disc":["Read manhua Debussy Lover / 德彪西恋人"]},{"title":"President daddy is chasing you","tags":["Drama","Romance","Slice of Life","Webtoons"],"disc":["Read manhua President daddy is chasing you / Here He Comes, My President Daddy / Daddy Is A President / 总裁爹地追上门 / Here He Comes / My President Daddy","Three years later, she brought her child come back home","Shocking! On the huge screen, there’s an intimate picture of a man and a woman. That pair in the pictures was her own sister and fiancee. Ruo Yun Fei who was the most innocent was accused of everything. Three years later, she returned with her daughter. How much pain you suffered before…\nWhen you break from your cocoon and turn into a butterfly, you’ll become even more dazzling ….."," "]},{"title":"She’s Gone Viral Again","tags":["Drama","Manhua","Romance","Shoujo"],"disc":["She’s Gone Viral Again , At long last, Xiang Yi thought she had completed her final transmigration missions and could retire in peace. How could she know that during the period when she wasn’t around, someone else would transmigrate into her body! The current her had fallen hard to become an obscure artiste with a rotten reputation, to the point that the entertainment industry even boycotted her for sleeping with the Best Actor. Even her family had cut ties with her But the maxed-level OP shows no fear at all~ Join her as she shows off her talents with a butcher’s knife to chop up those pretentious b*tches! Shocking! She’s gone viral again!"]},{"title":"Road to Awakening","tags":["Fantasy"],"disc":["Read Road to Awakening / Legend of Awakening manhua / 天醒之路","Rupin, a loser who’s protected by school goddess Candy, is always a joke of the Gale College. No one knows that his natural power got sealed for some reason. What will happen in the competitive college? And how does Rupin awaken his power?"]},{"title":"Between winter and spring","tags":["Manhwa","Romance"],"disc":["Read manhwa Between winter and spring, Winter Spring, 寒冬與暖春之間, 겨울과 봄사이","Two men of contrasting colors appear in front of Ha-yeon, who is suffering from color blindness."," "]},{"title":"Mermaid Bride of The Dragon King","tags":["Fantasy","Historical","Mystery","Romance"],"disc":["A new king of the dragon race who has just succeeded to the throne is faced with the extinction of the dragon race. The only way to keep the dragon race alive is to find the mermaid’s secret treasure again, as they were told by their former king. A harmless and cute girl, on the surface, she is a princess who is loved by everyone. In fact, it seems that her origins are a secret. The story of an extraordinary king and princess, each with their own hidden secrets ."]},{"title":"My Cute Baby Is A Wingman","tags":["Comedy","Drama","Romance","School Life","Slice of Life"],"disc":["Read manhwa My Cute Baby Is A Wingman / My Babes Are My Wingmen / 我的萌宝是僚机","Top hacker Ann Jiujiu sneaks into an auction, intending to steal a gem, but unexpectedly loses her baby! Instead, there is a child who looks exactly like her son, only a bit dumb? When the little fox An Jiujiu meets the big black wolf Ji Jinchen, she hides from him, but he still catches her firmly. Since we can’t escape, we’ll train him to be a good dog, and what’s the fate of marriage, we already have two children!"]},{"title":"Her Ladyship’s Scheme","tags":["Comedy","Fantasy","Manhua","Romance"],"disc":["Read manhua Her Ladyship’s Scheme / Konspirasi Sang Putri / Đích Nữ Vi Mưu / การแก้แค้นของหมอสาวที่เกิดใหม่ / 嫡女为谋","In her previous life, Bian Xia was forced to hide behind a mask of kindness crafted by her “benevolent” stepmother, while her “kind” half-sister spread vicious lies about her. When Bian Xia found herself backed into a corner, she turned to her fiance, the prince, for help, but he betrayed her and chose her stepsister instead. Now, if time were to turn back and give her another chance, would she seek revenge? With her cunning and strategic mind, could she protect her loved ones and bring justice to those who wronged her?"]},{"title":"I am the Lord of the Underworld","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa I am the Lord of the Underworld / 我是冥界之主 / I am the Lord of the Underworld","Mutation strikes, the world is overturned, and after a hundred years, humanity enters the era of universal job change. Chai Yu starts with an awakening of an SSS-level talent – the Apostle of the Underworld. Infinite undead, skills multiplied by a hundred, mental control – watch as Chai Yu sits on the high platform of ten thousand bones, deciding life and death with a wave of his finger. Three years later, the Void Clan invades the Blue Star. Chai Yu opens his eyes and says, “Hmph, mere aliens, easily exterminated with a flick of my hand!” In an instant, the Kingdom of Death descends, and billions of natural disasters engulf the void."]},{"title":"Ms. Social Butterfly","tags":["Drama","Josei","Manhua","Romance"],"disc":["Read manhua Ms. Social Butterfly / Housepet Socialite Online Trade / 그 남자와 아찔한 계약연애 / 社畜名媛在线营业","Qiao’s Group is on the verge of bankruptcy, and Qiao Yu, the youngest daughter of Qiao’s family, is ordered to become a social animal in danger! He did not hesitate to use himself and Lu Nancheng, the president of scheming, to make a deal, but he did not expect the two to pretend to be true and form a preference for each other. Crisis!! The love that is actively in business is cracked due to the grudges between the fathers, and Qiao Yu is gradually disheartened by Lu Nancheng due to the malicious and serious injuries of his rivals. I don’t know if the president will stage a wife-chasing crematorium!"]},{"title":"My Ex-Husband Became The Male Lead","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Ex-Husband Became The Male Lead / The Cure for Passion /  元夫が主人公の世界に転生しました / 关于我的前夫成为男主这件事 / 전남편이 남주가 된 것에 관하여","Renna, who lost her life, was reincarnated into a novel she used to read in her previous life.\nThankful for getting another chance, she lived her life peacefully until one day, the Male lead appeared in front of her out of nowhere and made a request.\n“….I need you to make me a potion that can make my desire disappear.”\n“What….kind of desire?”\n“….sexual…..desire…..”.\nThe problem here…..is that the man asking for the potion to be made is Renna’s ex-husband who lost his life on the same day as she did.\nHer stoical monk of an ex-husband. Her ex-husband, who throughout their marriage, was the literal meaning of the word ice.\nHe had possessed the famous Male Lead and appeared in front of her!"]},{"title":"Please Stop Summoning Me!","tags":["Action","Adaptation","Adventure","Fantasy","Mystery","Romance","Supernatural"],"disc":["Read manga Please Stop Summoning Me! / 别再召唤我啦！","[Adapted From A Novel By The Same Name] Eerie prayers were heard, and each name was distinct. “Lord of the Ashes” “Colorless City” “Mist of the White Shore” “Spirit of the Ancient” ” Dream of the Void” “Ruler of the Chaos” After Shen Yi transmigrated to a new world, mysterious groups seemed to be wanting to Summon him nonstop. The church, wizards, investigators, saints… Every summoning group had something they desired. And at the same time, they offered various sacrifices. Shen Yi was overwhelmed with annoyance, but there was nothing he could do to put a stop to it. Eventually, he was successfully summoned by cultists. And the first problem Shen Yi had to face was… A sacrificial little girl, who had slumped on the altar!"]}]