[{"title":"Fu Bao San Sui Ban Ta Bei Ba Ge Jiujiu Tuan Chingle","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Fu Bao San Sui Ban Ta Bei Ba Ge Jiujiu Tuan Chingle / 8人のおじさまとお嬢様 / Eight Uncles Spoil Little Bao / Fú Bǎo Sān Suì Bàn, Tā Bèi Bā Gè Jiùjiu Tuán Chǒngle / She, the Three and a Half Year Old Treasure of Fortune / Spoiled by Her Eight Uncles / 福宝三岁半，她被八个舅舅团宠了 / 福寶三歲半，她被八個舅舅團寵了","When the innocent, lovely and precocious Su Bao was beaten to death by her adoptive father, the psychic heard the voice of the judge master Ji Chang, guiding her to call her little uncle, and the eight big uncles rushed there! The little boy who was reborn Su Bao just wants to have something to eat and grow up in peace, but she doesn’t want to be spoiled by the eight bosses and uncles! In the end, the god-like overbearing father pampers her into a little princess that the whole world envies."]},{"title":"My Dear Enemy","tags":["Drama","Fantasy","Manhua","Romance","Slice of Life","Yuri"],"disc":["Read manhwa My Dear Enemy / Dear Arch-Enemy / My Dear Enemy / My Dearest Nemesis / Qin’ai De Siduitou / 亲爱的死对头","The whole company knew that they they were polar opposites who fought like cats and dogs. Yet during the year-end party, the wall between them shattered after they got drunk! And so the two of them went from always being close to going off on each other to feeling very strange things following the accidental mishap…"]},{"title":"The Emperor’s Sword","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Emperor’s Sword / 황제의 검"]},{"title":"I Married the Enemy Who Killed My Parents","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa I Married the Enemy Who Killed My Parents / Marrying the Enemy / Nikah sama Musuh / 부모님을 죽인 원수와 결혼했습니다","I thought it would be the happiest day of my life.\nI could finally be next to the person I loved so much, we would be together forever It was the best day of my life, because I finally managed to have everything I wanted…\nOr at least that’s what I believed. I never imagined that it would be the most tragic day of my life.\n“Why are you keeping me alive?”\n“Because I love you. Roney.”\nLove? The man who killed my parents and took everything. The man who took my freedom and trampled on my life, uttering the word love in his filthy mouth. I will never forgive him. I will make sure this man pays for what he did."]},{"title":"This Martial Saint Is Way Too Generous","tags":["Action","Drama","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read manhua This Martial Saint Is Way Too Generous / This Martial Saint Is Too Generous / 这个武圣过于慷慨"]},{"title":"I have Max level luck","tags":["Action","Adventure","Comedy","Fantasy","Manhwa"],"disc":["Read manhwa I have Max level luck / 내 행운은 만렙이다 /  My Luck is Max Level","A Virtual Reality game praised for its extreme difficulty. Hansung was once a top-tier ranker, but he got trapped inside the game! It’s hard to survive with his current stats. However, Hansung has a high level of luck! Obtaining SSS class skills from random boxes? That’s easy! Hitting the jackpot from the slot machine? A piece of cake! He is overflowing with luck! So, can Hansung safely clear this game by only relying on his luck?"]},{"title":"Melin’s Salvation Plan","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Melin’s Salvation Plan / メリーンの救世計画 / 梅利的救世计划 / 梅林的救世计划 / 멜린의 구세 플랜","I suddenly woke up in the body of Melinia, a supporting character and the first love of Male Lead A from “Azuli’s Magnificent Misfortune.” Since I know how this tragic tale ends, I decided to do what I can to stop the ultimate destruction of the kingdom from the male leads. But the more I try to fix things, I can’t help but notice that the storyline seems to veer farther away from what I read. Will this plan of mine work? Or will it just cause more harm than the original?"]},{"title":"I Will Seduce the Northern Duke","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Seduce the Northern Duke /  I Seduced the Northern Duke / 북부 공작님을 유혹하겠습니다"]},{"title":"I Won’t Accept Your Regrets","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Slice of Life","Webtoons"],"disc":["Read manhwa I Won’t Accept Your Regrets / Aku Tidak Menerima Penyesalanmu / 당신의 후회는받지 않겠습니다","“I can’t promise you love, but I’ll have no other woman but you.”","I thought it would be okay. Even if he didn’t love me, I thought my love would make our marriage happy. But that naive wish was soon shattered.","Because Lizzena, Raymond’s first love, came back with a kid.","“Lize is trying to make her child be the First Prince,” he told me.","“Let’s get a divorce.”","I decided to abandon him.","***","“What?”","Raymond’s eyes shook violently as if he didn’t understand my words. His agitation, seen for the first time, for some reason made me feel relieved.","I opened my lips to him again with a soft smile: “I want to leave you. So Raymond, let’s stop now. Divorce me.”","It was the end of a long unrequited love."]},{"title":"Destructive Desires","tags":["Comedy","Drama","Josei","Manhwa","Romance","Smut","Webtoons"],"disc":["Read manga Destructive Desires on manhwaclan\nAs a lonely orphan and a corporate heir, the lives of Seo Yeonwoo and Lee Seokheon couldn’t be any more different. Due to this, Yeonwoo has been unable to refuse Seokheon’s advances to be his sex partner. But as Seokheon’s grandfather was the one to take Yeonwoo in when she was orphaned, the guilt of sleeping with her savior’s grandson weighs heavily on her mind. She finally draws the line when Seokheon pulls out a wedding ring, professing that he’s willing to go against his parents’ wishes and marry Yeonwoo. No longer wanting to become a burden to Seokheon’s family, Yeonwoo decides to pack her bags and run far away. But just when everything seems okay, Yeonwoo learns that she has an unexpected baby on the way…\nAssociated Names\nUnhealthy Desire\nUnwholesome Desire\n불건전한 욕망"]},{"title":"Goo Hae-Jong SOS","tags":["Manhwa","Romance"],"disc":["Read manhwa Goo Hae-Jong SOS / 구해종 SOS"]},{"title":"Cynical Master Raises Rabbit Spirit","tags":["Fantasy","Historical","Romance"],"disc":["Cynical Master Raises Rabbit Spirit , The Eccentric Male Lead is Raising Rabbits, Medical student Ruan Ruan becomes a rabbit spirit, and meets a cold and blood-sucking fox spirit. Their first time meeting, she died under his dagger. Who would guess that she would come back alive the next day?In order to survive in this supernatural world full of masters, she became the fox’s follower. She does laundry, cooks, and calms him down when the looses his temper. During tje full moon she becomes his portable blood bank. So many worrisome mattersCynical Bloodthirsty Fox x Timid Cute White Bunny"]},{"title":"Steal the Child of the Terminally Ill","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Steal the Child of the Terminally Ill / they took my child by force / I’m Trying to Steal Even The Child of The Terminally Ill / The Stolen Child of the Terminally Ill Mother . They’re Trying to Steal the Child of the Terminally Ill / 시한부의 아이까지 뺏으려 합니다","“Are you going to leave your child with a terminally ill mother?”The future that the magic mirror, a relic from my parents, showed me was horrifying. A future where I would be a terminally ill mother and my husband’s mistress would demand that I leave my child behind. We’re not even married yet, so maybe we can avoid that unhappy future. You, who resemble the cold snowy fields of the north, cannot hold me. So why are your eyes so hot as you look at me as we speak of parting?”When the old duke dies, we will part ways.””If we don’t have kids, we’ll be fine, right? So don’t even think about divorce. Just stay by my side.”I felt the warmth of your lips on mine as you carefully moved closer. But the deep kiss was just the beginning of a long night ahead. Read at kaiscans.com to support us!"," "]},{"title":"Miss Hua Doesn’t Want To Fall In Love","tags":["Drama","Romance","Shoujo"],"disc":["Manhua to read Miss Hua Doesn’t Want To Fall In Love, 花小姐不想谈恋爱 at manhua website","At night, Miss Hua is a super thief operating within the black alliance. By day, she is the owner of a cat cafe hidden in the city. A police pursuing the thief, a doctor staying by the cafe owner’s side, and a mysterious young man suddenly appearing… This is the story of Miss Hua and those who fall in love with her…"]},{"title":"My Three Tyrant Brothers","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga My Three Tyrant Brothers / 폭군 오빠가 셋이래요"]},{"title":"Living as the Tyrant’s Older Sister","tags":["Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga Living as the Tyrant’s Older Sister / Hidup Sebagai Kakak Kaisar Tiran/Pokgunui Nunaro Sandaneun Geoseun/The Tyrant’s Sister/Vivir como la hermana de un tirano/Vivre comme la sœur aînée du tyran/成為暴君姐姐的生存法则/폭군의 누나로 산다는 것은\nWhen I opened my eyes, I was inside a fantasy novel world!\nThe beauty I see in front of the mirror is the future tyrant’s older sister, Alicia!\nShe’s not even a protagonist or an antagonist, but a character that doesn’t appear much and gets beheaded by the (upcoming) tyrant little brother.\nMy life is all about escaping that fate from the novel.\nIn the end, I seduced the male lead’s merchant friend who also doesn’t appear much and was about to leave the country with him.\nHow-e-ver.\nThe face of the man who spent the night with me was extraordinary.\n“I-I’m pretty sure the name I heard yesterday wasn’t that name but something else. Uhm, what was it. I-I think it’s Sir Lancelot.”\n“Ah, that’s my friend.”\n“…”\n“Why, is there a problem?”\nExcuse me, you’re asking if there’s a problem? A lot. There’s a lot.\n…. Why is the male lead on my bed!\nAlternative Name:"]},{"title":"Nine Star Toxic Healer","tags":["Action","Comedy","Fantasy","Shounen"],"disc":["Read manhua Nine Star Toxic Healer / 九星毒奶","This is a world filled with interdimensional portals, monsters, and star beasts. Awakened humans form groups to fight against various monsters, protecting the peace. Jiang Xiaopi, who has transmigrated into this world, grows from a lowly child into a medical-type awakened person who frightens both teammates and opponents alike, all thanks to the considerate guidance of his beautiful elder sister. Due to his peculiar trait of causing misfortune to whoever he heals, he is nicknamed the “Toxic Healer.”"]},{"title":"Bear Care","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural"],"disc":["Read manhwa Bear Care / 베어케어","Rough, tough, and gruff director by day. Fluffy oaf of a bear by night. Director Moon’s top-secret double life takes a turn for the worse when his troublemaker intern, Lee hits the scene. Her goal is to become Moon’s official secretary, but Moon will stop at nothing to hide his unstoppable, nightly cuddliness!"]},{"title":"Not a Secretary, But a Woman","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Not a Secretary, But a Woman / A Woman, Not Secretary / A woman, not a secretary / 비서 말고 여자","“Can you sleep with me just once?” Se-In, who has assisted Director Shin Tae-Heon for three years, spends an impulsive night with him. She planned to leave coolly for an overseas branch, but after that night, he started acting strangely. “Am I the only one bothered by Secretary Yun?” Not content with just clinging, he admits, “I’ve come to want Yun Sein.” He doesn’t hesitate to make bold statements, asserting, “Make me yours. Or I can make you mine.” He has become shamelessly forward. Director, why are you doing this to me… A disaster sparked by a one-night stand. The overwhelming pursuit by a man too perfect begins."]},{"title":"Empress Hunt","tags":["Action","Adventure","Fantasy"],"disc":["Read Empress Hunt/ 황제사냥","All of earth has fallen except for the immortal, “Yoon Seul”. “The guy who destroyed my world is the world’s strongest? I don’t care about that, I’ll kill that person first. Head turning scenes? Gets you turning quickly. Action scenes? Fantastic. Her personality… is a little rough but she’s warm-hearted."," "]}]