[{"title":"The Villainous Duke’s Special Rice Cultivation Method","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainous Duke’s Special Rice Cultivation Method / The Villainous Duke’s Daughter’s Special Method of Growing Rice / 악역 공작 영애의 특별한 쌀 재배법","One day, I remembered my past life. A life in which I was on the verge of success as a rice farmer when I was run over by a damn truck! I also realized that I was the villain of a novel I had read. She got involved with a psychopathic male protagonist and was eventually killed.I was shocked like the sky was falling, and I vowed to myself. I will never die easily in this life!"," "]},{"title":"I Was Rocked to the World’s Richest Man in a Matchmaking Office","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read I Was Rocked to the World’s Richest Man in a Matchmaking Office / I Was Rocked From the Marriage Office to the World of the Richest Individual / Wǒ Zài Hūnpèi Suǒ Yáo Dàole Shìjiè Shǒufù / 我在婚配所摇到了世界首富","As soon as I graduated, the country assigned me an object, and it was also the super diamond king Ye Junqing on the Forbes rich list. As the leader of the top ten cancers of unmarriage that have spread wildly outside, Ye Xingguang thought that such a big man must be very It’s hard to get along with, but in the end, you hold her in the palm of your hand! Who knows that the greatest luck in this life is not to win you in the crowd.."]},{"title":"The Reincarnation of the Forbidden Archmage","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Reincarnation of the Forbidden Archmage / The Reincarnation of the Forbidden Archmage / Kinki no Tensei Daimadoushi / Kinki no Tensei Daimadoushi ~Munou kara Level Up de Saikyou ni~ / 禁忌の転生大魔導士 ～無能からレベルアップで最強に～/ 禁忌の転生大魔道士","One day, dungeons suddenly appeared. Humans with awakened skills then set out to face these dungeons in search of hope and riches. Our protagonist, Saeki, having no skills, is considered incompetent; in order to earn enough money for the treatment of his little sister with an incurable disease, he decided to become an adventurer. Saeki has a secret, in his previous life he was the most powerful mage. Since his reincarnation he has to level up to regain his former powers. This is the story of an incompetent who will turn the world upside down with his power!"]},{"title":"More! Intimate Connection","tags":["Adaptation","Drama","Fantasy","Mature","Romance","Slice of Life"],"disc":["Read manhwa More! Intimate Connection","“My current boyfriend and I do it every time we’re together!” “What? You? Who is he? Tell me his name!” “It’s Cha Jihyuk! I’m dating Jihyuk Sunbae!” We’ve only ever exchanged greetings before, but our relationship changed with a lie I blurted out in response to my ex-boyfriend’s mockery. “Were you being sincere earlier? You won’t save yourself anymore?” “Can one’s values change in just a day or two? Men are just so ridiculous, huh? Why does that matter, anyway?!” “It matters. It’s not wrong to want to do it with the girl you like.” I did love my boyfriend, but I thought physical intimacy was separate from love. However… “You did like him in a romantic way, right? So why is that the case? It’s instinctive, you know.” The moment he approached me, my heart started pounding like crazy. “Did I make your heart flutter? If so, you’re normal.” We thought we would never meet again or have any involvement, but we had a miraculous reunion a year later! “Hello. I’m the new member of the planning team. I’m Ham Sooyeon.” “Right. I’m your Team Leader, Cha Jihyuk.” An unexpected meeting and opportunity. Could I have a more intimate connection with him this time?"]},{"title":"I Became the Villainess in an Anticlimactic Novel","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Villainess in an Anticlimactic Novel / 용두사망 소설 속의 악녀가 되었다 / IBVIAAN / I Became the Villainess in a Disastrous Novel","I became a villainess of the novel I was reading.","But this novel…","…was a novel with an anticlimactic conclusion where the empire suddenly collapsed just before the ending!","To hell with the original story! I had to try and survive first.","Thus, I was just trying to flee to the neighbouring country beside us, but then…","“I’ve waited for 100 years just to meet you.”","The man who had hidden his identity as the Demon King and was the driving force behind the invasion.","Grand Duke Arvis grabbed me with a gaze filled with intense emotions.","“If I lose you… I’d probably start by wiping out this continent that took you away from me.”","…Just why?"," "]},{"title":"About the Death You Gave Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa About the Death You Gave Me / 당신이 건넨 죽음에 대하여","The secret lover of the devil duke, the duke’s maid.\nIt’s ridiculous.","Because Eslyn was the princess of the empire who died by his hand!","“Princess Eslyn, I brought you your poisoned cup.”","The face of the devil who told her to die is still vivid. But.","“My Esy, whom I love and respect. Your servant has come.”","Who on earth is that man who whispers sweet words of love?","Eslyn could not become the lover of the man who killed her.","That was also her last pride as a princess who dreamed of the throne.","Will Eslyn be able to escape safely from that beast-like man who is strangely obsessed with the maid?","What on earth can a princess who has become a maid do?","… More than that, was everything Eslyn knew the truth?"]},{"title":"I’m Not a Regressor","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I’m Not a Regressor","[By the Author that brought you <Player Who Returned 10,000 Years Later>!]\nOne day, a silver-haired goddess appeared before me. [The star of the heaven rebellion. The one who goes against fate. The only savior of a world that is fated to end.] Woman, what are you even talking about? [You are the regressor, huh?] What? I’m not one, though…"]},{"title":"That’s Right, Good Job, Eat It","tags":["Drama","Manhwa","Mature","Office Workers","Romance"],"disc":["Read manhwa That’s Right, Good Job, Eat It / Love on the leash / 옳지, 잘했어, 먹어","Eight years ago, I reunited with my first love, who had unilaterally broken up with me and disappeared. Now, I love her too much to hate her, and I declared that I would do anything to start over with her. However… “I don’t like unattractive guys.” An unexpected twist in the scenario?! In order to meet the girl I love, I must literally become her pet human(?) and say, “Make me your dog.”"]},{"title":"Reminiscence Adonis","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhua","Manhwa","Martial Arts","Romance","Webtoons"],"disc":["Read manhwa Reminiscence Adonis / Adonis / 아도니스 / 阿多尼斯","Ianna and Arhad had much in common. They both only cared about themselves, and were madly obsessed with each other. The difference is one wanted the other’s warmth, and the other wanted submission.Though Ianna’s life ended in a heated battle against Arhad, the Kingdom’s emperor, she is reincarnated into the same life for reasons unknown.Two people who faced misery in their previous life now have a chance to meet again. Will the same tragedy repeat itself, or can Ianna change the course of history?"]},{"title":"How to Extend a Marriage Contract","tags":["Comedy","Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa How to Extend a Marriage Contract / 결혼 계약을 연장하는 방법","Emily, the only daughter of an earl, is looking for a marriage partner to inherit the title. Kyle, the captain of the Order of the Holy Knights, appears before her at just the right time. ‘I need you,’ he says, ‘and you need a suitable husband.’ The two agree to pretend to be married for the duration of the contract. But Emily falls for Kyle during their fake marriage, and soon the three years are over and their contract comes to an end. However, Kyle returns from an expedition with an unexpected case of amnesia. ‘So does that mean he doesn’t remember the marriage contract?’ Emily thought, realising that if Kyle knew, he would be horrified."]},{"title":"Actor Class","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Actor Class / 배우수업","Up-and-coming actor Seo Kangwoo is up for “Rookie of the Year” when his former lover, industry exec Lee Jiwon, suggests they act like a couple in public. Although they are no longer dating, Jiwon now needs Kangwoo’s help to create a dating scandal that will break off an engagement set up by her family. With his lingering affection for Jiwon, Kangwoo jumps at this chance to be close to her again. Although it’s all supposed to be acting, will Kangwoo’s real feelings for Jiwon blow everything?"]},{"title":"My Target! Your Character Is Wrong!","tags":["Drama","Fantasy","Romance"],"disc":["Read My Target! Your Character Is Wrong! / 攻略对象！你人设歪了啊！","【Why can’t you like me…Brother. ] [Don’t call me brother, it’s disgusting. 】 …So we’re all in the love game. Why is this non-target who looks like my brother—why has he been pestering me? !"]},{"title":"Once Again [Official]","tags":["Drama","Fantasy","Romance"],"disc":["Read Once Again [Official]","After living as a commoner during war, Adelaide regresses as the princess of the empire. To change the future, she desperately tries to win over the powerful but aloof Divine Magician, Ethan. The royal family has many secrets, and Ethan knows more than anyone—including her past lives."]},{"title":"I Became the Sister of the Time-Limited Heroine","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Sister of the Time-Limited Heroine / I Became the Dying Female Lead’s Sister / I Became the Younger Sister of a Dying Woman / 余命わずかなヒロインの妹になりました / 시한부 여주의 동생이 되었다","One day, suddenly, I became the twin sister of my favorite terminally ill woman!","Being possessed by the king, I married the villain of this novel on behalf of Choi Ae…","“Your Highness, such a fancy cloak really suits you.”","“I don’t know where you got such a sensible cloak.”","Keu-hum- This man who blushes and squeaks at every word I say… I heard you’re a murderer, but why are you so cute? Why is your face so handsome?! At first, it was a plan for my favorite, but it gradually… Do you really think you’re getting better?"]},{"title":"The Dungeon Smells Like Chicken","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Dungeon Smells Like Chicken / 던전에서 치킨 냄새가 나요","Yes, you read the title correct. This is a story about a man who Isekaied into modern world. He got a taste of fried chicken and then ask to be the FL’s servant. Confused? Me too. Let’s enjoy the read anyway"]},{"title":"The Price Is Your Everything","tags":["Drama","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa The Price Is Your Everything / 대가는 너희의 모든 것","Princess Nerys, exploited by her half-brother and her maid, and poisoned after being abused by her family and husband, dies cursing all who tortured and exploited her, but she returns to the age of twelve, when all her misfortunes began. When she gets another chance, Nerys vows revenge on everyone who took advantage of her before she dies. “The turning point of my misfortune, of the beginning of my wrath. I will make you pay for what happened to me, this place where it all began."]},{"title":"Rise From The Rubble","tags":["Action","Fantasy","Manhua","Monster"],"disc":["Read manhua Rise From The Rubble / 从末世崛起\n10 years after the night of starfall, city S was destroyed by the biggest recorded monster outbreak in history. Zuo Fan, carrying the name of [A traitor’s son], as well as being the most useless starfall warrior reserve who ran away, awakened the Super Warrior System during a trap disguised as a raid. Since then, he has embarked on the road of success, rising like a meteor. All the while, searching for the truth of his father’s treason amidst the strong opposition, and gradually commencing on the thorny road of saving the world."]},{"title":"In the Night Consumed by Blades, I Walk (Sword Fanatic Wanders Through The Night)","tags":["Action","Adventure","Martial Arts"],"disc":["Read In the Night Consumed by Blades, I Walk (Sword Fanatic Wanders Through The Night)","{From the same author that created The Return of the Crazy Demon and the studio of Mercenary Enrollment}\nThe Mystic Lunar Dance Troupe took in Jin Sohan as an orphan, and he spent his childhood with them.\nBut one day, one of the four great demons, the Venom Demon, discovered that he was special and kidnapped him.\nAfter all kinds of test, he decided to raise him as his disciple.\nTen years later, Jin Sohan tried to look for traces of the Mystic Lunar Dance Troupe, but the Sword Dance Troupe had already been destroyed at the hands of the Unorthodox Faction that’s now ruling over his hometown."]},{"title":"The Abduction of Mademoiselle","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Abduction of Mademoiselle / 약탈★마드모아젤 / Kidnapping The Mademoiselle / loot Mademoiselle / Stealing the Lady’s Heart\nYeoju: Henriette ㅡ Born as the only daughter of a family, abandoned by her parents because of her ugly face and despised and ridiculed by relatives.\nShe will inherit a lot of money, and she wants someone to kidnap her and marry her.\nNamjoo: Rainier – Despite being a duke, he can’t do anything because of his debts passed down from generation to generation and because of his mother’s luxury. She likes secret encounters with people with handsome faces.\nAnd then….the woman met the man, she would repay him. The man will kidnap the woman. To marriage.\nThe story about the naughty meeting of the heroine and the male lead is very interesting."]},{"title":"I’m a Supporting Role in a Horror Game, Don’t Kill Me","tags":["Drama","Fantasy","Horror","Manhwa","Romance"],"disc":["Read manhwa I’m a Supporting Role in a Horror Game, Don’t Kill Me / I’m a Supporting Role in a Horror Game, Don’t Kill Me / 공포게임 조연인데요, 죽이지 마세요 / Spare Me, I’m Just a Side Character in This Horror Game","In the horror mystery game “Night of the Murderers,” I inhabited the character destined to be the tenth victim, the tutor ‘Arviche Green’. The prime suspect is her employer, Duke Rearmend Laycus! “…A, a murderer.” “Miss Green, you seem convinced that I’m the criminal. Is that right?” She lost her life after her last conversation with Laycus. The remaining life count is two hearts. ‘If I use up all my hearts, I really don’t know what will happen. So I need to steer clear of the main plotline of this game as much as possible.’ Arviche’s efforts to distance herself from Laycus, the prime suspect, perversely catches his interest… “Do you remember when I said you were interesting, Miss Green? I must retract that statement.” It was a relief to hear that. The interest of a murderer is nothing but horrifying. “Perhaps saying you’re interesting might not be enough.” [Laycus Rearmend’s favorability has increased.] ‘…Wait, what? This isn’t what I intended.’ A misstep."]}]