[{"title":"Embrace My Shadow","tags":["Romance","Shoujo"],"disc":["Read manga Embrace My Shadow on MANHWACLAN\nEmbrace My Shadow The encounter between an innocent girl and a cold president, a dangerous but addictive love game. The conspiracy and love about noble and powerful families, fast pace and rich plot, a highly recommended bossy president comic. A transaction binds her and the noblest yet most awful man together, in the daytime, she’s one of the ordinary girls; But at night, she can’t escape his control …he holds her chin, smiling evilly; The entire Dongling is mine, do you think you can run away?"]},{"title":"SSS-Class Suicide Hunter","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Martial Arts","Psychological","Romance","Seinen","Supernatural","Webtoons"],"disc":["Read manhwa SSS-Class Suicide Hunter , SSS급 자살헌터\nI want an S-Rank skill too! I want it so badly, I could die for it!\n[You have awakened an S-Rank skill.] [But it only works when you die.]\nHUH!? WHAT’S THE POINT OF GETTING ONE IF I DIE !?\nNovel SSS-Class Suicide Hunter"]},{"title":"Attic princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Attic princess / The Princess of the Attic / 다락방 황녀님\nI’ve lived in this little hell ever since I was born. for being the daughter of a gypsy who carries misfortune The Trump empire killed my innocent mother. The emperor, the temple, and the whole empire Locked me up, abused me, resented me and abandon me. Their abandonment is an opportunity, Here in the kingdom of Jardine, I will begin my revenge. The Trump empire, may it dry up a little more. The dryness will soon be a precious stream for me. ……I will start my revenge."]},{"title":"Barbarian Quest","tags":["Action","Adventure","Fantasy","Manhwa","Mature","mature - 2","Seinen"],"disc":["Barbarian Quest manhwa, 바바리안 퀘스트\nThe Sky Mountain Range was a resting place for souls, and the living were not allowed to cross it.\nEveryone believed it as such.\n“You will become a great warrior, Urich.”\nUrich, the tribe’s strongest warrior, turned his back on his home and ventured into the civilized world."]},{"title":"The Cellist","tags":["Drama","Josei","Romance"],"disc":["Read manhwa The Cellist / 君を奏でたい / 애착 인형","Kim Hayeon was just covering for a friend at their day job when she unexpectedly ends up inside cellist Ji Sehun’s private waiting room. Despite his immense musical talent, Sehun is aloof and cold-hearted, and doesn’t take kindly to Hayeon’s intrusion. Though he accuses her of attempted theft, he cannot get her out of his mind, and attempts to court her. But while Hayeon may be timid, she is not easily won over. If this cellist isn’t careful, he may end up being the one getting played."," "]},{"title":"The Duchess’ Secret Writings","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Duchess’s Secret Writing / 공작 부인의 은밀한 집필","It’s the first time I met such a passionate reader after writing for a long time. “I can’t talk about feeling…But I want to do something!” Ellisya who was holding her dress secretly hand out her hand. “Urm, should I give you……a handshake?” “Sorry……?”‘ “Or, maybe a hug?” In that moment, Resa’s pupil has started to shake brutally.","The Duchess’ Secret Writing\n공작 부인의 은밀한 집필\nThe Duchess’s Secret Writing"]},{"title":"I am the Rising Villain","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa I am the Rising Villain / 手残的我在反派风生水起 / I am the King of the Game","How does a handicapped closed beta player survive in a game after crossing over? Fortunately, I am the original author of this game. What devils and angels, let me show you what a father’s love is like!"]},{"title":"After Ten Years of Chopping Wood, Immortals Begged To Become My Disciples","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["After Ten Years of Chopping Wood Immortals Begged To Become My Disciples manhua,\nAfter ten years of chopping firewood (so tired ಠ╭╮ಠ), female immortals (one after another ╮(￣⊿￣)╭) knelt down and begged me to take them as their disciples! _(´ཀ`」 ∠)_"]},{"title":"The Healing Priest of the Sun","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read The Healing Priest of the Sun manhwa / 힐통령 – 태양의 사제\n[From the author of Return of the Frozen Player:] “The reason why he does quests like that isn’t because he’s kind but because he’s a sucker.” Kai looked back at the people talking behind him from a distance. ‘I’m a sucker?! Is it really wrong for me to help those in need?’ [You helped an NPC in trouble.] [Your kindness stat has increased by 1.] You’re rewarded when you do good deeds? A never-before-seen Priest on a whole ‘nother level has appeared!!"]},{"title":"Isabela","tags":["Fantasy"],"disc":["Read manga Isabela","Somewhere called Isabela, we ‘lived’ and ‘existed’. A seemingly endless life. Life, does it need to have any meaning? Or do we simply exist?"]},{"title":"NPCs Fateful Awakening Melody","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa NPCs Fateful Awakening Melody","Lady Agatha is a random mission NPC in The Fate of the Fallen, and a dedicated worker.\nEvery day, adventurers would wander the streets, hoping to find Lady Agatha’s lace handkerchief, meet her, save her, and get the necklace from her. The mission requirements had been in place for a long, long time, without fail, until one day.\nUntil one day, when a mysterious handsome knight takes Agatha’s mission. And makes the world of the game begin to collapse in an uncontrollable direction. All the hidden storylines start to reveal themselves, and the true story comes to light!"]},{"title":"The Invicible Princess Is Bored Again Today","tags":["Action","Drama","Fantasy","Manhwa","Reincarnation","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Invicible Princess Is Bored Again Today / The Duke’s Bored Daughter is My Master / The Max Level Princess is Bored Today as Well /The Invicible Princess Is Bored Again Today / 만렙 공녀는 오늘도 무료하다"]},{"title":"Urban: I Have a New Identity Weekly","tags":["Action","Fantasy","Harem","Martial Arts","Super power"],"disc":["Read manhua Urban: I Have a New Identity Weekly / 我每周一个新身份","Activate the strongest vest system and get a new identity every week. Some people seem to be a mediocre student, but secretly he is the chairman of a multinational group, a peerless genius doctor, the world’s crazy chef, the world’s top killer, and a superb hypnotist. In short, he has countless vests. Su Xun: “I really just want to be an ordinary person, why is it so difficult?"," "]},{"title":"I’m Going To Meet You Beyond Time","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Going To Meet You Beyond Time / 시간을 넘어 당신을 만나러 갑니다","Genius magician Eleanor, who is also the Grand Magician and Duchess of a small country, activates her time magic, which she has been preparing since the day her mother died, to capture her.\nEleanor, who has traveled back 24 years into the past, sets out to find her mother, but encounters a man she doesn’t recognize.\nLiam Temperyion, Duke of the Empire. However, in the future where Eleanor lives, his family does not exist. Void information. Eleanor approaches the truth of the past."]},{"title":"I am the Angel of Death","tags":["Action","Adventure"],"disc":["Read manhua I am the Angel of Death"]},{"title":"DARISHA – Princess’s Secret Sweetheart","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manga DARISHA – Princess’s Secret Sweetheart","Asha – the youngest princess is dating a commoner. He said he would go to the palace to meet her. But WHAT THE *Beeeeeeep* Why DOES HE TURN out to be a eunuch?????? Mysterious murders happen in the harem. What should Asha do when she discovers that everything is related to her boyfriend?"]},{"title":"It’s Just Fortune-Telling. How Did the Nine-Tailed Demon Emperor Become My Wife?","tags":["Action","Adventure","Comedy","Romance"],"disc":["Read manhua It’s Just Fortune-Telling. How Did the Nine-Tailed Demon Emperor Become My Wife? / 算命而已，九尾妖帝怎么就成我娘子了？！/  chỉ là bói toán mà thôi cửu vĩ yêu đế sao lại thành nương tử ta / Suanming Eryi, Jiu Wei Yao Di Zenme Jiu Cheng Wo Niangzile?","Jiang Jue travels through the world of Xianxia and obtains the Destiny Deduction System.Observing other people’s destiny, knowing their past and knowing their future can even change their fate against the sky!It’s just that there seems to be a big problem with this system.No matter what he calculates, he has to truthfully tell the fortune-teller’s destiny.On this day, he met the leader of the Ten Thousand Demon Kingdom, the Demon Lord.Tu Shanlan: “Sir, you might as well do the divination for me.””Thousands of years later, you will be married and have five children.” “…””By the way, your husband-in-law is me.”"]},{"title":"The Cold Commander by Day Cries in My Arms at Night","tags":["Drama","Fantasy","Romance"],"disc":["Read manga The Cold Commander by Day Cries in My Arms at Night / 白天冷冰冰的指挥官晚上在我怀里哭唧唧, 高冷指挥官在我怀里哭唧唧"," "]},{"title":"Welcome, Is This Your First Time in the Afterlife?","tags":["Comedy","Drama","Manhwa","Romance"],"disc":["Read manhwa Welcome, Is This Your First Time in the Afterlife? / 어서 와, 저승은 처음이지?","“Romance Crossing the Boundary Between the Mortal World and the Afterlife: The Cold Handsome Reaper Official and the Bright College Student.”\nsora, a bright 21-year-old college student majoring in dance, boards a luxurious cruise ship anchored on the Han River without even realizing she’s in a coma. Everything is free on the cruise except for what’s not allowed, so she enjoys drinking and having fun all night. However, when she wakes up, she finds herself in disbelief, “Wait, is this the underworld?”\nAmidst the chaos caused by a major accident involving a mountain person immigrating to the underworld, the examination hall is turned upside down. In the midst of this, a savior steps in to resolve the situation. However, the sharply handsome underworld civil servant who is about to sober up turns out to be quite grumpy.\nAnyway, the situation could be resolved once they return to the living world, but strangely, the data of sora’s life stored in the underworld has been deleted in the blink of an eye. All that remains is her name and a few scant pieces of information.\nFurthermore, if sora fails to find her body within the grace period of 49 days, she will be classified as a lost soul and forcibly admitted to the underworld…!"]},{"title":"Raising the Demonic Cult’s Leader","tags":["Drama","Fantasy","Historical","Manhwa","Martial Arts","Reincarnation","Romance","Yaoi"],"disc":["Read manhwa Raising the Demonic Cult’s Leader / I Cherished and Raised the Demonic Cult Leader / I Have Raised the Demonic Sect Leader Dearly / 마교 교주를 애지중지 키웠다"]}]