[{"title":"Royal Marriage (2024)","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa Royal Marriage","Lovers in peril amongst troubled times, and a grand wheel of fate that awaits them You told me, my little Princess, That a sworn promise must be carved into the heart, not a rock. “Swear it in front of the Gods of Heaven and Earth, that Eunri and Gyeol are now wed. Carve our names onto here.” The young obedient groom, Se Gyeol, took out a pocket knife and carved their names side by side like the little bride had asked. “As our names have been carved into this rock, it has now become an oath set in stone.” “Hmph. A sworn promise should be carved into the heart, not a rock, you know.” The Crown Prince of Sayuta, Lee Hun Se Geyol, 13 years old The Crown Princess of the Je Empire, Dam Eunri, 8 years old A sworn promise made at youth blossoms entrancingly amidst an impure world stained with betrayals and conspiracies."]},{"title":"It Is Said That I Am a Fairy Princess","tags":["Drama","Fantasy","Romance"],"disc":["Read It Is Said That I Am a Fairy Princess, 据说我是精灵公主, 據說我是精靈公主, 暴君パパに殺されかけたけどハッピーエンドを目指します","Ordinary college students crossed the different world into the small princess of the fallen people, facing the paranoid, picky and stubborn minister, willing brother. . . … After a long time, with wisdom and powerful magic to eliminate misunderstanding, discrimination, defeat the Lord, finally reap the love of all, and get the pure love of the imperial prince."]},{"title":"Once Wicked, Always Wicked","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Once Wicked, Always Wicked / 악녀는 악녀의 길을 간다"]},{"title":"Lies Become You","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lies Become You / 한배를 탄 사이/On the Same Boat\nNever fall in love with a lie.Lacey is finally ready to enjoy the high life after finishing up her most recent con. Unfortunately for her, her last client has betrayed her, and now there’s a bounty out on her head! She climbs aboard a ship to escape, unaware that it belongs to her archnemesis, the alluring Prince Halid.\nThe acting of the villain who was crazy in love was now over.\nLacey’s plan to get rid of everything and set off in search of freedom was perfect when she was paid.\n<Bounty money-10 million gold. Regardless of life or death>\nHowever, what was held in Lacey’s hand was not a check, but a wanted leaflet with her face in it.\nNo time to feel the tingling in her head after her client had gone and hit her hard.\nLacey had to leave the country in a hurry, so she took advantage of the rain to sneak onto a strange ship.\nIs she a guest for the night, or is she stowing away to escape?\nShe met Khalid, the crown prince of a foreign land, who had been her enemy all her villain life… ….\n“Since you have accomplished the role of villainess, you can be the bride of the century, right?”\n“… … Yeah?”\n“The role I want you to be is simple.”\nLeaning against the window, he smiled.\n“You, who I brought from an exotic country, fell in love with me at first sight.”\n“Who are you ? What do you want me to do?”\nHe raised the corner of his mouth to Lacey, who was just frozen\nWith just that kind of eyes, he pulled one of his mouths toward the frozen Lacey.\n“I look forward to your acting that is convincing to anyone.”\nInstead of the villain’s mask, it was time to use a white veil.\n***\n“Don’t forget. Now we’re on the same boat.”\n“While we’re on it……I’ll tell you when you’ll get on the other ship.”\n“You’re on it now, aren’t you?”\nLooking at her, he slowly licked his lips.\n“A boat other than this boat.”\n“…….”\nHer gaze stopped in one place.\nLacey realized it belatedly and groaned. It was too early to say that he could eat using his desires.\n“Come here, my bride.”\n—————\nNOTE from author:\nThe costumes in the work are inspired by ancient Egypt. However, it is only a motif and does not thoroughly reflect the ancient Egyptian lifestyle. Therefore, it may not meet expectations for those who like the Egyptian background.\nThe novel is scheduled to be completed between 160~180 episodes."]},{"title":"The Duke of Ashleyan’s Contractual Marriage","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Duke of Ashleyan’s Contractual Marriage / 아쉴레앙 공작의 계약 결혼 / Duchess Aishling’s Contract Marriage / The Contractual Marriage of the Duke Ashillean","After the ‘Tyrant King’ killed our parents, we managed to defeat him in a coup d’etat. My younger sister became the Emperor and I became the Duke who ruled the beast-infested Northern territory. We took our revenge and my younger sister has become the Emperor, so there’s only one task left – the oath I made to God right before helping my younger sister. In order to fulfill that oath, I’ll have to get married. But for someone like me who has never had a relationship before, ‘love’ is more difficult than war or fighting a dragon. However, the illegitimate son of the tyrant, the Prince, has just proposed a contractual marriage…? “Three years. Please just stay married to me for three years. I will divorce you right after that.” “What is he saying? And yet, why does he keep catching my eyes?”"]},{"title":"The Supporting Girl Who Transmigrated Into the Book Only Wants to Be a Salted Fish","tags":["Drama","Fantasy","Romance"],"disc":["Read manhua The Supporting Girl Who Transmigrated Into the Book Only Wants to Be a Salted Fish / 穿书女配只想当咸鱼","Cheng Yiqing was forced to be transformed into a vicious female supporting role in a book. The psychedelic character made her split in her daily life: – The heroine is such a hardworking and good girl, I feel so bad for hurting her! – The hero is a bastard! Qi Wenyao:? Since the day he heard Cheng Yiqing’s inner voice, he has never had a good sleep! Damn woman, she is so hypocritical! She said she loved him, but she never stopped complaining in her heart! A vicious female supporting role who was reading the lines fell into deep thought: – I don’t know if I will be struck by lightning if I lie every day? Qi Wenyao said indifferently: “I will just watch you act quietly!”"]},{"title":"Helmut: The Forsaken Child","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Helmut The Forsaken Child manhwa,\n[By the studio that brought you ]\nHelmut was a child who had been abandoned in the Magic Beast Forest at birth.\nRaised by Magic Beasts, the first human that he met was the Sword Saint Darien.\nLittle did Helmut know that the chance encounter would soon shake the foundation of his fate…\n“Grow stronger If you want to get out of here.”\nThe boy who’d lived like a beast was thrown into the human world!\nHe possessed overwhelming swordsmanship, outstanding looks and sharp intelligence, but there was one thing he lacked: humanity.\nI am no longer prey. I am now a predator!"]},{"title":"Perfect Secret Love: The Bad New Wife Is A Little Sweet","tags":["Action","Comedy","Romance","Webtoons"],"disc":["Read manhua Perfect Secret Love: The Bad New Wife Is A Little Sweet","“How perverted is Si Ye Han’s taste? He still wants me like this?”","Waking up, she looked at her reflection in the mirror: explosive wig, tattoos, and demon-like makeup. Any normal person’s eyes would burn if they looked at her for more than a second.","Before her rebirth, she was in love with a different guy, so all she wanted to do was escape from Si Ye Han and hated him to his core after being locked up by him.","After her rebirth, she looked differently at him, thinking that maybe he changed for the better?","In the past, her mind was muddled. She let go of a stunning husband, was hurt by a scumbag and backstabber and most of all, was brainwashed by her most trusted friend. In the end, she was utterly alone.","In her current lifetime, there are evil people scheming and eagerly waiting for her downfall. Sorry, but this girl won’t fall for the same tricks twice!"]},{"title":"The Cooking Wizard","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa The Cooking Wizard / 요리하는 마법사 / Cooking Wizard / Cooking Sorcerer","A food-loving tattooist, YooJung. After losing consciousness due to a sudden accident she opens her eyes to find herself possessing ‘Sylvia’, a character from the novel she read. In addition, she happens to meet ‘Felix’, the hero of the novel, who, due to the abuse of his stepmother, suffers from anorexia and will soon turn the continent into blood. In order to eat more delicious food, to cook more easily, Sylvia inscribes magic circles on to her body. The new magic circles that are born through her fingertips bring a new breeze to the continent where magic-beasts are rampant."," "]},{"title":"Don’t Tempt Me, Oppa","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read manhwa Don’t Tempt Me, Oppa / 유혹하지 말아줘, 오빠","Eui-jun, who replaced his brother’s vacancy for 10 years, and Woo-mi, who has had a crush on him, finally confesses to Eui-jun at the moment when she has been full of emotions that she has kept to herself for a long time “Your hands are long and pretty.” “I gave you powdered milk with this hand.” “Your voice is sweet because it’s nice to hear.” “I sang your lullaby with this voice.” But what is it? This fresh iron wall? Umi, who is upset by Eui-jun, who pushes him a thousand times every hundred times, makes her final suggestion, “Okay, I’ll give up, but kiss me.”"]},{"title":"Shall We, My Lady?","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Shall We, My Lady? / Dear, Come With Me / Lady, Shall We Go Together? / レディ、ご一緒にいかがでしょうか / 레이디, 함께 가실까요?","As a devoted knight of her kingdom, Irene M. Voltern has fought for her country countless times. And even when she is offered as a tribute to the Perkan Empire, she readily accepts her fate. She is prepared to become Crown Prince Kael’s concubine, but he wouldn’t dream of making her do anything against her will. Having fallen head over heels for Lady Irene at first sight, he will do anything to make her happy. But after spending her life putting others first, can Irene finally live for herself?"]},{"title":"Blood Hotel","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural","Vampire"],"disc":["Read manhwa Blood Hotel","After narrowly escaping an attempt on her life, Ms. Maria quickly started over under the name “Sheridan” and even found a new job at a fancy hotel to boot. Unfortunately, The Lodge hotel is much more than meets the eye! She soon learns that the hotel is actually a safe house where humans and vampires coexist. With nowhere else to turn, can Sheridan make the best of this blood-chilling situation?"]},{"title":"Purely Roommates","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Purely Roommates / 순수한 동거생활"]},{"title":"When The System Opens After The Age Of 100 , All Grandchildren Kneel Upon The Mountains!","tags":["Action","Fantasy","Martial Arts"],"disc":["Read manhua When The System Opens After The Age Of 100 , All Grandchildren Kneel Upon The Mountains!, Bai Sui Kai Xitong, Xiaozi Xiansun Gui Man Shan!, 百岁开系统，孝子贤孙跪满山！, Opening the System at a Hundred Years Old, Filial Children and Virtuous Grandchildren Kneeling All Over the Mountain!, Opening System After 100 Years","Xiao Chen, a time-traveler nearing the age of one hundred, was peacefully preparing to spend the rest of his life. Suddenly, a system activated, rewarding him for his family’s childbirth. Not only would he become stronger, but his lifespan would also reverse! “Procreate, quickly procreate!” he exclaimed. “Everyone in the family, regardless of age or gender, give birth, give birth, give birth!”"]},{"title":"Pampered Queen’s Heart Has the Powerful Minster as the White Moonlight","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read Pampered Queen’s Heart Has the Powerful Minster as the White Moonlight / 宠后心头有个权臣白月光 / 皇后転生～堅物皇帝陛下を溺愛させます～"]},{"title":"Loving the Forbidden Prince","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["A Desire to Love the Hostile / Choudi Zhizi Zong Shi Liao Wo Zenme Ban? / Chóudí Zhīzǐ Zǒng Shì Liāo Wǒ Zěnme Bàn? / What Should I Do If My Enemy’s Son is Always Flirting With Me? / What Should I Do When My Enemy’s Son Always Teases Me? / ¿Qué debo hacer si el hijo de mi enemigo siempre está flirteando conmigo? / 仇敌之子总是撩我怎么办？","Guided by the goddess of love, Alice and Ethan from opposing countries fell in love, but with it came hatred, curses, and conspiracies… This comic is adapted from the novel of the same name by AimeeLynn on Webnovel."]},{"title":"The Male Lead Is Mine","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Male Lead Is Mine / ML nya Milik ku / 남주는 내가 차지한다","“I’m the only daughter of Marquis Ian Horissen, right?”","When I opened my eyes, I found myself inside a novel…not as the female lead, but as a supporting character.","Who said only the main characters got a happy ending? I’ve decided to choose a new path and take the male lead for myself!\nIn the original novel, it would take two and a half years for me to meet him, but I can’t wait that long.","“Bring me a pen and some paper.”","I’ll write a letter to him instead. There’s no time to waste—I’ll make sure the sweet and caring male lead is mine!"]},{"title":"Yeon Lok Heun","tags":["Action","Adventure","Fantasy","Gore","Manhwa","Martial Arts","Romance","Supernatural"],"disc":["Read manhwa Yeon Lok Heun / His Majesty Secret Heroine / His Majesty’s Secret Heroine / Yeon Lokheun / 蓮禄昕～宿命の華～ / 연록흔","Yeon Lokheun is a girl who grows up living as a boy learning martial and spiritual arts. She heads for the palace in order to clear the name of her father, a wanted criminal, where she meets the young Emperor Garyun. He promises to save her father’s life in exchange for her lifelong services. After gaining Garyun’s trust, she travels the world solving supernatural-like problems that arise in place of the Emperor. But how long can she continue this life without the others finding out that she is actually a woman?"]},{"title":"Super Green Tea System","tags":["Drama","Fantasy","Romance"],"disc":["Read Super Green Tea System / 超级绿茶系统","The best way to teach green tea a lesson is to be more green tea than her! The heroine Xia Yijing died of hatred and accidentally activated the green tea system, let’s teach the scumbag men and women a lesson! !"]},{"title":"Definition of a Villain","tags":["Action","Fantasy","Romance"],"disc":["Read manhwa Definition of a Villain / 빌런의 정의","A world where there are ‘superpowers’, a new race of humans who surpass human abilities, and ‘guides’ who can control their rampage. ‘Betty’, a guide, hides her identity and lives in a small town in America. One day, ‘James’, a super-powered hero, transfers to Betty’s school to find the villain ‘Dave’. Betty avoids James but continues to become involved with him and to make matters worse, while trying to stop her best friend’s rampage of superpowers, she is forced to use her guide abilities… It turns out that her friend is not an ordinary superpower, but a villain.It was ‘Dave’! Betty is caught between a villain and a hero, and her life, which she wanted to live normally, begins to spiral.Original Webtoon:"]}]