[{"title":"You Are My Desire","tags":["Drama","Fantasy","Manhua","Romance","School Life","Slice of Life"],"disc":["Read manhua You Are My Desire / 白日梦我","The battle for scholarships is in full swing. In front of the principal’s office, Lin Yujin and Shen Wan face each other off. After exhausting their efforts for the dramatics, the two people stared blankly at each other for three seconds before turning away sharply and leaving. Shen Wan stepped into his private helicopter, while Lin Yujing got into her Rolls-Royce. This is the story of the two rich people who try their best, everyday, to appear poor in front of the other."]},{"title":"The Fake Saintess Awaits Her Exit","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa The Fake Saintess Awaits Her Exit / 가짜 성녀는 퇴장을 기다린다","I possessed the body of Yvelina, a fallen saintess from a romance novel I read before I died. I’m a fake saintess who’s about to be burned at the stake. I can’t die like this. Until the real saintess appears, I must fix my relationships with the male leads and change the future. But… “You want to continue living in this body, don’t you? If so, then go fuck a man.” Will I… really be able to survive here?"]},{"title":"Reincarnation Laundry","tags":["Drama","Fantasy","Manhwa","Mystery","Romance","Slice of Life"],"disc":["Read manhwa Reincarnation Laundry / Reincarnation Laundromat / 転生クリーニング店 / 转世洗衣房 / 환생 세탁소","Life on spin cycle, or hung out to dry? Sangah’s life becomes a living hell after meeting the mysterious Yacheon, who places a curse on her. She quits her job and returns to her hometown where she discovers a dry cleaner run by Chungmyeong, to whom her destiny is tied. The two must unravel their red thread of fate and save Sangah’s soul."]},{"title":"Everlasting Love","tags":["Drama","Romance","Shounen Ai"],"disc":["Read Everlasting Love, cezs, chuí ěr zhí shì, Deacon Lop, 垂耳执事, Lop-Eared Guard","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","For the world to function and sustain, it has to be inevitability built on hierarchy. As precious, rare resources, high-grade omegas are kept in captivity by powerful, elite alphas in order to reproduce the next high quality generation. Yan Yi, a lop-eared rabbit omega, had once ravaged the battlefield with the powerful peregrine falcon alpha Lu Shangjin, had once loved him deeply, and had once tasted his heartlessness. Now, he could only succumb to the social order and submit to his subordinate nature."," "]},{"title":"Goblins Night","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Goblins Night / Goblin’s Night / 도깨비의 밤 / Night of the goblin / Dokkaebi’s Night"]},{"title":"I Ended Up Raising the Children of the Female Lead and Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Ended Up Raising the Children of the Female Lead and Male Lead / 여주와 남주의 아이들을 키우게 되었습니다","‘Ye-hee’, who lost her precious younger siblings, one day becomes possessed as ‘Märchen’, an ill-fated minor character in the novel <One Greater Happiness>.","‘Märchen’ is a miserable woman who ends up raising the children of the woman her husband once loved even before the pain of her miscarriage subsides. ‘Ye-hee’, who is possessed by such a fairy, unexpectedly realizes at once that these children are her deceased younger siblings.","Although it is a harsh reality for Marchen, ‘Yehee’, who carries the memories of her past life, cherishes and loves her children, who are the reincarnations of her younger siblings, and protects her children with her life from beings that target them…","As shown in the novel <One Greater Happiness>, the ancient dragon ‘Eskaya’ who protected the country left behind three treasures in the empire. Under threat from speculation that her children may have one of the treasures, will Yehee be able to protect her children with her husband and discover the secret of their possession in this world?"]},{"title":"The Abandoned Bachelorette Enjoys Her Simple Life","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Abandoned Bachelorette Enjoys Her Simple Life / Catherine’s Key to a Happy Life / Rejected Lady Enjoying a Modest Life / A Delightful Simple Life of a Single, After Leaving Home / 버림받고 즐기는 소박한 독신의 삶","Catherine did not want much. Even if she did not have luxurious clothes and shoes, she was alright with her hideously frayed bedroom curtains and her shoes that were so worn at the soles it was different in height. It had been two years since she started enduring it for the sake of her late mother. She no longer felt the need to do that. “Alright, I’ll leave.” Catherine was tired of everything. *** “Are you the Pope’s watchdog? You’ve done well coming all the way here.” The man who intruded her home was drenched from head to toe. She could see mud squished beneath his black leather boots. Unbelievable. To think he would drag in not grass, but mud, while she was cleaning the floors! “You’ve got quite the disguise. Even I was almost fooled into thinking that you’re just an ordinary city woman—” “Wipe it.” She pushed the rag she held onto the man. “Why are you looking at me so foolishly? I told you to wipe the floor. And it’s not proper to show your sword when it’s our first time meeting each other. Is it not enough that you intruded that you would want to be reported for attempted murder?”"]},{"title":"Welcome to Dungeon Hotel","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Welcome to Dungeon Hotel / 던전 호텔에 오신 것을 환영합니다","“[Class: Hotel Manager (Hidden) awakened!] Mac x Mo x Gol x Coffee turns into potions, A mysterious hotel where staying for a day restores stamina. Awakened as the manager of this place! All guests are hunters, and the hotel is in the middle of a dungeon. Just by putting on a business smile, money rolls in, right?! “Welcome, welcome to the Yeongchun Hotel!”"]},{"title":"I Became The Game’s Biggest Villain","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I Became The Game’s Biggest Villain / I Was Too Crazy, I Became The Villain of the Entire Server! / 网游：因为太浪，我成了全服公敌! /  I Became The Game’s Biggest Villain","This is an extremely difficult game. If you don’t have enough abilities, you won’t be able to escape!"]},{"title":"The Handsome Male Lead Won’t Let Me Log Out","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Handsome Male Lead Won’t Let Me Log Out / Marigold In A Box / 상자 속의 마리골드","The development of <Marigold in a Box>, a virtual reality game, is stopped after an unfortunate accident. Sun-ah can’t help but be sad and disappointed as the manager of the development team. She decides to log on to the game as a farewell… But she can’t customize her character? She can’t even log out?! She is forced into becoming the protagonist of the game, Chloe Marigold. What choice does she have? She just has to kill herself and reach the ‘dead ending’ in the game. Then, she’ll be free! However, due to interfering NPC characters, she always fails. She almost makes it out once… but she doesn’t. Now, there’s only one way to get out. She must beat the game."]},{"title":"Death Penalty","tags":["Action","Adventure","Fantasy"],"disc":["Read manga Death Penalty, にほんご／にっぽんご, 日本語","In the present day, tower dungeons called Magic Towers have appeared throughout the world. Takamichi Yoshito is a convenience store clerk. The manager yells at him every day, making his life miserable. Yoshito dreams of making a fortune, and soon…"]},{"title":"I Quit the Hero’s Party","tags":["Action","Adaptation","Adventure","Historical","Manhwa","Martial Arts","Romance","Seinen","Shounen"],"disc":["Read manhwa I Quit the Hero’s Party","There was once a party who sought to defeat the Demon Lord and save the world, the Hero’s Party.","However, tired of the Hero’s Party unwillingness to go directly after the Demon Lord, the Ashen Wizard Raniel quit the Hero’s Party and returned to his hometown to meet with his master.","There, he was recommended a position as an assistant professor at a prestigious academy.","“Why are you so bad at this? Just make circuits, cover yourself in mana, and use it.”","However, a genius like him didn’t seem to have any aptitude for teaching others…","The strongest of mankind begins his hectic new job at the academy!"]},{"title":"The Tutorial is Too Hard","tags":["Action","Adventure","Fantasy","Manhwa","Psychological"],"disc":["Read The Tutorial is Too Hard / The Tutorial is Too Tough! / 튜토리얼이 너무 어렵다","Gandara’s fusion fantasy novel, ‘The Tutorial is Too Hard’, is now here as a webtoon. One day, amidst a boring life, an invitation message appears before my eyes. [Would you like to enter the tutorial world?] Following it is a difficulty-selection window. [Easy] [Normal] [Hard] [Hell]. I select hell-difficulty without hesitation. And I regret it. I know it said hell-difficulty, but this is just too much."]},{"title":"Where the Heart Is","tags":["Drama","Manhwa","Mature","Romance"],"disc":["Read manhwa Where the Heart Is / Be My Family (Nas) / Be Part of My Family / 가족이 되어주라","Min Harang’s future is clear. Go to KNU law school, become a prosecutor, and be successful. At least, that’s what her mother wants. But when Harang fails the entrance exam, she has to come to terms with the fact that her mother’s wishes might not line up with Harang’s own. Out sulking in the rain after an explosive argument, help comes in the form of her sex-crazed neighbor – the very man who’s constant moaning distracted her from studying! And since it’s his fault anyway, it’s only fair that he take responsibility, right? But there’s more to the man that first appears, and soon Harang finds herself coming face to face with a different form of family. It just goes to show that home is truly where the heart is."]},{"title":"Protecting the Witch’s Son","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Survival","Webtoons"],"disc":["Read manhwa Protecting the Witch’s Son / 마녀의 아들을 지키는 이유"]},{"title":"Trumping My Tragic Destiny","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance","Time travel"],"disc":["Read manhwa Trumping My Tragic Destiny / The Female Lead’s Daughter After the Ending / I Am the Daughter of the Female Lead Who She Gave Birth to After the Bad Ending / The Heroine’s Daughter After the Ending / ヒロインの娘はバッドエンドを覆し たい / 배드엔딩 후 태어난 여주의 딸입니다","Our Protagonist was an avid gamer, obsessed with a fantasy game with multiple outcomes for its Female Lead. After meeting her untimely demise, she was reborn into the game as Remilian, the daughter of the Female Lead. Her extensive knowledge of the game was no longer any good, as she was born after the game’s worst ending had already occurred. Now stuck with a tragic story, unable to change anything following the “Bad Ending””, she is content with her small but happy life with her loving mother, the original Female Lead, even though they are imprisoned by the King, Remilian’s actual father. Following an attempt at escape, Remilian finds herself on the brink of dying again, but a last moment spell from her mother throws her back into the past. Waking up in a timeline before the game’s events have unfolded, Remilian now has all the knowledge she needs to make a choice: Will she change her mother’s tragic ending, even at the cost of never being born?"]},{"title":"Picked Up by a Mysterious Wizard","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Picked Up by a Mysterious Wizard","Lydie, imprisoned for being labeled a witch, is unexpectedly rescued by a mysterious wizard named Victor. He uses his magic to transport her to a secluded island in the north, a haven for witches and wizards. With Victor’s guidance, Lydie begins to carve out her place within the island’s community. However, just as she starts to grapple with her burgeoning feelings for Victor, he inexplicably begins to pull away. Lydie has finally found a place where she belongs, but could Victor’s undisclosed plans jeopardize everything…?"]},{"title":"My Second Husband Is Desperate And Depressed","tags":["Comedy","Drama","Fantasy","Manhwa","Reincarnation","Romance","Webtoons"],"disc":["Read manhwa My Second Husband Is Desperate And Depressed / I Can’t Keep Up With My Stallion Duke / I’m Depressed Because My Second Husband Is Desperate / I Am Depressed While My Second Husband Is Desperate / 두 번째 남편이 절륜해서 우울하다 / My Second Husband Is Desperate And Depressed","Not a single soul in Olivia Florence’s life, including her own husband, provided the warmth that she craved, and she lived her life alone, growing strong. Waking up two decades earlier right after her regretful arranged marriage to the Duke, Lord James Parnell, she plans to live a different life. She hatches a plan to anull her marriage remarry the Duke, Ian Tyrone, infamous for being “”IMPOTENT”” for never showing any interest in the ladies. Maybe his disinterest in women would allow Olivia to comfortably live as his wife, unburdened by childbirth and free of any other pressures in life. But wait, the Duke who seemingly “”couldn’t get it up”” turns out to be a complete stud at in the bedroom. What has Olivia gotten herself into?"]},{"title":"No Exit","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Supernatural","Webtoons"],"disc":["Read manhwa No Exit / Kein Ausweg / No Outlet / No Way Out (Wann) / Sans Issue / 逃げ道なし / 출구없음","Roy isn’t your average crime-fighting agent. She sees visions in her dreams—visions that come true soon after. Using this gift of foresight, she predicts crimes ahead of time. One night, she has a dream about making passionate love to a man she had never seen before, which makes her uneasy because her dreams always become real. What’s more, this man keeps popping up in the crime scenes she foresees. Just who is this mysterious man? Why does he keep showing up in her dreams and reality?"]},{"title":"Only for Love","tags":["Adaptation","Comedy","Drama","Fantasy","Office Workers","Romance","Shoujo"],"disc":["Read manga Only for Love / Accidental Love / 错撩","The stunning financial reporter, Zheng Shuyi, is dating a two-timing scumbag? How could she possibly stand back and do nothing about those love birds: the cheating bastard and his white lotus of a mistress. Upon seeing the Rolls-Royce’s plate number of the mistress’ uncle, which was a straight numerical number plate, Zheng Shuyi made up her mind. Doesn’t the cheater plan to marry rich to retire twenty years early, by going down the laughable CEO route? Then I shall become both you and your mistress’ aunt!"]}]