[{"title":"Sickly? Husband’s Contractual Wife","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Sickly? Husband’s Contractual Wife / Sickly? My contract wife / Contractual Marriage to a Sickly? Husband / Contractual Marriage to a Surly Duke  /병약한? 남편의 계약 아내","I’m Selena, a daughter born to a family well-known for their fertile women. I was sold off in a marriage to a sickly duke whose life hung in the balance, for the sake of producing an heir of his family. They provided me a medicine purported to aid in pregnancy, and the astrologist even advised me about good days to sleep together, but…there was no child.","“So, are there any signs of pregnancy?”","“Ah, I-I’m sorry.”","“You’re useless. What luck do you think won you the position of the duke’s wife?”","I couldn’t say a word.","‘No, excuse me. I only have to look at the sky to pluck a star. That’s how I attained this position.’","***","A husband who doesn’t like touching me in the least.","But he’s still pitiful so let’s at least make him healthy by feeding him nutritious food, getting him to exercise, and I’ll personally test any doubtful food first. Once he recovers from my extensive efforts, I’ll sign an annulment paper and flee, but…","“You agreed to a contract to bear me an heir. But to think you would go back on your words…”","Although he’s in good health now, my “former” husband has become a bit too healthy.","“You’re healthy now!”","“The duties of marriage are sacred. I will collect my dues.”","“Wait. Wait! But we’re divorced? We’re no longer husband and wife…”","He smirked then took a piece of paper from his breast pocket and tossed it to me.","“We aren’t divorced yet.”"]},{"title":"My younger brother forces my flower path","tags":["Comedy","Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa My younger brother forces my flower path / My Younger Brother Paved My Flower Path / My Younger Brother Paved My Road to Success / Brother Know Best / 남동생이 꽃길을 강요한다","I have a younger brother. A good little brother who does anything for his sister.","The problem is, he doesn’t know the right way.","“Sister, now this is yours.”","What my brother gave me was the crown that was on the tyrant’s head just until yesterday.","“Sister, you said you wanted to be an emperor. I’ll be your knight.”","When did I say that, crazy brother?","So, I became the emperor thanks to my crazy little brother.","I’m doing well because it seems to suit my aptitude.","“Sister! I’ll make the continent kneel under your feet!”","My brother kept raising the scale.","Hey, you crazy bastard, that’s not it…","At this rate, I’m likely to die of overwork even before I become the first emperor to unify the continent.","This can’t be done. I need to find a good worker, no, a husband.","“Eddy, I’m thinking of getting married now.”","“I’ll find the best brother-in-law in the world.”","“No need to be the best in the world, just work well and listen well…”","“I can’t accept a man who’s weaker than me to be sister’s partner. I’ll prepare for a National Tournament!”","You son of a. Listen to me.","The husband who survived the final battle was the Duke of Dehart, the Monster of the North.","He was the second crazy man who dreamed of reunifying the continent with his brother-in-law.","Ha, these bastards are really…"]},{"title":"The Cursed Maid of the Duke’s Castle","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Cursed Maid of the Duke’s Castle, Cursed Maid of the Duchy, The Cursed Maid in the Duke’s Castle, The Duke’s Castle’s Cursed Maid, The Cursed Attendant of the Duke’s Castle, 공작성의 저주받은 시녀님","Lia is a young woman who saves an old man from being beaten in the street, but receives a curse that will kill her if it is not broken within a year. She discovers that the only way to get rid of the curse is to stay close to the cold and cruel Duke, who appears in the library where she searches for clues. She decides to become a servant in the Duke’s palace, but he treats her like a murderer and watches her closely. Lia tries to get closer to him to end the curse, but ends up awakening another type of curse: the Duke’s obsession with her."]},{"title":"The Reborn Witch Raises a Templar","tags":["Drama","Fantasy","Magic","Manhua","Romance","Shoujo"],"disc":["Read The Reborn Witch Raises a Templar / 转生魔女养成了圣殿骑士 / Zhuǎnshēng Mónǚ Yǎng Chéngle Shèng Diàn Qí","One day, she finds herself reborn as Nielce Glory, the main character in a revenge novel and the strongest witch around—a title she earned by single-handedly taking down the Church. Despite being determined to leave all her grudges behind and face the miserable life she’s supposed to have, she ends up saving Harvil, the templar who’s fated to kill her later on in the novel. What was a brief moment of softheartedness has now become a major lifelong headache. And why is the usually cold-hearted Harvil from the novel acting so clingy now?"]},{"title":"The Bridal Night","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa The Bridal Night / Bride’s Night / Bridal Night / 신부의 밤","Haneul is a woman with terrible luck, and all she wants is a peaceful and normal life. But one day, she has an erotic dream about a mysterious man, who reveals himself to be the king of demons and the only dragon in the other world, Jinmong. Jinmong wants to make Haneul his bride, but she doesn’t believe in his existence. They begin a fateful and destined romance, but what will be their ending?"]},{"title":"Trash of the Count’s Family","tags":["Action","Adventure","Comedy","Fantasy","Seinen"],"disc":["Read manhwa Trash Of The Count’S Family / Lout of Count’s Family / 백작가의 망나니가 되었다","When I opened my eyes, I was inside a novel. [The Birth of a Hero]. [The Birth of a Hero] was a novel focused on the adventures of the main character, Choi Han, a high school boy who was transported to a different dimension from Earth, along with the birth of the numerous heroes of the continent. I became a part of that novel as the tr*sh of the Count’s family, the family that oversaw the territory where the first village that Choi Han visits is located. The problem is that Choi Han becomes twisted after that village, and everyone in it, are destroyed by assassins. The bigger problem is the fact that this s*upid tr*sh who I’ve become doesn’t know about what happened in the village and messes with Choi Han, only to get beaten to a pulp. “…This is going to be a problem.” I feel like something serious has happened to me. But it was worth trying to make this my new life."]},{"title":"My Brother’s Friends Can’t Be This Big!","tags":["Adult","College life","Drama","Fantasy","Manhwa","Mature","Reverse harem","Romance","Smut"],"disc":["Read manhwa My Brother’s Friends Can’t Be This Big!","※This series includes themes and topics that might not suit everyone’s taste, such as threesomes. Please be mindful when reading. “What would it feel like to be surrounded by muscular men, our bare skins rubbing against each other?” Ever since I was young, I’ve always preferred spending time alone in my room over hanging out in groups. Now that I’ve just become an adult, I find myself different from my friends who are busy enjoying clubs, group dates, and all that stuff. But of course, being introverted doesn’t mean I lack desires. Yep, my thing was being with multiple people at once. Under the condition they’re good-looking! I indulged in naughty chats online, something impossible in real life, enjoying the anonymity the internet provided. This perfect little world of mine… “If we knew you were into this, we would have done it for you sooner.” “Exactly. No need for us to fight over nothing.” “No way…!” “So, have you masturbated to our dick pics a lot?” I was wondering what kind of nutters that hot go around sending nudes. Turns out they were my brother’s friends who’ve been annoying me all this time!!"]},{"title":"The Secret Bedroom of a Dejected Royal Daughter","tags":["Drama","Fantasy","Historical","Josei","Manhwa","Mature","Romance","Royal family","Webtoons"],"disc":["Read manhwa The Secret Bedroom of a Dejected Royal Daughter / The Abandoned Princess’ Secret Bedroom / The Abandoned Princess’ Secret Room / The Secret Bedroom of the Forsaken Princess / 버림받은 왕녀의 은밀한 침실\n“A woman who does not know love, may you know the joy of pleasure.” The curse of lust placed on Lewellyn, a princess who was once revered but miserably abandoned. In order to prevent the curse, she would have to spend the night with a man! She eventually opens her own private bedroom… Childhood friend Armandite, who returned as a hero of the Holy Sword, Commander Tristan, who is as blunt as a rock, but somehow wanders around her. Beautiful but somehow twisted, Holy Priest Ernel. And, watching her, ‘someone.’ Will she be able to break the curse safely? Who will be with the thorny princess? – “It sounds lovely.” The priest smiled beautifully. – “Princess, do you like my body, not me?” Tristan said in a voice that had everything crumbled. – “I mean.” “… … .” “I didn’t want to hold you like this.” “Hush!” Lewellyn gasped and looked at Armandite."]},{"title":"The tyrant’s pet","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua The tyrant’s pet / I Am a Toy in the Hands of a Villain / Lun Wei Baojun De Zhangzhong Wanwu / Lún Wèi Bàojūn De Zhǎngzhōng Wánwù / Rơi Vào Tay Bạo Chúa / She Became the Plaything in the Tyrant’s Palm / Я игрушка в руках тирана / 沦为暴君的掌中玩物 / Pet of the Tyrant / 暴君のペットはお断りします"]},{"title":"The Main Characters That Only I Know","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Main Characters That Only I Know","[By the Author that brought you <Academy’s Undercover Professor>!]\n“If I were given another chance…” 10 years after the apocalypse began on Earth, while he faced imminent death, Yoohyun was filled with regret. Just then, a bright light descended upon him. When he opened his eyes, he was greeted by an unfamiliar scene… Not only had he reincarnated as a non-human race called “Teller,” but he had also traveled back in time by 10 years! “Now that it has come to this, I’ll live my best life this time!” Unlike his previous life, where he was solely focused on survival, he is now determined to lead a successful life. In this new life he has gained, will Yoohyun truly be able to become the protagonist?"]},{"title":"My Demon","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa My Demon / 마이데몬","Do Do-Hee is the successor of the Future Group. She has an arrogant and cool-headed personality, who doesn’t trust in anyone and is cynical about love. Do Do-Hee gets involved with a demon named Jung Gu-Won and makes a contract marriage with him.\nHe can live for eternity by making dangerous, but sweet deals with humans who endure hellish lives. But after looking down upon humans for 200 years, he gets involved with Do Do-Hee and somehow loses his power. To prevent his own extinction, he must protect Do Do-Hee who has taken all of his power."]},{"title":"Starfall","tags":["Fantasy","Romance","Webtoons"],"disc":["Read Starfall: A Song for the Cosmos / 스타폴:별을 위한 노래 / Star-fall〜星のための歌 〜","He was born the son of a king, but chose to walk a path that is paved with hardships and struggles. She was born with a flaw that makes her shunned by society. Due to an accidental meeting, a new relationship is beginning to form. Little did they know about the troubles they would face due to their different backgrounds. But, as long as they are together they can face anything that comes their way. “A fancy victory or the glory of the victor isn’t important. Since we swore to be together even till death.” * The elected manhwa of 2015 manhwa scout by SBA-Seoul culture office-"]},{"title":"Reaper of the Drifting Moon","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Reaper of the Drifting Moon / Synopsis Reaper of the Drifting Moon","He’s in the deepest part of the Jianghu. Keep your eyes wide open if you do not wish to get dragged into the abyss."]},{"title":"Duchess Mecklen’s Elegant Rebellion","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Duchess Mecklen’s Elegant Rebellion / 메클렌 공작부인의 우아한 반란","Please divorce me.","I’d sell my soul to divorce you!","If I had another chance, I wouldn’t live and die in vain like a fool.","Eleanor’s goal after being miraculously reincarnated is to divorce the Duke of Mecklen to avoid future misfortune."]},{"title":"Don’t Mess with My Duke Dubless!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Don’t Mess with My Duke Dubless! / Don’t Be My Darling / 내 최애 까지마라","One day, Jade Kinsel finds herself in the world of the novel .She decides that, while she is here, she’d try and change the ending of her favorite character-Duke Dubless. Rather than the sad, underdog second-lead that loses out on the girl and eventually dies alone, Jade would find him his own match and let him meet an ending he truly deserves. She awaits the appearance of Minne, the main character and saintess that will get the ball rolling… But once the original novel begins, Jade notices that something is wrong-the story has changed its course!"]},{"title":"Crown Prince Has A Sweetheart","tags":["Drama","Fantasy","Historical","Manhua","Romance","Royal family"],"disc":["Read manhua Crown Prince Has A Sweetheart / 太子有位心上人","",""]},{"title":"Flavors of Reincarnation","tags":["Drama","Fantasy","Josei","Manhwa","Reincarnation","Romance"],"disc":["Read manga Flavors of Reincarnation / Whose Child Should I Give Birth To? / Nuguui Aileul Nah-eulkka / Reincarnated Beauty’s Love Affairs / Tensei Bijo no Ren’ai Jijou / Whose Child Are You Going to Give Birth To? / 転生美女の恋愛事情 / 누구의 아이를 낳을까","After a heroic death, Oh Youngsil is given the chance to select her own rebirth. With all the flavors of life before her, Youngsil forgoes all else and piles on one “scoop” of beauty after another. But there’s a catch. The choices she makes now take time off her life. To stop this, she is told she must give birth to “God’s Helper,” which will grant her wealth and happiness. Armed with beauty and not much else, will Youngsil taste the sweetness of life, or will reincarnation prove bittersweet?"]},{"title":"My Demons Can’t Be That Cute!","tags":["Action","Drama","Fantasy","Manhua","Romance","Supernatural"],"disc":["Read manhua My Demons Can’t Be That Cute! / Wo De Liaozhai Bu Keneng Name Ke’ai! / Liêu Trai Không Thể Nào Xinh Đẹp Như Vậy / My Liaozhai Can’t Be This Cute! / Wǒ De Liáozhāi Bù Kěnéng Nàme Kě’ài! / 我的聊斋不可能那么可爱！","I transmigrated into a world of monsters through a picture album. In this fallen world, demons and ghosts feed on humans, hence I have no choice but to wield a sword and cut them down! It’s just that…these monsters seem to be a little different from what I thought! They’re just too cute!"]},{"title":"The Nightmare Spirit Boy","tags":["Action","Adventure","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua The Nightmare Spirit Boy / 魇灵少年","Nightmare demons are born from the dark side of the world. Fourteen years ago, a nightmare demon named Ya caused irreparable damage to the Snow Spirit City, leading to the deaths of countless tribesmen. Fourteen years later, a boy named Bai Ya encounters an invasion by a mysterious nightmare demon. After experiencing numerous crises and battles, Bai Ya continues to grow and embarks on an adventurous journey full of danger and excitement, exploring unknown worlds."]},{"title":"I Swallowed the Heavenly Demon","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa I Swallowed the Heavenly Demon / 천마를 삼켰다"]}]