[{"title":"Newcomers Turn Low at Night","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Newcomers Turn Low at Night / 신입은 낮져밤이","An angelic new employee by day, a different person by night. Three months into the job, the handsome, well-mannered newcomer turns out to be the chairman’s son.\nBut it wasn’t just his identity that was deceiving. His personality…his personality is terrible!\n“Good morning, Ms. Shin.”\nThe sweet and cheerful newcomer in the daytime.\n“Take care of it by tomorrow.”"]},{"title":"Reborn As The Heavenly Martial Demon","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Reborn As The Heavenly Martial Demon / After I Die, I Transform Into a Martial Arts Demon / 我死后 / 化身武道天魔签","Humanity lost the war. Businessmen who sold out their fellow compatriots, hunters who turned to the monsters, stepping on countless human corpses, all in order to earn profit. The otherworldly monsters that entered our world seized it bit by bit like a raging fire. That was until Zuo Chi arrived. Back then you were happily invading our world, so why are you crying now?"]},{"title":"The Reason Why The Twin Lady Crossdresses","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Reason Why The Twin Lady Crossdresses / 쌍둥이 영애가 남장을 하는 이유","When Linari, who was executed due to the tyrant crown prince’s plot, opened her eyes, she returned to the world three years prior. “In my second life, I will change my fate!” The method she chose was… crossdressing, in order to go to Fortis Academy in the stead of her younger twin brother, Liam! However, the crossdressed Linari caught the eyes of “Perseus,” the quartet led by the crown prince, and…?! An isekai academy love story begins… one where she can’t ever allowed to be caught!"]},{"title":"A Guide to the Reality of Villain Extras","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read Manhwa A Guide to the Reality of Villain Extras,Villain Extra’s Reality Guide, The Villainess Extra’s Guide to In-Game Purchases, A Guide to the Villains Extras, Villain Extra’s F2P Guide, 악역 엑스트라의 현질 가이드","As soon as I made 2.2 billion won through cryptocurrency, I found myself possessed by a villainous extra in a game I used to play.","On the day I hit the jackpot with crypto, I was suddenly transported into the game I had been enjoying the day before. In the game, I was destined to be used and then killed by the villainess in the early stages. To avoid this fate, I betrayed the villainess, ‘Cleora,’ but was still killed in the end.","However, after returning to the first day I was possessed, I gained the ability to use the 2.2 billion won I earned in real life as currency in the game’s cash shop.","With such an enormous amount of in-game cash, will I be able to survive until the end this time?"]},{"title":"Did You Like Me?","tags":["Fantasy","Magic","Romance"],"disc":["Read Did You Like Me? / あんた私のことを好きだったの？","Several years after marrying into a rival marquis family, I had resolved to live my life as a mere decorative wife. But I never expected to be attacked by a magical beast and lose my life. Amidst the roaring flames, my husband, who was supposed to hate me, desperately called out my name. “Did you actually like me?” “If that’s the case—” When I next woke up, I had returned to the time just before marrying into the marquis family. In order to survive the upcoming attack, I must build a good relationship with my husband. But despite thinking he liked me, his attitude remains as cold as ever…?"]},{"title":"The Moonlight Shines On My Fading Future","tags":[],"disc":["Read The Moonlight Shines On My Fading Future","Lunatia, the daughter of a viscount, was nothing more than a tool exploited by her family for her “clairvoyance.” Used even by her own fiancé, she eventually pays the price for her abilities by losing sight in one eye. The only future she sees awaiting her is one where all five senses are lost… Determined to live on her own terms and die an honorable death, Lunatia escapes from home. She finds refuge in the manor of the “Marquess of the Lunar Eclipse,” who is rumored to be seeking a new bride. With daring resolve, she proposes to this fearsome, seemingly inhumane man: “If you make me your bride, I will read your future once a day. You don’t have to love me. And when you no longer need me, please kill me with your own hands.” Thus begins their marriage based on these unconventional terms. Though Lunatia tries to keep her dying senses a secret, the truth starts to come apart at the seams. But why is her supposedly cold-hearted husband suddenly revealing unexpected depths of devotion…?"," "]},{"title":"Notorious Wife-Killer’s Remarriage Proposal","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manga Notorious Wife-Killer’s Remarriage Proposal","Divorced by her abusive ex, she’s now cherished by her new husband! Chloé, a Baron’s daughter, was divorced by her corrupt noble ex-husband because she ‘couldn’t bear a child.’ Left alone with a broken heart, she suddenly receives a marriage proposal from someone she never expected–the notorious ‘wife-killer,’ Marquis Roland! Though renowned throughout the kingdom for his capabilities, he remains a man of mystery, never removing his mask. Despite Chloé’s fears, why does Roland treat her with nothing but love and kindness as they embark on their new life together as newlyweds…?"]},{"title":"May Your Misery Exceed Mine","tags":["Romance"],"disc":["Read May Your Misery Exceed Mine","In the first year of her marriage, Keiko Natori enjoys being a full-time housewife and having a great relationship with her husband. Surrounded by a circle of cherished friends, among them her dear younger sister Shiho, Keiko’s life seems blissful in every aspect. However, her happiness is shattered when her beloved sister betrays her trust by seducing her husband. Thus begins a tumultuous battle for affection between the two sisters, sparked by the flames of an illicit affair—who will emerge victorious in this emotional tug-of-war? “Sister… I only wish for your misery to exceed mine.”"]},{"title":"Loveless Heroine","tags":["Drama","Fantasy","Historical","Reincarnation","Romance"],"disc":["Read Loveless Heroine / Wanthong Rai Jai / วันทองไร้ใจ","Pennueng was reincarnated into one of the most well-known Thai folklore epics, “Khun Chang Khun Phaen”. To be more precise, she woke up as a younger self of the infamous female lead, Wanthong ‘Two Hearts Bitch’. The nickname she was unfairly given before sentenced to death for appearing indecisive toward the contesting of marriage to her. All because she couldn’t decide which of these two abusive men to be with! The handsome accomplished man but a philanderer that this body originally fell in love with or the ugly wealthy man who obsessively faithfully loved you? …Screw that! I’m not choosing any of you!"]},{"title":"Special Civil Servant","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Special Civil Servant","After failing the Grade Nine civil service exam four times and many twists and turns, Han Maru finally succeeded in becoming a special civil servant under the Ministry of Environment. Goodbye, gosiwon! Goodbye, convenience store lunchboxes! But the joy of passing was short-lived. It turned out to be a life-threatening national secret job?! Along with the yellow dust came the demons, creatures that kill and eat humans. The Grade 9 special civil servant job involved waging war against these demons! Han Maru’s life-threatening civil service career begins."]},{"title":"Let the Saintess Be Selfish","tags":["Fantasy","Reincarnation","Romance","Webtoons"],"disc":["Read manga Let the Saintess Be Selfish / Seijo Lilia wa Wagamama ni Ikitai / 聖女リーリアはわがままに生きたい"]},{"title":"Fly Me To The Moon","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Fly Me To The Moon / 플라이 미 투 더 문","An unusual existence, evil things are not enough to say they are monsters.\nAn unexpected appearance by Jeong Yeon, who attended her mother’s funeral, forces her to enter their world.\nHate is manipulated, terrible pain. There was someone holding her right when she broke down."]},{"title":"The Second Child of God","tags":["Drama","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa The Second Child of God / 두번째 신의아이","Jiseo, born with the fate of the second child of God. Hyunjin, who appeared before Jiseo as he lamented his fate, tries to help him but ends up being possessed by a ghost…"]},{"title":"The Stepmother Likes Harems","tags":["Drama","Fantasy","Harem","Manhwa","One shot","Reverse harem","Romance","Shoujo"],"disc":["Read manhwa The Stepmother Likes Harems / Ibu tiri yang suka harem / 계모는 하렘을 좋아해\n“Charlhein is my true love.” “Isn’t Charlhein your adopted daughter?” “We did that to protect her from attacks within the house. It was a helpless situation. She’ll become the lady of this house when Father passes away. Everyone in the Barony already knows.” “Then, what about me?” Eliana, the eldest daughter of a poor noble family, accepted a marriage proposal from Baron Carmen in order to take care of her siblings and the household. However, as soon as she got married, she heard news that came out of nowhere. Additionally, because of Charlhein’s scheming, people started calling Eliana by the disgraceful title of “stepmother.” She couldn’t let it go, so she decided to use her stepmother image to turn the crisis into an opportunity. Her goal is to be the queen of the harem. It’s not about her sweet love—it’s a warlike shortcut to power. Alongside this dangerous harem-building, will she be able to exact revenge and find true love?"]},{"title":"I Became My Crush’s Servant","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became My Crush’s Servant / 推しの下僕になりまして","The protagonist, grieving the death of her favorite character, finds herself reincarnated into the game’s world before her beloved’s demise! As the mob character Lou Lurea, she resolves to save her favorite character no matter what. However, she is reincarnated into a magical academy filled with handsome vampires. As the only human, Lou is nothing more than a delicious treat to everyone. While being pursued as “prey” by the characters, she struggles to prevent her favorite’s bad ending…?! A story begins where love for her favorite character changes destiny!"]},{"title":"On Bad Terms [Official]","tags":["Comedy","Drama","Fantasy","Mature","Romance"],"disc":["Read manhwa On Bad Terms [Official]","Han Gahye has lived her whole life doing what her father, a renowned doctor, tells her to do. Now she is determined to leave everything behind and start her own business in a small town. But things go awry when she keeps running into Baek Jung, the sexy owner of a butcher shop below her clinic. Gahye tries not to take an interest in the rough and blatant butcher, but she can’t stop thinking about him… and his muscles. Will Gahye successfully maintain her distance, or can Jung change her mind?"]},{"title":"Starting as a Master of Female Disciples’ Leisure Skills","tags":["Action","Adventure","Fantasy"],"disc":["Read Starting as a Master of Female Disciples’ Leisure Skills","Xiu Xian died and, upon waking up, found himself transmigrated into the body of a cowardly illegitimate son from a cultivation family. Without spiritual roots, he couldn’t cultivate, and the head of the family despised him. Almost anyone in the household could easily humiliate him. However, he acquired a “Female Disciples’ Leisure System.”","As long as his female disciples cultivated various leisure skills like cooking, painting, blacksmithing, weaving, and construction, Xiu Xian would gain experience points. As the disciples improved their skills, they could even develop all sorts of incredible cultivation techniques—like eating food to restore health bars…"]},{"title":"Legendary Ranker’s Comeback","tags":["Action","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Legendary Ranker’s Comeback","One day, the dungeon apocalypse game, Dream Side, turned to reality. Having just completed University, I was stuck inside the elevator while delivering packages when a blue screen appeared before me, along with a monster! As I used to be the number 1 ranker of that game, I destroyed the extremely difficult tutorial and continued playing the game like an elite player…"]},{"title":"I Must Seduce the Count’s Daughter’s Lover","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Must Seduce the Count’s Daughter’s Lover / Seduce the Count’s Daughter’s Lover / Seduce the Count’s Eldest Daughter’s Lover / Seducing the Lady’s Lover / 백작 영애의 애인을 꼬셔라","I’m Ridel Cross.\nAt the age of 18, I was locked up in a magical tower by the emperor and used me as a suitable tool. That was my previous life.\nBut in this life, I have resolved to live a life that has nothing to do with magic and vow to become a servant of the earl’s house…\n“Only you! Get him out of Milena! I beg of you!”\nWait a minute, master. The ‘he’ that master told me to separate from the countess’s lady probably wasn’t Graham, the butler, who had the exact same features as the emperor in his previous life, right?\nThere’s an intense battle about to take place just by looking at it, seducing Graham?\n…Will I be able to live peacefully in this life?"]},{"title":"My In-laws are Obsessed With Me","tags":["Action","Cooking","Drama","Fantasy","Historical","Isekai","Manhwa","Reverse","Romance","Shoujo","Villainess","Webtoons"],"disc":["Read manga My In-laws are Obsessed With Me / The In-Law’s Side Is Obsessed With Me/시월드가 내게 집착한다","My family and my husband killed me. Because of the inheritance. Returning to the past, I made up my mind. “I have to protect my life and my inheritance.” Grand Duke Lapireon of the cursed family. I offered him, who was not interested in property and women, a one year contract marriage. Now, all we have to do is get a divorce… “Lady, do you think you can leave me now?” My husband is weird. “Would you like a land or a mine? Or an empire?” “Sasha, did Theo do something wrong?” “Mom, don’t leave me.” “Sister… I can’t live without you.” Even my in-laws began to obsess over me."]}]