[{"title":"I Became a C-Level Guide Obsessed With Crazy People","tags":["Fantasy","Josei","Romance"],"disc":["Read manhwa online I Became a C-Class Guide Obsessed With Crazy People, 미친놈들에게 집착받는 C급 가이드가 되었다, Became a C-Class Guide Obsessed with Madmen, ヤバい奴らに執着されるC級ガイドになった","Baek Yeo-eul, who has been in her fifth year as a C-level guide, has only one goal. To live as thinly and long as possible. Baek Yeo-eul has lived like that all along and plans to live like that in the future. Matching rate 89%. “… “That’s it.” Unless the matching rate was 89% with an S-class esper who is famous for changing guides before completing a month. After that, Baek Yeo-eul’s life completely changes. Han Yi-hyeon, a crazy esper who treats himself with respect and is kind. General Manager Dogeon, who is in charge of his own agent, his C-rank guide. Jerry tells him to take responsibility for the life he saved by chance. For some reason, Baek Yeo-eul became a C-level guide who was obsessed with all the crazy guys."]},{"title":"Estio","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Read Estio manhwa / 에스티오\n“Are you the one who called me…?” A black-haired beast looked at him with glowing yellow eyes. “It’s okay. It won’t hurt anymore. You’ll be okay.” Estio was born as the youngest son of a farmer, but everyone hated him. He was a child who could read the hearts of people and animals. And… “A cursed child.” He finally turned 19, and it was now time for his coming-of-age ceremony. Now starts Estio’s journey to find happiness."]},{"title":"Crown Prince’s Marriage Proposal","tags":["Adaptation","Drama","Manhwa","Romance"],"disc":["Read manhwa Crown Prince’s Marriage Proposal / The Crown Prince’s Proposal / 皇太子的求婚 / 왕세자의 프러포즈","In an alternate reality, the Republic of Korea is a constitutional monarchy ruled by the royal family of the Joseon Dynasty (1392-). One day, the shocking announcement is made that the Crown Prince has suddenly died, and the identity of the next in line to the throne is shrouded in mystery. The new Crown Prince is unmarried but expected to attend his coronation ceremony with his significant other, but instead of the beautiful entertainer and daughter of a powerful CEO with whom he was romantically linked, the prince again shocks the nation with a profession of love for another – but who can it be? A plucky, savvy, young reporter Leejin Choi vows to get to the bottom of the story finds that she is strangely connected to the prince."," "]},{"title":"I’m Actually A Peerless Powerhouse","tags":["Action","Drama","Fantasy","Shounen"],"disc":["Read I’m Actually A Peerless Powerhouse / I’m a Master of the World / Wo Jing Shi Jueshi Gaoshou / 我竟是绝世高手\nJiang Chen transmigrated to the world of immortals, but he did not have any talent for cultivation and was destined to be a mortal.\nThe one at the door? Oh,it’s just Jiang Chen’s legendary golden-winged bird."]},{"title":"Terrarium Adventure","tags":["Adventure","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read Terrarium Adventure manhwa","Jae-Hee is an addict of the trash game . One day, she finds out that the developers of Infinite Dia are releasing a new gacha game called .Wanting to get the final secret achievement before the game is discontinued, she puts all her time into Infinite Dia. When she finally succeeds in getting the secret achievement She wakes up to find herself in a world of fantasy and magic!!Now, not only does Jae-Hee needs to figure out this entirely new world, she also needs to enlist of help of dryads to stop the world from burning"]},{"title":"One Hundred and Eight Ways to Discuss About the Villain’s Pretentious Crappiness","tags":["Drama","Fantasy","Harem","Historical","Manhua","Romance","Transmigration"],"disc":["Read manhua One Hundred and Eight Ways to Discuss About the Villain’s Pretentious Crappiness / 108 Cách Bày Trò Của Nhân Vật Phản Diện / Lun Fanpai Bai Lan De Yibai Ling Ba Zhong Fangshi / Trăm Kiếp Luân Hồi Kiếp Này Ta Chỉ Muốn Lười Biếng / 论反派摆烂的一百零八种方式","Meng Guiti originally thought she would be the most powerful cultivator in the world. But she one day realized she is just number one cannon fodder and this world is a novel she knew from her previous life. After being aware of that, she was stuck in hundreds of loops throughout her lives. In short, she is doomed to fail. She can’t fight against the Fated Chosen, she couldn’t even steal their fates. She could only follow the plot to maintain such a life, in hope to reach the end. Meng Guiti: I’m tired! Now I just want to lie down. Everyone, do whatever you want!"]},{"title":"Ways to Satisfy a Devil","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Ways to Satisfy a Devil / 악마를 배불리는 법"]},{"title":"Marriage Situation","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marriage Situation / Marriage Circumstances / 結婚事情 / 结婚请求 / 결혼 사정","Kim Yooyoung is sick of playing the nice, boring lawyer and daughter. So when her overbearing mother books her a hotel room the night before an arranged blind date, she steps out of character and spends the night with a seductive stranger from the hotel bar. Only this stranger turns out to be none other than Cha Jihoon, her blind date and the hotel’s high-class owner! Yooyoung will do anything to keep their “bad deed” a secret… but can she really marry her first one-night stand?"]},{"title":"The Business Is Closed Due To The Tyrant Parents","tags":["Comedy","Drama","Fantasy","Historical","kids","Magic","Manhwa","Romance","Royal family","Slice of Life","Time travel","Tragedy"],"disc":["Read manhwa The Business Is Closed Due To The Tyrant Parents / 폭군 아빠들 때문에 폐업합니다 웹툰화"]},{"title":"The Fate of the Perennial Sub Male Lead Is in My Hands","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Fate of the Perennial Sub Male Lead Is in My Hands / 만년 서브남의 운명이 내 손에"]},{"title":"How To Stop The Tyrant’s Blackening","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How To Stop The Tyrant’s Blackening / Preventing The Making Of A Tyrant / Como Impedir o Obscurecimento do Tirano / 폭군의 흑화를 막는 법","She became an extra member of the Blackmak family, who blackened the emperor and turned him into a tyrant.","The darkened tyrant is obsessed with the female lead and becomes a good villainous sub-male lead.","Of course, what about me before that?\nI die after being used only.","However, I didn’t know this death would be repeated three times.","How to break the cycle of tedious regression?\nLet’s stop the blackening of the tyrant.","*","“Do you believe in Tao?”","A gaze that looked like a worm came back.\nI know how it feels. I was like that, too.","“I can’t even sleep well these days!”","Flinch. She stopped walking, trying to ignore it.","“My mind is blank. My heart is pounding like crazy. Don’t you think your head is going to explode? ”","Under my eyes, a perfect man looked at me even if he had dark circles.","” …Can I believe in the Tao?”","Of course, just trust me."]},{"title":"Goodbye My Juliet","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Time travel"],"disc":["Read manhwa Goodbye My Juliet","“No, I refuse to die this time!” Juliet is on a mission to find that one happy ending in the loop of tragedies woven into the very fabric of her character and the world around her. From swords to tomatoes, everything in this universe seems to be a death trap designed to create the perfect Shakespearean tragedy. Only her beloved cousin, Tybalt, comes to her aid upon noticing the time loops. Juliet wants her universe back, and Tybalt wants the real Juliet back. And now, they must work together for Juliet to find her true love in Romeo so they can both get what they want…"]},{"title":"The Dragon Prince’s Bride","tags":["Drama","Fantasy","Manhua","Romance","Webtoons"],"disc":["Read manga The Dragon Prince’s Bride\nSylvia had more than her fair share of hardship. Abandoned by her husband, sold into slavery by her father, and now ruled by a harsh master, she’s never felt free.But everything changes when she discovers an injured stranger in the woods. Despite his initial hostility and the language barrier between them, Sylvia decides to help him at any cost. She’s determined to save him from a cruel fate: and he’s become her new secret. But she never realized that he’d be a prince — or that he would kidnap her as his bride!As Sylvia takes on this unexpected adventure, she faces a difficult question: can love be her freedom, or is it just a new prison?"]},{"title":"Lotto Princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lotto Princess / Lottery Princess / 로또 황녀님 on manhwaclan","[I want to meet a baby who did a great job of reincarnation and regression. Would you like to live one more time?]\nI, who was a game YouTuber in the first life,\nbecame a very small baby princess in the third?\nWait a minute.\nDid God tell you to be born into a good family?\nWhy are you the princess of the ruined imperial family?\nThat moment Tilong! A chat window appeared in front of me with the sound.\n[ The list of people in the general channel is released.]\n[Participants: 21 / Ted (Knight), Mia (Knight), Dave (Knight), Rotten (Wizard)… … 16 others]\n[Ted: Whoa! Princess is cute! Break the tree! Break it!]\n[Mia: If I stab the ball… … Just grab your finger! It’s blasphemy!]\n[Dave: From now on, the abbreviation for cute is Chou!]\n[More]\nWhat is all this?\n… … Well, I guess not everyone is crazy.\nStill, it’s good that you like me, right?\n[Berg: My nephew wants bread.]\n[Berg: I want all the bakeries in the empire.]\nIn addition to that, the Northern Duke’s uncle who told me to go to the North if he wants.\nI’ll give you a wink about what happened and try to live in peace.\nLet’s suck honey and live this life!"]},{"title":"I Became The Youngest Prince in The Novel","tags":["Action","Adventure","Fantasy"],"disc":["I Became The Youngest Prince in The Novel, 소설 속 막내황자가 되었다, Becoming the youngest prince in the novel","The novel Chronicles of the Hero of Frosimar is a story about the failures of the protagonist not the successes.","“This is terrible.”","The First Emperor, who conquered the whole world, closed his eyes with a brief appreciation (after reading the novel).","But the moment he opened his eyes again, there were only a few lines about him in the Chronicles of the Hero of Frosimar.","This was because he became an imprisoned prince who met death with his first appearance (in the novel)."]},{"title":"Ming Dynasty: From Xu Family’s Scorn to Ascension Through Battle!","tags":["Action","Adventure","Fantasy"],"disc":["Ming Dynasty: From Xu Family’s Scorn to Ascension Through Battle!, 大明：开局徐家嘲讽，我杀敌升级","Zhu Xiong was reborn in a small town within Beiping territory during the early years of the Ming Dynasty.","In this significant year, Zhu Yuanzhang, the founding emperor, was in his prime.","With Crown Prince Zhu Biao by his side, he rectified the laws and discipline of the imperial court, and consolidated the territories.","During the same period, Zhu Xiong has been living for two years with the woman he saved, Xu Jin’er. They dream of running the tavern left by his grandmother and living an ordinary life together.","However, this year takes a dramatic turn when Xu Jin’er’s family arrives, revealing that she is actually the daughter of Xu Da, a founding duke of the nation!","This revelation brings honor and unexpected challenges as the Xu family brothers seek her, bringing disgrace upon them."]},{"title":"Blooming Melody","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Blooming Melody / 블루밍 멜로디"]},{"title":"I Tamed the Duke","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Tamed the Duke / Viola Tames the Duke / 公爵様を手懐けてしまいました / 공작님을 길들여 버렸습니다"]},{"title":"Alessa’s Frills","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Time travel"],"disc":["Read manhwa Alessa’s Frills / 알레사의 프릴","“The rebel who destroyed everything I had, I’ll definitely make you pay for it!” Alessa, who lost her parents and hometown to the rebels, lived only for revenge. While arresting the rebels’ mastermind, Empress Fleria, she was stabbed. Suddenly, she returns to the day, 10 years ago, when her master, Zekibel, was murdered. This is Ratsin’s will. Change the past, save Zekibel, and kill the rebels! But something’s wrong. Why can I hear Fleria’s voice in my head? “Kyaa! Miss Alessa is so cool! Perfect, elegant, gorgeous!” She’s even my biggest fan?! “Could it be… can you hear my thoughts right now?” Two regressors, each with the other’s inner thoughts in their head. Everything has to do with Fleria. Is this eccentric and bright girl my enemy, or is she part of my fate?! Idol knight Alessa and her biggest fan Fleria change the past and protect the future. A cheerful secret operation!"]},{"title":"The Medical Fairy Is a Three-And-A-Half-Year-Old Cutie","tags":["Adventure","Drama","Fantasy","Harem","Historical","Manhua","Romance"],"disc":["Read manhua The Medical Fairy Is a Three-And-A-Half-Year-Old Cutie / Meng Bao Yi Xian San Sui Ban / 萌宝医仙三岁半 / 萌寶醫仙三歲半","The most famous alchemist in the world of cultivation, Xuan Tianji, turned into a kid from the backlash of her attempt to seal the system that had been manipulating her. Ever since then, her childhood friend, ex-boyfriend, disciple, nemesis, etc. started looking for their “wife” to no avail. Instead, they find themselves happily becoming “Dad”…"]}]