[{"title":"Protect Me, Knight","tags":["Comedy","Drama","Fantasy","Josei","Romance"],"disc":["Read manhwa Protect Me, Knight","After “Ye Eun” fell in love at first sight with a Male student, she practiced kissing her older sister’s figurine called “Brick” While imagining the boy she fell in love with. She woke up because of a strange dream that night. She saw the figure “Brick” moved as if its alive. The figure asked her for help to lift the curse. Ye Eun accepts Brick’s request for some reason and begins to find clues about the witch who made the curse."]},{"title":"Maydare Tensei Monogatari: Kono Sekai de Ichiban Warui Majo","tags":["Adventure","Comedy","Fantasy","Historical","Isekai","Magic","Reincarnation","Romance"],"disc":["Tales of Reincarnation in Maydare , Maydare Tensei Monogatari: Kono Sekai de Ichiban Warui Majo, Tales of Reincarnation in Maydare: The World’s Worst Witch メイデーア転生物語 この世界で一番悪い魔女\nMakia is a noble lady descended from an infamous witch. Thor, a boy who was raised with her and came from another world, is chosen to be the knight of the “savior”. The two are forced apart and to see Thor once again Makia aims to be the top student at Magic School!"]},{"title":"Butler, Please!","tags":["Romance","School Life"],"disc":["‘Baekma-ri’ is an outcast at school and a rich girl at home. I, an outcast, made the first-ranked handsome man my butler…?! No. 1 in school, and at home, Marie’s lowly butler. I have to somehow make the bullied girl the queen of the school!! A romance between boys and girls who are opposites. New work by a quirky writer Story, Romance All Ages"]},{"title":"Please Take Care Of Me In This Life As Well","tags":["Romance","Slice of Life","Webtoons"],"disc":["Read manhwa Please Take Care Of Me In This Life As Well / See You in My 19th Life / 이번 생도 잘 부탁해","The biggest romance rival of my 19th life is my 18th? The romance story of a woman who remembers her past life.\nSee You in My 19th Life"]},{"title":"Remember Me","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Remember Me","Eun-ha goes on a trip and then finds herself a mysterious boy, San-Ho, chased by a suspicious person. Although they barely escaped, a month later, San-Ho died in front of Eun-Ha. Resulting in Eun-Ha running away to Korea, and then 17 years later, a man resembling the dead, San-Ho, appeared in front of her. The man introduced himself as Shin Noel, but too many resemblances seem to overlap. Is it really him or not? Remember me, a story of finding you in my blurry memories."]},{"title":"The Pharmacist’s Soliloquies","tags":["Drama","Historical","Medical","Mystery","Romance","Slice of Life"],"disc":["In the imperial court, a young woman is put into servitude, Maomao. The tale is just beginning for the woman pharmacist from the red-light district, as rumors circulate about the emperor’s children’s lives being short-lived. Her curious nature and thirst for knowledge pushes her to action. To satisfy her curiosity, this young pharmacist will investigate the origin! What is shifting in the imperial court..!? (From: Square-Enix)"]},{"title":"Amina Of The Lamp","tags":["Fantasy","Mystery","Romance","Supernatural","Webtoons"],"disc":["Read manhwa Amina Of The Lamp / Amina’s Lamp / 램프의 아미나","On the day the Wizarding City of Paz was destroyed, Amina was trapped inside a lamp while trying to go back in time. And 300 years later, she is awakened by a military commander, Jackal.\n“I don’t have any wishes for you to grant”\n“Well, I just wanted to make a quick wish so I can go back, What the hell is this guy?”\n“Do you know who I am? There is no one else in this world who understands you better than me.”\n“That’s impossible…..I’m going to disappear one of these days!” Amina, who needs to return to the lamp after her wish has been granted, unexpectedly meets Jackal, who wants to give up his wish to be with her. However, there are many dangers and threats that prevent him from doing so.\nWill Amina finally get her wish?"]},{"title":"I’m An Opportunistic Princess In-Charge of Solving Things","tags":["Comedy","Historical","Reincarnation","Romance","Shoujo"],"disc":["I’m An Opportunistic Princess In-Charge of Solving Things,Watashi wa Gotsugou Shugi na Kaiketsu Tantou no Oujo de Aru\nOctavia is a fujoshi princess, originally a high school student who was reincarnated into her favorite novel, “The Noble King.”\nIn order to solve the successor problem of this “BL world,” the princess was going to enter a political marriage and offer her own child to the king– But she doesn’t want that at all! For a fujoshi who has yet to know what love is, she’ll find her fated partner in this world she’s reincarnated to! The supporting character princess will cut through her fate, an other world reincarnation love comedy!!"]},{"title":"The Reincarnated Villainess Doesn’t Want Revenge","tags":["Fantasy","Romance","Shoujo"],"disc":["The Reincarnated Villainess Doesn’t Want Revenge , Tensei Shita Akuyaku Reijou wa Fukushuu wo Nozomanai THE COMIC\n‘“I’m not interested in revenge!” Rosemary was branded as a villainess and hung for a crime she didn’t commit. She reincarnates as the commoner, “Marie”, while still retaining the memories of her previous life and hopes to live peacefully this time. However, contrary to Marie’s wishes, she ends up returning to the royal palace. “Sister, how do you want to punish the people who killed you?” Her brother, who she doted on in her previous life, had changed completely and intended to take revenge on behalf of his sister. “Master, please tell me your desire.” The knight who swore allegiance in the previous life swears his allegiance this time as well. I’m not thinking of taking revenge on the person who killed me. However, the people around me will not allow that…"]},{"title":"The Struggle of Being Reincarnated as the Marquess’s Daughter: I’ll Deal with What’s Coming to Me!","tags":["Fantasy","Isekai","Reincarnation","Romance","Shoujo","Villainess"],"disc":["The Struggle of Being Reincarnated as the Marquess’s Daughter: I’ll Deal with What’s Coming to Me! Tensei Koushaku Reijou Funtouki: Watashi, Rippa ni Zamaa sarete Misemasu!\nOne day, the Marquess’s daughter Julianne suddenly regained the memories of her previous life and reflected on her behavior up to this point.\nA life of luxury, bullying her siblings and stalking her fiancé…… A horrible personality and overweight appearance, devoted only to wrongdoings that belonged to the villainess of the novel she read in her past life.\nIn any case if it is a “serves you right” fate from now on, then it will be after I get a beautiful body and soul!\nShe, who thought this, started a diet together with showing a wholehearted devotion to her family —?!"]},{"title":"Royal Cinderella Mama – The Orphaned Fallen Noble Lady Is Cherished by the Merciless Emperor","tags":["Fantasy","Manga","Romance"],"disc":["Read Royal Cinderella Mama – The Orphaned Fallen Noble Lady Is Cherished by the Merciless Emperor / Royal Cinderella Mama – I Was Reincarnated as a Poverty-Stricken Woman but an Emperor Became Infatuated with Me!? / ロイヤル・シンデレラ・ママ　転生したら貧乏令嬢だったけど冷徹皇帝に溺愛されちゃいました!?","Rosalinde Baltzer was born as the only daughter of Baron Baltzer. Due to the former baron’s gambling addiction which landed them with many debts, they were forced to live in poverty, and were only nobility in name. Nevertheless, she was raised by parents who were extremely humble and loving.","However, when she was 14, her parents passed. After selling the only assets she possessed, which were her home and land, to pay the debts, she was left with nowhere to go. Thanks to her relative’s recommendation, she was able to acquire a job as a gardener for the royal castle’s back garden.","Rosalinde then decided to live quietly in the back garden, surrounded by her favorite plants. However…"]},{"title":"With a Strong-Willed Marchioness, Prince Yandere’s Love Offensive","tags":["Drama","Fantasy","Romance","Villainess"],"disc":["With a Strong-Willed Marchioness Prince Yandere’s Love Offensive manga,Douse Suterareru no nara, Saigo ni Suki ni Sasete Itadakimasu どうせ捨てられるのなら、最後に好きにさせていただきます\nAgnès has been engaged in an arranged, political engagement with Lucile since childhood and fell in love with him upon meeting him. Lucile however does not return these feelings and sees the marriage as purely political. Now adults, Lucile wishes to break off engagements and marry the one he truly loves, Agnès however will not go down so easily."]},{"title":"Little rabbit can’t escape her enemy after reincarnation!","tags":["Fantasy","Reincarnation","Romance","Shoujo"],"disc":["Little rabbit can’t escape her enemy after reincarnation!, Outei Denka no Okiniiri Tensei shitemo Tenteki kara Nigerarenai You desu!?, 王弟殿下のお気に入り 転生しても天敵から逃げられないようです!? :\nCountess Ashley lived her life as a black rabbit in the Demon Kingdom, but died at the hands of a brave hero. Now she’s reborn in the Tolpha kingdom, which is governed by his descendants. Suddenly, the crown prince Clyde becomes her fiancé. It’s impossible, he’s her enemy!? But Clyde is happy to embrace Ashley. “Give me a hug?” “I can’t!” When I see his face my heart skips a beat…Is it terror? Or is it love?"]},{"title":"Atelier Inbyeoldang","tags":["Drama","Gender Bender","Romance","Shoujo"],"disc":["Read Atelier Inbyeoldang / Inbyeoldang / Per Person / 花美男照相馆 / 인별당\nTo become a painter in an era of prejudice, Chae Hongkyung disguises herself as a boy and leaves for Gyeongseong. Despite her hatred of cameras, she’s drawn to the photos she sees at a studio called Inbyeoldang. After an interesting encounter with its owner, Joo Heon, Hongkyung accepts his offer to learn photography and work at the studio, which is on the brink of collapse. Will she fulfill her dreams, survive her new job, and most importantly, keep her true identity secret from her boss?"]},{"title":"Vampire Next Door","tags":["Fantasy","Josei","Romance","Vampire"],"disc":["Read manhwa Sillim-dong Vampire / Sillim Vampire","Nana Jeong, a new tenant in My Home Flat located in Sillim-dong. Her grandmother is a skilled shaman, but Nana doesn’t have the ability to see ghosts and she hates superstition. Because she likes good-looking guys so much, she goes out with a lot of weird guys. She comes to her senses, decides to begin her new life and gets a room in a flat. Then, she falls for Cheolsu, a good-looking resident next door. She gets very affectionate towards Cheolsu, and he says something shocking. —Actually, I’m a vampire?’” Jesus, am I supposed to believe that?!"]},{"title":"Office Gods","tags":["Comedy","Drama","Fantasy","Manhua","Office Workers","Romance","Webtoons"],"disc":["Read manhua Office Gods\nWhat’s it like to work at an office where all of your bosses are literal gods and goddesses?\nIris, a young human woman, is swept into the world of divine bureaucracy as a mailroom assistant in the corporate HQ of the Olympians themselves!\nBut this is no easy place for a human to be, and she’s already gotten off on the wrong foot with two handsome demigods: the fiery, short-tempered Dante, and the stoic but gentle Orion. As she grows closer to them both, can she keep her personal and professional lives separate while surviving Eros’ antics, Aphrodite’s temper, and Hermes’ pranks."]},{"title":"Heaven Defying Sword","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts","Supernatural"],"disc":["Read manhwa Heaven Defying Sword\nTo defeat his uncle who destroyed his family, the teenager Xuan Tian embarked on a martial arts training journey to hone his sword techniques. From a teenager who knew nothing to a Sword God of his generation, those he once saw as strong are now mere specks of dust to him. With one finger, I obliterate all; With my sword, I defy the heavens! And his path, leads him directly to the limitless heavens!"]},{"title":"The Meaning of You","tags":["Drama","Fantasy","Harem","Historical","Isekai","Romance"],"disc":["Read manhwa The Meaning of You / Your Meaning / Neoui Uimi / 너의 의미","Dayeon is… tired. She’s so tired that she’s been transported to a new world and she’s still too tired to do anything. But most of all, she’s tired of Emperor Mikhail’s near-constant attention! He’s just so perfect… always concerned about her well-being and shielding her from the church’s attempts to label her some kind of saint. And he keeps finding reasons to brush her hair behind her ear or stare dreamily into her eyes. How’s a girl supposed to sleep through all this endearingly loving attention?!"]},{"title":"Astra’s Dream","tags":["Mystery","Romance","Villainess"],"disc":["Dreams of Huang ji / 黄莨一梦\nThe background of the story is in Shanghai and London. How various characters meet up due to a strange tie of fate starting from 1920"]},{"title":"The Three Are Living a Married Life","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read manhwa The Three Are Living a Married Life / My Husband, My Sister, and I / My Husband’s Lover / 多余的妻子 / 세 명이서 결혼 생활 중입니다","On the night of her fourth wedding anniversary, moans were heard from her husband’s bedroom.","“Tell me I’m better than her, come on.”","It was the voice of her twin sister."]}]