[{"title":"A Deceiving Bride and The Fierce Lion","tags":["Drama","Fantasy","Romance"],"disc":["Read manga A Deceiving Bride and The Fierce Lion / Okoreru Shishi to Migawari Hanayome – Yorugoto, Anata ni Koi wo suru / 怒れる獅子と身代わり花嫁 / 怒れる獅子と身代わり花嫁～夜ごと、あなたに恋をする～"]},{"title":"Keeping My Boss on a Tight Leash","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance","Webtoons"],"disc":["Read manhwa Keeping My Boss on a Tight Leash / CEO, You Son of a Bitch! / 대표님 개자식!","Tangled up in some hairy business. Office worker Nahee is working late when she gets caught in the crossfire between her boss and a would-be assassin. She’s dragged into the secret world of human-animal shapeshifters, and it turns out her boss imprinted on her?! The two can’t stand being together but can no longer bear being apart!"]},{"title":"The Otherworld Patissiere’s Sweets Reform","tags":["Romance"],"disc":["Read manga The Otherworld Patissiere’s Sweets Reform","Emi had been passionate about making sweets since her childhood. However, her life as a patissiere came to an abrupt end when she was hit by a truck. When she awoke, she found herself reincarnated as Chantilly Merveilleux, the daughter of an earl, in a different world. She’s bullied by maids and her father treats her coldly, but worst of all… there are no sweets in this world!","“I can’t take this! If sweets don’t exist, then I’ll just have to make my own!”","With the determination to introduce sweets to this world, Chantilly leaves her home. She learns about an exam being conducted to hire chefs for the kingdom’s frail yet handsome second prince. Once hired as his personal patissiere, they work together to solve their problems using sweets. Over time, their professional relationship evolves into something else that’s completely different…"]},{"title":"The Alpha’s Replacement Bride","tags":["Drama","Fantasy","Mature","Romance"],"disc":["Read The Alpha’s Replacement Bride","To save her younger brother, Marchioness Harriet Goldlane became a substitute mate for Liam Almandine, the dying Alpha of the Almandine Pack. His mate died long ago and he currently had no heir. The pack wanted Harriet to give birth to a son from Liam’s seed so that their family would have a new leader after he died. Unfortunately, the Alpha was severely injured and could only wake up during full moon nights. Could Harriet accomplish her mission before Liam died? And what would happen when love blossomed between the two? PS: This story is uncensored (the initial chapters have lightsabers, but the later chapters are all uncensored. And the good news is, now they are working on uncensoring the early chapters too. So, I will wait until the early chapters are revised to publish them here.)"]},{"title":"The Silver Dragon’s Bride","tags":["Fantasy","Romance"],"disc":["Read The Silver Dragon’s Bride","As a young child, Lily was sold into slavery by her own parents, never knowing the meaning of freedom. With a scarred body and soul, she trudged through life, questioning the purpose of her existence. As Lily grappled with her grim fate, Sir Ortiz, the Captain of the Knights, unexpectedly entered her life. His kindness and encouragement breathed hope into Lily’s spirit, coaxing her to embrace the concept of living freely, a notion foreign to her battered heart. However, a profound secret cloaked Ortiz—he was not merely human, but also half-beast, a kind universally hunted across the country. Their paths, destined never to intersect in the ordinary course of life, have woven together in an extraordinary tapestry of fate. The half-beast and the slave girl have chosen each other, against all odds. But what destiny lies in wait for them?"]},{"title":"A Rose of Revenge","tags":["Fantasy","Romance"],"disc":["Read manga A Rose of Revenge","Cosette lived a poor life alongside her mother.\nOne day, she finds out she was born to a Count as his hidden child.\nTo get revenge on this nobleman who harmed her mother, Cosette disguises herself as a boy named “Gilbert” and declares she will become the heir to the Count’s family, aiming to become the perfect noble child while hiding her gender.\nBut one day, at a ball, the gentleman Wolff discovers that she’s a woman, pulling her into the nobles’ waves of malice. Will Cosette be able to successfully exact her revenge?"]},{"title":"He’s Now Healthy-Perhaps Too Much","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa He’s Now Healthy-Perhaps Too Much / The Terminally Ill Obsessed Male Lead Has Become Very Healthy / 余命わずかのヒーローが元気になっちゃった!? / 시한부 집착 남주가 너무 건강해졌다"]},{"title":"To Take a Mermaid’s Heart","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa To Take a Mermaid’s Heart","You tore out my heart. Now, I must find out why. The humans of the Bavenberg Empire and the sea people called mermarcs have been embroiled in a bloody war for over a decade. When a truce is finally called, a young half-mermarc girl called Cordelia is sent to the imperial palace as a token of peace. As the years pass by, she befriends the imperial prince, Noah von Bavenberg, and the lady-in-waiting, Melina von Hannover. She has everything that she could want or need, except for one thing – the ability to set foot outside of the imperial villa. Despite this, Cordelia spends her days free from care, surrounded by the love of her friends and the generosity of the emperor. However, on her 18th birthday, Cordelia’s life takes a dark and twisted turn. After a horrific incident, she finds herself transported two years back in time. Can Cordelia remove the veil from her eyes to discover the sinister truth behind the empire? Will she be able to save herself from the inevitable events to come?"]},{"title":"The adopted daughter-in-law wants to leave","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The adopted daughter-in-law wants to leave / The Duke’s Darling Daughter-in-Law / 입양된 며느리는 파양을 준비합니다 / Adopted Daughter-in-Law Is Preparing to Be Abandoned / I Don’t Want to Be the Duke’s Adopted Daughter-in-Law / No quiero ser la nuera adoptiva de duque / Não quero me tornar a nora adotiva do duque / Прийомна невістка готується до удочеріння / 以儿媳身份被领养 / 被领养的儿媳","I have possessed the body of the extremely cruel villain who tormented the male lead while in the orphanage.\n“Just don’t do that”\nI thought so. But it looks pitiful that he keeps getting beaten up by the other kids, so I’ll keep an eye on him for a bit.\n“The child next door. I will also adopt that child”\n“Am I adopted?”\n“No, I will take the position of daughter-in-law”\n…Like that, the male lead and I were adopted together. But how can that be? And the female lead!\n***\nAs expected, the male lead joined his adoptive father to join the war. And when he returns, he’ll be with the original heroine.\nI prepared very carefully for divorce and deportation from my family. With both in the past time, I have made a lot of money! But…\n“Damian, did you go home alone? Did anyone else come with you?”\n“Others?”\nDamian’s gaze suddenly sharpened at my question.\n“This is so awkward, Ellie. Are you looking for a man other than your husband?”\n“Huh?”\n“No way. I would probably kill that man out of jealousy.”\nI looked over to my father-in-law for help.\n“I also agree. Ellie shouldn’t betray her husband somewhere.”"]},{"title":"I Found a Husband When I Picked up the Male Lead","tags":["Comedy","Drama","Fantasy","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Found a Husband When I Picked up the Male Lead / The Rewards of Marriage / 니 남편이 생겨버렸다","Her family used all their money for her extravagance and luxuries and brought a crisis of bankruptcy.","While trying to figure out how to pay off their debts, she found a leaflet from the duke looking for a lost child.","The reward is so much money that you can play and eat even after you pay off your debts!","Following the memories of reading this book, right away, Lizelle picked up the boy who was caught in a tr*sh in a poor village.","She took the lost Lapel and went to the duke.","“This is the child the Duke is looking for.”","Duke Chester said, looking at me with a doubtful glance.","“I need confirmation, so you should stay with my child in this house for the time being.”","The strange cohabitation of the three people started like that.","However, Lapel keeps thinking of me as a mother and won’t let her leave.","*","“Let’s get married.”","Lizelle was startled by the unexpected words.","“Are you insane? Did you drink?”","“1 year. If you perform a contract marriage for one year, I will pay you 10 times the amount of the rewards you were given.”","“Can I call you honey?”","And the contract marriage and marital life began.","But why are my eyes constantly changing?","Why do you keep coming every night!"]},{"title":"I Made a Contract With a Dragon to Get Revenge on My Mother","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Made a Contract With a Dragon to Get Revenge on My Mother / 어머니에게 복수하려 용과 계약했습니다"]},{"title":"The Devil","tags":["Drama","Historical","Manhwa","Romance"],"disc":["Read manhwa The Devil / Lady Devil / Magwi / The Devil (Ena) / 魔鬼 / 마귀 / Ma’gwi","The princess trapped in the tower brings in a marriage. Her husband has killed his ex-wife several times. The frightened princess eventually wakes up the sarcophagus in the basement and calls out the devil…. “I don’t want to marry him, Raven.”"]},{"title":"A Blood-curdling Lifestyle","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa A Blood-curdling Lifestyle / 피말리는 과대생활","“The life of constantly being compared to my older sister is over. I’m the main character now!” Shin Seonha enters college with big dreams. “However, I thought there was something strange about this department, but who would have thought that everyone here was a vampire…!!!” Seonha’s blood-curdling college will now begin with her new vampire classmates."]},{"title":"I Ended Up Saving My Crazy Stepfather!","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa I Ended Up Saving My Crazy Stepfather!","“No… Mom, don’t die.”","This is the tenth life.","I’ve witnessed my mother’s death nine times, but it never gets easier.","Thud, thud.","I hear footsteps approaching from afar, and I hurriedly draw a magic circle.","Finally, I’ve succeeded.","At last, we’ve escaped from the emperor who abused my mother and me!","“What are you?”","A man as handsome as if he were sculpted by the gods.","This is Duke Abellant, the man I’ve been searching for.","“I found you in one go. I’ve found my candidate for a dad!”","“…What…? A dad candidate?”","“Yes! Raise me and my mom!”","I didn’t care about the bewildered look he gave me.","He’s the person I’ve chosen to be my dad candidate.","“I’ll make you emperor!”","“Huh…?”","“I’m strong!”","You need me, I’m sure of it.","So, please take care of us!"]},{"title":"Yeonwoo’s Innocence","tags":["Comedy","Romance","School Life"],"disc":["Read manga Yeonwoo’s Innocence / 연우의 순정\nYeonwoo possesses such a delicate appearance that he could be mistaken as a female student. However, he has a secret crush on the school idol, Gang Haesol. But the shy and timid Yeonwoo has never said a word to her…"]},{"title":"Mightiest Melee Magician","tags":["Action","Adventure","Drama","Fantasy","Magic","Manhwa","School Life"],"disc":["Read manhwa Mightiest Melee Magician / All Powers Wizard / 올 힘 마법사"]},{"title":"Miss Forensics","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Miss Forensics / My Dear Forensic Lady / Wo Qin’ai De Fayi Xiaojie / 我亲爱的法医小姐","Lin Yan, a cold and arrogant female forensic expert, meets Song Yuhan, a righteous and sharp female detective. From being incompatible to becoming friends, they witness the lives of many ordinary people along the way: a young girl who struggles to survive but dies innocently, an old mother who waits for her criminal son to return in the mountains, a timid policeman who faces a gun-wielding robber bravely… They fight for the rights of the living, speak for the dead, and vow to uncover the truth that has been silent for years."]},{"title":"Trash of A Dark Fantasy","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Trash of A Dark Fantasy, I got transmigrated to a dark fantasy MMORPG and became the ruined character I raised, 다크 판타지의 망캐가 되었다","<Character Deletion Rejected>\nNot impossible, but rejected…? I didn’t even give myself time to think, I opened my eyes in the middle of a swamp. As a trash character, I leveled.\nA brutal and ominous world. Filled with those who worship chaos and abyss, rushing towards the brink of destruction in a dark age.\nThis is the story of a survival journey in the dark fantasy, the survival of a trash character."]},{"title":"I Cultivated A Nemesis","tags":["Action","Adventure","Fantasy"],"disc":["Manhua to read I Cultivated A Nemesis, Wo Peiyangle Sudi, Wǒ Péiyǎngle Sùdí, 我培养了宿敌 at manhua website","The demon king possesses a return ability, but is continuously killed by his nemesis, finally, he chooses to return, but then becomes the older brother of his nemesis. He decides to use his abilities and raise his nemesis to become useless, but this began to go in an unexpected direction"]},{"title":"The Life Goal Is to Get a Two-Story House","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Tragedy","Webtoons"],"disc":["Read manhwa The Life Goal Is to Get a Two-Story House / 이번 인생 목표는 이층집 마련","No one will love you’ ‘No one will trust you!’ Her father’s frequent business failures made Jia suffer from the hardships of her life, and the affair of her boyfriend of six years led her to her death. ‘If there is a next life…’ She thought it would end like that. By the way… “Maylin, are you awake? Are you okay now?” Due to a long civil war, she is reincarnated as ‘Meirin’, a refugee girl who moved from Helleniton to Farrington. Will Jia, who has become Mei Lin, become rich in her life and will be able to achieve her dream of owning a house?"]}]