[{"title":"I Am a Child of This House","tags":["Fantasy","Romance","Webtoons"],"disc":["Read manhwa Anak Keluarga Ini / Appartengo al Casato dei Castielo / I Am a Child of This House / I Belong to House Castielo / I Belong to This House / J’appartiens à la Maison Castielo / Pertenezco a la Casa Castiello / Pertenezco a la Casa Castielo / Sou filha desta casa / Soy una hija de esta casa / Tôi là tiểu thư của gia đình này! / Я – дитя этого дома / أنا طفلة من هذا المنزل / ข้าเป็นลูกสาวท่านดยุค / ある日、私は冷血公爵の娘になった / 我是这家的孩子 / 我是這家的孩子 / 나는 이 집 아이","11-year-old Estelle never imagined she’d be sold off by her own mother. But the buyer is the one and only duke in the empire, Ein Castielo… and he’s Estelle’s father?! Feared across kingdoms for his blood-red eyes and the immense powers of his magical lineage, Ein is the cold master of House Castielo. His sworn enemies and dashing knights could become Estelle’s, but does being his rare daughter really mean she is a child of this house?"]},{"title":"I’ve Been Here From the Beginning","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga I’ve Been Here From the Beginning / Here From the Start / I Was Here From The Beginning / I’ve Been Here Since The Beginning / 처음부터 여기 있었는데요 / 最初からここにいたんですが\nDon’t do it too much.\nPoor Maid The next day commented on the pitiful side of the maid that even the author had forgotten.\nHe took possession of that poor maid, Maria Mayer.\nDue to the convergence of its presence to zero, it even acquired the title of ghost.\nI still thought I could do my job with sincerity, but people interested in her started appearing.\nEven future princes and grand dukes!\n“Can’t you feel the presence? What the hell is your identity? ”\nWith Crown Prince Elias half-concerned and half-wary about Maria’s identity, he wanted to keep her around.\n“It doesn’t matter that I don’t remember. In the future, you can be sure that you will not forget me. ”\nArchduke Dietrich approached with a smile as if he already knew it even though it was his first time seeing it.\nI, I …… I’m just an ordinary maid 1 (Special: Ghost)! *\n“Where are you looking?”\nA dark shadow slowly appeared behind the man.\n“It’s just an afterimage of me.” nice. it was famous."]},{"title":"I’ll Become the Tyrant’s Tutor","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life","Webtoons"],"disc":[]},{"title":"I’m Being Shipped With the King of Film!","tags":["Comedy","Drama","Manhua","Romance","Webtoons"],"disc":["Read manga I’m Being Shipped With the King of Film! / Quan Wang Dou Shi Wo He Yingdi CP Fen / Seductive Fox Spirit / The Internet Are Character Pair Fans of the Movie God and Me / Toàn Mạng Đều Là Fan Cp Của Tôi Với Ảnh Đế / 全网都是我和影帝CP粉"]},{"title":"The Young Lady I Served Became a Young Master","tags":["Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manga The Young Lady I Served Became a Young Master / The Lady I Served Became a Master / 모시던 아가씨가 도련님이 되어버렸다\nFour years have passed since the original heroine ended her life as a maid. A handsome man came to visit. That too, a man who looks like the lady I used to serve.\n“I’m here to keep my word, Blair. You said you’d be with me forever.”You don’t say… Miss?”\nAt the moment, the man’s red eyes turned round. Just around the corner, he tilted his head and kissed his hair. And whispered. In a very sweet and beautiful voice, “Now call me Master.” ……yes?"]},{"title":"Sweet Enemy","tags":["Romance"],"disc":["Read manga Sweet Enemy","She only loves three things in her life: money, saving money, and running all kinds of errands to earn money! Ms. Errand Runner, at your service!\nWhat? You want her to spy on the handsome and rich young man who’s going to have a blind date with you? That’s a piece of ca… catastrophe.\n“Mission failed, asset snatched away by the target.”\n“How?”\n“They… they are engaged…”"]},{"title":"You Can’t Change A Person!","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa You Can’t Change A Person! / Humans Can’t Be Changed! / 사람은 고쳐 쓰는 게 아니야!","I’m the first human created by God. As I took for granted the love that I received, I never gave love to others.\nOne day, God appeared before me and gave me a riddle.\nUntil I answer that riddle, I am unable to die.\nThis time, I will definitely find the answer. But… “Bwaa!” I reincarnated into the baby princess’ body?! I’m screwed!"]},{"title":"Monday to Weekend","tags":["Comedy","Office Workers","Romance"],"disc":["Read manhua Monday to Weekend / From Monday to Weekend / When Monday Met Sunday / 周一至周末","The urban workplace light comedy begins! From Monday to weekend, the daily laughter continues to be the\npoorest and richest second-generation Husky x urban violent temperament strong woman when a Husky becomes a subordinate, there is no misfortune!\n“Promotion! Salary increase! Train (?) a Husky!”"]},{"title":"A Gate Opened on my First Day as a Politician","tags":["Action","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa A Gate Opened on my First Day as a Politician / A Monstrous First Day / 任期初日にゲートが開いた / 임기 첫날에 게이트가 열렸다"]},{"title":"The Circumstances Between the Duke and His Maid","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family","Shoujo"],"disc":["Read manhwa The Circumstances Between the Duke and His Maid / 그 공작님과 그 메이드의 사정"]},{"title":"Murderer Llewellyn’s Enchanting Dinner Invitation","tags":["Historical","Mystery","Shounen Ai","Thriller"],"disc":["Read Murderer Llewellyn’s Enchanting Dinner Invitation / Murderous Lewellyn Candlelit Dinner / 살인마 르웰린 씨의 낭만적인 정찬 / 杀人魔罗威尔的浪漫定食\nShevon is a writer who lives in a run-down apartment in the streets of the slums. One day, strange memos start showing up at his front door. Before he can uncover the mystery behind them, he encounters a beautiful young man that keeps peeling onions on the staircase next to his unit. After accepting a dinner invitation from the young man, Shevon discovers a dead body in his host’s bedroom…"]},{"title":"Heaven Guards","tags":["Action","Fantasy","Manhua"],"disc":["Read Heaven Guards, Lit The Supreme Being , Lit The Supreme Being , Againts the Sky Supreme\n“Those who hurt my relatives, kill! Whoever snatches my woman, kill! Dare to pretend to be forceful in front of me? You have to kill even more! After the end of the world, Tan Yun finally remembered his identity-when I woke up, the whole world Will tremble under my feet!”\nSource: Google translator"]},{"title":"Yes, My Queen","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read Yes, My Queen / 예스! 마이 퀸 [ 완결]","William Castle’s topnotch school for aristocrats is famous for its association with many rich and prestigious political circles around the world. One day however, a girl named Mickey enrolled in this school and was confronted by the prince regarding everything. What’s the reason behind her transfer into this school? And what will happen between Mickey and the two princes in school?"]},{"title":"Backstage Kiss Scene","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read manhwa Back Stage Kiss Scene / Baeg Seuteiji Kiseu Sin / Baegseuteiji Kiseusin / 国民女神外宿中 / 백스테이지 키스신","Korea’s top actor Yun Gaeul is a national younger sister, an actress who holds the title of zero anti-fans. But then she suddenly retired! The Republic of Korea turned upside down. And the place she showed up at was in front of a small house where two men live! Somehow, the heart of the three starts tickling strangely in the life of a house that started without notice?!"]},{"title":"My big boss daddy’s","tags":["Manhua","Romance"],"disc":["Read manhua My big boss daddy’s / 我有五个大佬爸爸","When the young monk Ji An Ruan, who didn’t know her life experience, she was five years old, she was taken down the mountain by the master who raised her to entrust her to five dads who she hadn’t met. Relying on her cuteness, Ruan Ruan successfully moved to come to survey the environment but unexpectedly met Ruan Ruan’s first father-Mu Shen. Mu Shen, who originally disliked children and didn’t think he would have children, was gradually conquered when he got along with her, and became a standard dad"]},{"title":"To My Dear Wolf","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa To My Dear Wolf / To My Beloved Wolf / 사랑하는 나의 늑대에게"]},{"title":"Ark The Legend","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Ark The Legend / 아크 더 레전드","After standing at the top of the game, “New World”, Ark, aka Kim Hyeonwoo, spent boring days as an advisor and director. One day, he heard from the NIS that Lucifer, an artificial intelligence who was his rival in New World, has escaped to the real world. Lucifer, who has illegally occupied nuclear generators, invites Ark to the new space game, ‘Galaxian’. [User Ark from New World must participate in this competition.] Ark, the strongest player in New World, enters the game in order to stop Lucifer… [The durability of the alloy dagger has reached its limit.] [I lost my alloy dagger.] Ark lost his only belongings and got stuck in the tutorial. Space newbie life is not as easy as you think, can Ark meet Lucifer?"]},{"title":"Rose Castle’s Elise (The Elegy of Roses)","tags":["Adaptation","Adventure","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoon"],"disc":["Read manga The Elegy of Roses\nThe main character is Iruri.\nShe was transported to another world through a dream and possessed Tineke’s body. It was a young noble of a certain kingdom.\nShe tries to leave the mansion to get clues to return to the real world.\nHowever, in a strange world where Elma, the girl who follows Tineke, always steps on her, and has no one to trust, Ruri is helpless…\nWill Ruri be able to finish her journey and return home safely?"]},{"title":"Haechi’s Princess","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read Princess Haechi’s Princess / Soyang and Haechi / Soyang Princess and Haechi / 소양공주와 해치","What if a myth from 300 years ago wasn’t just a myth? According to Joseon legends, it has been told that Haechi, the youngest son of the Jade Emperor, was inseparable from the Princess So-yang. Following the recent discovery of the princess’s tomb, Lee Young-gwang is chosen to curate the exhibition. However, it seems there were more than just ruins in the tomb that was excavated… Haechi reappears in modern-day Korea to search for his princess. Will he be able to find her? And is Young-gwang ready for the adventure that awaits her, full of danger and centuries-old vengeance?"]},{"title":"Nancheng Waits for the Moon","tags":["Drama","Romance"],"disc":["Read Nancheng Waits for the Moon / In Nancheng to Wait for the Returning Moon / Nam Thành Chờ Trăng Về / Nancheng Dai Yue Gui / Nánchéng Dài Yuè Guī / 南城待月归 / 결혼을 훔쳐버렸다","Determined to tear down the angelic b*tch faker and the homewrecker, Shen Yugui, a returning professional, master hacker, and elite martial artist would do all she can to play dumb, win the heart of the icy CEO, and climb toward the summit of her life!"," "]}]