[{"title":"The Villain’s Savior","tags":[],"disc":["Read manhwa The Villain’s Savior / Ag-yeog-ui guwonja / Спасительница злодея / 악역의 구원자 / منقذة الشرير"," "," "]},{"title":"Lan Ke Qi Yuan","tags":["Action","Adventure","Manhua","Martial Arts"],"disc":["Lan Ke Qi Yuan, Lan Ke Ji Yuan\nLan Ke Qi Yuan is a Manga/Manhwa/Manhua in (English/Raw) language, Action series This Comic is About “Leaves fell on the chess game by the side of Rotten Ke, and the old trees played against each other due to the uninteresting son of Tian Yuan, and then looked back on the vast mountains and seas… When he woke up, Ji Yuan became a half-blind beggar in a dilapidated mountain temple. The sword, the sacred stick and one mouth are the foundation for Ji Yuan to settle down in this terrible world.”"]},{"title":"Immortal Swordsman in The Reverse World","tags":["Action","Adventure","Fantasy","Harem","Manhua","Martial Arts","Romance","Supernatural"],"disc":["Read manhua Immortal Swordsman in The Reverse World,\nQing is a sword expert cultivator, who 300 years ago accidentally entered the fairy world. During those 300 he began his cultivation journey. At the time of reaching the realm of eternity, it was not expected that he would instead open the hall of time and space and return to earth at the age of 17 years. But when he saw the situation, it turns out it was not the earth he once lived in, but the world was reversed between the roles of women and men. How was his journey to find a way to return to the original world, and defeat and conquer the strong women in the world …"]},{"title":"Faking It In Style","tags":["Comedy","Fantasy","Manhwa","Romance","Slice of Life","Webtoons"],"disc":["Read manhwa Faking It In Style  / 쇼윈도의 품격","Suah is a petite, red-haired designer who leads a drama-free life… until one morning, she wakes up tied to a chair. The man scowling down at her is none other than her roommate’s scary older brother, Seung-hyun, the owner of the apartment she’s been living in rent-free for the past eight years. He gives her one week to pack her bags and move out. Panicked Suah tries to plead and beg, but the coldhearted Seung-hyun’s got the upper hand. That is, until he runs into Suah at work. Turns out she’s not only an essential member of the new team he put together, but also one of the best employees he’s ever worked with. Like it or not, the two are stuck with each other for the foreseeable future… Can Suah convince Seung-hyun to let her stay? And how will Seung-hyun keep things professional with the woman he wants to kick out of his house?"]},{"title":"Why Are You Doing This, Shinseonnim?!","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Why Are You Doing This, Shinseonnim?! / 왜이러세요 신선님 / Why Are You Doing This, Freshman?!"]},{"title":"Wrong Confession ( A False Confession )","tags":["Drama","Fantasy","Romance","Shoujo","Webtoons"],"disc":["Read False Confession/ A False Confession / Wrong Confession / 你的告白已签收 / 错位告白 错误的告白 / 잘못된 고백","I confessed. I couldn’t do it while sober so I took a shot of liquid courage. “I like you.” “Why?” “I just like everything about you.” “… I don’t understand.”"," "]},{"title":"The Secret Queen","tags":["Drama","Harem","Psychological","Reverse harem","Romance","Smut","Webtoons"],"disc":["Read manhwa The Secret Queen / The Secret Monarch / 그녀, 비밀의 군주","Praised solely on her looks for years, Lia was eager to put everything behind her and start anew… Until she got kidnapped and tossed into the harem of an unknown ruler. Desperate and afraid, Lia makes a deal with Karian, the handsome yet ruthless regent to the king, who seems strangely drawn to her. Will Lia be able to keep up appearances as Karian’s concubine long enough to search for the hidden assassin in their midst? And once she does, will that be the very leverage she’ll need to make her escape?"]},{"title":"Romance is a bonus book","tags":["Comedy","Drama","Romance","School Life","Slice of Life"],"disc":["Read manhwa Romance is a bonus book / 로맨스는 별책부록\n“Sister” “I don’t want to go back.” “Tell me where you want to go.” “ I’ll take you there.” “If there’s a day I want to turn around, that’s the moment. If I didn’t go back to the wedding hall that day. I wish I had gone somewhere far with Eunho.” Dan-i, who came back as a divorced woman, started living with Eun-ho. Eun-ho accepts her as his noona Dan-i. The second chapter of Kang Dan’s life. And romance is a bonus book!"]},{"title":"A Night With The Emperor","tags":["Comedy","Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manga A Night With The Emperor /One Night With The Emperor / Overnight With The Emperor / 황제와의 하룻밤 / His Majesty’s Proposal\n24-years-old Penelope.\nA beautiful daughter of a baron on the outside, a swearing old lady on the inside!\nBut the man who she spent the night under the influence of alcohol… was the Emperor?\n“Damn it, that man is everywhere.”\n“I’ll make sure to get my hands on her.”\nExperience the youthful heart-fluttering romance fantasy of the two!"]},{"title":"Another’s Love Story","tags":["Drama","Romance"],"disc":["Read manhwa Another’s Love Story /남의 사랑 이야기 / A Love Story Of A Person / Love Story / Another Person’s Love StoryA deep love that I wanted to try even if I was in pain, hurt and resigned. I had an unexpected encounter when I thought I wasn’t lucky. Will it be love this time?\nFollow the story with us and don’t forget to leave your comments. Hope that you will always support us <<teenmanhua.com>> thank you very much!\nAnother’s Love Story – manhwa new"]},{"title":"The Emperor Reverses Time","tags":["Drama","Fantasy","Historical","Romance","Time travel"],"disc":["Read manhwa The Emperor Reverses Time / 그 황제가 시곗바늘을 되돌린 사연","After Empress Lizzie died, Emperor Leon realized his folly. It is belated regret, the time that has passed never comes back.\nBut not….\nWith Leon’s wishes, the Clock Tower Witch travels back in time to the day Leon first met Queen Lizzie. Leon has returned to the past, and tries to make Lizzie happy.\nBut the effect of going back in time was bigger than he thought. Can Leon make Lizzie happy?\nWhat’s interesting in this story is that the male lead is the one who will make amends with the female lead by going back in time and trying to win her over, not the other way around."]},{"title":"Breed My Dear Enemy Season 2","tags":["Comedy","Drama","Fantasy","Historical","Romance"],"disc":["Read manhua Breed My Dear Enemy Season 2 / Breed My Dear Enemy / Guiding a Rival to Become the Emperor / How to Raise an Enemy / Our Binding Love: My Gentle Tyrant / Raising the Enemy Only Brings Trouble / 악당이지만 남주를 키웠습니다 / 养敌为患2：恶女归来 / 强制欢宠：我的温柔暴君 / 転移お嬢様は導きたい！ / 养敌为患","Season II is coming!\nOn the day she transmigrated, she killed the male lead?!\nA domineering young lady X a scheming crown prince\nTheir love story now begins!","Transmigrating into the world of the book, she became a supporting female role who died distressingly. Ain’t got no that for this game! The female lead decided to kill the male lead, destroy the world and get out of here! When she faced this scrawny little boy, she just couldn’t do it… What should she do? Raised up this boy as her helper? An excellent idea! But this boy didn’t grow up as a righteous man as she expected! Could she restart again?"," "]},{"title":"Is this Hunter for Real?","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Is this Hunter for Real? / Monster Streamer for Gods / 이 헌터 실화냐?\n[From the author of “FFF-Class Trash Hero” and “Is This Hero For Real?”: ]\n“God is always watching you.”\n“There is no such thing as God in this world!”\n[A certain God is confused]\n[Viewers: 1]\nWhen the weird message appeared in front of me, I was reminded of my father’s words…\nHe was right."]},{"title":"Newbies","tags":["Comedy","Drama","Josei","Romance","School Life"],"disc":["Read Newbies / 正值青春的我们 / 純情シェアハウス / 풋내기들","Saebeom, 20 years old, moves into a share-house, nervous and excited, in spring before her first year in college. She meets Heejoo, a roommate with a unique personality, and even a Choi Rawook look-alike. It’s a story about the lives of our enthusiastic, immature, 20 year old selves! Would you like to come to our share house full of the first love excitements?"," "]},{"title":"Return of the Female Knight","tags":["Action","Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa Return of the Female Knight / 回归的女骑士 / 穿越的女騎士 / 돌아온 여기사","Elena, who spent her entire life as a cold-blooded female knight to avenge her family, ended up dying without claiming her revenge. When she opened her eyes she found that she went back into the past. By day she was a lady in a dress, and at night she carried a sword to change history and prevent her family’s destruction. “I want to marry you, Your Highness,” she said to the crown prince. She would do this to save her family."," "]},{"title":"The Big Player of the Demon Clan","tags":["Action","Adventure","Fantasy"],"disc":["Read manga The Big Player of the Demon Clan / The Top Player From The Demon Clan / 魔门大玩家"]},{"title":"The Empire’s Hidden Hope","tags":["Adaptation","Comedy","Cooking","Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read manhwa The Empire’s Hidden Hope / Flower Hidden in the Palace / Hidden Flower in the Palace / 宫墙里的花 / 궁에 숨은 꽃","Han Wol is known as one of the military’s finest young men, but… Wol is a woman! After her father was framed for the former emperor’s murder, she narrowly escaped execution by disguising herself and hiding in plain sight. Since then, the empire has been under the thumb of chief state councilor Shin, but the young emperor is hatching a plan to take back control. As the only one who holds the key to unlocking the mysteries of the past, it looks like Wol’s days of laying low are over…"]},{"title":"The cursed princess fell in love with a witch","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Villainess"],"disc":["Read manhwa The cursed princess fell in love with a witch / 저주받은 공주가 마녀와 사랑에 빠졌다네요","",""]},{"title":"Head Start at Birth","tags":["Action","Adventure","Fantasy","Romance"],"disc":["Read Head Start at Birth / 0 Saiji Start Dash Monogatari / 0 Sai Ji Start Dash Monogatari / 0 Years Old Child Starting Dash Story / 0-sai Ji Start Dash Monogatari / 0歳児スタートダッシュ物語  / Zero Sai Ji Start Dash Monogatari / Zero Saiji Start Dash Monogatari","Lilia, a generous marquess’ daughter, can not only use magic, but is also good at territory management. Having a strong gamer spirit, Lilia finds out about the existence of magic in the world where she was reincarnated and remembers her previous life in a different world. Even though she was still a newborn and could not even walk, she started to actively develop her abilities. As a result, she can excersize advance magic, control high-ranking spirits, and actively participate in the management of the marquess’ premises. No matter whether this world is a RPG or a ranch game, this cheat is unbeatable! Lilia cannot go unnoticed by the royal family who invite her to have a birthday party at the court. Could it be that this is an Otome game involving political marriage with the princes?! Just please don’t make her the villainess!!!"]},{"title":"Princess, Don’t Ruin Your Public Persona!","tags":["Liexing","Manhua","Ping Ping Jun","Romance"],"disc":["Read manga Princess, Don’t Ruin Your Public Persona!","Gee! What would you do if you wake up and find yourself become a new born baby overnight? I guess I have to re-live my childhood again. Fortunately, i am reborn in the noble family of Grand Secretary. I guess I should seize this chance and establish my own career! My family dote on me, my friends support me, and my princes charming fancy me. Wait… How am I supposed to choose from the emperor and the crown princess? And I am not interested in being the d*mn empress! All I want is money money money!"]}]