[{"title":"I Will Remove Them From My Life","tags":["Action","Adventure","Drama","Fantasy","Manhua","Manhwa","Martial Arts","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Will Remove Them From My Life / 그것들, 내 인생에서 삭제합니다 / I Will Delete Them From My Life / I’m Deleting Them From My Life","I was strangled to death by my cheating husband when I asked for a divorce. I thought that would be the end of my painful life. “I’m young…?” When I opened my eyes again, I went back to being a 12 year old daughter of count who had no power and couldn’t speak. My uncle who watched for an opportunity to swallow the Count. An audacious housemaid who thought that they became the owner. Furthermore, a maid who steals mother’s belongings? ‘I won’t live like this again, I can’t!’ One life spent being used, suffering, and dying in vain was enough. Those who made my life torture. ‘I will delete them all from my life.’"]},{"title":"The Previous Life Murim Ranker","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts"],"disc":["Read The Previous Life Murim Ranker , Reincarnation of the Murim Clan’s Former Ranker 무림세가 전생랭커\nThe Strongest Guild, Griffin! SSS Ranker Gang Tae Ha challenges them alone! But he meets his death after a fierce battle. However… “…I am this pig?” I open my eyes, and it’s Murim? I am Yu Shin Un, the ruffian of Baek Un Clan? A chaotic situation with no time to rest. In the midst of incoming death! “You guys have no idea who I am?” Necromancy from former life. Martial arts from current life. He who wields both power! Now shakes the destiny of the World!"]},{"title":"Damn Demonic Swords","tags":["Action","Adventure","Comedy","Fantasy","Manhwa"],"disc":["Read manhwa Damn Demonic Swords, Cursed Demonic Swords, Damned Demonic Swords, The Demon Swords of Condemnation, The Magic Swords of Damnation, 빌어먹을 마검들","Signature Jagger is a warrior who lives with the creed, ‘Pay back gratitude two fold, resentment ten fold!’ actively avoiding troublesome matters.\nUnsure if it’s coincidence or inevitable, he is followed around by demonic swords who have turned into young girls by getting into all sorts of twists and turns…\nWarrior of doom Signature Jagger, if you can’t avoid it, then slay everything in the path!"]},{"title":"Number One Beast Master","tags":["Action","Adventure","Fantasy"],"disc":["Read Number One Beast Master","Number One Beast Master – A worldwide mutation unfolds, and magical beasts invade, threatening humanity’s very existence.\nBeast Tamers now shoulder the monumental duty of protecting human civilization from destruction.\nAfter being transported to this new reality, Xiao Xingyu awakens the [Divine Beast Taming System].\nWith the Eye of the Demon God, he can discern every hidden evolutionary path of beasts, awaken their dormant bloodlines, and unleash boundless evolution…\nA mere husky transforms into the fearsome Hell Asura Wolf! A tiny sprite mutates into the legendary Twelve-Winged Seraph!\nHatch a dragon egg, and summon the awe-inspiring Nine Nether Candle Dragon!"]},{"title":"Royal Shop of Young Lady","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read manhwa Royal Shop Of Young Lady / Lady Chef Royale, 로열 셰프 영애님 / The Young Lady Is a Royal Chef / Royal Chef Young Lady","As a chef at a small knight’s restaurant, I became the nuisance youngest daughter of a powerful man who was afraid of the emperor. I tried to run away with all my travel expenses… It’s strange. “If you say you’re sorry, are you that shameless?” “That’s because I’m your brother.” “Why don’t you take Grandmother on a stroll?” Why is everyone so nice to me all of a sudden? “Why do you want to take out someone’s eyeballs when they see me?” People who had caught me trying to escape. I’m just cooking. What’s wrong with you?"]},{"title":"To Your Moralless [Complete Edition]","tags":["Mature","Romance"],"disc":["Read manhwa To Your Moralless [Complete Edition] / 배덕한 타인에게 [완전판]","A story of abnormal and crazy love between sociopath Park Chi-gyeong and daring, indifferent woman Kang Tae-ri, based on Hirachell’s original work. At the police station, where Tae-ri goes to report her colleague, she is offered a large settlement by a man she meets for the first time. Unlike her immature peers, this man, Park Chi-gyeong, exudes a dangerous aura. Tae-ri, who rejects the settlement, becomes a bothersome existence to Chi-gyeong, who has lived his life controlling everything. From their first meeting, they become thorns in each other’s sides. The obsession of Chi-gyeong, who tries to break Tae-ri’s resolve, and Tae-ri, who refuses to lose, only deepens with time…"]},{"title":"Beneath the Surviving Princess Joyful Facade","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Beneath the Surviving Princess Joyful Facade / 살아남은 왕녀의 웃음 뒤에는","“Very good. I shall give you my beloved sister, whom I cherish dearly.” Eric Chladnie, who led the long war to victory against the Shidate Principality, received the mandate to marry a foolish princess as a reward for his triumph. After the wedding ceremony, Eric returned to the mansion with the newlywed princess. Amidst the princess’s eccentric behavior, his father attempts to kill her and his mother advice not to give his heart. Only he, treating her like a child, respects and cherishes her as his wife. However, who is this woman who, in front of the king, impersonates deeds that she has never done and acts piously?"]},{"title":"Absolute Sword Sense","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Absolute Sword Sense","After being given up on by his family because his dantian was destroyed, Soh Woonhwi was kidnapped by the Blood Cult and lived as a third-rate spy. One day, he died while being used to find a legendary sword immortal’s secret records. However, he returned to the day he was kidnapped ten years ago and obtained a mysterious ability that allowed him to hear the voice of swords."]},{"title":"Her Marriage Was Called Off at Daytime, the Cutely Fierce Commander Asked Her For a Hug at Night","tags":["Drama","Fantasy","Romance"],"disc":["Read Her Marriage Was Called Off at Daytime, the Cutely Fierce Commander Asked Her For a Hug at Night","Huo Yichang and Su Wan, the daughter of the Su family in the third district of the Federal Empire, had been childhood sweethearts, but on the wedding day, the groom ran away! Groom gone? Then change him! Su Wan bumped into a handsome man with furry ears and a big tail at the corner of the corridor. His big wet eyes looked at Su Wan expectantly. Su Wan immediately decided that he was the one! They registered for marriage and went through the wedding ceremony in one go! But they found out that he was the first commander of the empire?"]},{"title":"The Constellations Are My Disciples","tags":["Action","Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Constellations Are My Disciples / 성좌들이 내 제자","God Hyun-oh Kim defeated Pars, the lord of the Tower of Destruction, and stopped the destruction of the world. God Hyun-oh Kim, who was supposed to die when the Tower of Destruction fell, is reborn three hundred years after the Tower of Destruction fell in the body of seventeen-year-old Kim Joo-hyuk. He then discovers in the present that the “Constellations” that appeared when he was out of the world are his disciples from three hundred years ago and sets out to find them."," "]},{"title":"Fragrant Magician","tags":["Fantasy","Magic","Manhwa","Monsters","Romance"],"disc":["Read manhwa Fragrant Magician / 향긋한 마법사","Emperor Carlos Afforny suffers from an awful curse that causes him to smell a foul stench from everything and everyone at all times. In a desperate attempt to break the ever-worsening curse, he summons Ersala, the apprentice of the Grand Witch, to the imperial palace. However, lacking experience, she fails to fully lift the curse leading to the stench vanishing for the emperor but only when Ersala is within his vicinity. Moreover, with Ersala being able to use magic only once a year, it seems she is tied to the emperor, almost quite literally, until she can attempt to lift the curse again."]},{"title":"A Transmigrator’s Privilege","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Time travel","Webtoons"],"disc":["Read manhwa A Transmigrator’s Privilege / The Perks of Being an S-Class Heroine / Preferential Treatment for the Possessed Person / Privilegios de los poseedores / 为附身者的特惠 / 憑依者の特典 / 為附身者的特惠 / 穿越者的幸运礼 / 穿越者的特權 / 빙의자를 위한 특혜","It’s the era of Transmigration.","I wanted to possess a body of a rich young lady in a Rofan childcare novel, and live while receiving lots of love.","No. 1 to be avoided!","No. 1 in frustrating the reader!","I possessed someone inside an infinite return novel called: Return Until the World is Saved.","Forget being a young lady from a prominent family, I will soon be ruined because the survival difficulty of the original work is S-Class.","I became an extra. Ellet, the young daughter of a servant in the Count’s manor.","We are poor, but it’s a happy life between a kind brother and a good father.","I’ve got a best friend I’ve never made before because I was always busy.","Even the gods of the Transmigration Management Bureau are openly fond of me.","I’m living a life full of confidence.","On top of that, I accidentally bought the ‘After-Life Insurance’ full package just before my death.","I leveled up with the high-speed growth buff, and diligently destroyed the original plot.","Thanks to plenty of special privileges, I came to give satisfaction for all the frustrated readers of the original work.","“You wiped your face with your dirty hands.”","“…….”","“Don’t be surprised. It’s because I have an obligation to be kind.”","And then, there’s the protagonist who is still nothing more than a handsome push over, Thesilid.","‘Why is he being this crafty with me?’"]},{"title":"The Fake Rides in a Flower Kiln","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Fake Rides in a Flower Kiln / 가짜는 꽃가마를 탄다","From an orphan, I suddenly became the empire’s sole princess overnight. I read books until my eyes bled, mastered etiquette, and cultivated refinement. I endured the nobles’ sneers, the Three Brothers’ tyranny, and the servants’ disdain. Ten years later. They say they found the real princess presumed dead. I resigned myself and tried to leave as calmly as possible. “Sister! Don’t worry! From now on, I’ll protect you!” The real princess likes me too much! “…Thank you.” The duke, whom I thought wasn’t on my side, treats me like his own daughter, “Is there another reason? I just wanted to dance with the princess.” Even the prince, plagued by bad rumors, resorts to schemes. Isn’t this something only seen in stories?"]},{"title":"Don’t Mess With the Puppy!","tags":["Comedy","Drama","Romance","Yaoi"],"disc":["Read manhwa Don’t Mess With the Puppy!, Don’t Mess With the Pooch!, Don’t Touch the Dog, 강아지는 건드리지 마라","After being abandoned by his parents when young, Gyun Heesung grew up in a casino. For the sake of his hyung, who took him in, he doesn’t hesitate to put himself in harm’s way. However, after an ambush, he finds himself injured and transformed back into his dog form. And upon waking up…","“What’s with this dirty rag of a pooch?”\n“Let go – you goddamn bastard!”","Gyun Heesung suddenly became the pet dog of a predatory wolf. Though he now lives being showered with wholehearted care and affection, their cohabitation is somewhat unsettling.","“Doggy… I don’t think I’ll eat you up.”\n“C-crazy bastard.”","A story about the cohabitation between a doggy that wants to run away from a carnivorous wolf and a wolf who’s completely smitten by said dog."]},{"title":"Entomologist In Sichuan Tang Clan","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Entomologist In Sichuan Tang Clan / The Poison Master of Sacheondang Clan / 파브르 in 사천당가","Spicy Fabre, a million-streamer known for his expertise in poisons and venomous insects,\nwas bitten by a black mamba during a local shoot in Africa and subsequently reincarnated in the world of Murim.","Now in a jungle raising poisonous insects, the streamer has caught the attention of the Sichuan Tang Clan, renowned for its mastery of poison arts, who wants him.","“Join us and become a member.”"]},{"title":"Play Karma","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Play Karma / 플레이 카르마","“Ahn Somi,” the queen of the Garden of Eden, an SM club where people can enjoy the most forbidden desires and pleasures of humanity. Four men get interested in the mysterious queen of Eden, starting an exciting and passional drama that leads to a tragic event… This is a series of drama, revenge and romance mixed with twisted desires that contrasts far from your everyday day love story."]},{"title":"Hydrangea Melancholy","tags":["Drama","Romance","School Life","Shoujo"],"disc":["Read Our Rainy Days of Melancholy / Our Rainy Story Days / 雨川物语","You Qiuzi—there’s no one at school who hasn’t heard of her name. Nobody approaches her because of her intimidating aura and, on top of that rebellious attitude of hers, she likes caking her face with heavy makeup. What people don’t know is that under her scary façade is a broken heart. A heart that’s unknown to the public eye and yearns to escape society. However, her boring days came to a stop after reconciling with her childhood sweetheart. In face of the person whom she feels so familiar yet distant from, she’s giving everything she’s got in order to see his smile once again…"," "]},{"title":"Surviving as the crown princes childhood friend","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Surviving as the crown princes childhood friend / 황태자의 소꿉친구로 살아남기"]},{"title":"The Male Lead? I Don’t Want Him","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read The Male Lead? I Don’t Want Him / 남주? 줘도 안 가져요","I reincarnated as Luna, a supporting character who is accused of ruining the heroine and hero’s relationship, and is murdered.","I’m not interested in someone else’s man, but the heroine’s friends bully me every day.","“Why are you trying to get close to someone who’s already taken?”\n“That’s right, please stop! Why are doing this?”\n“Stop doing such terrible things!”","So Luna decides to announce it in front of everyone.","“I don’t want someone like Fersen even if you beg me to take him so stop bothering me. I’d rather date Anthes Vincent, who’s rumored to be insane.”","And soon she meets someone who she never expected to meet……","“I heard you have an interest in me? The truth is, I do too. Is it a coincidence?”"]},{"title":"The Obsessive Second Male Lead has Gone Wild","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":[]}]