[{"title":"Part 2 of the Damned Work Started","tags":["Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa Part 2 of the Damned Work Started / 망작의 2부를 시작합니다","‘Oh… It’s finally the ending.’","After having a drink and falling asleep, I was transmigrated to a damned fantasy novel.","A year of living according to the stage directions of the damn author.","Just like the original story, I saved the world from the Demon Lord and finally died, hoping to open my eyes to my original world.","However…","[Ding!]\n[Even if Part 1 ends, the story continues! And so part 2 commences! Welcome to <I Became the Saint Who Saved the World>!]","‘That damn author even wrote a part 2 of this?!’","“You swindler! I don’t want all of this, so send me back to my original world!!!”","Eventually I negotiated with that damn author.\nThat if I finish part 2 without getting caught, I would be sent back to my original world.","“Part 2 is childcare, isn’t it? Alright. I’m going to finish this damned childcare novel super fast!”","The problem is that the setting is the same as the first part, and I keep running into my old comrades.\nAnd they have all had an odd change in character.“How did they become like this?”","Furthermore, the duchess that I possessed has a huge secret.","“Caw?!”","Will I be able to return?"]},{"title":"The Prince Regent’s Concubines","tags":["Fantasy","Historical","Romance"],"disc":["In her previous life, Lin Yaoyue was framed by her lover and relatives. After dying in vain, she woke up to find that she was reborn in her youth. Lin Yaoyue vowed to make the villains pay for what they’ve done, but what she didn’t expect was that Murong Jin, her enemy in her previous life, had become her lover in this lifeHow Much Extent Did The Embroidered Moon Intoxicate The Willow In The PlaceJi Du Jin Yue Zui Gong Liumangabuddy is a website dedicated to fans of anime, , , , video games, and cosplay. Where you may find all of your anime-related memes, recommendations, reviews, manga recommendations, character fanfiction, favorite quotations, and simply those ordinary anime things that you enjoy, particularly memes.You can , online for free at mangabuddy. Chapters are updated hourly with high-quality graphics and a full English translation. Find free translations of your favorite , and . The latest updated content on mangabuddy is now available.","How Much Extent Did The Embroidered Moon Intoxicate The Willow In The Place, Ji Du Jin Yue Zui Gong Liu, The Prince Regent’s Concubines, 几度锦月醉宫柳, 幾度錦月醉宮柳"]},{"title":"Lost Princess","tags":["Adventure","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Lost Princess / The lost princess / 로스트 프린세스","As long as Olga can recall.\nShe had dreamed of going out to sea and searching for the secret treasure she often saw her father talking about.\nBut after her father and brother went missing at sea, that dream seemed lost forever.\nUntil pirates attack her quiet village, turning everything upside down!\nNow, with a crew of sailors dressed in rags, can Olga finally unravel the mysteries of her family’s disappearance and uncover the treasure she’s always dreamed of?"]},{"title":"Tyrant Daddy’s Petite Bag","tags":["Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Tyrant Daddy summary is updating. Come visit manhwaclan sometime to read the latest chapter of Tyrant Daddy. If you have any question about this manga, Please don’t hesitate to contact us or translate team. Hope you enjoy it.","Tyrant Daddy\nBàojūn Diēdiē De Tuán Chǒng Xiǎo Jiāo Bāo\nTyrant Daddy’s Petite Bag\n暴君爹爹的团宠小娇包"]},{"title":"I Am The Undying God","tags":["Fantasy","Manhua","Shounen"],"disc":["Read manga I Am The Undying God / 吾乃不死神\nWhy do elves, catgirls, lolis, and older sisters all want to be my servants? Is it because of my unparalleled power? Then, I shall lead you and pave the path to Godhood once more!"]},{"title":"My Tender Despot","tags":["Fantasy","Historical","Romance"],"disc":["It is said that the most merciless despot has fallen for a lady and devoted his soul and heart to her. It is also said the despot sentenced the lady to death in the end. History buried and story twisted, yet true love never fades.","My Tender Despot manhua\nFate of Rebirth: My Gentle Tyrant\nZài Shēng Yuán: Wǒ De Wēnróu Bàojūn\n再生缘：我的温柔暴君"]},{"title":"The Evil Lady’s Hero","tags":["Drama","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Evil Lady’s Hero / Villainess In Love / 악녀의 남주님","“Warning: Mature content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nJunipe Magnolia, a villainess friend of the heroine in this novel called Rael Cania. The Junipe inside the novel has always loved the male lead, Iseed. To the point where she harassed Rael out of jealousy because she’s loved by Iseed. And thus, Junipe is destinied to die in the hands of the male lead of this novel. But one day, “Why did I become Junipe?!” But let’s think about it, it’s still one year away from the time Junipe is going to get killed by Iseed. So, I have to meet Iseed and Rael first, I’ll be able to find a way out of my death if I do so. Yeah, let’s meet them first! But, this man is just so tender-hearted and kind. Would Junipe be able to escape from this man?! this…???"]},{"title":"It’s Not That I Want to Wear Women’s Clothing","tags":["Comedy","Romance","Shounen Ai"],"disc":["For the sake of a tripled salary, straight guy Lin Zicheng discards the joke of going to work in women’s clothing. Who would have expected that President Gu Fang, who was never fond of girls, would fall in love with Lin Zicheng in women’s clothing at first sight?! Wasn’t there a rumor that the president couldn’t stand being near women and that his orientation was questionable? “What about your integrity, President?!”"]},{"title":"My senior brother is too steady","tags":["Action","Adventure","Drama","Fantasy","Manhua","Martial Arts","Reincarnation"],"disc":["My senior brother is too steady, My Brother Is Actually Too Stable, My Senior Is Really Extremely Firm, Wǒ Shīxiōng Shízài Tài Wěnjiànle, 我师兄实在太稳健了, 我師兄實在太穩健了 , Wo Shixiong Shizai Tai Wenjianle\nAfter being reborn in ancient times before the Great God-Conferment War, Li Changshou became a small cultivator.\nTo survive in the cruel Primordial Times, Li Changshou tries hard not to accumulate any karma. He always plans thoroughly before doing anything and never allows himself to walk into dangerous situations. He hides his trump cards well, trains himself in escape techniques, refines poisonous pills, and masters mystical abilities.\nLi Changshou originally planned to remain hidden and safe in the mountain until his ascension to immortality. However, everything changed one year when his master brought home a junior sister…"]},{"title":"A Sheep in Wolf’s Clothing","tags":["Comedy","Fantasy","Historical","Isekai","Romance"],"disc":["Read A Sheep in Wolf’s Clothing / A Sheep in Wolf Clothing / Pi Zhe Yang Pi de Lang / 披着狼皮的羊","“The funny love between the gentle, black-hearted Sheep King and the funny, straightforward Wolf tomboy girl has just begun.” There exists a website where you just pay a few dollars and set a keyword, then you can easily enter the world of novels to personally run around and venture. After every time you enter, the experiences that occurred will automatically become parts of the novels. A new novelist, Lan Pi, saw such an introduction, mouse-clicked it, closed her eyes, and entered the VR world."]},{"title":"I Favor The Villainess","tags":["Fantasy","Isekai","Magic","Manga","Reincarnation","Shoujo Ai","Yuri"],"disc":["I Favor The Villainess manga, Watashi no Oshi wa Akuyaku Reijou , I’m in Love with the Villainess\n私の推しは悪役令嬢\nOrdinary office worker Oohashi Rei wakes up in the body of the protagonist of her favorite otome game, Revolution. To her delight, the first person to greet her is also her favorite character, Claire Francois–the main antagonist of the story! Now, Rei is determined to romance Claire instead of the game’s male leads. But how will her villainous lady love react to this new courtship?!"]},{"title":"One Pair Lady","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Time travel","Webtoons"],"disc":["Read manhwa One Fair Lady / 원 페어 레이디","When I woke up from my sleep, my house had disappeared?! Adele, a gambling genius, suddenly transmigrates ten years into the future. Participating in a gambling event at the request of the tower master, Rudy leads her to meet the Duke of Elfinheim, the organizer of the event. A name that I seem to have heard somewhere, with a familiar pronunciation and appearance. What is this strange feeling? “Where’s the lady the Duke was looking for? “Aha, that rumored lady? “Yes. I heard rumors that the gambling ship itself is currently afloat only for that woman.” Besides, the rumored lady’s description is similar to mine?!"]},{"title":"House of Riddles","tags":["Drama","Historical","Horror","Manhua","Mystery","Romance","Supernatural"],"disc":["The brutal and bizarre murder raises the curiosity of the famous gentleman detective Lucien, but the crime scene is destroyed by a fire. And the last person to arrive at the scene was Scarlett Atissian, the producer of the house who learned from the crime scene. To find out the truth of the case, Lucien had to” bully” the strange lady to cooperate with his investigation. He didn’t know Scarlett had so many bloody secrets…","Don’t covet the beautiful young master / 不准觊觎漂亮少爷; House of riddle"]},{"title":"Acidity of Regret","tags":["Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa Acidity of Regret / 후회의 산미","“I’m cursed to fall in love with you.” The most beautiful woman called the angel of the Angela Empire, ‘Vanessa Rohawk’. When her family collapsed overnight as traitors Who saved her was the owner of the Principality of Vincart and Vanessa’s lover. It was ‘Declen Vincart. “Vanessa Rohawk. Would you like to come with me?” He was salvation, he was light, he was love. As long as I could be by your side, I could endure any hardship I swore that not even death would ever separate us. This relationship should never have started in the first place. “Vanessa, you can never walk away from me without my permission.”"," "]},{"title":"Predestined Fate, You Are Mine","tags":["Manhua","Yaoi"],"disc":["Read manga Predestined Fate, You Are Mine"]},{"title":"The Flower of Vampires","tags":["Drama","Fantasy","Romance","Time travel"],"disc":["Read manhwa The Flower of Vampires / 뱀파이어의 꽃 / The Flower of Vampire / Vampire’s Flower / The Vampire’s Flower [Official]","A breathtaking vampire romance depicting adventure and love in search of the legendary ‘vampire flower’. The vampire Louvre sets out in his quest with the human contractor, Seoyoung, appearing in the human world after 500 years."," "]},{"title":"I Became A CEO In The Other World","tags":["Drama","Isekai","Manhua"],"disc":["I Became A CEO In The Other World manhua, After being transmigrated to another world, he did one thing and reorganized the labyrinth of the devil into a company, and since then he has embarked on a path he never imagined."]},{"title":"Sacrifice Myself To Get Your Love","tags":[],"disc":[]},{"title":"The Story of Hua Yan","tags":["Comedy","Historical","Manhua","Romance","Shoujo"],"disc":["Read Hua Yan Ce,花颜策,The Story of Hua Yan\nThe almighty crowned prince insists on marrying this young “Overgrown Apricot” lady from the tainted Hua family. When the news broke out in the capital, many hearts were broken but what?! This wicked woman doesn’t even want to be the crowned princess because she wants to drink and run away with another man?!\nLady Hua: I am a tough woman. I’m definitely not suited for you!\nCrowned Prince: Then I’ll make sure that in this world, you can only pick me."]},{"title":"Today Living With You","tags":["Comedy","Drama","Manhwa","Romance","School Life","Slice of Life","Webtoons"],"disc":["Read manhwa Today Living With You / Today I Live With You / 너와 사는 오늘","“Fine! I’ll start dating then!!” Dohee has a crush on childhood friend Jaehyuk. But in order to distance herself from him, she has decided to start dating others when the handsome lunatic Wonyoung appears! Wonyoung’s constant antics slowly start to rub off on Dohee… will Dohee be able to start a relationship in her eventful campus life?"]}]