[{"title":"Lost You Forever","tags":["Drama","Manhua","Romance"],"disc":["Lost You Forever manhua"]},{"title":"Regina Rena – To the Unforgiven","tags":["Action","Crime","Demons","Fantasy","Horror","Manhwa","Monsters","Romance"],"disc":["Read manhwa Regina Rena – To the Unforgiven / Regina Lena – To the Unforgivable You / Regina Rena – To the Unforgivable / 레지나레나 – 용서받지 못한 그대에게","“I’ll give you a chance. A chance to be forgiven.” The father sold his daughter. And the daughter returned from hell. In an empire with a diversity of the living and the dead, the young Rena Rubel was destined to die as a sacrifice for her father. But six years later, the girl who everyone thought had died, came back to life. Taking off the mask of a little lamb, and becoming a lion."]},{"title":"A Young Miss Past Life","tags":["Romance"],"disc":["Read A Young Miss Past Life / 重生之千金归来","Yin Mo, the daughter of the chairman of the Yin Group, is reborn at the age of 17 after being persecuted to death by her stepmother and stepbrother. The reborn young miss vowed to change her life against the odds. Let those who have hurt her and her family pay the price beyond redemption !"]},{"title":"I Became the Dark Villain’s White Moonlight","tags":["Adaptation","Drama","Isekai","Manhua","Romance","Shoujo","Time travel"],"disc":["Reading manhua I Became the Dark Villain’s White Moonlight / Become The Blackening Villain’s White Moonlight / I Became the Dark Villain’s White Moonlight / 成了黑化反派的白月光"]},{"title":"Demon Hunting Record","tags":["Fantasy","Romance","School Life"],"disc":["Read manhua Demon Hunting Record / Demon Capturing Sketch Book / Demon Hunting Record / Travelogue of Monster Capture / Zhuō Yāo Jiàn Wén Lù / 捉妖见闻录","What a strange world of monsters! I was hit on the head by an incense burner, and a mysterious power woke me up inside of me! I Woke up to find my boyfriend and stepmother who have been with me all the time have started been visible to me as monsters, and when I checked with others I found out that my boyfriends monster Arura was the strongest, so now let me take you into the world of monsters for a journey!"," "]},{"title":"Date on Christmas","tags":["Josei","Romance"],"disc":["Read manhwa Date on Christmas / Christmas Man / 크리스마스의 남자","Jiyoung Lee is an impeccable secretary, the best one could ask for. Will her humble wish for Christmas come true?! Having worked five years for Senior Managing Director Manbok Kim, the most finicky manager of them all, Jiyoung is one capable secretary. Though everything about her seems perfect and she, confident, Jiyoung has had a small wish: she would like a cup of coffee with Managing Director Seungjoo Yoon, of whom she’s a secret admirer, on Christmas, which is also her birthday. One day her boss Director Kim retires due to an illness, and finally, she is reassigned to Manager Yoon."]},{"title":"Dreamy Love","tags":["Drama","Fantasy","Josei","Romance","Shoujo"],"disc":["Read manhwa You Even in My Dreams / 꿈에도 그대","Naeun Lee is an average woman who works as a travel guide in Korea. One day, a handsome man named Leehan Shin starts appearing in her dreams. However, this man throws her off the roof for just for bothering him! After that, every night she suffers nightmares… So she has no choice but to ask Leehan for help. Will Leehan give Naeun the help she needs, or will she just suffer another horrible death by his hands?"," "]},{"title":"Grace of the Crown Prince","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Grace of the Crown Prince / 황태자의 성은","National star Seulchan An─leader of an idol group─has been able to maintain his position of top actor and show host through his handsome looks and quick judgment skills; instead of the skills he was given at age 18. Actress Yooni Kim has been stuck with extra roles ever since her scuffle with a major production agency due to her uncompromising nature; despite having a high level of skill, talent, and aspiration. A man who has everything but is no longer happy and a woman who has nothing but has a lot to protect, are slowly attracted to each other after they meet by pure coincidence. But there are too many obstacles for love to develop between the two; most notably the fans of Yooni (and her talent), and the broad-shouldered, narrow-minded agency CEO hell-bent on kicking Yooni out.The path to obtain Yooni’s love is long and winding for Seulchan, even after swallowing his pride. This is a story about Seulchan’s shameless, painstaking efforts to break down Yooni’s walls and earn her favor; one cookie point at a time!"," "]},{"title":"I Confessed to My Mortal Enemy","tags":["Comedy","Drama","Fantasy","Romance","School Life","Shoujo"],"disc":["Read I Confessed to My Mortal Enemy / 我向死敌告白了 / Wo Xiang Sidi Gaobaile\nJiang Mi was originally a hard-working social animal in City A. At 1:00 in the morning, Jiang Mi, who finished overtime because she helped her colleagues with the PPT, was so angry that she ran to the Internet to express her anger on the most hated female supporting characters in the novels she had read before. Unexpectedly, she traveled to this novel. inside. What’s even more outrageous is that he turned into the villainous female supporting actress Oye Fu in the novel. Although Oyve was the duke’s daughter, but because of repeated evil acts, he finally died under the sword of the male protagonist. I know Oyve is sad"]},{"title":"Today’s Venus","tags":["Drama","Manhwa","Romance","Shoujo"],"disc":["Today’s Venus manhwa, 오늘의 비너스\n“The ordinary me…? The most beautiful in the world from today? By the way, who decides that standard?” Kang Hana, an aspiring actress who always failed auditions because of her ordinary appearance despite her outstanding acting skills. Then, one day the global beauty company stated that ‘her appearance is her ability’ comes at her with a scout offer. And one person is bound to learn Kang Hana’s greatest secret…? [2021, 1st place Award-Winning Work]"]},{"title":"A Villain Is A Good Match For A Tyrant","tags":["ecchi 2","Manhwa","Romance","Shoujo"],"disc":["Read manhwa A Villain Is A Good Match For A Tyrant / 폭군에게는 악녀가 어울린다 / A Villainess for the Tyrant\nOne day the tyrant Estian sent a marriage proposal to Cecil. She got dragged to the empire unwillingly but when she saw the emperor’s face she got a change of heart. “You’re quite the hottie aren’t you?” She liked her husband. And her husband likes her back too!\nTo live happily with her tyrant husband Cecil needs to become a villainess far worse than the tyrant?!"]},{"title":"Demon Lord’s 5500 Shadows","tags":["Comedy","Demons","Drama","Fantasy","Romance"],"disc":["Read manhwa Demon Lord’s 5500 Shadows / 마왕님의 5500가지 그림자","I had great success with an erotic novel starring the demon lord, but then the demon lord really turned me in!\nI need to make at least half of the novel a reality in order to survive.\nThe smut novel needs to come true!\nIrene Yoo, whose life ended as soon as it began to bloom at the age of nineteen, spent her second life as a virgin ghost full of yin* energy in the underworld. She made the most of her benefits after turning into a succubus and being allowed to live in the Demon Realm.\n‘I’ll teach the naive, workaholic Demon Lord this, that, and all that, but-‘\n“It’s not much. Close your eyes. Let’s finish quickly.”\n“I… I have my hobbies too!”\n“I think I know your preferences better than you do.”\nThe Demon Lord memorized the erotic words I wrote in one night. Furthermore, what happens to this fascinating ‘progression chart’?!\nWhen I told him I couldn’t lose my virginity with someone I didn’t have feelings for, the Demon Lord, Claude Stern, asked as he unbuttoned his shirt, “You don’t have feelings. what about me? ”\nYour Majesty, why is your voice so low? Why are you bridging the gap between us?!\n*Note Yin Tl: the passive principle of female in nature in Chinese cosmology is expressed in the dark, cold or wet and combined with yang to create all that happens.\nSource: merriam-webster dictionary"]},{"title":"The Heirloom Recipe","tags":["Comedy","Cooking","Drama","Fantasy","Historical","Romance"],"disc":["Read The Heirloom Recipe / The Fair Wind Must Lean On The Blue Kite / There Must Be Fair Wind Leaning On Blue Kite / Ying You Chang Feng Yi Bi Yuan / 应有长风倚碧鸢 / 愛の隠し味 / 應有長風倚碧鳶 / 비법은 비밀이에요","Due to a bowl of ‘Xiangsi (lovesickness) soup’, Biyuan was abducted to a royal mansion by the butler to cook for the royal lord. During her escape, she broke the lord’s precious soup bowl but to find that it was poisoned. The secret led her to be trapped in danger. The lord decided to investigate this case and destroy the conspiracy behind the poison and the Xiangsi soup, so as to protect Biyuan. What’s going to happen next?"]},{"title":"Super Model, Super Sweet","tags":["Drama","Romance"],"disc":["Read Super Super Model, Super Sweet manhua / Supermodel Lover Is a Bit Sweet Chao Mo ,超模恋人有点甜","Gu Man was once a super model, yet she chose to get married at the prime time of her career. However, the man who she loved dearly and promised her unchangeable love was not worthy of trust at all! He cheated with Gu MAn’s sister and planned to take her property and drove her away! Gu Man, with a broken heart but an even more sharper mind, decided to get divorced and defend herself! When she determined to go back to fashion industry, a CEO from a start-up hired her. This man was…unusual, not only his background but also his attitude towards Gu Man! ."," "]},{"title":"The Villainess Wears an Idiot’s Mask","tags":["Fantasy","Romance","Shoujo","Time travel"],"disc":["Read manhwa The Villainess Wears an Idiot’s Mask / The Villainess Behind the Mask / The Villainess Appears to Be a Fool / 악녀는 백치가면을 쓴다"]},{"title":"Cute Baby Is Coming : Daddy And Mommy Are Super Fierce","tags":["Manhua","Romance"],"disc":["Read Cute Baby Is Coming : Daddy And Mommy Are Super Fierce","A cute baby took a book and flipped it over seriously. Mommy the next man you are going to meet, you must grasp him. The woman looked confused when she was forcibly taken to a certain cafe by her own son. Wu Jiao Jiao wants to cry, but there are no tears. Hello sir, I am here for a blind date. A certain man raised his eyes with a sullen look on his face. Wu Jiao Jiao, are you seeking death by coming to a blind date alone?! Wu Jiao jiao raised his legs and ran, while running, she is accusing her son and said “you did not tell me, this man is your father”."]},{"title":"The Mermaid Wears a Dress","tags":["Comedy","Drama","Fantasy","Manhua","Romance"],"disc":["Read manga The Mermaid Wears Dresses / Mermaid’s Dresses / 人鱼的裙摆","In order to break her marriage contract, the revolting mermaid girl goes ashore to the city, to find her “fiancee” that manages a western-clothes shop, but accidentally releases the seal, on a piece of female clothing, of a monster……. For the sake of subduing the monster, the arrogant mermaid girl and the attractive two-faced brother start a fantastic new life~"," "]},{"title":"A Bad Proposal","tags":["Fantasy","Manhwa","Romance","Smut","Webtoons"],"disc":["Read manhwa A Bad Proposal / 나쁜 제안 / Bad Suggestion","“…How did you know to come here?”\n“Perhaps, I really can’t find someone like you so I can’t leave you alone.”\nHer boyfriend who broke up 7 years ago, Seok Hyun appeared before Hee Soo, who was struggling with his uncle’s debt and was working at a cafe by day and at a bar by night.\nFor Hee Soo, who always works hard for money, Seok Hyun made an offer she couldn’t refuse."]},{"title":"Logout Disabled in VR Chat","tags":["Action","Comedy","Drama","Fantasy","Mystery","Psychological","Sci-fi"],"disc":["Read manhua Logout Disabled in VR Chat / VR Chatroom Cannot Be Offline / VR聊天室无法下线","One day, 8 players were pulled into a mysterious space called the Judgement Hall. An angel, with the power to control life and death, tells them — “Find the murderer.” The process of this investigation will be streamed live to the entire internet. Stuck online, the 8 are forced to find the truth and more secrets are revealed as they continue to search for the answers…"]},{"title":"My Two Stepsons Looking At Me Weirdly","tags":["Manhua","Romance","Slice of Life"],"disc":["Read My Two Stepsons Looking At Me Weirdly","A witch picked up two children by chance, and as they got along day by day, both of them developed extraordinary feelings for her. From then on, a tragedy occurred. Chen Ming Xuan was instigated by a mysterious person to kill Dugu Chen Feng but accidentally killed Zhi Xi. A hundred years later,Zhi Xi’s soul awakens in the body of Dugu Chen Feng’s ex-wife, at the time, Chen Xuan Ming also appears beside Zhi Xi Notes from mangabuddyAll our manhua content is protected under copyrighted law. manhwaclan never gives anyone authorization or permission to publish our content on another website/app. If you’re publishing our contents on your website/app, it’s mean that you’re infringing the copyright of our works. Therefore stop stolen our works or else we will take legal action against you."]}]