[{"title":"We’re Soulmates Starting From Today","tags":["Comedy","Drama","Romance","Shoujo"],"disc":["Read manhwa We’re Soulmates Starting From Today / 오늘부터 천생연분","Dakyung and Ji Minwoo, the two of them are rivals in the field of business, they are openly competitive, scandalous and are rapidly moving towards ‘marriage’!\nBut somewhere in this whole marriage, something was a bit suspicious.\n“Before summer turns 29, you must succeed in marrying So Dakyung”. What story did he have with his old paper?"]},{"title":"Be Jealous","tags":["Romance","Time travel"],"disc":["Travelling through the worlds., kick the ex, abuse the mistress, tear down the white lotus, and then find a big shot to have an adult hormonal explosion of love ……\nBe Jealous (Lan Shou)\nKuài Chuān: Bìng Jiāo Nán Zhǔ Tā Yòu Chīcùle\nQuick Transmigration: The Yandere Male Lead Is Jealous Again\n快穿：病娇男主他又吃醋了"]},{"title":"Sick Yandere Prince Depends on Me to Continue His Life","tags":["Drama","Fantasy","Historical","Josei","Manhua","Romance"],"disc":["Once in the book, Su Ye became the arrogant and domineering female partner with countless male concubines in the book. If you want to survive, you have to stay far away from the sickly and black-hearted prince in the book, but the sickly prince clasped her hand and coughed loudly: “Is my benefactor pleasing to me?” Nodding: “Yue, my heart is very happy.” What should the unlucky female partner do when she encounters the demon king, she can only get used to it!","The Prince Relies on Me / Bìng Jiāo Wáng Yé Kào Wǒ Xù Mìng / Sick Prince Depends on Me to Continue His Life / Sick Yandere Prince Depends on Me to Continue His Life / Sickly Yandere Prince Depends on Me to Continue His Life / The Yandere Prince Depends on Me to Continue His Life / 病娇王爷靠我续命"]},{"title":"How to Take Off a Wedding Dress","tags":["Drama","Romance","Shoujo"],"disc":["“Find out who that woman is.”\nThe wedding planner, Jisue Lee caught the eye of the CEO of Hotel I, Woo Suk Yeon, with her resoluteness.\n“Jisue Lee, do you want to work for me?”"]},{"title":"Great Comeback of the Deserted Princess","tags":["Fantasy","Liexing","Ping Ping Jun","Romance"],"disc":["The legend says that Gu Qingcheng was once the wife of Prince Yongjun, but was divorced by her husband. Her whole family was beheaded, and she herself nearly became food in the belly of the beast in the colosseum. She was once the most beautiful woman in the Great Xia Empire, now she’s taken away by Prince Sheng. After a year, she’s ready to make her comeback, and make the man who destroyed her family pay the price!"]},{"title":"The Villainess Reverses the Hourglass","tags":["Fantasy","Romance","Webtoons"],"disc":["Read manhwa The Villainess Reverses The Hourglass / The Villainess Turns the Hourglass / 악녀는 모래시계를 되돌린다","With the marriage of her prostitute mother to the Count, Aria’s status in society skyrocketed immediately. After leading a life of luxury, Aria unfairly meets death because of her sister Mielle’s schemes. And right before she dies, she sees an hourglass fall as if it were a fantasy. And just like that, she was miraculously brought back to the past. “I want to become a very elegant person, just like my sister, Mielle.” In order to face the villainess, she must become an even more wicked villainess. This was the new path Aria chose to take revenge on Mielle who  murdered both her and her mother."]},{"title":"Pestered by the Yandere Once Again","tags":["Romance"],"disc":["Read manga Pestered by the Yandere Once Again / Once Again Being Tangled With the Yandere ; Yòu Bèi Bìng Jiāo Chán Shàng Le ; 又被病娇缠上了","While escaping from pursuers, Shen Nian Que accidentally entered the house of a handsome young man. Not only was he not afraid of her threats, he even personally treated her gunshot wound. At first, she thought that it was just a coincidence. However, she would’ve never thought that this young man, who has a delicate character and is a year younger than her, would end up pestering her. She couldn’t bear to beat him or scold him. Slowly, his gaze towards her became increasingly morbid…"," "]},{"title":"Heavenly Demon Bakery","tags":["Action","Adventure","Cooking","Manhwa","Martial Arts"],"disc":["Heavenly Demon Bakery manhwa, 천마님의 베이커리\nIt’s been decades since he began ruling over the Central Plains as the Heavenly Demon, but now he’s back to his original world!\nNow that he’s returned, he’s started to help his father with his bakery.\nUsing the Mind’s Eye skill, he uncovers recipes while using Body Reformation to optimize the kneading of dough.\nThe strongest in the Central Plains, the Heavenly Demon, uses his martial arts to become the premier baker!"]},{"title":"She Is Wearing a Mask","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["As Count Cayenne’s successor, Brilia lived as commander of the ranger unit. She is saddened when she hears the news that her younger sister Evelyn has died. However, for a short time, she decides to assume the identity of her younger sister Evelyn, to find out what has been hidden behind the scenes. Is it over there meets the prince of an enemy country, Schaffen, then he finds out that she is Brilia, and strangely he begins to actively help her after that. Also, even Crown Prince Louis, begins to help her…"]},{"title":"Hired to Love","tags":["Adaptation","Drama","Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhwa Hired to Love","Henley never thought she’d see so many zeros on one check—$10,000 to be billionaire Bennett Calloway’s fake girlfriend! And that’s just the advance! She’s barely scraping by, working two minimum wage jobs just to afford the worst apartment ever and the lawyer fees from her brother’s wrongful conviction. Calloway is rude and entitled, but the opportunity seems too good to pass up. The only catch? Don’t fall in love. In desperate need of cash, Henley finds herself caught up in a whirlwind business arrangement, pretending to date Calloway so his mother will ease up on the pressure for him to find a wife. But once Henley is enmeshed in Bennett’s world, he falls for her, and she starts to develop feelings for him as well. Despite her romance with Bennett, it’s clear something is wrong—are the Calloways involved in the conviction that put her brother in jail? What secrets are their family hiding? Journeying deeper into a world of wealth and conspiracies, Henley is forced to rely on Bennett. But how much can she really trust him…when doing so could cost her everything?"]},{"title":"Extremely Arrogant","tags":["Action","Adventure","Fantasy"],"disc":["The orphan “Xiao Bai” has the secret of “A huge amount of Credit points”. To find out his background and avenge his teacher, Xiao Bai hired the human murder weapon known as “storm”, and used his excellent mechanical transformation technology to transform him into a Superweapon, the two escaped the pursuit all the way and explored the truth of the world."]},{"title":"I Said Again, Will You Be My Wife?","tags":["Yaoi"],"disc":["Read manga I Said Again, Will You Be My Wife?"]},{"title":"I’ll End This Engagement!","tags":["Comedy","Fantasy","Romance"],"disc":["I’m Going to Break This Marriage Now / 이제 그만 파혼해 드릴게요 / Time To Call Off This Engagement / I will break this marriage","I, who suddenly possessed Leah Prezis, the fiancee of a sub-male supporting character and also known as the vindictive evil woman resentfully hated by that of the readers. Who was also betrayed by the female protagonist and her fiance. I put my everything into changing the fate of Leah, the wicked woman. “I’m going to ask of you to break our engagement. ” Finally, I asked for a breakup in order to escape from the barbaric like death ending, but he said, “I can’t do that,” What? You can’t do that now? And I never thought I’d get hit in the back of my head right before I managed to escape from the terrible fate of Leah Prezis. “Why, do you want me to beg for you not to leave, on my knees?” When I saw a certain man’s persistent smile, there was only one thought that came to my mind. “No, he’s crazy!”"]},{"title":"When the Black Moon Rises","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manga When the Black Moon Rises on manhwaclan\nA single miracle created by one man who risked everything. “I don’t want to forget you.” “Please make it so that I don’t forget you.” He was not a god. ‘…It was you.’ “…Baek Giha.” A light riding on the wind, flying like a song; a glorious miracle that fell down like a burning star. I gave thanks to god, but the one gave this opportunity to me was not god, who had abandoned me. It was the one who she had pretended to not know when he courted her. “Don’t do that. I don’t have the time to care for you.” “Saving my family is most important. Other than that, I won’t concern myself with anything else.” Will Joo Sehwa be able to exact pain on the enemies who beheaded her and her family, and find love with the one who gave up everything for her?"]},{"title":"It’s not easy to bully my mother","tags":["Comedy","Fantasy","Isekai","Mystery","Romance","Shoujo"],"disc":[" "]},{"title":"Millions and Millions Lives in Huadi World","tags":["Comedy","Fantasy","Historical","Reincarnation","Romance","Shoujo"],"disc":["Summary: The heroine is a comic book writer who likes to open pits and not fill them, and also has the bad habit of drawing dead male characters once they are cut off at the waist. What she didn’t expect was that one day she would be thrown into a world of deep pits dug by the gods themselves.After this is over, the male characters who can’t be saved will accompany her to die again and again. If you want to solve these bugs and loops, you can only Fill your own hole~","A billion lifetimes under flowers\nHuā Dǐ Rén Jiān Yì Wàn Shì\nMillions and Millions Lives in Huadi World\n花底人间亿万世"]},{"title":"Asmodian’s Contract","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Asmodian’s Contract / Contrato Asmodiano / Majog-ui gyeyag / 마족의 계약 / Дьявольский контракт / The Demonic Contract\nThe demon lord’s daughter Yurisina was living a normal demon’s life when she was summoned by a human who was about to die. Not just any human, but the Paedin kingdom’s first princess Marianne. As Yurisina lives on in her body instead, Marianne requests that Yurisina takes revenge on the person who poisoned her."]},{"title":"Contract Marriage: I Married My Cunning Childhood Friend","tags":["Drama","Josei","Romance"],"disc":["Read manhua Contract Marriage: I Married My Cunning Childhood Friend / Can You Marry Me? / I Married My Cunning Childhood Friend / Marriage Contracted Childhood Sweetheart Is Too Two-Faced / Matrimonio por contrato: Me casé con mi astuto amigo de la infancia / Qi Yue Hun Yue De Zhu Ma Tai Fu Hei / 契约婚约的竹马太腹黑 / 남사친의 아찔한 청혼","Zhao Youwei is a girl who’s always been worried about her masculine name. All of a sudden, her childhood friend, who had just come back from abroad, proposes to her when he realizes that she is a girl! Liang Miaoyu did that because she bullied him when they were young, which caused him to be traumatized when being in close contact with others. Moreover, Zhao Youwei can’t reject his proposal! What a disaster!"," "]},{"title":"Vinegirl: Mercy Killing","tags":["Action","Drama","Fantasy","Horror","Manhwa"],"disc":["Read Vinegirl: Mercy Killing / Mercy Killing","Demon City—a city of the future where everything and everyone is fair game for the rich and powerful. The immoral tech corporation that rules the city sacrifices innocent lives to entertain the decadent elite, and Ally Qiao would’ve been just another nameless casualty of their games if a vengeful scientist hadn’t chosen to test his experimental formula on her. Ally is now reborn with the power to grow and control plants, and she will show no mercy in her quest to avenge herself and every other victim of this corrupt society."]},{"title":"You Should Marry My Mommy","tags":["Romance","Webtoons"],"disc":["Read manhua You Should Marry My Mommy / Sweet Little Cutie / 萌宝好甜","Betrayed by her family five years ago, she lost her loved ones and her lover. But a genius baby was left with her. She vowed to revive her life, but didn’t expect to meet the fateful man, Huo Tingchen.\n“We don’t know each other!”\n“You stole my seed and wanna run away?”\n“Who stole your what?”","Alas, her son is just a mini-version of this man, only cuter and smarter~"]}]