[{"title":"The Little Princess Waits for the Breakup","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Little Princess Waits for the Breakup / Little Princess Waits For Her Breakup / The Lady Awaits a Broken Engagement / 소공녀는 파혼을 기다린다"]},{"title":"Whose Identity Will Be Discovered First, Wild Fox or Gao Linghua","tags":["Drama","Historical","Romance"],"disc":["Read Whose Identity Will Be Discovered First, Wild Fox or Gao Linghua / Ye Hu Li Yu Gao Ling Hua Shei Hui Xian Diao Ma? / 野狐狸与高岭花谁会先掉马？","Cang Yu hid her daughter body and lived as the second son of the Cang family. I wanted to return to the capital to find my mother’s family background, but I was pushed into the pit of fire by my family, and somehow became a candidate for the princess son-in-law. This princess! She is so beautiful, but Kefu! If you want to live, you have to stay away from her! Cang Yu originally wanted to escape from the candidate for the son-in-law, but he did not expect to discover the shocking secret of the princess… It"]},{"title":"A Perfect Ending Plan of the Villain in a Fairy Tale","tags":["Action","Adventure","Comedy","Drama","Fantasy","Korean","Manhwa","Romance","Shoujo","Villainess","Webtoons"],"disc":["Read manhwa A Perfect Ending Plan of the Villain in a Fairy Tale /  The Perfect Plan for a Fairy-Tale Ending / 동화 속 악역의 완벽한 엔딩 플랜","The protagonist of a fairy tale whose tears turn into diamonds.","I was possessing… her bad sister.","Three years left until the passing prince fell in love with my younger sister and married, and the family who harassed the protagonist were executed.","‘I’d rather go find the prince and throw in the protagonist and plan a way to live.’","It was nice to find the prince after the twists and turns…","“Please marry me.”","The prince knelt on one knee. In front of me.","Not there? Don’t you have to marry my sister?"]},{"title":"The Time When We Were Young","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Time When We Were Young / What We Liked Those Days / 그때 우리가 조아한\nChoi Ah-ran, a novelist and publisher, runs a publishing company while hiding the humiliation of her past as Jo A-han, a writer who made a big name for herself 20 years ago with an internet novel about the popular leader of Sanggo High falling for an an ordinary high school student. Ah-ran goes to her parents’ house, where she grew up, to announce the end of her engagement, but loses consciousness and is dragged into the realm of internet novels, ‘Cheonyangsi.’ Cheonyang-si is completely different from reality. Her now divorced parents affectionately wake up Ah-ran, and emoticons expressing their feelings appear in the speech balloon. The spelling is a mess! Such a cliché blabber! Ah-ran goes to school in an unguarded moment and realizes that this is an imaginary world where the laws of Internet fiction are constantly occurring. ‘This is a world I made up, so I can escape!’ While searching for a way to go back home, she goes to the city with her friend Soyoung, and meets the Four Heavenly Kings in the arcade. Ah-ran falls off the stairs and lands on Kang Hwiyoung, the head of Sanggo-chan. ‘Oh, no! If you fall like that, there is a high probability that you will kiss Sanggo-chan regardless of your falling position!’"]},{"title":"Miss Gu and Miss Qu","tags":["Drama","Romance","Shoujo Ai"],"disc":["Miss Gu & Miss Qu / 顾小姐和曲小姐 / Gù Xiǎojiě Hé Qū Xiǎojiě / Miss Gu and Miss Qu / Twin Flames Of Destiny","There are two women in the entertainment industry who share a similar name. One being Qu Xizhi and the other being Gu Xizhi. Gu Xizhi had already formed a grudge against Qu Xizhi for “stealing” her entitlement as well as her ex boyfriend. As for Qu Xizhi, who’s said to be the perfect lady, pesters about Gu Xizhi to her friends?! This is a story about a straight tsundere women who falls into a trap by the perfect women, who is seen to be her rival."," "]},{"title":"The Iron-Blooded Necromancer Has Returned","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa The Iron-Blooded Necromancer Has Returned / 철혈의 네크로맨서가 귀환했다","His only blood relative, his younger brother, died."]},{"title":"I Have A Blade That Can Cut Heaven And Earth","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I Have A Blade That Can Cut Heaven And Earth / Wo You Yidao / Ke Zhan Tiandi / 我有一刀 / 可斩天地","Heavenly Emperor Lin Dao, in his pursuit of comprehending the supreme blade heart, dispersed his cultivation to start anew. However, he was betrayed by Wang Xian’er, leading to a change in the heavenly throne. At the brink of death, Lin Dao comprehended the supreme blade heart. His soul lay dormant for thousands of years before awakening and possessing an abandoned disciple of the Heavenly Sword Sect. Coincidentally, the abandoned disciple was sent to the Divine Blade Sect as a scapegoat. Lin Dao then used the Divine Blade Sect as his base, meticulously preparing for revenge against Wang Xian’er. Subsequently, Lin Dao annihilated the Heavenly Sword Sect, defeated the Soul Annihilation Hall, and forcefully unified the three major continents. This also revealed the puppeteer who had always been behind the scenes – the Azure Cloud Sect, the strongest force created by Wang Xian’er. The conflict between the two emperors thus began."]},{"title":"Love Affair","tags":["Manhwa","Romance"],"disc":["Read manhwa Love Affair / 러브 어페어"]},{"title":"I Grind Dungeons Around The World","tags":["Action","Adventure","Fantasy"],"disc":["Read I Grind Dungeons Around The World, 我在全球刷副本, Wo Zai Quanqiu Shua Fuben, Universal Raider","Su Mu traveled to a parallel world, where everyone in this world will be forced to enter the game space when they are eighteen years old and become a challenger! Start various types of survival games in space! Hide and Seek! Become the victor.."]},{"title":"High School Life Guide for the Great Wizard","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa High School Life Guide for the Great Wizard / A Guide to High School Life for Archmages / The High School Survival Guide for a Wizard / 대마법사를 위한 고교생활 가이드","Despite her hatred of humans, the powerful wizard Oz decides to attend a human high school and make friends due to an old deal. Unfortunately, she has difficulty adjusting due to her uncontrollable magic. Things get even more complicated when a mysterious tornado from Oz’s world drops a knight named Dorothy at her school. In an effort not to blow her cover, Oz quickly takes him in, oblivious to the fact that this annoying intruder may be the key to unlocking the school life she wants."]},{"title":"Dear Stranger","tags":["Drama","Fantasy","Manhua","Romance","School Life"],"disc":["Read manhua Dear Stranger / Qin’ai de Mosheng Ren / 亲爱的陌生人","“A cheating fool with too many excuses!” The depressed Zheng Weiwei reunited with Gu Changan. They didn’t recognize each other immediately, despite their intimate encounter several years ago. Gu Changan helped her repeatedly through workplace assault, targeted harassment, and many other troublesome situations. “You’re just as unforgettable as I remembered.” “Hey handsome, it was just a night of passion, alright? Are you going to treat me like an accessory too, Mr. President?” A sickeningly sweet story full of cliché tropes. Be warned!"]},{"title":"All male protagonists are ill","tags":["Drama","Fantasy","Harem","Josei","Manhua","Romance"],"disc":["Read manhua All male protagonists are ill","Reincarnated in a certain girls’ game, the heroine has to make the “sick” heroes fall in love in order to return to the real world! Tecno: When referring to sick, it’s from something mental like crazy, although in the Arabic translation they put it “psychosis”."]},{"title":"Revenge of the Top Ranker","tags":["Action","Adventure","Fantasy"],"disc":["Read Revenge of the Top Ranker","The globally acclaimed VRMMO game, Yggdraverse, captivates over 2 billion users who forsake sleep for play. After dedicating himself tirelessly, Kento Kageura climbs to the game’s top rank using his account ‘King’, but his glory is short-lived as his account is seized by his stepbrother. Vowing revenge, Kento creates a new account, ‘Shadow,’ and sets out on his path for vengeance."]},{"title":"Sorry, But I Am Just a Normie","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Sorry, But I Am Just a Normie Sorry / 죄송한데 제가 일반인이라서요","I’m Woo Yeon-hee and what is my achievements? Num .01 in the world’s ranking. Num .01 ranking in Korea. Undisputed number 1 ranking. World’s first advanced gate solo cleaner The world’s first super level gate single person clearance Pass the world’s shortest special level gate solo . . . I don’t need it all. I’m sorry! Because I’m a normal person! Don’t touch me! I’m going to be a normal person from now on!!"]},{"title":"I Have a Mansion In The Post-Apocalyptic World","tags":["Action","Comedy","Ecchi","Manhua","Romance"],"disc":["Read manhua I Have A Mansion In The Post-Apocalyptic World / 我在末世有套房","I Have a Mansion In The Post-Apocalyptic World summary is updating. Come visit MANHWACLAN sometime to read the latest chapter of I Have a Mansion In The Post-Apocalyptic World. If you have any question about this manga, Please don’t hesitate to contact us or translate team. Hope you enjoy it."]},{"title":"Crazy Princess Wants the Throne","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Crazy Princess Wants the Throne","Cherna used the marriage as an excuse to return to the imperial capital and set her revenge plan in motion, only to discover that her childhood fiancé was having an affair with her royal sister, Leila. Cherna seized the opportunity to unilaterally break the marriage contract and contacted the young talents of all the great families under the pretext of seeking a new marriage partner to achieve her purpose of pulling the strings of all the great families and, in the process, became sentimentally entangled in the process with the ministers’ sons…."]},{"title":"In the Name of Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhua In the Name of Love / 以爱之名"]},{"title":"Ancestor is beautiful and elegant","tags":["Drama","Fantasy","Manhua","Romance","Supernatural"],"disc":["Read manhua Ancestor is beautiful and elegant","Bai Chuwei has lived for five thousand years, only to wait for the original development of the plot. Coming down from the mountain, she became the ancestor of all mankind.Money? The first in the world of assets. The eight great families? They are only her servants. When they all shout “Ancestor Bai Chuwei”, the fourth lord of the Duan family of Haicheng takes her into his arms. Who understands this? This brat who grew up next to her, Bai Chuwei just wanted to absorb her spiritual energy, but ended up getting involved in the plot herself…."]},{"title":"Help, the Villain I Wrote About Is Here","tags":["Drama","Fantasy","Harem","Manhua","Romance"],"disc":["Read manhua Help, the Villain I Wrote About Is Here / 救命，我写的反派找上门了"]},{"title":"The Little Lord Who Makes Flowers Bloom","tags":["Adaptation","Drama","Fantasy","Historical","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Little Lord Who Makes Flowers Bloom / The Baby Master of Flowers / The Flower Blooming Baby Lord / 꽃을 피우는 아기 가주님"]}]