[{"title":"This Country is Finished: Escaping Japan to Start over in Another World","tags":["Action","Fantasy"],"disc":["Read manga This Country is Finished: Escaping Japan to Start over in Another World","Haru Maemori, reincarnated in another world, gains cheat skills from a bored god.However, the world is stagnant and full of injustice. Frustrated, Haru mutters, “This country is already over,” echoing his thoughts from Japan. Unlike in Japan, though, Haru now has the power to correct these wrongs. Determined, he sets out to use his abilities to build a better, fairer country where he and those around him can live comfortably."]},{"title":"Conquering the Academy with Just a Sashimi Knife","tags":["Action","Drama","Fantasy","Manhwa","School Life"],"disc":["Read manhwa Conquering the Academy with Just a Sashimi Knife / Chew the Academy With a Sashimi Stick / Chewed Up the Academy With a Bag of Sashimi / I Took Over the Academy With a Single Sashimi Knife / 사시미 한 자루로 아카데미를 씹어먹음","“If I slash, it will be cut.” I, who was once called the best swordsman in the nation, have ended up in a mobile game I’ve only spent money on a few times. And I’ve even received the blessing of the ‘Sword God’! But… the only weapon I can use is a sashimi knife? Just one minute a day. I become a Sword Saint with a sashimi knife."]},{"title":"The Song of Good Nidana","tags":["Drama","Fantasy","Historical","Manhwa","Martial Arts","Military","Romance"],"disc":["Read manhwa The Song of Good Nidana / A Good Master / Hoyeonga / Hoyeonga Le ballet des papillons / 好缘歌 / 運命の恋歌 / 호연가","“I am offended by your presence.” The Moon family is in peril after the death of their father and eldest son. Moon Ji-dam turns to her fiancee Shin Woo-jo for help in a desperate attempt to solve the family’s woes. ‘How could she romp around so lasciviously every night when she has a fiancee?’ After hearing a groundless rumor, Woo-jo cruelly turns her away, never stopping to think that he may have been deceived. ‘I think I still have some pride remaining.’ With those words, Ji-dam parts ways with Woo-jo. Five years after the marriage was broken off, The pair meet again when Ji-dam is sent by the emperor to work as a petty officer at Woo-jo’s Guryang Fortress. Despite his cold demeanor towards her, Woo-jo can’t help but be bothered by her every move. After remaining still for some time, the wheels of fate begin to turn once again. What lies in store for the lingering feelings between them…?!"]},{"title":"I’m a Solo Guide","tags":["Action","Drama","Fantasy"],"disc":["Read manhwa I’m a Solo Guide","Ye Ji-an, the only S-class guide in Korea, was often called the “useless guide” due to her unique trait of having a 0% matching rate with all espers. After failing to match with an esper from Russia and on her way back home, she is suddenly swept away by a gate manifestation and wakes up alone in a strange temple-like place. The world she has traveled to through the gate is the continent of Wisrode, filled only with espers, and in this place, Ji-an is the only guide…"]},{"title":"The Obsessive Stud Scammed Me into Marriage","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Obsessive Stud Scammed Me into Marriage / I Was Tricked Into a Fraudulent Marriage by the Obsessive Villain / 집착 흑막에게 사기 결혼 당해버렸다"]},{"title":"Blue Glass","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manwha Blue Glass / Cиний лазурит / Pureun Yuri / 蓝色琉璃 / 青い 硝子 瑠璃 / 푸른유리","Every princess in Nakrang Kingdom is fated to be married off as a political tool the moment she comes of age, and Princess Sol is no exception. Seeing her older sister die after being used the same way leaves her feeling alone and helpless. That is when a mysterious medium tells her that what she desires most awaits her outside the palace. As fate would have it, Sol finds a frail boy named Miru at the slave market and feels compelled to save him. Though Miru quickly becomes Sol’s only refuge, it won’t be easy to protect him from her evil brother’s clutches…"]},{"title":"A Confident Marriage (Official)","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa A Confident Marriage (Official) / 도도한 결혼","Workaholic Lee Dain, the dazzling actress and national goddess, never saw herself walking down the aisle. But when her grandfather falls ill, she grants his final wish by marrying her failed one-night-stand, Seo Dojun. Suddenly, her life spins into chaos: handling wacky in-laws, dodging a junior actor’s advances, and dealing with her hubby’s ex. Armed with her trademark confidence and sass, she’s ready to take it all on. But will this rollercoaster marriage ever find its happily ever after?"]},{"title":"Two Names of Night","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Two Names of Night / 밤은 두 개의 이름을 가지고 있다"]},{"title":"Powerful Confession","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Powerful Confession / 전력고백","Falling in love with someone should be an exciting situation…. But not like this! Our protagonist, Hari, carries the curse of unrequited love, and Yura intends to borrow that curse. Will Hari be able to confess to her crush? Or will she give in to the complications of unrequited love? The exciting story of Hari’s first love begins!"]},{"title":"I Didn’t Lull You to Sleep Only For You to Be Obsessed","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Didn’t Lull You to Sleep Only For You to Be Obsessed / 집착하라고 재운 건 아니었는데 / I Didn’t Mean to Make Him Obsessed","“I’m going to live here with sister!”","She possessed a supporting role, who was swayed by the villain and killed by his male protagonist, Duke Claude Winterville. In addition, she accidentally picked up his nephew!\nFurthermore…","“You better tell me the truth. How did you put me to sleep?”","Like in the original novel, her ability to heal Claude’s insomnia was revealed. In the end, she even received an offer as his exclusive barista to make’ sleeping coffee’ for him!","However, to avoid the death flag, she had to decline the offer—","“I’ll open up a cafe in the capital, and of course, the owner will be you, April.”","As expected, the best treatment is financial treatment.","“I’ll do it!”","She accepted the offer, blinded by her dream of opening her own cafe.\nShe was just trying to help him sleep well and only took Claude’s hand because of the beneficial offer… but, why did he suddenly get obsessed?","“I won’t let you regret your decision.”","Somehow, his gaze looked unusual."]},{"title":"Want to See My Cat?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read mạnhwa Want to See My Cat? / Do You Want to See My Cat? / Wanna See My Cat? / うちの猫見ていく？ / 우리 집 고양이 보고 갈래?","Chayeong Mun had the perfect life — a peaceful life in the countryside with a loving husband, three cats who run the house, and two dogs who think they’re cats. One day, she goes into the city to meet her friends and dies while saving a student from being hit by a truck. The god in the afterlife gives her the incredibly rare chance to go back to her wonderful life, but only under the condition of going back 10 years in time. Given the second chance, Will she be able to marry her husband again and rebuild that perfect life she knew?"]},{"title":"Random Target","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Random Target / 랜덤타겟 / 随机恋爱","Choi Serin is struggling with finding her perfect ideal man. She became a fool after failing her first love and was dumped by her very handsome ex boyfriend a week before her birthday. In the end, she tried to find a man that’s like a ‘unicorn’ in the legends… But one day, she really met a unicorn in a VR blind date app <Random Target>! So, who is Choi Serin’s true love?"]},{"title":"The Password Is 002","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Password Is 002 / 암호는 002!","Sujung finally makes up her mind to confess her feelings for Dojin, her classmate who she’s had a crush on for 6 months. However, Dojin is unable to recognize Sujung on the street and passes by her. Shocked by this, Sujung is unable to go to class and runs off to the gym’s storage. There, she meets Jaehyun, who promises to help Sujung and Dojin get closer… How? By making a grand scheme to seduce her crush with his younger brother!"]},{"title":"My Crush Got Possessed by the Duke","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural"],"disc":["Read manhwa My Crush Got Possessed by the Duke / One Day, My Partner Was Possessed by the Duke / One Day, the Duke Was Possessed by His Partner / One Day, the Duke Was Possessed My Partner / 幼なじみは今日から公爵様! 幼なじみは今日から公爵様！ / 어느날 짝남에게 공작님이 빙의했다","So-a knows that having a crush on a childhood friend can be complicated, but it’s even harder when he gets possessed by… the duke?! When So-a’s friend Yuseong is suddenly possessed by Duke Hereis De Licariel, they must figure out a way to get Hereis back home — which is easier said than done when Hereis sounds like he came straight out of a fantasy novel! Can So-a get her childhood friend back while having to juggle academics, sports, and a duke who also happens to be a swordmaster?"]},{"title":"A Couple Of Obligations","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Couple Of Obligations / 부부의 의무를 원하신다면","The tall, imposing gates of the castle opened grandly as the charismatic princess of Bashar met the sharpest sword of the empire, a fearsome warrior known across the lands for his valor and strength.As their eyes locked in a moment of unspoken understanding, the courtiers whispered about the powerful alliance forming before them, a union meant to solidify bonds and secure peace in turbulent times.Yet behind the facade of diplomatic unity, a tempest of emotions rages within each of the newlyweds, torn between duty and desire, their hearts entwined in a dance of secrecy and longing.In the dimly lit corridors of the castle, a tingling thrill of forbidden romance grows, as two souls collide in a whirlwind of passion and uncertainty, bound by fate but pulled apart by the secrets they hold."]},{"title":"Concubine Scandal","tags":["Drama","Fantasy","Historical","Josei","Manhwa","Romance"],"disc":["Read manhwa Concubine Scandal / 후궁 스캔들 / 後宮スキャンダル","Hwayeong was forced to go to the princess selection contest because of her little sister. By using this as a chance, she makes a plan to get kicked out in a dramatic way! However the plan becomes difficult due to Prince Shin Young. On the contrary, Hwayeong catches the empress and empress dowager’s eye and becomes a top candidate to be elected."]},{"title":"Wild Night","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Wild Night / Chaotic Nights / Stormy Nights / 폭야(暴夜) [완전판]","A high-level historical drama set in an oriental style, depicting the delicate process of Seo Jihak, a man abandoned after attachment and remorse, and Lee Eunha, a pure and affectionate lady, falling for each other. Based on the original work by Jin Soye.\nEunha, in her quest to rescue her sister from the life of a kisaeng, is unexpectedly offered the role of a personal reader for a blind man. Afterward, she meets a dangerous man named Jihak, who, for some reason, wants to use Eunha. As time passes, they gradually fall for each other while hiding their true feelings…"]},{"title":"Back to Chanbi","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life","Slice of Life"],"disc":["Read manhwa Back to Chanbi / 백투더찬비","The 18-year-old Kang Gyeonoh enjoys the mutual love growing between him and the extremely beautiful Baek Chanbi from the same class. The growing attention he gets from the girl, the one to always make the first move, ends when she gets into an accident. An accident that erases her memories of the past year, including the memories of her liking Kang Gyeonoh…"]},{"title":"Sisters War","tags":["Drama","Psychological","Romance","School Life"],"disc":["Read Sisters War / Sisters at War / Sister Wars / Soeurs ennemies / สงครามสองพี่น้อง / 姊妹戰爭 / 姐妹战争 / 자매전쟁","Two girls who want to be recognized as greater than the other. Won Rion and Haera Chu will compete for the first place spot in Daehan art high school. It’s a catastrophically war between two half-sisters."]},{"title":"Your Instinctive Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Your Instinctive Love / Instinctive You / 본능정인 그대 / Locked Onto You","Shin Yu-jin, a clumsy male friend with shaggy hair who only knew about studying. He, who was foolish, changes 180 degrees and shakes Kang-hee’s heart. “I can’t watch you with other guys pretending to be friends anymore.” Her fluttering first love that started like that, Yoo-jin leaves in an unexpected accident, leaving Kang-hee with a trauma. Eight years later, Kang-hee became a homicide detective. She’s been on an undercover job for a week and she meets a strange man in a hotel lounge. A face and coupling that resemble Eugene’s. Confused by her confusion, Kanghee ruins his seat, and the two continue to get entangled due to an inevitability like a coincidence…"]}]