[{"title":"Oh! My Maid Master","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhua Oh! My Maid Master / My Dear Maid /  哦！我的女仆大人","Katie, who lives in a small port somehow saved Count Brown’s only daughter, so she becomes the Brown family’s maid and meets the aggressive successor of the Brown family. During their first meeting, she mistakes him for a priest so the start developing a strange relationship… with a mysterious yet aggressive alex and a katie who was suddenly pulled into this, what will be the result of their intertwined fate?"]},{"title":"Level Drain","tags":["Action","Adventure","Drama","Fantasy"],"disc":["Read manga Level Drain / 絶対無双の冒険者","“In this world, levels are absolute, and the weak are deprived of everything. I was once like that…”","This is a world where dangerous monsters roam the land and adventurers make their living by defeating them. With level as the symbol of absolute power, those with the higher levels gained wealth and fame while those with the lower levels exploited others further beneath them.","The protagonist, Alca, was called a “corpse scrapper” because of his “Unable to gain experience” skill, which prevented his level from rising, making him the lowest in society. Under such circumstances, he obtained the “Abyss Armor,” a suit of armor of calamity.","This armor makes him able to use “Level Drain,” which allows him to absorb the level of the person he kills!","“With this power, all those who stand in my way will be……”","Alca, who now has obtained the “Level Drain”, begins to increase his fame and abilities as an adventurer by absorbing the levels of both humans and monsters alike.","But before his path, dragons, the strongest species in the world, as well as adventurers of the natural disaster class, of which there are only a few in the world known. stand in his way.","However, even they are nothing but stepping stones for him.","This is a heroic tale of a jet-black knight, once despised as the lowest of lowest, who now takes from those above and grows to become the most powerful being in the world."]},{"title":"Ex-wife of A Billionaire","tags":["Drama","Liexing","Manhwa","Ping Ping Jun","Romance","Shoujo","Webtoons"],"disc":["Read manga Ex-wife of A Billionaire /A Billionaire’s ex-wife / The Expensive Ex-Wife Of A Wealthy Family / 一夜危情：豪门天价前妻 / 豪门天价前妻 / 이혼해줄래요?","Young designer Jian Mo is the secret wife of the famous Emperor Corporation’s C.E.O. Gu Beichen\nShe lives a rich and supportive life, until work causes her to meet her college sweetheart.\nJian Mo’s love life soon becomes complicated as she is immersed in a world of elite and luxury.\nJianmo, known by the nickname ‘Campus Flower’, separated from her partner after her boyfriend decided to study abroad after graduation.\nThe couple decided to keep their long distance relationship and wait for each other before starting a new life together.\nOne evening, the girl group gets into trouble after going out drinking with one of her confidants, but she is unaware of the nightmare that will follow.\nWill the nightmare change her for the better?"]},{"title":"The Obsessive Male Leads Wants to Eat Me","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa The Obsessive Male Leads Wants to Eat Me / 집착 광공들이 잡아먹으려고 해 / The Obsessive Male Leads Want To Eat Me Alive","I possessed someone in a depraved adult BL novel and met the young obsessive male lead (Top). After being bullied by the bottom for years, he turns to a darker path in his adulthood and becomes the crown prince, indulging in imprisonment, obsession and all sorts of heinous adult past-times. Hmm… Then if the bottom never bullied the top, it would have a happy ending, right? — For the bottom’s happy future, I met the young obsessive male lead top… and he was super cute?! ‘Oh, my heart. He’s like a furry baby predator.’ My baby, I shall protect you! I fed, raised and even introduced the insecure obsessive male lead top to the bottom. ‘Big Sis, I don’t like that bastard. He’s disgusting.’ Of course the bottom was hesitant at the beginning, but the two ended up a little closer. I left with peace of mind. I hoped that my favourite character would lead a happy lives with each other, but, despite my intentions- A few years later, I heard that an obsessive male lead was sweeping through the battlefield looking for me. — With a height reaching almost 190cm, shoulders as wide as a wild beast and black hair with the scent of blood, Sislin held my waist with a look in his eyes akin to that of a freshly captured beast. ‘Annette is tiny.’ Red eyes tinged with madness turned towards me. ‘But I’m not.’ — Heinley undid my ribbon with his bright red lips. Swish – I could hear the thin cloth rub against each other as it came undone. ‘You promised not to leave me behind.’ Purple irises with a hauntingly beautiful smile. ‘What kind of punishment should I give… to a naughty child that breaks her promises?’ — He was a stranger, the man who ‘proposed’ to me with countless slaves caged up behind him. ‘It’s a present. You wished to raise a smart pet, after all.’ All I did was raise some boys for a happy ending, but these obsessive male leads want to eat me alive. Why? What happened…?"]},{"title":"I Can’t Be This Stupid","tags":["Manhwa","Romance","School Life"],"disc":["Read manhwa I Can’t Be This Stupid / He Can’t Be This Dumb! / 이렇게 바보일리 없어","‘Doha’ transfers to Kukje Island High School, where only the rich can attend. This place is famous for a unique system in which dormitory buildings and room sizes are determined by rank…\nAmong them, you will continue to stumble across ‘Rowoon’ – the most famous, who has used the largest VIP room for three years. Rowoon, the perfect man with face, body, intelligence and loyalty. But there’s only one thing missing…that’s an infatuated idiot who doesn’t even understand women’s psychology!\nDoha has a twin sister, and is also a fan of Rowoon. They share their news using a special stone (which can communicate with each other through the heart). One day, she discovers that her sister’s stone has fallen into Rowoon’s hands.\nBut Doha had suddenly left the dormitory. Rowoon realized the absence, for lack of the appearance of a familiar image in the VIP room. They have decided to give each other what they need..\nDoha takes an active role as Rowoon’s secret love consultant, and a romantic life together begins."]},{"title":"The Goddess of Healing","tags":["Drama","Historical","Isekai","Romance","Tragedy"],"disc":["Read manga The Goddess Of Healing / Fei Wei Jiuqing / Fēi Wèi Jiǔqīng – Shényī Xiǎo Jiāo Fēi / La déesse de guérir / 《妃为九卿》- 神医小娇妃 / 환생하여 의녀가되다","The daughter-in-law of the Guanjia family, after getting accused of something she never did by her step-sister she is executed. After her death, she is reincarnated to Fanghua’s year. Follow the path of MC’s re-life!!"]},{"title":"Shadow Bride","tags":["Historical","Romance","Shoujo"],"disc":["Read manga Shadow Bride on manhwaclan\nYunjo is a young prince who always serves his kingdom from behind the scenes. He has spent his life in the shadow of his brother, crown prince Yigang, fighting enemies and winning wars in his name. All that changes when one day, he meets Seolyun, a mysterious and charming woman who seduces him instantly. What happens when a man emerges from the shadows to follow his heart? Will he be able to overcome all the obstacles on his way to the light and be with the one he loves"]},{"title":"The Omniscient Point Of View Of An Unrequited Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Crush of a Lifetime / The Omniscient POV of an Unrequited Love / The Omniscient Point of View of an Unrequited Love / 全知单恋视角 / 전지적 짝사랑 시점","Hyeji is a social media star with over 100,000 Instargram followers. She’s received tons of confessions because of her popularity, yet despite that she’s never been on a single date.","But one day, she gets asked on a date—by another popular social media star that she’s secretly been following, no less!","On the day of the long-awaited date, when she’s alone, Hyeji finds that the only way she can get a perfect selfie angle is if she takes it with her toes…","Just then, Kisung, a part-timer there, accidentally opens the door, revealing Hyeji mid-shot, and to her date, of all people…!","After her disastrous date, Hyeji decides she’s done being Forever Alone and is determined to find The One.","Hyeji starts school with her new ambitious aspiration, only to find she’s in the same class as the cause of her tragic toe incident—Kisung!"]},{"title":"Blood Reverie","tags":["Drama","Fantasy","Historical","Supernatural"],"disc":["Cassia works a Dead-End job, lives in a cramped apartment, and can’t remember her own last name. Good thing she has a sexy vampire boyfriend who lives in her dreams- if only he were real, then maybe life wouldn’t suck so bad."]},{"title":"Global Examination","tags":["Action","Adaptation","Romance","Shounen Ai"],"disc":["Read manga Global Examination","This is a test that puts your life at stake. Pass the test and survive. When the two-faced examiner Qin Jiu meets the cold examinee You Huo, the two amnesiacs are put head to head in a fight by the inhumane system. However, they form a tactic agreement. The system collapses after a series of warnings and the erased memories gradually become clearer. It turns out that at the end of this smoke-filled world, you are still the first person I met. The world is brilliant and grand. Welcome home."]},{"title":"Useless Wizard","tags":["Action","Adventure","Fantasy"],"disc":["Read Useless Wizard / 底辺魔術士 / 底辺魔術士～工作スキルでリスタート～","In Fortelnia, a world where strength and destiny are all determined by the rank of “existence power” a power that people born with. Aruto, who has only the lowest rank of existence [☆1], is so powerless that his girlfriend Hanna is killed by Gamizin, the world’s most powerful mage. However, Aruto, who has lived with regret in his heart, gets a chance to start his life over after death–? Making full use of his “crafting skills,” a special power given to him by God, he sets out on his second life to save Hannah’s life!"]},{"title":"Priscilla’s Marriage Request","tags":["Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Priscilla’s Marriage Request / La demande en mariage de Priscilla / La solicitud de matrimonio de Priscilla / Permohonan Pernikahan Priscilla / Proposición de matrimonio de Priscilla / Присцилла просит о замужестве / フリーシラーの結婚依頼 / 女伯爵的結婚請求 / 女伯爵的结婚请求 / 恶魔的契约新娘 / 惡魔的契約新娘 / 프리실라의 결혼 의뢰"]},{"title":"Deadly Vs Romance","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Deadly Vs Romance / Lethal Romance / 필살VS로맨스","A woman who is like a martial arts manhwa character “Yubi”. A man who is like a shoujo manhwa character “Shin-woo”. The two who are used to living in their own genres won’t easily fall for each other! Will they be able to achieve a happy ending according to the standard of manhwa?!"]},{"title":"Goodbye, In-Law","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Goodbye, In-Law / Goodbye In-laws / 再也不见 / 굿바이 사돈","Because of a misunderstanding 8 years ago, Jung Da-ae and Lee Han-eol are mortal enemies. To make things worse, their siblings get married making these two in-laws! But then the bride and groom are killed in an unfortunate accident. In a moment of mourning and arguing in the middle of the road, Jung Da-ae and Lee Han-eol are hit by a truck, killed and transported back to when they were in high school! Is this their chance to fix everything?!"]},{"title":"New Year’s Taste","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa New Year’s Taste / Toyboy’s Charm / The Taste Of Someone Younger / 연하의 맛","Gong In-joo was dumped by her boyfriend, Ahn Geurim, for no reason. In-joo, who has been living while depending on Ahn Geurim all this time, feels the emptiness of losing Geurim and plans to get him back. The first thing in the plan is to arouse Geurim’s jealousy! To do this, she tries to seduce Seo-yoon, a handsome junior she met during volunteer work, but Seo-yoon had a crush on someone…What will the end be for the two people who form an alliance to win over love…?"]},{"title":"Contracted Lover","tags":["Romance","Webtoons"],"disc":["Read manhua Contracted Lover / 总裁的契约情人(中文) / Kekasih Kontrak(Bahasa Indonesia) /  Amante Contratada(Español) / The President’s Contract Lover","Contracted Lover Comics Online. Why an orphan girl with a bumpy life would be favored by a president? What kind of unknown past did an icy president have?","The President’s Contract Lover","102"]},{"title":"One Episode is Enough for Unplayed","tags":["Comedy","Drama","Historical","Manhwa","Romance","School Life","Slice of Life"],"disc":["Read manhwa One Episode Is Enough For Unplayed / A Single Round at Romance is Enough  / First Round in the Dating Simulator is Enough! / One Playthrough is Enough! / 미연시는 1회차로 족하다","One day, I became the heroine of a love simulation game, Deborah. After seeing that I would be sent back to my world after achieving a Happy Ending, I finally managed to receive the confession of the male leads through many struggles. [ Normal Ending achieved! ] ‘What? Normal ending? Didn’t the happy ending with the female lead and male lead end well?!’ The second round started again after failing to achieve a happy ending. ‘Oh, I don’t know, tell them to stop this!’ It’s none of their business to decide my life. I have to be happy! Unlike the first round, I’m going to do what I want to do… But aren’t the male leads acting a bit weird?! First Round in the Dating Simulator is Enough!"]},{"title":"Falling Flower, Flowing Water","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Falling Flower, Flowing Water / 낙화유수"]},{"title":"Sound of Bread","tags":[],"disc":["Read manhwa Sound of Bread"]},{"title":"The Snowflower Blooms for Revenge","tags":["Drama","Fantasy","Historical","Mystery","Romance"],"disc":["Read manga Kyuujo Sekka -Koukyuu no Hana wa Fukushuu ni Saku- / Miyaonna Sekka -Koukyuu no Hana wa Fukushuu ni Saku- / เสวี่ยฮวา -บุปผาชำระแค้น- / 宮女雪花-後宮の花は復讐に咲く-","“Xuehua, a no-nonsense handmaiden seeking promotion in the harem, is one day entrusted with the important task of serving the feared Princess Bailian, an immortal witch from an enemy nation. However, the diligent Xuehua finds that “Princess” is actually a man…! Deciding to cooperate with “her”, Xuehua finds herself embroiled in the harem’s maelstrom of vengeance. From Nishiya Shita, the author of The World is Made of Happy Endings, comes a classic, Chinese, romantic fantasy. The adventure begins!”"]}]