[{"title":"Sister, I Am the Queen in This Life","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Sister, I Am the Queen in This Life / Sister, In This Life, I’ll Become The Queen / I’m the Queen in This Life / 언니, 이번 생엔 내가 왕비야","Her fiance, her sister, and her parents. Ariadne returns 14 years in the past, the day she was cast aside by everyone. “Shit! I am trying to court you right now!” From her fiance, who acted much different than he did in the past, “Don’t cry, Ariadne. Don’t you know how pretty you are to me?” to the kind Prince, who fell for her at first sight. This time, she will get revenge on everyone and become Queen."]},{"title":"It Was Just a Contract Marriage","tags":["Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa It Was Just a Contract Marriage / 계약 결혼일 뿐이었다 / It Was Just A Contract Marriage / Promo Novel / FtrSumoms","The empress of a fallen nation was dragged to the enemy empire. Despite everything, the Treasure of Grandel was still gorgeous. However, in the end she was just a captive who was going to be hanged by the savages. Eliza wanted to avoid that outcome no matter what, even if she had to tell outrageous lies. There was only one option: the man known as Banella’s guard dog, the enemy empire’s Commander, and a lowly and vicious warrior—Lezet Christian. Eliza had to convince this cold and obstinate man who stood before her. In a trembling voice, she said, “I’ll give you a child.”"]},{"title":"Falling for a Dying Princess","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa Falling for a Dying Princess / If I Fall in Love With the Time-Limited Princess / If You Fall In Love With A Terminally Ill Princess / 시한부 공주님을 사랑하게 된다면"]},{"title":"I’ll Save a Decent Family","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’ll Save a Decent Family / 망할 가문을 살려보겠습니다, I’ll Save this Damn Family! / I’ll Save This Damned Family!","Ji-Woo Lee, an author gets reincarnated into her novel as Tara Elias, the 5th daughter of the Elias family. However, the family is supposed to fall soon, and everyone in it will be executed. Ji-Woo insists that she will escape her fate."," "]},{"title":"Heavenly Inquisition Sword","tags":["Action","Adventure","Martial Arts","Murim"],"disc":["Read manhwa Heavenly Inquisition Sword","By Redice Studios, the ones who brought you <Return of the Disaster-Class Hero> and <Solo Leveling>!","“He is the master of the Nine Heavens.”","Yeon Jeokha was the child of a second wife. Viciously bullied by his father’s first wife and his siblings, he was later imprisoned in a warehouse after his father died of illness…","It has been ten years since his escape after he had learned martial arts that were out of the world.","“I regard the Yeon Family with great bitterness.”","The unstoppable adventure of the sole successor of the Heavenly Inquisition Sword, Yeon Jeokha, begins now!"]},{"title":"Solo Max-Level Newbie","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa Solo Max-Level Newbie, 나 혼자 만렙 뉴비 , I’m the Only Max-leveled Newbie\nJinhyuk, a gaming Nutuber, was the only person who saw the ending of the game [Tower of Trials]. However, when the game’s popularity declined, it became difficult for him to continue making a living as a gaming Nutuber. Since he already saw the ending of the game, he was about to quit playing. But that day, [Tower of Trials] became reality, and Jinhyuk, who knew about every single thing in the game, took over everything faster than anyone possibly could! “I’ll show you what a true pro is like.”"]},{"title":"Till Divorce Do Us Part!","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa Till Divorce Do Us Part! / The Case of Hiring the Upper-Owner Husband / Till Divorce Do Us Apart / 雇你做商团主的老公 / 상단주 남편 채용의 건","Carly Browning, the head of the powerful Brownings, is sick of suitors eyeing her fortune. Her solution? Propose to young aristocrat Ethelred Elad! With his family in ruins, this sham marriage would be perfect for both of them, just until they’re able to divorce. If they do divorce, that is."," "]},{"title":"My Status Window is on Strike","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa My Status Window is on Strike / 내 상태창이 파업했다","The S-rank skill “Dramatic Growth,” which I couldn’t use for seven years… All because my status window was an outdated version? Why am I only finding this out now?! There’s no way I’m letting this go. I’m going to reclaim everything I missed out on! The brilliant and comedic revenge story of Taejun Lee, with the new status window manager and Dramatic Growth, begins!"]},{"title":"The Villain Family’s New Daughter-In-Law","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Slice of Life","Time travel","Villainess"],"disc":["Read manhwa The Villain Family’s New Daughter-In-Law / 악당 가문의 새아가 / The New Daughter of The Villainous Family","Luciel, the “Crystal Fairy,” creates jewels whenever she feels strong emotions. After being used and ultimately dying, she finds herself returned to the past! “This time, I won’t live like that again.” To avoid the terrible fate she remembers, she proposes a contract marriage to the most notorious villain family in the empire. But something strange happens. It was supposed to be temporary, yet… “How about making you our daughter instead of just a daughter-in-law?” “I’ve always wanted a granddaughter. You’re perfect!” “When I grow up, I’m going to marry sister-in-law!” Wait, aren’t you supposed to be the villain family? Why are you acting like this? And then there’s him… “Whether you create jewels or flowers, it doesn’t matter to me.” Belstein’s reaper, the man who led her to ruin in her previous life, now smiles at her with a young face. “If you try to escape my sight, I’ll chase you to the ends of the earth, Luciel.”"]},{"title":"Online Game: I Can Evolve Everything","tags":["Action","Adventure","Fantasy"],"disc":["Read Online Game: I Can Evolve Everything","Betrayed by a good brother, lost billions in wealth, lost close family members, and even lost both legs.","Reborn, in this life I will take back everything that belongs to me!!!"," ","The game descends, and no one knows this game better than I do!","Entering early at a high price, spending crazily, and acquiring the god-level talent [Evolve Everything].","My revenge starts now!"]},{"title":"Savage Forest","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Savage Forest / 세비지 포레스트","The Aguilea tribe considers a healthy body to be their greatest asset.","Enya lives there and is not treated as a person because she has a crippled leg. But she has Tarhan by her side, the incarnation of the predecessor Leias and the most revered man in Aguilea.","“Don’t have any other man but me. And I will do the same.”","Tarhan constantly longs for Enya and is obsessed with her, but Enya is overcome with unknown anxiety due to people’s cold treatment towards her and Tarhan’s abnormal obsession…","In a dizzying world, can two people become the salvation for each other?"]},{"title":"Holy Emperor’s Grandson Is A Necromancer","tags":["Action","Adventure","Drama","Fantasy","Historical","Isekai","Manhwa","Reincarnation","Shoujo","Shounen","Supernatural"],"disc":["Read manhwa Holy Emperor’s Grandson Is A Necromancer / 성황의 손자는 네크로맨서","Our MC dies from an accidental electrocution and ends up inhabiting the body of a young prince in another world, his new profession being the Necromancer he chose in the game he was playing before his untimely demise. However, things are not what they seem – including his own Necromancy skills!"," "]},{"title":"Expelled Hero Is Too Strong","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Expelled Hero Is Too Strong / 파티에서 추방된 영웅이 너무 뛰어남 [독점]","” Yu jihan, you’re useless.”","Yu jihan, a member of Kim hyuntae’s party, ‘Keroz’s’ rank 1 party, suddenly received a notice of expulsion.","After 7 years of dedication, all he is left with is a severance pay of 10 million won.","However that’s okay.","I have ‘Sampling,’ the ability to see probability.","[Chances of growing into a giant guild if you join the fun guild]","[99%]","I swear I’ll be more successful than you!"," "]},{"title":"The Princess’s Bedchamber Toy","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Princess’s Bedchamber Toy / 황녀의 침실 인형","Laha, the princess in an unwanted golden cage. One winter day, her tyrant brother gifted her a slave to warm her bed. “Didn’t the servants teach you to listen well to your master?” “So, what should I do?” The man was a captive trampled by the Empire and a slave facing imminent death. His eyes were filled with nothing but hatred, and she knew that she was also within the target of that hatred. Laha was ready to give her life to that hatred. However, the look in the man’s eyes had changed. “Laha Delharsa. I desire her as a prize.” A princess who wished for death and a slave who desired her What awaits them at the end?"]},{"title":"Enough with the Flirting","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Enough with the Flirting / 작작 좀 들이대시죠","Rolicia Roba’s world is turned upside down when her mother tragically passes away. And not only does her long-lost father come to fetch her, but he turns out to be the renowned Count Roward. Thrust into noble society as an illegitimate child, Rolicia is determined to secure her own future without relying on her newfound father. But her cunning stepmother and selfish half-sister are standing stubbornly in her path… and so is Lockhart Caidel, the wartime savior of the second crown prince. With razor-sharp wit and a will of steel, Rolicia refuses to go down—or fall in love—without a fight!!!"]},{"title":"The Crazy Killer Whale’s Favourite Penguin","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Crazy Killer Whale’s Favourite Penguin / 미친 범고래의 애착 펭귄","Born as a penguin, I miraculously transformed into a human. The problem? My guardian, the Tower Master, hates beastmen. Fearing discovery, I ran away, only to be found out by a self-proclaimed penguin enthusiast.","Whale clan orca beastman, Suuradel, looked at me intensely, his eyes reddening sensually.","“Ha… Your wild eyes are incredible.”","Those aren’t eyes, just white feathers.","“May I touch your belly fat?”","Seriously? Furious, I pecked at him, but he looked oddly elated.","“Did you just kiss me?”","…It seems I got caught by a lunatic, not a penguin enthusiast."]},{"title":"The Reincarnated Assassin is a Genius Swordsman","tags":["Action","Adaptation","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa The Reincarnated Assassin is a Genius Swordsman / 환생한 암살자는 검술 천재","I was a chained dog in my past life. I didn’t remember my parents and I lived an emotionless life; like a tool. That life ended with my master horrifically killing me. I thought that was the end of my life. But when I opened my eyes again, I was born as the youngest child of the continent’s most powerful family. For both revenge and those who treasure me in my new life, I wielded the sword instead of the dagger."]},{"title":"Even if the Villain’s Daughter Regresses","tags":["Drama","Fantasy","Historical","Magic","One shot","Romance"],"disc":["Read manhwa Even if the Villain’s Daughter Regresses / 악당의 딸은 회귀해봤자 / Even if the Villain’s Daughter Returns","A child who lost everything to a villain. Ten years later, that child returned as a hero called a demigod. And the enraged hero began his revenge by killing the villain and his family… But there was a problem. It was that Lila was the daughter of that villain. “Are you Lila Hildegar?” “You’ve got the wrong person.” “No, I think I’ve got the right one.” …Pretending to be someone else, failed! “Please spare me.” “No.” …Begging for her life also failed! There was no other choice. Lila chose the last resort. “Any last words?” It was to swallow the “Regression Stone” and return to the past after death. “It wasn’t pleasant meeting you, so let’s never see each other again!” That’s how Lila returned to the past, opened her eyes at the age of ten, and… Died again. Lila tried to survive. She tried and tried again. That was all she did… “Why did you save me?” The boy answered with a pale face. “Because I’ve gone mad.” …The enemy who had driven Lila to death several times became strange. [Villain’s daughter female lead/female lead who wants to live to be 90/is still the villain’s daughter even if she regresses] [Male lead who lost his home and family to the villain/male lead whose only goal in life is revenge] [Opposing parties are enemies → What are you doing right now…?]"]},{"title":"Ranker Who Lives A Second Time","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Ranker Who Lives A Second Time / Second Life Ranker ,The Ranker Who Lives Twice ,Ранкер, который живёт второй раз/ 두 번 사는 랭커","Yeon-woo had a twin brother who disappeared five years ago. One day, a pocket watch left by his brother returned to his possession. Inside, he found a hidden diary in which was recorded “By the time you hear this, I guess I will be already dead….”"]},{"title":"Return of the Sword God-Rank Civil Servant","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Return of the Sword God-Rank Civil Servant, 검신급 공무원의 회귀","[By the Studio that brought you {Margrave’s Bastard Son was The Emperor}! and the Author that brought you {The Rebirth of an 8th-Circled Wizard}!","Sword God, Ahn Su-ho.\nSurprisingly, humanity’s greatest swordsman player was a civil servant hunter affiliated with the Korean Hunter Association.\nSu-ho chose the path of a public servant purely to end the gates.","Perhaps that’s why?\nWhen one of the disaster-level gates, called the final gate, was attacked,\nIn an ironic turn of events, he was betrayed by his comrades.","“It would have been better if he had joined us from the beginning. Public servants are so stubborn.”","The reason his comrades betrayed him?\nBecause if the gates were closed, their influence would disappear.","Is this the end?","Just as Su-ho’s consciousness was fading away,","[Rebooting the system of player Ahn Su-ho.]\nThe system gave Su-ho one more chance.\nA chance to go back to the past and set everything right."]}]