[{"title":"I am the Most Powerful Transcendent Being","tags":["Action","Adventure","Fantasy"],"disc":["Read I am the Most Powerful Transcendent Being / I am the strongest awakeners, recognized by all of the world’s cheat masters","Awakeners, beings with exceptional physical and special abilities, exist in this world. Kannagi Minato, who has been bullied daily, finds himself dragged into a deadly situation. At the brink of death, he is suddenly reawakened. Inside him dwell the heroic spirits of the past founders who saved the world. His life changes after that incident."]},{"title":"Dungeon Defense","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Psychological","Tragedy"],"disc":["Read manhwa Dungeon Defense","When his total scumbags of parents die, he finds himself with a mysterious inheritance of 500 million yen.","Deciding to do whatever he likes from then on, the boy enters the most challenging online game, “Dungeon Attack,” where he becomes the first to unlock the achievement of defeating all the Demon Lords. However, when he answers a mysterious question that appears after completing the game, he suddenly finds himself sent into the game world.","He had been reincarnated as “Dantalian,” the lowest and weakest Demon Lord, ranked 71st in the game world! With nothing but his memory of defeating the strongest Demon Lord and his eloquence to rely on, he fights to survive in this brutal world – this is a story of comeback and revenge!"]},{"title":"On Off Romance","tags":["Action","Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa On Off Romance / 온오프 로맨스","In the MMORPG world, veteran player “Minseo” helps newbie healer “Angelica01” fend off trolls. Their friendship blossoms, leading Minseo to suggest a real-life meeting. However, he’s surprised to find a tall, intimidating young man claiming to be Angelica’s brother, “Jin.” Strangely, Jin looks just like Angelica! Can Minseo navigate his feelings as he moves between the virtual and real worlds?"]},{"title":"I am the Older Sister of the Possessed Female Lead","tags":["Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I am the Older Sister of the Possessed Female Lead / She is The Older Sister of The Posessed Lady / My Sister’s Happy Ending / 빙의물 여주의 언니입니다만","My younger sister who used to harass me has changed! “Me? Tied you up? My sister?” Why, why are you suddenly speaking formally? She can’t even remember what she did! “It would be good for my older sister to participate in the debutante ball this year too.” You told me not to go even last year… “How about a cool-looking guy with black hair who doesn’t seem to get a drop of blood even if he gets stabbed? What about a pretty and delicate young man like a puppy in the rain? There are people who are a little inferior to the two in front of them, but there is one person who is really good!” She even recited the men’s personal information saying she should know my taste. No, rather, do I look like I’m going to play with a guy now? “Will you marry me? Annette of Valois.” “Annette, Annette, I wish you were a parrot. So that I can watch and raise you in a cage.” Let’s play… It looks like we’re going to play… “Ah, but older sister! That guy can’t!!!” It’s all good, but sister, can’t you at least tell me why you don’t want anyone? I wondered why she suddenly became kind, but this little sister seemed to have just come out of the boat! There’s a flower boy approaching my younger sister! Her Majesty the Empress, who is stuck in a strange place and only favors me! Oh, I don’t know. I’d rather go back to the way it was before…"]},{"title":"Conquering Dungeons With Copy Paste!","tags":["Action","Adventure","Fantasy"],"disc":["Conquering Dungeons With Copy Paste!, 던전공략은 복붙이지, Copipe de Dungeon Kouryaku!, Copy Paste de Dungeon Kouryaku!","Synopsis Conquering Dungeons With Copy Paste!:\nSeo Han-Jun, the protagonist, is cursed by a Transcendent being with a skill called “Copy-Paste” (Ctrl+C, Ctrl+V) and given only 20 years to live.\nHowever, this skill only works on himself, and its growth is stunted, leading him to live a disregarded life as a low-level hunter.\nOne day, while fighting in a dungeon, he discovers a way to develop his Copy-Paste skill! With this newfound power, he quickly becomes a world-class hunter.\nNow, together with his companions, Han-Junmust prevent the impending catastrophe. Will Seo Han-Jununcover the Transcendent’s identity and save the world?"]},{"title":"Son-In-Law Above Them All","tags":["Fantasy","Manhua","Martial Arts","Romance"],"disc":["Son-In-Law Above Them All, 第一赘婿 / THE BEST HUSBAND EVER manhua\nQin Li, whose parents have disappeared, has been practicing silently for ten years after receiving the secret exercises of the mysterious old man. After marrying Chu Qingyin who is a sexy wife, he tasted the warmth of the world. After ten years of success, he began to counterattack!"]},{"title":"Bloodhound’s Regression Instinct","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Bloodhound’s Regression Instinct","“Yan,” the protagonist, was brainwashed by the emperor and lived as his puppet.\nAfter finding out he was being played by the emperor, he planned to seek revenge, but collapsed due to the emperor’s might.\nHe thought he had died, but when he woke up, he realized he had regressed to the time when he was a recruit.\nWhether to seek revenge on the emperor or to find his family. The choice lay in his hands."]},{"title":"Return of the Legendary Spear Knight","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Unrivaled Spear Knight / Return of the Legendary Spear Knight / 역대급 창기사의 회귀","The stereotype that knights must use swords is broken by the brightest star of a duke’s family. The hero that brought an end to the empire’s civil war. The name of that person is Joshua Sanders.\nDespite his reputation of being called the empire’s unrivaled spear, he was bleeding dark red blood. Not just anyone but by the hand of his own emperor, Kaiser… “Kaiser! Don’t think it will end like this!!” Moments before death, incurred by magic circle, the spear that spent its years together with him, ‘Lugia’, started to emit an enormous amount of energy…\nThis familiar place, it can’t be… the stable that I used to live in when I was young?\nMy body became young?! Lugia, what the hell are you?\nJoshua returned to his younger self. His ultimate revenge starts here!"]},{"title":"Genius of the Unique Lineage","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Genius of the Unique Lineage manhwa / 규격 외 혈통 천재","I want to be someone who kills invaders\n__\nI want to kill invaders and live a happy daily life in a special world.\nCan’t I just ask for that?\nWhy? Why can’t I do that?\nPeople say chasing two different rabbits will make you miss both, but…\njust don’t miss them."]},{"title":"Becoming the Obsessive Male Lead’s Ex-Wife","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Becoming the Obsessive Male Lead’s Ex-Wife /  MENJADI MANTAN ISTRI DARI SUAMI OBSESIF / 집착 남주의 전부인이 되었습니다","Irwen, it’s already been four years since I married you. You think I wouldn’t recognize such a shallow trick?” Princess Irwen, the princess of defeat, the wife of the greatest evil, and the wicked woman who is executed for attempting to kill her husband.."]},{"title":"Lucia","tags":["Historical","Josei","Manhua","Romance"],"disc":["Read manhwa Lucia / ルシア / 露西亚 – 攻略公爵计划 / 露西亞-攻略公爵計劃 / 루시아","Lucia grew up not knowing she was a princess.But when her mother died, she entered the palace and had the chance to see her entire future in a dream.In her dream, when she reached 19 years old, she was auctioned off to the bidder who offered the highest dowry. Her life became miserable from then on.When she woke up from her dream, she was determined to reshape her future, realizing that she had plenty of time before the crucial turning point.\nThus, she begins her journey to change her dark future.Lucia, jeune fille de 16 ans et princesse du royaume, a vu son futur à travers un rêve étrange. Mais c’était un cauchemar bien réel d’un mariage qui continue de la hanter. Pour changer son atroce destin, elle se propose en mariage au Duc Hugo Taran, un coureur de jupon très célèbre. Cela pourra-t-il briser le destin funeste de Lucia ? Ce choix la mènera-t-elle vers un destin totalement inattendu ?"]},{"title":"Mesopotamian Mythology of Hongkki","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance","Shoujo"],"disc":["Read manhwa Mesopotamian Mythology of Hongkki / 홍끼의 메소포타미아 신화\n“Who created humans?”, “Why do humans die?”, “How did love coexist with war?” The primal curiosities of humans regarding life and death are combined with lively imagination to create mythological stories that make us laugh and cry. These myths originate from the “first myths discovered in the first civilization of humanity” – [Mesopotamian Myths]!"]},{"title":"Am I Invincible","tags":["Action","Adventure","Comedy","Drama","Fantasy","Harem","Manhua","Martial Arts"],"disc":["Read manhua Am I Invincible / When Did I Become Invincible / Since When Am I Invincible","He always thought he was a mortal, but he didn’t know that his yard was full of artifacts and the chickens he raised were even phoenixes! It was only after five years of living in a mortal town that the system finally let him go in contact with cultivators. It was then that he discovered that no matter how strong people were, when they saw him at that moment, they would be scared to death and call him senior. Some even knelt down to worship… The story is full of fun with peculiar style and interesting surprises!"]},{"title":"Insanely Radiant","tags":["Adaptation","Manhwa","Romance"],"disc":["Read manhwa Insanely Radiant","Radiana didn’t want to die. Offered as a sacrifice to the sun prince in place of her scheming half sister, she decided to do whatever it takes to survive… but never dreamed it would be in the bed of the sun prince! Oratio is sick and tired of receiving human sacrifices. A disillusioned sun prince with the ability to read minds, Oratio involuntarily rescues Radiana from the burning altar…and is shocked to see that she can meet his eyes without bursting into flames. His interest piqued, Oratio offers to let Radiana live… by spending a passionate night in his arms, but Radiana would rather die than go to his bed willingly. Unbeknownst to them, however, there are forces that will stop at nothing to break them apart. Will Oratio and Radiana realize they’re meant to be together… before their enemies come to break them apart?"]},{"title":"The Murdered Princess and the Innocent Traitor","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Murdered Princess and the Innocent Traitor / 살해당한 황녀는 반역 공작가에 취직한다","Brigit, who has spent her entire life as a commoner orphan, finally reunites with her brother, the emperor, and her sister, the princess. Just as she begins to envision a bright future with her family, she is brutally murdered by her own siblings as a sacrificial offering on her coming -of-age day. Now, her life is turned back by Nidhor, the evil dragon, and she awakens as a commoner who has yet to find her family. Knowing that she is sure to face death should she return to the palace, she decides to flee the empire quickly and finds a job as a sorceress. However, by a twist of fate, she lands a job at an enterprise run by the traitor duke.. Will Brigit manage to successfully fulfill her contract and escape the empire?"]},{"title":"A Foxy Affair","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut","Supernatural"],"disc":["Read manhwa A Foxy Affair / Fox House / Fox Mansion / Fox Palace / Le Manoir des Renards / Yeou Jeotaeg / Yeoujeotaeg / ตำหนักจิ้งจอก / 여우 저택","“In a drunken haze, Seol Yuyeon, a top-tier assassin, takes on a bizarre job involving seduction for a very large sum of money. The peculiar terms of the contract leave her no room to back out. Disguised as a new bride, she infiltrates the Ju estate, only to discover an even stranger twist—the client, Yihyeon, and the target, his younger brother Yihwi, share one body. Yihyeon insists that to carry out the job, Yuyeon must avoid the groom and receive guidance from him. She thought her mission was to seduce only the target, but it turns out she has to engage with the client as well. To make matters worse, these brothers are not ordinary people—they are mystical fox spirits who have lived for a thousand years. Can even the world’s greatest assassin accomplish such a peculiar murder?”"]},{"title":"Return of the Martial Arts Genius","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Return of the Martial Arts Genius / 회귀했더니 무공 천재 / I Came Back as a Martial Genius / The Resurgent Martial Prodigy / Martial art genius returnee"," "]},{"title":"If I Don’t Die Soon, I Will Rule The Demon Realm","tags":["Action","Adventure","Fantasy"],"disc":["Read If I Don’t Die Soon, I Will Rule The Demon Realm / 再不死我就统治魔界了","A legendary human warrior, vanquished in a brutal confrontation with the demonic forces, is granted a second chance at life. Paradoxically, he awakens as a member of the very race he had sworn to destroy. To reclaim his humanity, he must embrace the irony of his existence and seek a fatal end. However, as he dances with death, he uncovers a sinister plot that threatens both worlds…"]},{"title":"Ranker’s Return (Remake)","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","Shounen","Webtoons"],"disc":["Read manhwa 랭커의 귀환, Ranker’s Return (Remake)\nIn the early days of the virtual reality game, Arena, MeleeGod was the strongest ranked player! He deleted his character and suddenly left. In order to restore his bankrupt family, he returned to Arena! “Do you want to create a character?”"]},{"title":"The Substitute Bride","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Substitute Bride / 대리 신부 / The Proxy Bride / La novia que fue sustituida / Novia Sustituta","Eloise is sent as a substitute bride for her half-sister, destined to marry the fearsome Duke Tristan, a renowned warmonger and the conqueror of their enemies. With an imperial command to seduce and uncover his vulnerabilities, Eloise steps into a perilous game. But on their very first night, her disguise is shattered. Just as she braces for the worst, the Duke surprises her with a chilling command: “Get on the bed. As the substitute bride, you must fulfill your role.” To survive, Eloise surrenders to the Duke’s demands, finding herself irresistibly drawn into a web of dangerous desires. Will she navigate this treacherous path, or lose herself in the passion that binds her to the Duke?"]}]