[{"title":"Moscow’s Dawn","tags":["Drama","Fantasy","Isekai","Music","Romance"],"disc":["Read manhwa Moscow’s Dawn / The Dawn of Moscow / 모스크바의 여명","21-year-old pianist, Lee Si-yoon chooses to die pessimistically about his life that can no longer play the piano due to an accident, but he wakes up as Tatiana, a girl from a wealthy family who speaks a foreign language that he cannot understand. Is this a God-given opportunity? Or is it a curse? What’s the big deal with the gender change? As long as your hands are intact, you can play the piano again! Let’s make our dream come true as ‘Tatiana’!"]},{"title":"Dating My Best Friend’s Sister","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa Dating My Best Friend’s Sister / 오빠 베프와 데이트하기","",""]},{"title":"I Thought I was the Real Daughter","tags":["Drama","Fantasy","Romance"],"disc":["Read I Thought I was the Real Daughter / I Thought I Was the Real One / 私が本物だと思ったのに  / 내가 진짜인 줄 알았는데","Selena’s whole world is turned upside down when Sienna, the daughter of a maid, suddenly claims that she’s the real daughter of Count Estarion. Sienna remembers everything about Selena’s childhood, making everyone believe that she’s the real daughter. Her once supportive brother and father, who are everything to her, turn cold and kick her out of the house. Even her close friend and fiance turn their backs on her. With nowhere to go, she is saved by the only person who treats with her kindness, Eideun Calypso, a war hero who was once a lowly slave. He asks Selena to be his private tutor and teach him high society etiquette. Why is Eideun being so generous to her? Will Selena be able to find out the truth about her identity? Will she take revenge on those who betrayed her trust?"]},{"title":"My Boss Can’t Sleep Without Me","tags":["Adaptation","Drama","Fantasy","Manhwa","Office Workers","Romance","Webtoons"],"disc":["Read manhwa My Boss Can’t Sleep Without Me / Suspicious Sleep With the Boss / Clause nocturne / 上司と私のおかしなベッド事情 / 必须同寝才可以 / 상사와의 수상한 잠자리"]},{"title":"Adieu, My Villainess Life","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Adieu, My Villainess Life","It’s at her first ball that Carmilla falls in love at first sight with Bernhard. Despite his reluctant attitude, Carmilla ties the knot with him and believes she would be happy forever as long as she got rid of his lover. But her husband’s disdain continues even throughout her pregnancy, causing Carmilla to lose her precious child. On the way back from seeing Bernhard’s lover, Carmilla’s carriage topples and she dies. Perhaps that was her fate for being the villainess in the love triangle. But suddenly, she finds herself back in time when she had yet to marry Bernhard. Could this be her second chance to rectify things? She decides to change her fate and no longer succumb to the strict rules of her family as well as her cruel first love."]},{"title":"What It Means to be You?","tags":["Drama","Historical","Romance","Shoujo"],"disc":["Read manhwa What It Means to be You? / Dangsinui Ihaereul Dopgi Wihayeo / To Help You Understand / 당신의 이해를 돕기 위하여 / 为了明白你的心"]},{"title":"I’m a Villainess But I Became a Mother","tags":["Drama","Manhwa","Reincarnation","Romance","Shoujo","Time travel"],"disc":["Read manhwa I’m a Villainess But I Became a Mother manhwa, The Villainess Became a Mother, The Villainess Becomes a Mom, 악녀인데 엄마가 되어버렸다\nI reincarnated as the villainess of that novel? In that case, I will have to leave him before I get betrayed!\n“Calix, let us break off this marriage.”\n“You cannot run from me, Loure ”\nEven though he will end up choosing another woman… Why does he continue to haunt me? Then there’s the unexpected turn of events of getting pregnant with Calix’s child… And so, once again, I naively had the fleeting thought that I would be able to live my days in happiness. What’s worse, I one day witnessed Calix kissing another woman. To protect the child in my stomach, I abandoned everything and set off on a journey, still unaware of Calix’s newfound irrational obsession…"]},{"title":"The Lady and the Beast","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read manhwa The Lady and the Beast / Ella y la Bestia / Kız ve Canavar / She and the Beast / The Woman and the Beast / 그녀와 야수","100 years after her death, Empress Martina, the founder of the Carabella Empire, reincarnates as Astina Lette, the daughter of a count. Her peaceful, everyday life as a noble lady, a stark contrast to her past life, is short-lived, however.\nWith the bankruptcy of her father’s failed trade business, her family falls into great debt. Astina decides to sell herself off to marry Grand Duke Thereode in place of her sister Kanna to save her family from their financial crisis. But Thereode is forever cursed to take on the form of a beast, and no one expects her to survive the night with him…\nStill, defying all odds, she fights the beast with her impressive swordsmanship, and miraculously survives. A slow relationship begins to kindle between them as she tames him as her pet. One night, Astina gives Theo a brief peck on the lips as a reward for his obedience, when suddenly… Theo becomes…. human?"]},{"title":"I Became a Sitter for the Obsessive Villains","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became a Sitter for the Obsessive Villains / 집착 흑막들의 시터가 되어버렸다"," "]},{"title":"Sincerely, Vanessa","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Sincerely, Vanessa / Dear Teacher, From Vanessa / 선생님께, 바네사로부터","Being an orphan, Vanessa never imagines that she’ll attend the prestigious Vamburgh Academy. But when a mysterious sponsor spots her magic talent from afar, he sends her there on the sole condition that she write him letters about her school life. And so, the chatty Vanessa picks up her pen to tell him everything, from trying to get along with the rich students to battling the mountain of schoolwork and the rogue monster on campus! As her sponsor’s kind replies get her through the hard times and make her happy moments stronger, Vanessa’s curiosity about her secret benefactor only grows…"]},{"title":"Lustfully","tags":["Adaptation","Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Lustfully / 탐욕스럽게 / Greedy","[Mature Audiences Only] As the second daughter of the affluent Daeju Group family, Yoon Seung-ah should have a perfect life of luxury. However, the dismal truth is that she has experienced nothing but contempt and restriction simply for being an illegitimate child. Then, one day, in a strange twist of events, Seung-ah meets Ki Taejun from the KCT Group, who wants to strike up a deal in exchange for helping her regain her freedom and sense of self. And for the first time, she decides to give in to her impulses which sets in motion an array of complications and desires…"]},{"title":"Please Don’t Reply!","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Please Don’t Reply! / 답장하지 마세요!","What’s worse than someone who leaves you on read? How about someone who doesn’t know when to end the conversation? Mira Hexen is cursed to always be the last one to reply for a whole year or she will be turned to stone. But that’s a bit difficult when you’re the chief of a company that produces a massively successful messaging device. Mira’s latest VIP client is Euryx Deyra, an extremely friendly duke who feels the need to respond to every little thing she says. If only she could just tell him to shut up already…!"]},{"title":"Confession","tags":["Drama","Fantasy","Manhua","Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhua Confession","“A story between the handsome yet loving pilot Zhou Jingze and a gentle yet dependable doctor, Xu Sui. Summer has always been warm, so is the boy I love. Stay tune to see the undying love of the “”infatuated playboy”” Zhou Jingze.”"]},{"title":"City of Arrogance","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa  City of Arrogance / 오만의 시대","The lord of Perbaz, who led the 28-year war to victory, ‘Asha Perbaz’. For Pervaz, who was devastated by the long war, Asha heads to the imperial family to receive the victory reward promised by the emperor. However, the only reward that came back was the . As the best choice, Asha pointed out the ‘Duke of Carlisle Haven’, the first prince who had recently been deprived of the title of crown prince. If she was refused, she intended to receive alimony from the emperor… “Marquis Perbaz. I will accept your marriage proposal.” Contrary to expectations, the Duke of Carlisle accepted Asha’s choice. Promising tremendous support for Pervaz… !"," "]},{"title":"Honey, I’m Going On a Strike","tags":["Drama","Fantasy","Manhwa","Mature","mature - 2","Romance","Shoujo"],"disc":["Reading manhwa Honey, I’m Going On a Strike / 여보, 나 파업할게요 / Sayang Aku Akan Berhenti Bekerja / Baroness Goes On Strike\nCassia Ruberno, Countess of the Simone Empire, marries Zester Greze, a commoner war hero, at the order of emperor.\nAfter living for 10 years with no love or money, he dies of incurable disease. No, I only thought that he was dead.\nAt the same time as his death, Cassia returns to the first day she met him, 10 years ago.\nHowever, I don’t want to repeat the same life as before, so I declared a “strike.”\nCassia, who was blunt and knew nothing but war, was determined to live on her own without being discouraged.\nStrangely, Zester in this life continues to try to get into Cassia’s heart.\nCassia, who didn’t hate Zester’s efforts and changes at the same time, said, “I think that maybe I can manage change it in this life.”\nNovel Honey, I’m Going On a Strike"]},{"title":"No, I Only Charmed the Princess!","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa No, I Only Charmed the Princess! / 아니, 저는 황녀님만 꼬셨다니까요? / No, I Only Seduced the Princess?","As if dying from overwork doesn’t suck enough, imagine being reincarnated as a minor novel character who will also meet a pitiful end soon. With nothing to lose, Adelia makes the perilous journey to become the empire’s first white mage in 300 years. Why? To have the crown prince marry her so she can have the power to get revenge on her abusive family, of course! And once she becomes a member of the imperial family, Adelia can live happily receiving the love of her favorite character, Princess Ariana. But wait, she never asked for Crown Prince Lucian’s affection too…!"]},{"title":"I Become a fool when it comes to my Daughter","tags":["Comedy","Drama","Manhwa","Seinen","Slice of Life"],"disc":["Read manhwa I Become a fool when it comes to my Daughter / I’m a dotting father / 딸 바보가 되었습니다 / Komik I Become a Fool When It Comes to My Daughter\n25 years old unemployed Lee Juwon. One day, he became a dad. “dad…?” but… his daughter is too cute"]},{"title":"Resetting Lady","tags":["Drama","Fantasy","Josei","Manhwa","Reincarnation","Romance","Shoujo","Villainess"],"disc":[]},{"title":"Don’t Do This Your Majesty!","tags":["Fantasy","Romance"],"disc":["Reading manhwa Don’t do this Your Highness / Don’t Do This Your Majesty! ,You Can’t Do This Your Majesty!, 이러면 안 돼요 전하!","The Empire’s strongest Knight, Rosetta.\nShe returned four times to save the assassinated prince.\nIn this life, she tried to hide her power and save the Crown Prince by working as a maid, not an escort knight.\n“You said you wanted me,” said the feisty prince.\n“I meant I wanted your safety.”\n“Similar meaning.” Very, very dangerous.\n“So don’t talk to me, open your mouth, Rosé.”\n“Don’t do this, My Majesty!”"]},{"title":"Monster Duke’s Daughter","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Monster Duke’s Daughter / Daughter of the Duke of Monster / Hija del Monstruo Duque / 괴물공작의 딸","She was cut off from the world until she was 5 years old and she was taken in by her father the ‘Monster Duke’. One day, I sneaked into father’s study without anybody knowing and discovered a strange book… What’s up with the content? I will die because of a sickness? Then, are you treating your foster daughter well? In the end, I’ll die because I’m sick but it won’t happen before that! Then… I will do whatever I want!"," "]}]