[{"title":"Reincarnator","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa Reincarnator","[Adapted from one of the old top novels of all time!]\nGod created the Abyss to escape his boredom. Trapped in the hellish Abyss, humanity was on the path to the apocalypse… “Is it over for us… now…” On the brink of humanity’s annihilation, the four strongest survivors tried to prevent it by traveling back in time to the point just before humanity was pulled into the Abyss. But only one of them could go back to the past. “What’s there to think about? Isn’t it already decided who’s going? The strongest among us, Kang Hansoo.” This is the story of the life of the legendary powerhouse, Kang Hansoo, who returned to save humanity from its doom. Will he be able to save everyone?"]},{"title":"I Raised Cinderella Preciously","tags":["Drama","Fantasy","Historical","Isekai","Romance"],"disc":["Read manhwa I Raised Cinderella Preciously / A Wicked Tale of Cinderella’s Stepmom / I Raised Cinderella Preciously / 신데렐라를 곱게 키웠습니다","There is a famous fairytale. A kindhearted girl whose father and stepmother got married and became a family of five with her two stepsisters. The poor girl who was condemned by her stepmother and stepsisters when her father died. The very fairytale, Cinderella. But I am not Cinderella, I am the stepmother. At the age of thirty-seven, already married twice, been widowed twice and is raising three daughters! Daniel Walford, a man who keeps approaching me while I’m busy trying to raise my three daughters. “Can I kiss you?” As a son-in law, I think he’s a little bit older but why does he keep approaching?… Oh, I don’t know. Once I let Cinderella marry the prince, I can live quietly. But is this fairytale really ‘Cinderella’?"]},{"title":"The Empress Wants To Avoid the Emperor","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Empress Wants To Avoid the Emperor  / 황후지만 황제를 피하고 싶어"]},{"title":"The Marquis Is Only Kind to Her","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Marquis Is Only Kind to Her / The Marquis Is Only Sweet to Her / The marquess’s favorite / 侯爵只对她温柔 / 侯爵様はカレにだけ優しい / 후작님은 그에게만 다정해","“Who are you going to do it with today?” ‘I’m going to do it with the most handsome and sexiest man in the empire!’ Twenty-three-year-old Archin Avand is full of outrageous imaginations that are not ladylike at all. She had no intention of going home unscathed tonight. ‘There.’ ‘I want to do it with this man.’ … a hot kiss! “Would you like to kiss me?” Archin returns to reality after sharing a hot kiss with a man he met at a party that night. “If this happens, the family might really be ruined.” “I don’t know anything else, but I’m confident in ‘cutting’.” He disguised himself as a man and joined the rugged knights who even gave life allowances for poor families… . “Haven’t we met before?” The man I kissed for the first time was the sergeant of the Knights!"]},{"title":"Princess and Dragon","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Princess and Dragon","Princess Hina was punished for treason, she was thrown into the dragon cave as an sacrifice to the dragon. But why are there no evil dragons in the cave, only naked black humans dying?"]},{"title":"For the Happy Ending of the Tragic Novel","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa For the Happy Ending of the Tragic Novel / 피폐물의 해피엔딩을 위하여","",""]},{"title":"The Regressed Mercenary’s Machinations","tags":["Action"],"disc":["Read The Regressed Mercenary’s Machinations","Ghislain Perdium, the Mercenary King and one of the continent’s top seven, started a great war in an attempt to avenge his fallen family.","His plans of revenge were going smoothly until he was slain by Idun, who he had never expected to make an appearance. Ghislain thought he died, but he woke up as a younger version of himself from before the fall of his household.","With this second chance, he decided to fix all the wrong pieces of the puzzle and avoid making the same mistakes he did in his past life!"]},{"title":"I Reincarnated as a Legendary Surgeon","tags":["Action","Historical","Manhwa","Shounen"],"disc":["Read manhwa I Reincarnated as a Legendary Surgeon / A wounded surgeon / The Divine Surgeon / 화타가 된 외과의사","Dr. Han Jinsoo always tried to live a righteous life, but in return, he got fired, swindled by a conman, and killed by his own professor. Luckily, a mysterious being offers him a second chance at life because of all the good deeds he had performed. The only problem is… he comes back to life as as Hua Tuo, the legendary Chinese physician, in the turbulent period of the Eastern Han Dynasty! Will he be able to survive in this era of wars and heroes as a surgeon without so much as a scalpel?"]},{"title":"Absolute Regression","tags":["Action","Adventure","Fantasy"],"disc":["Read Absolute Regression","“Please send me back to the past.” If he cannot not kill that person in this era, he just needs to go back to the past.."]},{"title":"The Knight King Who Returned with a God","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Knight King Who Returned with a God","I returned to Earth after hunting devils in the otherworld for three hundred years. But I did not return alone."]},{"title":"Dungeon Reset","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Dungeon Reset / 던전 리셋\nOnce it starts up, the dungeon goes through a process called “Reset the Next User”. Why doesn’t this reset process apply to me ?!I am the only one left from that endless reset of this dungeon. With simple skills and an overwhelming weapon, Jung-down game starts inside the dungeon"]},{"title":"Mysterious Village","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Mysterious Village / 귀촌리 / Gwichon-ri /Gwichonri"]},{"title":"I Thought I Didn’t Have Long To Live!","tags":["Adventure","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Thought I Didn’t Have Long To Live! / Time Limit / I Thought It Was Time! / I Thought My Time Was Up!","Lariette, princess of the Blanchett family, who was diagnosed with the disease had only three months to live.\nI was dying anyway so I decided to do some crazy things.\nFirstly, living with a fiance who is older than me and there is no affection between the relationship.\nSecond, date Asrahan, the monster duke for 3 months! As soon as I decided to run away from him, I discovered something.\nThe truth is that I didn’t have the disease and only lived for 3 months.\n“Lariette, didn’t I tell you?”\nAsrahan said with a savage smile.\n“If you run away, you will be responsible for any consequences”"]},{"title":"Monster General Recorded Legacy","tags":["Action","Adventure","Fantasy"],"disc":["Read Monster General Recorded Legacy / Goegongyurok / Registros de Goegongyurok / Registros de la Secta de la Espada Blanca / 魁公遺録〜下剋上再建〜 / 괴공유록","Frozen human? A martial arts supreme leader the world never knew! The slumbering Strange Master awakens!","After falling unconscious due to an unexpected accident, he wakes up to find that thirty years have passed. During that time, his sect, the White Sword Sect, has fallen into decline and was destroyed by the martial world’s forces. He learns the tragic news that Jin Yeongrim, his senior and the sect leader, has met a grim end.","The man whose mere presence made the martial arts world tremble—Sword Master Yu Jangryeong.","His legacy has been entirely inherited by a man the world has never known—Ja Un-hyun.","In this unfamiliar world, where his loved ones are now part of the past, Ja Un-hyun transcends conventions and life-and-death struggles. With his unpredictable eccentricity and unparalleled martial arts skills, he embarks on a thrilling, action-packed journey filled with laughter and boldness."]},{"title":"Follow Your Heart","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Follow Your Heart / 마음이 이끄는 대로","Yi-jae, who has been reincarnated as Hailey, the daughter of a noble family who threw herself into the river just before the royal marriage, now sees restless spirits that should never be seen behind the king! Days are spent struggling to exorcise the restless spirits that crowd around King Roderick. As Roderick spends time with Yi-jae, he starts to notice strange changes in his mental clarity and physical condition…"]},{"title":"I’ll Take On This Marriage In This Life","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’ll Take On This Marriage In This Life / 그 결혼, 이번 생엔 제가 할게요","Saena, who ended up marrying ‘George’ after a one-night stand she can’t even remember, found that her hellish marriage ultimately ended in death. Awakened by the call of her twin brother, ‘Yuri,’ Saena returns to her vibrant nineteen-year-old self before the marriage! For a moment, she vows never to marry again. But then she declares, ‘I want to be that man.’ The Duke ‘Constantine’ is proposing to me?!"]},{"title":"Hiding a Logistics Center in The Apocalypse","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Hiding a Logistics Center in The Apocalypse / 아포칼립스에 물류센터를 숨김","The world may have ended, but the logistics center still operates—within my own dimensional space"]},{"title":"Conquer the Game With the Best Web Novels","tags":["Action","Adventure","Fantasy"],"disc":["Read Conquer the Game With the Best Web Novels,  Conquer the Game With the Best of the Best in Web Fiction, Conquering the Game With the Strongest Webnovel Characters, Покорите игру с лучшими из лучших из веб-новелл, 웹소설 최강자들로 게임정복","Leaving behind only a single key, my father, a renowned web novel author known for his ‘Overpowered MC’ stories, passed away. Ten years later, a virtual reality game called ‘The Another World,’ based on one of his works, becomes a place where people can make a living or even strike it rich.Kim Woojoo, the author’s son, has been living a tough life with no special advantages. By chance, he discovers that the key, a keepsake from his father, is being traded at a high price. He decides to use the key to open a limited edition book in his father’s study and receives a special gift within the game.Accepting the gift, Woojoo encounters the Great Demon King Lucia, a character from his father’s web novel. Lucia grants Woojoo incredible abilities, but the power is so overwhelming that Woojoo struggles to complete even simple daily quests.After much thought, Woojoo decides to eliminate the source of his power, the Demon King, by bringing in another character, Killer Zero. However, his actions draw the attention of Jason, a powerful player in ‘The Another World,’ who comes to confront him.Will Woojoo be able to face the strongest characters in the game, the ultimate beings from his father’s web novel?"]},{"title":"Dear, Not Cunning Witch","tags":["Drama","Fantasy","Romance"],"disc":["Read Dear, Not Cunning Witch","In an age ruled by science, there remain almighty witches with mythical powers. However, Diana ended up lacking any of her mother’s witchly talent. In fact, ever since she began training at the age of 7, her only goal was to reunite with her sister. But life never turns out how we want, does it?"]},{"title":"The Fairy Legacy","tags":["Drama","Fantasy","Magic","Manhwa","Mystery","Romance","Shoujo"],"disc":["Read manhwa The Fairy Legacy / 요정의 유산","“Lady Ersetta refuses to marry the man her father has chosen for her and asks her maid Farme to meet him in her stead. But Lord Ligieri, her hated enemy, sends his servant Angelo to cover for him as well! Turns out, Angelo is oddly charming and Farme can’t get him out of her head!”"]}]