[{"title":"I Will Protect The Duke This Time","tags":["Fantasy","Manga","Romance"],"disc":["Read manga I Will Protect The Duke This Time","[A noble lady who turns back time for the person she loves most in the world!!]\nRescate, a noble daughter who is treated unfavourably by her family due to her differences in origin.\nHowever, Duke Angel, someone understands and respects her, becomes her lover.\nI was having happy days.\nMeanwhile, Angel and Rescate are assassinated due to a conspiracy by another family that is opposed to the Angel family.\nAt the moment of death, Rescate makes a contract with the goddess.\n‘The future of two people’ was the price of turning back time to the point where Angel can be saved.\nIn a world where the future with a precious person has been lost, Rescate stands up to save him… !\nA classic romantic fantasy story that will make your heart tremble due to sad and deep love begins!"]},{"title":"Totem’s Realm","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Totem’s Realm / Totem Zone / Totemui Yeongyeok / Totem’s Realm / Zona de Totem / 토템의 영역","Sera, an ordinary office worker, ends up in the mysterious world of a primitive tribe. An unknown and sexy beastman rescues her from the threat of the primitive tribe. After a while, an unknown ability germinates in Sera’s body… What will be her destiny?"]},{"title":"Queen’s Man","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Time travel"],"disc":["Read manhwa Queen’s Man / La reine de mon cœur / Queen and I / Queen In Hyun’s Man / Queen In-hyun’s Man / Queen Inhyeon’s Man / 인현왕후의 남자","Can their love stand the test of time travel? Bung-do Kim, a scholar from the Joseon Dynasty, is sent to the 21st century by a magic talisman, where he falls in love with Heejin Choi, an actress. But after a terrible accident, Heejin and Bung-do find themselves thrown back in time. Will they be able to find their way back to each other?"]},{"title":"The World’s Best Sect of Dependency","tags":["Action"],"disc":["Read manhwa The World’s Best Sect of Dependency, 天下第一 依赖門, 天下第一依賴門, 天下第一依赖門, 천하제일 의뢰문","“I’m finally free!” After fifteen years of locking myself on top of a mountain, I returned to the world in order to compensate for the youth I had wasted during those past years. As I descended from the mountain, I made a resolve to pay all of my master’s grace by completing the Ten Virtuous Deeds as soon as possible and then live the rest of my life in leisure. With a sense of pride, I took the first step forward, but somehow things didn’t go as expected and the situation became increasingly complicated… Join him now on his journey to become the strongest in the world, in a place filled with betrayal and tears rather than justice and laughter, on the rivers and lakes!"]},{"title":"I Became the Tyrant’s Secretary","tags":["Fantasy","Isekai","Magic","Romance","Shoujo"],"disc":["Read manga I Became the Tyrant’s Secretary / I Became the Secretary of a Tyrant  / Me convertí en la secretaria de un Tirano / Pokgunui Biseogwani Doeeotseumnida / 成为暴君的秘书官 / 폭군의 비서관이 되었습니다","I became the secretary of a tyrant in place of my clumsy brother to survive. But I have so much potential for it. I’m so darn good at my job. Because I served the tyrant so well, ‘Everyone has a happy ending’. Well then, shall I quit being a secretary and live a leisurely life now? “Rosaline, tell me what you want.” He asked as he stepped down from his chair. “I want to quit.” His eyebrows twitched slightly. “Do you want to die?” Your highness, you never hold on to people who want to leave, so why’re you being like this to me?"]},{"title":"My Husband Ascended as the Chosen One","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read manhwa My Husband Ascended as the Chosen One / My Husband Awakened as a Hero / 남편이 용사로 각성했다\n“How could you be so self-centered? You have a wife and a child!” Shirley’s husband, George flees to the capital on his own, saying that he’d return one day as the chosen one. Left all alone, she decides to raise her son Brandon on her own and forget about her scoundrel husband. But life is always a full of surprise. Shirley had to learn it the hard way, when her irresponsible husband returned to her with pride as the chosen one. “Forget about my past mistake and come live with me, for Brandon’s sake…” Being forced to accept George’s offer, Shirley forgives her husband and move to the capital city with her son. After all, Brandon’s happiness is all she cares about."]},{"title":"Don’t Fall In Love With The Villainess","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life","Smut","Webtoons"],"disc":["Read manga Don’t Fall In Love With The Villainess","Liv crossed inside a novel as the villain’s first love. The only means to return to her original world was to prevent the villain’s blackening.\nThe villain, Camian, was the prince of devils and the world’s strongest man. She expected a rough and rocky path… but… something was off…\nThe villain was sweet… and caring.\nCan Liv prevent Camian’s blackening?"]},{"title":"Girl and Science","tags":["ecchi 2","Fantasy","Martial Arts","Romance","Si-fi","Supernatural"],"disc":["Read Girl and Science manhua,妹子与科学\nThey were childhood friends, and she had always been more powerful than him. But when they accidentally traveled (summoned?) to another world, it was finally time for him to become the knight in shining armor! He had to find her first though, since they were separated… Come and witness his fight to be better in a crazy world where monsters roamed and technology was so advanced your amputated limbs be restored to perfection…"]},{"title":"The Forgotten Princess Wants To Live In Peace","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Forgotten Princess Wants To Live In Peace / 잊혀진 황녀는 평화롭게 살고 싶어","The Forgotten Princess Wants To Live In Peace mamhwa\nKhazar’s face was devastated as he named the Imperial Prince I’d be engaged to after breaking our engagement. He looked like the world would end at any moment.\nEluana smirked as she saw that tragic face.\n“Idiot. Didn’t I promise to get you the crown?”\nSkepticism clouded Khazar’s eyes. He wouldn’t have given up if there was even the smallest chance. But there was no such thing as hope for the current Khazar.\nBut still, Eluana continued to talk about the promise.\n“My promise wasn’t made lightly.”\nKhazar’s heart began racing so wildly that he almost felt resentful towards it. He watched Eluana speak like she was making a pledge. Once again, he was hopelessly pulled in by her.\nEluana continued.\n“Our promise will definitely come true.”"]},{"title":"That Couple Has a Secret","tags":["Comedy","Fantasy","Romance","Slice of Life"],"disc":["Read manhwa That Couple Has a Secret / The Couple Has a Secret / 그 부부에겐 비밀이 있다","The newlyweds who love each other the most in the world Serin and Sowon, have a secret that they cannot tell each other. The wife, Sowon, is the guardian of the kingdom of light, “Cryptic Rose”, the husband, Serin, is the prince of the dark kingdom, “Avalanch”. They became a married couple without knowing the other side of each other, and today they start a marriage fight? who risked their lives for love."]},{"title":"I Only Treat Villains","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Only Treat Villains / Lady Hanya Mengobati Penjahat / Syrinx, the Villain Healer / 专门对付恶棍 / 悪党ばかりが寄ってきます / 악당만 취급합니다","“One day a crazy person knocked on my door.”","My house is a jewel shop. Someone keeps bringing a person in front of my house. Ojiram was so powerful that he treated me with curses. Others get along with them well.","“Didn’t you save the head of an assassination guild leader last time?”\n“She’s a woman.”\n“Oh, what about the vicious loan shark who owns the billion mark on Second Avenue?”\n“She’s a woman, too.”\n“Who left their carriage in front of a noble’s house?”\n“It was a noble lady.”"]},{"title":"Thorns Of Warmth","tags":["Comedy","Romance","School Life","Slice of Life"],"disc":["Read manga Thorns Of Warmth / Dear Dreamers / 温暖的刺 / Wēn Nuǎn De Cì / Thorns of Warmness","Eccentric girl Yin Ying finally got into the university of her dreams, but she unexpectedly discovers that Ji Yuchuan, the arrogant and gifted senior, is her first love whom she lost contact with for four years. After a huge misunderstanding, the two started a “game”, pretending to be a couple. His life is now disturbed by her social butterfly behavior, yet his heart never seemed to stop beating – On the road of my chasing dreams, you were there. The curtains of this show of confusing love is about to be lifted~"]},{"title":"Ultra Alter","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa Ultra Alter\n“Awaken a New Self”. Lee Oh Reum is a high schooler who plays as a “Healer Shuttle” character in the kinesthetic VR MMORPG game .\nOne day, his sub character “Avenger” that he was secretly raising becomes the best.\nWill Lee Oh Reum be able to overcome all dangers like constantly appearing monsters and various quests to become his new self? An authentic action altermodern drama fantasy."]},{"title":"I Adopted the Male Lead","tags":["Adaptation","Drama","Fantasy","Historical","Isekai","kids","Magic","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Read manhwa I Adopted the Male Lead / 남주를 입양합니다"]},{"title":"The Predator’s Fiancée","tags":["Action","Comedy","Drama","Fantasy","Historical","Josei","Magic","Manhua","Manhwa","Medical","Mystery","Reverse harem","Romance","Sci-fi","Shoujo","Shounen Ai","Sports","Time travel","Tragedy","Villainess"],"disc":["Read manhwa The Predator’s Fiancée / Predatory Groom / The Predator’s Contract Partner / The Predator’s Contracted Fiancée / 포식자의 혼약자","R15 “You shouldn’t have crossed this line, Elisha, if you didn’t want it to be like this.” A sturdy arm wrapped around her swaying body. Her head became hazy and an intentional hot sweet sigh was pulled out of her. ‘How the hell did I get myself in this situation—’ Elisha recalled. This never happened before. ‘Yeah, I remember.’ Her future in which she would become the fake concubine to a demonic man from the same family, and would be eaten to death—even down to her bone marrow. A future in which the Cartier ducal family is embroiled in a power struggle and fragmented. To avoid that future, Elisha threw herself at Lucerne, the archrival of her former life. Yeah. There was no problem. She knew this man, before and after her regression. She already knew he was the most notorious maniac in the Empire. 20-year-old Elisha owes 30,000 gold coins (about 15 billion won in Korean currency or around 15 million in USD). After going back in time, in order to avoid a hellish life because of debt, she becomes the most capable illegitimate child in the world and visits Lucerne, the archenemy of her master. “What do you want from me?” “Please lend me some money. And… make me your subordinate. I’ll give you all the information I have.” “Why should I trust you?” “I’ll give myself up as collateral.” Lucerne listened to Elisha and watched her quietly. “Okay. But I decide how to deal with the collateral.” “…….” “First of all, marry me.” “…… huh?” Elisha didn’t expect it either. That her information transaction would become a marriage contract."]},{"title":"Iraine’s Circumstances","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Iraine’s Circumstances / 이레인의 사정","Iraine , who lived a modest life as a maid in a village dormitory,\nSeizing the golden opportunity, she gets a job as a prosperous imperial court servant.\nAt that time, when I thought that my life was blooming while being recognized for my abilities by the princess,\nCoincidentally, she runs into a man with a bad mouth in the Imperial Palace garden.\n“Do you have any strange hobbies? Bleeding from my feet.”\nUnlike his harsh words, he is a handsome man with black hair that exudes a sweet and noble scent of forget-me-not.\nIraine falls in love with the man she met…\nIs it okay if I give you that heart?","* * *","“Then what is your name?”\n“Yes Yes?”\n“What kind of person are you? What’s your name, you?”\nIraine’s face was completely drained of blood.\nEven though she couldn’t make an excuse, she wiggled her fingers as if to ask why.\n“Why are you asking my name? yo. this…”\nAs if Theo had heard a funny story, he burst out laughing.\nIt had been a long time since someone’s laughter felt so frightening.\n“hey.”\n“Yes Yes?”\nIraine backed off at Theo’s action as he took a step closer to me.\nTheo did not yield to her and leaned his upper body further.\n“Do you think it would be difficult for me to find out your name?”"]},{"title":"Dancing In The Middle Of The Night","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Dancing In The Middle Of The Night / Blue Night, Gloss of Enchantment / Azure Night, Waltz of Rapture / Blue Night, Waltz of Ecstasy /푸른밤, 황혼의 윤무","Kang Seo Yoon, an ordinary office worker, is captivated by the performance of pianist Ahn Hee Won.\nBut one day, she was in the concert hall when no one was left. She witnessed Ahn Hee Won aiding the murder case and played the piano in a pool of blood…?\nAnd right from that moment, the world of unscrupulous monsters wearing a beautiful cover and eating humans swallowed Kang Seo Yoon’s life.\nSo you can only eat or die. On the sentimental and beautiful face, the cold wave shook like a lamp.\n“Seo Yoon, make a choice”\nIt is a story of enchantment born at night. In a city filled with enchantment like a jungle, there lived a dark blue person who longed to eat.\nA virtual contemporary urban mystical romantic fantasy about an artist who enchants humans and monsters with love as a scapegoat."]},{"title":"Even the villain is annoying","tags":["Drama","Fantasy","Manhwa","Mystery","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Even the villain is annoying / I’m Too Lazy to be the Villain / Even the Villainess Can Be Annoying / Even the Villainess Is Annoying / I’m Tired of Being a Villain Too / 악역도 귀찮아서","Versace family! A house that produced many swordsmen and possessed a powerful force. Such a family perished. Due to the poisoning of the Crown Princess and the involvement of a foolish woman named Olivia de Versace. She was a woman who was pointed out as a rare ugly or evil woman because of her tall and heavy body. I thought it was absurd when I possessed a novel character who is often referred to as a villainess. If you’re going to pretend to be a female lead, or something. Or the male protagonist. Anyway, shouldn’t it be a small supporting role? Even if it weren’t, I shouldn’t have gotten the passer-by’s appearance like this."]},{"title":"Office Marriage, After a Breakup","tags":["Drama","Manhwa","Office Workers","Romance"],"disc":["Read Office Marriage, After a Breakup / 이별 후 사내 결혼 / Pak Manager bucin tapi aku suka / My Office Rebound Marriage\nDawon and Taehyun, the official couples of K&C, She thought that they would get married well, but they broke up as Taehyun’s wish. Dawon was shocked to find out that the opponent was Yoojung, a new employee in the same department as Taehyun. A man who had been looking at her for a long time appeared! But that guy is K&C’s ideal type. He’s my team leader?"]},{"title":"Pseudo Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Pseudo Love / 사이비 러브","Baek Ga-in, an N-jobber college student who lives a double life as the devil-worshipping concept streamer ‘Luciha’ and lives with the wounds of being connected to a pseudo-religion. … But after watching the broadcast, a real devil, ‘Incubus’ appeared?! Demons, humans, and… angel?! It’s not a ‘pseudo’, it’s a campus fantasy romance!!"]}]