[{"title":"More Than You Know","tags":["Adaptation","Fantasy","Manhwa","Romance"],"disc":["Read manhwa More Than You Know / 생각보다 훨씬 좋아해!"]},{"title":"How a Former Pro takes advantage by doing an easy job","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa How a Former Pro takes advantage by doing an easy job / The Sweet Life of a Reincarnation Pro / 転生のプロが甘い蜜を吸う方法 / 전생의 프로가 꿀 빠는 법 / How the Pro in His Past Life Sucks the Sweet Honey / Sweet Honey of the Reincarnated Pro","It’s my 100th life!! This life’s genre is fantasy. By the way, am I a prince? My mother was a maid, and my father is a king. However, I’m just a prince who is born with blood from a lowly class. It’s actually good! Yeah! It’s pretty good to me! There are no followers and no right of succession. I mean, people don’t really care about my existence. ‘This is a place where you can live easily, right?’"]},{"title":"Too Bad for You, the Position of the Saint Belongs to Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Too Bad for You, the Position of the Saint Belongs to Me","The protagonist, Avnir, is the daughter of the Great Saint. She was living a happy life, aiming to become a saint alongside her lover, the priest Rezol, but everything changed the day her cousin Flor appeared as a candidate for sainthood. Through Flor’s schemes, Avnir lost her position as a saint, her lover, and even her holy powers, eventually leading to her execution. Guided by the gods, she is granted a second life, and this time, she vows never to let anything be taken from her again."]},{"title":"A Saint Who Was Adopted by the Grand Duke","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Saint Who Was Adopted by the Grand Duke / A Saintess Who Was Adopted By The Grand Duke / 대공가에 입양된 성녀님"]},{"title":"Insanely-Talented Player","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Insanely-Talented Player","It has been six years since the game to decide the world’s fate began. The strongest player, Hero King Kang Yoosung, who has never lost his first place as the top ranker, greets a new season. “It was… over for me a fucking long time ago. I’m just doing this for the money.“ [Provocation stat increasing exponentially!] [The Clown Lord expresses satisfaction with contractor’s behavior!] The survival journey of a player with insane talent begins now!"," "]},{"title":"The Male Lead’s Boyfriend is Obsessed With Me","tags":["Adaptation","Drama","Fantasy","Manhwa","Reincarnation","Romance","Thriller","Transmigration","Villainess"],"disc":["Read manhwa The Male Lead’s Boyfriend is Obsessed With Me / 남주의 남자친구가 내게 집착한다","I was transmigrated into a a dark and melodramatic BL novel. Moreover, I became the villainess who was madly in love with the obsessive male lead, the boss of Baekcheon, and died in the first encounter with the main characters! I thought about changing their love story, which ended with the death of my favourite schemer, into a happy ending! “Let’s go together, to my hell.” What? Did my favourite character just kidnap me? “I like you,”’ “but this is too much.” To ensure that the story unfolded just like it did the novel, I tried to seduce my favourite character just enough that he would hesitate to kill me. “Why do you like me?” But something feels off. “Just try running away. That’s if you can, Princess.” “I’ve got my eyes on you right now, I’ll go crazy if you do.” The male lead’s boyfriend has started obsessing over me. “Please, Yeonbyeol…” “Don’t abandon me…” So dangerous and dizzying, it’s impossible to escape!"]},{"title":"The Beloved New Daughter-in-law Of The Wolf Mansion","tags":["Adaptation","Animal","Drama","Fantasy","Historical","kids","Manhwa","Romance"],"disc":["Read manhwa The Beloved New Daughter-in-law Of The Wolf Mansion / 늑대 저택의 사랑받는 새아가","Arsene, the only heir to the wolf family known for his illness, has died. The culprits are my father and my half-sibling. They killed the heir by lying to use the family’s healing powers. Thanks to this, the family was destroyed, and I was caught up in it and died. When I opened my eyes, I was back at the age of seven before I died! “Let me marry Arsene!” I can’t die under false accusations again. I requested a contract marriage to the Wolf family without my father’s knowledge. After curing the heir’s illness, I was going to divorce and leave when I turned 20. As the wolf family and our family are hostile to each other, they might hate me, but it’s better than to die motionless."]},{"title":"Our Secret Marriage","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Our Secret Marriage","Choi Yoonseol, a third-year business student who lives only with her grandfather, suddenly hears the news that her grandfather is seriously ill. Yoonseol wants to fulfill her grandfather’s last request. Her grandfather’s last request turns out to be… to see Yoonseol get married? Where can Yoonseol find someone who will marry her when she herself has no experience with love?!"]},{"title":"Confession Attack","tags":["Manhwa","Romance"],"disc":["Read manhwa Confession Attack","Hana was never first. Always because Han Geon Woo came in first every time! Hana would do anything to best Geon Woo, even though she can’t figure him out. This time, she tried to shock him by confessing… He believed and accepted the confession though? Does he like me?"]},{"title":"The Rankers Guide to Live an Ordinary Life","tags":["Action","Adventure","Fantasy","Romance"],"disc":["Read manhwa The Rankers Guide to Live an Ordinary Life / A Guide to the Right Life for Rankers / 랭커를 위한 바른 생활 안내서","“The first S-class Awakened, a reality as a third-rate student?! In the 21st century, the genre of the world is ‘fantasy’. In a South Korea filled with despair, ‘S-class’ has descended! ‘Magician King Jo’! -God Jo… King Jo… Who are you… -Who could it be?? The true identity of the prophet who has clung to mysticism for 10 years? Her profession. Third-rate student. Unable to make outgoing calls due to her mother’s anger. On the verge of being strangled and trapped in the abyss. Leading a peaceful and ordinary life as Korea’s top unemployed person, however, [ Rankings are changing ] [ Your current domestic ranking is 2nd place. ] [ ????? !!!!!!! ] “I know who you are. Magician King. I am-” ‘Baek Dohyun’, a ‘regressor’, appears in front of Gyung Jio. Will Gyung Jio, an S-class Munchkin ranker, be able to maintain her comfortable and lazy tyrant life, as her well-rolling life turns upside down into the position of the world’s savior?”"]},{"title":"Moment Space","tags":["Action","Adventure","Fantasy"],"disc":["Read Moment Space / Instantaneous Space / 刹那空间","A built-in system? No, it’s a Conceptual God! A real-world mystery? No, it’s a detective from another world! Superpower battles? No, it’s a series of baffling serial murder cases! There are no weak gods in the realm of conceptual gods? Then what on earth is the protagonist’s useless ability? Join ‘Na Sui’ and his best buddy as they unravel the truth!"]},{"title":"Noise’s comeback","tags":["Drama","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Noise’s comeback / 노이즈 컴백","No Y Jeu (her name pronounces like Noise in English) returns to school as a 4th year student in the Department of Furniture Design. Many annoying things starts to happen to her, who wants to live her life perfectly as she planned. When she loses her diary, her fatal secret is revealed to some strange man she’s never met before. The man ‘Woo Yoo Jin’ seems to enjoy her embrassement and see right through her. One day, Woo Yoo Jin suggests No Y Jeu for a collaboration for the Shepherd contest, which has been her dream for a long time. What purpose does he have to approach her ?"]},{"title":"I Was The Acting Empress But I Spent The First Night With Him","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Was The Acting Empress But I Spent The First Night With Him / Deputy Empress, but spent the first night / 대리 황후지만 첫날밤을 보내버렸다 / I Was The Acting Empress But I Spent The First Night With Him / Even though She’S the Substitute Queen, She Spent the First Night with Him","In place of Princess Lecilia, who eloped for love, Zelda became the substitute empress of the Lafion Empire.","She thought she only needed to pretend to be the real empress until the princess returned, but after spending the first night with Emperor Linel,","her plans for divorce began to waver.","“Don’t be in such a hurry. Tonight… I intend to fulfill my first duty as your husband.”"]},{"title":"I Raised My Childhood Friend as a Tyrant","tags":["Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I Raised My Childhood Friend as a Tyrant / My BFF is a Tyrant in Training / I Turned My Childhood Friend Into a Tyrant /소꿉친구를 폭군으로 키웠습니다","“I’m not interested in the throne.” I reincarnated as the person who makes the male lead become a tyrant, “the short-lived childhood friend.” I took the blame for him and died, just like the original story. And, I thought that I could finally return to my original world, but… “Why am I back to ten years old??”"]},{"title":"A Fortune-Telling Princess","tags":["Historical","Manhwa","Romance"],"disc":["Read manhwa A Fortune-Telling Princess / 점괘보는 공녀님 / A princess who reads fortune","Top actress Lee Sia with the ability to see ghosts. After the accident, she wakes up in the body of ‘Camila Sorpel’. The problem is that “Oh, father! Help me!” The end of this woman is death every time! Extending the lifeline is a priority, so let’s start by talking to the ghosts here first, shall we? “You will get a divorce soon.” “… what?” The atmosphere in the conference hall became quiet again at the word that was uttered like a hum. “What are you going to say now… … !” “Your servant’s wife.” The embarrassment was evident on the face of the other person in the following words. “She is also the wife of a subordinate whom she cherishes the most.” “Uh, what… … !” “Have you heard of my rumors?” Camilla smiled and took a step closer. “They say that the princess of the Sorpel family is looking at some fortune-telling.”"]},{"title":"In the Doghouse","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa In the Doghouse / 황궁의 정원에는 개가 산다","The Devon family sits on a mountain of debt and they are on the brink of bankruptcy. This is no fault of hers of course, but Courtney Devon has always been the one painted as the villain in her family. However, the family is in dire straits and they have to do something, anything, to raise some money and get out of this situation. But then one day, news arrives from the Imperial Palace that His Royal Highness the crown prince has decided to make Courtney the crown princess. Seemingly a typical prince on the outside, His Royal Highness is actually quite a troublemaker with a dark side. Will this arrangement end up solving Courtney Devon’s problems or just complicating things further? Will a love against all odds bloom or will someone end up in the doghouse…?"]},{"title":"I Don’t Want To Be a Magpie Bridge","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manhwa I Don’t Want To Be a Magpie Bridge / 오작교는 싫습니다 / I Don’t Want to Be an Ojakgyo","I was reincarnated as a supporting character in a novel. And on top of that, I had the role of a ‘magpie bridge’ inside the romance story . Anyways, romance was impossible, and my future seemed bleak with my debt-riddled family. After becoming a civil servant, I tried to enjoy the wealth and honor I couldn’t have in my past life, but… Unlike the originals, the male characters seem kind of strange?! “Imagine, how would Char-Char look blushing and shy while looking at someone she likes?” “Wow….. that’d be amazing.” Keurigord gets blank-stared, Hylli wants to talk whenever we see each other, and Yves wears an expression and mutters to himself. “Should I take you and run away….” Sean would cover his face with both hands without saying anything. His blush used to only reach his face but now the red spreads to the tip of his ears. Why are you guys not obsessing over the female lead and doing other stuff instead? Charine West, who wanted to live a normal life, and her survival at Char-Char’s reverse harem."," "]},{"title":"Teach Me True Love on Hand and Foot","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read Teach Me True Love on Hand and Foot","A new trend has emerged among the noblewomen, in which they reject their long-time engagement partners chosen for them by their parents. To counter this threat to her kingdom, the brave Queen Phillis finds herself needing to get married?! A beginner to romance, she gives an order to her childhood friend among the royal knights: “I want to learn about true love, so teach it to me on hand and foot!” Thus begins an adorable romantic comedy between a dense queen called the goddess of destruction and a knight who has hidden his feelings for many years."]},{"title":"The Legendary Hunter Becomes Young Again","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Legendary Hunter Becomes Young Again / 전설의 헌터, 회춘하다","“If only I were 10 years younger…!!” <A special reward is given that reflects the target’s wish.> Gwak Pilseong, a legendary hunter enjoying his retirement at the age of 80. He accidentally gains the ability of immortality and rejuvenates, returning to the hunter industry after a long hiatus… There are… too many rotten scoundrels in the hunter industry!"," "]},{"title":"You’ve Got The Wrong House, Villain","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance","Villainess"],"disc":["Read manhwa You’ve Got The Wrong House, Villain / 집 잘못 찾아오셨어요, 악역님 /  Villain Salah Rumah / You’ve Come to the Wrong House, Villain / You’ve Got The Wrong House, Villain (Novel) / You Have Got the Wrong House, Villain","I guess I’m just an extra next door, and a neighbor with a lot of stories… According to the original story, the heroine had to save the wounded villain and in return, she will receive the maniacal obsession of her handsome villain. But for some reason, Why the Villain passed out in front of my house? I looked around for a moment and then pushed the man’s body away"]}]