[{"title":"Who Kidnapped the Empress?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Who kidnapped the empress? / 황후를 훔친 이는 누구인가 / Who Stole The Empress","“You don’t know how goosebumps I got when I saw you limp.”\nThese injuries made her look so worn out…That’s why the emperor abandoned the queen in the snowy situation.\nIn her hand was a sword stained with the blood of family and friends.\n***\nHeavy snowfall.\nRosellin, who had been abandoned in a dark world, was ready to accept death.\nFamily, friends, ambition. There was no reason for her to continue living.\nShe lay down with her cold body and watched the white snow dyed black.\nThe painful cold quickly subsided. At that time, she thought that freezing to death wouldn’t be so bad.\n“The one who is cornered on the road to death but lies as if it will dominate all these snowfields”\nThat man.\n“This life…If you insist on leaving, I’ll pick it up and take it away”\nThe enemy general, Tamon Krasis.\n“You’re mine now, queen.”\nShe was abandoned by them. But he stole her and took her away."]},{"title":"Children of Orbit","tags":["Romance"],"disc":["Read manhwa Children of Orbit / 僕たちの軌道 /  궤도의 아이들","“It seems that the light shines from noona . Even to you , is noona such a person?” Brother and sister, Ryu Bin and Ryu Seong, attract everyone ‘s attention wherever they go. However, Bin has a secret, and that is she has a crush on her classmate, Young-in. Younger brother Seong-eun, who has an inferiority complex to his older sister Bin, begins to approach Young-in, a shy and quiet girl. Three children who are becoming adults and their rather noisy growth story ."]},{"title":"Overtime Elite","tags":["Action","Adventure","Manhwa"],"disc":["Read Overtime Elite","Omari’s dream was always to become a professional basketball player. But that dream was quickly crushed by reality. There’s school, money, his strict aunt, and the future, of which he wasn’t sure of until a mysterious scout discovers his talent"]},{"title":"Potion Witch","tags":["Drama","Fantasy"],"disc":["Read manhwa Potion Witch / 묘약마녀","Pharmacist Vanna runs a small pharmacy in the city of Blerock. Once night falls on the city, a “Witch Raven” appears and Vanna often takes requests for medicines that can undo the effects of the witch’s curse. But one day, some police officer has come looking for Vanna…. the true identify of “Witch Raven” is..?!"," "," "]},{"title":"Pure Villain","tags":["Action","Comedy","Romance","Shoujo","Supernatural"],"disc":["Read manhwa Pure Villain / 순정빌런 / O amor puro de um vilão","A world where special police exist to deal with criminals with special abilities. An unreasonable villain comes to Han Do-ryeong, the strongest special police officer who was spending peaceful days! But something’s wrong with this criminal? The worst villain who loves the strongest hero, “Park Rosa’s” crazy love story."," "]},{"title":"Darby, the Dizzying Flow","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Darby, the Dizzying Flow / That Which Flows By / Darby, the Flowing Dizzy / 다비, 아찔하게 흐르는","Dan-i, the owner of a tea shop selling tea leaves north of the Yalu River, is saved with the help of a man. The true identity of the man who saved his life is a cold-blooded man who mercilessly cuts down female females, Joseon general Seo Gyeol, who is called the cursed northern ghost. He is cursed to drink only strong tea instead of water, and it is said that he takes children and uses them as Dadong to brew his own tea and eats them… Can you stay?!"]},{"title":"She’s a Villainess, but Her Husband Is Handsome","tags":["Action","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa She’s a Villainess, but Her Husband Is Handsome / 악녀인데 하필 남편이 잘생겼다 / Suamiku super Tampan","Possessing the evil woman, she lived hard.\nAs a result of doing her best not to interfere with the female lead and her male lead, she says, the female lead was successfully engaged to her male lead.\n…But one day, the female lead came to visit me?\n“Please help me and His Highness the Crown Prince break off our engagement!”\nHey, I think you misunderstood the role, but I’m a villainess and you’re a heroine.\n*\n“Still, can’t we sign a pair contract, even on paper? My teacher begged me to sign a pair contract.”\n“It’s not possible.”\n“They said that pairs were defined as people of similar skill level. If you’re on the same level as me, that means you’re just such a knight.”\nI like him but I also have to admit it. Considering the magic from before, it was clear that I was just such a wizard. Avonne just loved me. It was easy to admit that.\n“So, what is there to call each other with mere people like that? You said you can just sign a contract and never see it again?”\nPoor knight. Originally, there is a possibility of development when you know yourself. It hurts now, but I can’t help it. Since you’re handsome, it’ll be okay if you’re a little short of a knight.\nI looked at Kyle, who was staring blankly at me.\n“What the hell are you talking about?”\nKyle opened her mouth again. His expression twisted as if trying to peek into my thoughts.\n“Are they just people like that?”"]},{"title":"I Can See Your Death","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manga I see your death / 너의 죽음이 보여 / あなたの死が視える"]},{"title":"If You Remove the Kind Protagonist’s Mask","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa If You Remove the Kind Protagonist’s Mask / If You Take Off the Mask of a Sweet Male Lead / Behind His Kind Mask / 優しい主人公の仮面をはがすと / 摘下善良男主的假面 / 상냥한 남자주인공의 가면을 벗기면"]},{"title":"The Battle of Nations: I will subdue the world through Pangu","tags":["Action","Adventure","Fantasy"],"disc":["Read The Battle of Nations: I will subdue the world through Pangu / 国运之战：我以盘古镇诸天","The spiritual qi is revived, the mythological arena descends, the gods of each country arrive, Sakura awakens Amaterasu Omikami, the Eagle Federation summons Odin, and Shila summons Zeus.","Only the Chinese are missing, leaving them in danger!","I have traveled across the world, and I know all of history. I have summoned the Great Pangu! Gods are forbidden in China!"]},{"title":"Don’t Trust the Heroine","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Don’t Trust the Heroine / Don’t Trust the Female Lead on manhwaclan","She was reincarnated into a novel as the villainess’ supporter and died a tragic death after harassing the heroine.\nTo avoid her death, she gave everything to Suzanne, the heroine and helped her get her happy ending. But…\n“Think back on your sins. You are convicted of attempted murder, high treason…”\nShe was betrayed in the end…\n“Goodbye, foolish countess. Ah, I forgot that you’re not a countess anymore,” Suzanne chuckled.\nThe heroine’s vicious nature, which she learned on the brink of her death. At that last moment, she thought.\n‘If I was given another chance, I…’\n* * *\n“No way! …I returned?”\nShe went back to the day before she met the heroine. The worst mistake she had made in her previous life.\n[History is written by the victors.] She will no longer be the heroine’s s*ave. She swears to come out victorious and have her own happy ending!"]},{"title":"Archmage Transcending Through Regression","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Archmage Transcending Through Regression","Mikhail Walpurgis, the world’s only 9th-circle Archmage, fell in battle due to a damned hero, and managed to cast one final advanced magic spell, . As time rewound, he regressed to 20 years ago.\n“Fine. I’ll just become the hero instead.”"]},{"title":"Royal Redemption","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Royal Redemption / How to Tame My Beast Husband / 驯服野兽的方法 / 못된 짐승을 길들이는 법"]},{"title":"Solo Farming In The Tower","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Solo Farming In The Tower / Farming in the tower alone / 나혼자 탑에서 농사","One day, a mysterious tower suddenly appeared in the city. The people decided to call it a dungeon, and while it was full of rugged terrain and dangerous monsters, it was also a land of opportunity, where countless treasures awaited. When Sejun, a young man living an ordinary life, is invited to the dungeon by chance, he is thrilled at the prospect of becoming rich, but he is stranded in a hidden area of the mysterious tower. All he has is a few seeds and his body. Now Sejun must farm, collect resources, and figure out his own survival strategy! 나혼자 탑에서 농사, Farming in the tower alone"]},{"title":"Match Made in Heaven by Chance","tags":["Comedy","Manhwa","Romance"],"disc":["Read manhwa Match Made in Heaven by Chance / 어쩌다보니 천생연분 / Accidentally Heavenly Match / Maybe Meant To Be","How long have i been laying down at home?’ Han Jia, who is turning 32 this year (she’s a freelancer who’s still doesn’t have a full-time job/jobless), suffers because of the pressure given by people around her that keep telling her to get married. Around the same time, Jin Mincheol, her childhood friend who came to Jia’s hometown for holiday, is having the same problem. Then, the two people got married just like that. Now that they have married.. Huh? We match each other more than i thought?’"]},{"title":"There Are Too Many Second Male Leads!","tags":["Comedy","Drama","Fantasy","Isekai","Magic","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manhwa There Are Too Many Second Male Leads!  / 서브 남주가 너무 많아! / One Too Many Supporting Male Leads / There are too many sub-male leads!"]},{"title":"The Saintess Returns To The Emperor","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Saintess Returns To The Emperor / The Saintess Returned to the Emperor’s Arms / The Saintess Returned to the Emperor’s Bosom / The Saintess Returned to the Emperor’s Embrace / 重回皇帝怀抱的的圣女 / 황제의 품으로 돌아온 성녀","After being betrayed by her lover, Riella decides to end it all, only to be saved by Emperor Herrhan. Without ever getting to thank him, she sneaks away to start her life anew. But soon, she finds herself on the brink of death once more when she’s wrongfully framed for trying to assassinate the emperor. Fortunately, Herrhan comes to her rescue yet again, and this time, Riella will be able to repay him in an even bigger way than she imagined. As it turns out, she is the empire’s sole saintess who has the power to heal the cursed ruler…"]},{"title":"Fox Love Story","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Supernatural"],"disc":["Read manhwa Fox Love Story / 여우애담","Yeon, a nine-tailed fox who despises humans, avoids an accident with the help of Dong-i, who happens to be a human. In essence, a nine-tailed fox is a being that must repay a favor it receives. Yeon visits Dong-i without missing a day in order to repay the favour. But Dong-i feels burdened by her kindness. The two, who seemed like they could never become closer, become aware of each other’s wounds and shortcomings, fill them in, and feelings emerge within their hearts. With different backgrounds, species, and even ways of loving, can the love between a Gumiho and a human truly end happily?"]},{"title":"I Regressed As The Duke","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["I Regressed As The Duke manhwa,\nThe son of the great Emperor Gline,\nPrince “Aaron”, is the recipient of the “Dragon’s Blessing”.\nBut because of the rebellion led by his uncle, “Zerone”,\nHe was banished to the outskirts of the kingdom, ‘Brahn Grounds’.\n“Emperor Zerone will kill us all…”\nKeeping his father’s dying wish to forget about the crown and revenge,\nAaron had been living powerlessly as the Duke of a barren land… but one day,\nEmperor Zerone invaded Brahn Grounds!\nHe didn’t come just for Aaron’s life,\nbut rather, his aim was to destroy Brahn Grounds!\nEven the loyal subject, “Gayle”, disappeared into ashes\nas he watched Duke Aaron and Brahn Grounds disappear\nin midst of Emperor Zerone’s flames.\nAt least, that’s what we thought happened!\nWhen he opened his eyes,\nGayle found himself in the position of a younger Prince Aaron!\n“I won’t live while hiding my power like the Duke did!”\nBy using any means necessary to develop the land,\nand preparing for Emperor Zerone’s invasion that will happen 20 years,\nhe decides to take back the spot of Emperor which he was robbed of!"]},{"title":"I Can’t Stop Doting the Empire’s Most Notorious Villainess!","tags":["Drama","Fantasy","Romance"],"disc":["Read manga I Can’t Stop Doting the Empire’s Most Notorious Villainess!","In high society, Raven is known as a womanizer and a free spirit. But suddenly, Estella, who’s rumored to hate men and is said to be the cruelest girl in the empire, walks into his bachelor life. And this girl proposes that he marry her! “There’s not a chance in hell this marriage will succeed,” thinks the young guy. But… Estella is convinced he’ll be the one to fall head over heels for her. How will it all pan out, and in the end, who will be right…"]}]