[{"title":"Ideal Match Delivery Service","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Ideal Match Delivery Service / Ideal Delivery Service / 理想のカレシをレンタルします / 이상형 배달 서비스","Eunhyeong’s world crumbles when her husband-to-be leaves her on their wedding day. While in a drunken stupor at home, she discovers an ad for a match delivery service on her phone. The next morning, a man named Minho shows up at her door, claiming to be her ideal match. What starts as a one-time free trial evolves into a routine of repeated orders, and sparks soon ignite between them as they find comfort in each other. Can they transform this unexpected twist of fate into a lasting love story?"]},{"title":"The Ducal Family’s Poisonous Flower","tags":["Drama","Fantasy","Magic","Manhua","Romance","Vampire"],"disc":["Read manhua The Ducal Family’s Poisonous Flower / 公爵家的毒之花","Lily Roland, the daughter of Duke Roland, stumbled upon her fiancé and her illegitimate sister having an affair! She was poisoned by the two people whom she grew up with, and thrown into the wilderness. When her life was hanging by a thread, she was saved by a monstrous creature that had a body of a human, but a head of a beast, who turned out to be the Crown Prince, Isaac Stewart. Isaac was cursed by a mysterious witch to turn into a bloodthirsty monster on the night when the moon is full, and Lily’s blood is his only antidote! Isaac decides to help Lily in her revenge, but in exchange, she must marry him and assist him in lifting the curse."]},{"title":"I Became the Young Villain’s Sister-In-Law","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Became the Young Villain’s Sister-In-Law / 어린 흑막의 형수님이 되었다","After being reincarnated as an extra with amnesia, i saved a child by chance, but he was the villain… What? The villain had a brother who died because of a fairy’s curse. He was the reason for their corruption. How cruel, if i met that fairy, i would have killed her, but unfortunately i’m an extra… “Elia?” Wait… Am i that fairy?"]},{"title":"I Became The Older Sister of A Regretful Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became The Older Sister of A Regretful Male Lead  / 후회 남주의 시한부 누나가 되었다","Edna possessed the older sister of the Male Lead, the man of regret, in the novel. Even the younger brother is a trash male lead who regrets accumulating all kinds of karma for the female lead, and Edna herself learns that she is doomed to die 3 years after suffering from a dark disease!\nBut Edna, who read the original, knew the cure for dark disease. That is, to be in constant physical contact with a person with an overflowing divine power! The only problem is that he is the 3rd Prince and the older brother of the original female lead, Karen.\nEdna’s struggle to make a contract engagement begins with a natural meeting… Contrary to expectations, she will be misunderstood as a member of the group that adores Karen, abbreviated as Kalsamo!"]},{"title":"I’ll Change My Fate To Be Executed","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’ll Change My Fate To Be Executed / 처형당할 운명을 바꿔 보겠습니다","The first night as a prince. The dagger in my hand was dyed red with my husband’s blood. The hot blood of a man who has been cold to me all his life. The moment I was executed for the crime of the Crown Prince, I vowed that if I were born again, I would never be his wife. Another chance given like that. I’m trying to get everything back. Even if you become a crazy young person in this area! but what is it Why does everyone keep praising me? “If you refuse to be my evil wife, I will make you the Crown Prince myself.” Besides, why is the Crown Prince who used to be cold to me like this!?"]},{"title":"I Became the Head of the Family","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became the Head of the Family / 소녀 가주가 되었습니다 / I Became the Family Head / I Became the Madam of The House / I Became the Mbabro of The House","After possessing the eldest daughter of Count Leire, Archel , became the head of the family following her parent’s death. The only way to protect her little brother and herself from the old foxes who are after her family was…","“I know that you need Leire’s sea territory.”","In order to acquire a shield called Gael Von Zenat, the infamous guardian of the eastern sea, but in reality, he was the head of a pirate family.","“I’ll give you the sea territory there. So, please marry me.”","It wasn’t a romantic proposal. It was just a perfect deal. You take care of our family’s sea, and I’ll protect myself and my brother.","I thought so, but…","“When I graduate, be sure to divorce my sister.”","“I think I’ve already told you that I don’t want to divorce her.”","The relationship between the two is unusual.","***","“Gael, stop it.”","She tried to move away but Gael didn’t budge at all.","“What do you mean? I said that I believe in you, didn’t I?”","“No.”","Archel said after a moment of silence.","“For real, it seems like you really do. I swear it seemed like you love me.”","That’s just an illusion.","After watching my expression, a smile disappeared from Gael’s face.","“Am I mistaken?”"]},{"title":"If You Save an Immoral Beast","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Mature","Romance"],"disc":["Read manhwa If You Save an Immoral Beast / 배덕한 짐승을 구원해버리면","The count’s maid, Asha, only ever dreamed of earning money for her sick mother’s medicine, and opening a small veterinary hospital. One day, she is tasked to run an errand at “Night Butterfly”, the darkest, most bizarre street in the Arte Empire. There, she meets a beautiful but wounded slave named Lee. After saving his life, it seems Lee does not want Asha to go. “It was you who saved me. My master, my salvation, my Asha.” After seeing him smile so strangely, she realized everything was ruined. She was trapped. Clearly, this seductive smile knew all along that she would never escape…"]},{"title":"Only for Your Well-Being","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Only for Your Well-Being","Ethan let Ruelli become another man’s woman, just for the sake of her happiness.","But contrary to what Ethan had willed, Ruelli’s fiancé cruelly pierced her heart, betraying her.","Highly grieving, she loses her memories and assumes Ethan to be her fiancé.","“I feel like I’ve lived my whole life for nothing.”","After someone attempts to murder Ruelli, she comes know that something was wrong.","Ethan is dead set to save her, who had been from being abandoned by both her parents and god, to give her everything he can.","“Take my hand and run away with me. From your cursed destiny.”"]},{"title":"Born As The Daughter of a Lowly Concubine","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Born As The Daughter of a Lowly Concubine, Became the Daughter of a Humble Concubine, I Was Born as The Daughter of a Low-Ranking Concubine, 말단 후궁의 딸로 태어났습니다","When I opened my eyes, I was a princess.","I was reborn as a princess, not a princess in Joseon, but a worldview far from actual history without any hard work to watch the historical drama.","I was born as the daughter of a lowly concubine, so I just wanted to live a quiet life, but I can’t, so…","I pushed out Youngbin and her son who were aiming for an empty midfield seat!","And realized that this world is similar to the novels I’ve read before!","The fact that the final boss, no, the villain Youngbin and her son Kyung-eon-gun while I who had been in the extra 1st position, had somehow removed them!","Thanks to this, the Crown Prince who would otherwise have been killed is still alive, and the Grand Prince, who should have been distrusted as a Crown Prince after suffering a dark battle, is still intact!","I wonder if this is okay… It was far from the novel’s content, but I wanted to live a peaceful and enjoyable life… Things in the world don’t always go as planned."]},{"title":"Everything is under the baby’s feet","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Everything is under the baby’s feet / As Leticia Wishes / Semuanya ada di bawah kaki bayi / Little Princess Holding the World in Her Hands / 모든 건 아기님 발 아래","As the beloved princess of the Kingdom of Tyrian,\nI was the revered star of the kingdom, but I was killed in vain.\nI thought that was the end\n… Did you break the egg?\n“wealth!”\n“Oh my God, my God! What kid from the egg!”\nIn the form of a very small child that only a bizarre babbling can do.\n“Ow! right!”\n*\nAnd a new family was formed.\n“Our lovely youngest daughter Leticia. You tame all the men in this house!”\nMy mother, Beth, with a sunny smile,\n“Not the Archduke, not the Father. Call me Daddy. Ah. Dad.”\nArchduke Cassius, who pretends to be blunt but is actually kind,\n“There is no such thing as your boyfriend, Leticia. You’ll soon forget it’s an alto or something. Sasha is only close with her brother. Understand?”\nAfter my brother Dmitry, who is an imperial genius who only comes out once in a thousand years, but is just jealous in front of me.\n“So, the naughty one came to my house as my birthday present. So that means it’s mine.”\nKylus, a troublemaker of the same age who calls me ugly, but says he likes me.\n“Nunna! Tisha! Joa! Hyung-ah, Shirae. Go away.”\nEven the cute youngest Rayleigh who only follows me.\nEveryone loves me so much!\nI wanted to live in peace like that…\nWas there a secret in the death of my previous life?\n“I found it. The child of prophecy.”\nWhatever it is, I have to put everything under my feet."]},{"title":"After Improperly Licking a Dog, I Became a Billionaire","tags":["Action","Drama"],"disc":["Read manhua After Improperly Licking a Dog, I Became a Billionaire / After Improperly Licking a Dog, I Became a Billionaire","Lin Xinben was an ordinary licking dog. After being dumped, he got the Shenhao system, and he got trillions at the beginning! The bad thing is that this money can only be spent on girls! No way, in order to spend the money, Lin Xin embarked on an unusual path of Shenhao’s counterattack!"]},{"title":"Hey Little Duke, Just Trust in Sister","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Hey Little Duke, Just Trust in Sister / 이봐요, 아기 공작님 누나만 믿어!","Trusting only her talent in swordsmanship, Espin tried to become the best knight but failed. It was because of Duke Xenoc Blacknight. The no. 1 knight in the Empire. I hated him so much. He was nothing but an enemy. “I won.” I was finally able to beat him, but my last memory was leaving the knights order then jumping in front of a carriage to save a rabbit. I thought I was going to die just like that… but I got resurrected? I opened my eyes back in the Empire 18 years ago, completely in a different body! “So if I gather sacred beasts like you, you’ll bring me back to my original time?” -Exactly! So if I help the sacred beasts, I can go back to my original time and live a new life! Instead of being resurrected, I wanted to live and enjoy the things I wasn’t able to enjoy before. “No, I-I’m scared…!” The Xenoc from 18 years ago is crying while hugging me?! “You… said you would marry me. Why are you running away?” Will Espin, who suddenly became a time-traveler, be able to fulfill her mission and go back?"]},{"title":"The Evil Grand Duchess Has a Secret Life","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Evil Grand Duchess Has a Secret Life / 악역 대공비의 위험한 이중생활"]},{"title":"I Killed Him","tags":["Action","Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Killed Him / I Killed / 내가 죽였다","You must never tell anyone. If you don’t follow it, you die.” Kwon Soon-hyang, the owner of the building who suddenly murdered the tenant. Seven years later, he is killed by someone ahead of his surrender. Shin Yeo-ju, a detective who digs up a huge conspiracy and absurdity behind the death of Soon-hyang Kim, a lawyer who gives a clue to the case linked to the death of his own client. When you don’t know who’s your friend and who’s your foe Who is the opponent behind all the incidents the two of them have to face?"]},{"title":"The Beast Within","tags":["Adaptation","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Beast Within / Citadel of Desire / Castle Of The Beast / The Castle of the Beast / 야수의 성 / 愛を知らない令嬢と野獣"]},{"title":"Da Capo","tags":["Fantasy","Manhwa","Music","Slice of Life"],"disc":["Read manhwa Da Capo / The Life of a Piano Genius / The Preliminary Life of a Piano Genius / ピアノの天才の高校生活 / 피아노 천재의 예고 생활","Only in death did I realize the meaning of my life. Daehwa Kim is a piano prodigy who drops out of a prestigious performing arts high school due to a lack of passion. Just when he finally discovers his love for the piano at 30, he gets into a fatal accident, only to wake up as a high school student again! Can he turn his fate around this time?"]},{"title":"I Was More Overpowered Than the Hero, so I Hid My Power!","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","School Life","Seinen"],"disc":["Read manhwa I Was More Overpowered Than the Hero, so I Hid My Power! / Era más fuerte que el héroe así que oculté mi poder /  I Was More Overpowered Than the Hero, so I Hid My Power! / Soy más fuerte que todos, pero oculto mi poder / Too Strong than the Warrior So He Hides His Strength / แกร่งเกินผู้กล้า แต่ซ่าไม่ได้ / 隐藏实力的幕后高手, 隱藏力量的邊緣英雄 / 용사보다 너무 강해서 힘을 숨김","From a young age, I’ve always dreamed of being that “unassuming hero,” appearing ordinary but possessing unmatched strength. But one day, fate took a turn when I was hit by an eight-ton truck, and suddenly, reincarnation was on the table! “What would you like to be in your next life?” asked the goddess of reincarnation. Eagerly, I replied, “I wish to become a wimp, but secretly OP!” She granted my wish, but with an unexpected twist: if anyone ever uncovers my true abilities, my heart will explode! This isn’t quite the “secretly-OP-wimp-life” I had in mind…"]},{"title":"I Become the Tiger’s Daughter","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Become the Tiger’s Daughter / 호랑이님의 딸이 되었습니다","The Tiger Lord of the East is now my father?! When Ari opens her eyes, she finds herself reborn as a baby in the land of divine animals, abandoned in the middle of a forest. Luckily, the white tiger lord takes her in, but he plans to send her away once she is old enough. Can Ari find a way to stay at the palace for as long as possible?"," "]},{"title":"The Corpse Will Tell","tags":["Action","Adaptation","Adventure","Drama","Fantasy","Romance"],"disc":["Read manhwa The Corpse Will Tell / Sicheneun Malhanda / 시체는 말한다 / The Body Says","“10 years, live as if you were a dead mouse for at least 10 years. I won’t meddle with however you live your life after that.” Jeanne, the girl who was praised as a war hero. During the civil war, in order to prevent the emperor from running away, she chopped off his right arm which made her the emperor’s target. After changing her name and fleeing to a barren land, she hid herself amongst the , a criminal investigation unit specializing in crimes committed by aristocrats. She spent a peaceful 10 years along with her new colleagues whom she solved various cases with. But, the past she came to forget starts to catch up to her! As if the lieutenant from her past who had a crush on her arriving and her dull subordinate who keeps acting suspiciously wasn’t enough headache, now even a scammer impersonating as her appears?! “…This is insane, am I still drunk?” The unpredictable mystery of the war hero who became a lazy detective begins!"]},{"title":"I Don’t Want to Be a Lady","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Revenge","Romance"],"disc":["Read manhwa I Don’t Want to Be a Lady / 레이디는 싫습니다","I’ll be the one calling the shots. After enduring an upbringing full of torment, Lady Arianne refuses to be used as a means to anyone’s end but her own. When her father moves to have her sold off as an additional mistress to the crown prince, she takes matters into her own hands by proposing a contract marriage with a duke instead!"]}]