[{"title":"Only Hope","tags":["Drama","Reincarnation","Romance","Thriller","Time travel"],"disc":["Read manhwa Only Hope / 온리호프.","The night she witnessed the murder of her beloved husband, Eun-hye was murdered and returned to nine years ago when she first met him. Will she be able to stop her husband’s serial murders? And… will she ever be able to love again?"]},{"title":"Heart Throbbing Conqueror","tags":["Fantasy","Isekai","Romance"],"disc":["Read manhwa Heart Throbbing Conqueror","I opened my eyes, but where I am?! Daeun instinctively realized she fell into the world of ‘Handsome Boy’s (Girl’s) Love Simulation’ as Diana. As she looks around, she sees hearts above the head of others! Men, women and even passing animals are all targets! Diana, thinking this is all a dream, creates a plan to start a reverse harem…"]},{"title":"I will steal your place","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I will steal your place / Stealing So-hee / 소희 훔치 / Sohee Stealing","Are you going to steal my identity? When Kim Yi-Seul transfers to a new school, she is immediately teased by Jin Soo-Hee. But Yi-Seul doesn’t seem to mind. Instead, she takes off her thick glasses and applies heavy makeup so that her face ends up looking just like Soo-Hee’s. That’s when the adventure begins."]},{"title":"I Have No Intention of Dating","tags":["Comedy","Manhwa","Romance"],"disc":["Read ,ậm I Have No Intention of Dating / 연애 생각은 없지만","“I want to live simply.” Do-hee wants to live her life the way she always has, and Dong-i, her coworker, likes her alone. who has no intention of getting romantically involved in the office… but does? We invite you to explore the intimacy of two people who keep running into each other."]},{"title":"Son’s Retribution","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Son’s Retribution","Kang Pildu, a cold-blooded psychopathic prosecutor, receives the news of his mother’s death.\nHe finds out that the “Seonhwa Group” led by his father and older brothers was involved in her death.\nThus begins his desperate revenge plot to bring down the Seonhwa Group."]},{"title":"The Fox Club","tags":["Drama","Romance","School Life"],"disc":["Read manhwa The Fox Club / 여우 놀이 / Fox Play","Meet Sangmok High’s Fox Club, home to the prettiest, wealthiest, and most popular girls in school. To ordinary Onyu Park, whose most extraordinary trait is being best friends with the gorgeous Chaeri Shin, the Foxes exist in a whole other world – or so she thinks – until she and Chaeri are suddenly thrown into the Fox Club headfirst! As if adjusting to high school wasn’t hard enough, the girls find themselves surrounded by prying eyes, rumors, catty schemes, and budding romance. Will Onyu and Chaeri’s friendship survive all of the drama and secrets? Who are the Foxes, really? And does Onyu have what it takes to become one of them?"," "]},{"title":"A Campus Romance, I Guess","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life","Shoujo"],"disc":["Read manhwa A Campus Romance, I Guess / 대충 캠퍼스로맨스임 / It’s just a campus romance","An ordinary university student, Hayoon. She meets Kang-on on a trip for which she leaves on impulse. Kang-on falls in love at first sight with Hayoon and confesses to her but she rejects him. The two who thought they would never see each other again are reunited during a university club recruitment event…and end up joining the same club. But wait..the president of the club they joined likes Hayoon too?! Lol this isn’t made up but really just a campus romance…I guess."]},{"title":"No Dating Allowed In The Office","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa No Dating Allowed In The Office / 사내연애 사절!","There’s nothing more memorable than a first love. Imagine meeting your first love again after many years, does your heart still beat strongly? From first love to a friend, from friend to colleague, a retrograde relationship. In my heart, I’ve created a dilemma! “No dating in-office!” From the same artist as <The Only Romance> Tofu X And the same writer of <The Right Guide to Dating> Nam Soo have joined and created “No dating Allowed in the office!” a romance with reunions and twists and turns about the past!"]},{"title":"Starting Over With the Dead You","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Starting Over With the Dead You / 죽었던 너와 다시 시작하기"]},{"title":"Go Away Romeo","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Go Away Romeo","Rosaline believed that she and Romeo were destined to be lovers, but an unexpected tragedy comes when he dies on the same day as her cousin, Juliet. Rosaline learns she has one last memory of Romeo— a son. However, Rosaline’s loving memory of Romeo is shattered when she learns of his betrayal. With no one left to love and protect but her son, the last thing she wants is for Romeo to return to Verona and take everything she holds dear."]},{"title":"Beauty and the Beasts","tags":["Ecchi","Fantasy","Harem","Manhua","Romance","Webtoons"],"disc":["Read manga Beauty and the Beasts on manhwaclan\nAs soon as she fell into the world of beast men, a leopard forcibly took her back to his home. Indeed, Bai Jingjing is at a complete and utter loss. The males in this world are all handsome beyond compare, while the women are all so horrid that even the gods shudder at their sight. As a first-rate girl from the modern world (she’s even a quarter Russian), Bai Jingjing finds herself sitting at the center of a harem filled with beautiful men — at the very peak of existence."]},{"title":"Script Shop of Dream","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":[]},{"title":"My First kiss With The Evil Butler","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My First kiss With The Evil Butler / 흑화한 집사와 첫키스를 해버렸다","Lady Isla Allandis, a noble lady on the brink of her social debut, is desperate to escape a contractual marriage. She encounters a handsome nobleman, Martin, seemingly the answer to her prayers. Eager for their first kiss to be flawless, Isla seeks guidance from Jade, her trusted butler. As they embark on ‘practice kiss,’ Isla and Jade feel the tension rising between them. Little does Isla know, Jade harbors secrets of revenge and a past shrouded in shadows."]},{"title":"Sorry, I Am Also a Big Shot","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhua Sorry, I Am Also a Big Shot / 抱歉，我也是大佬","Li Yuan, who was being chased after waking up in the hospital, found that she had lost her memory. At the critical moment, a man claiming to be her husband appeared and killed the last killer…"]},{"title":"I Became the Tutor of the Royal Twins","tags":["Adaptation","Comedy","Drama","Fantasy","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Became the Tutor of the Royal Twins / 쌍둥이 전하들의 가정교사입니다","An elementary school teacher in her past life, and a private tutor in the present.\nSera Popo uses all her past life experiences in her second life.\nShe worked as a high-value tutor for aristocratic children.\nHer goal is to be the owner of her own school!\nThen, one day, the Emperor of the Empire sought her out.\n“I want Miss Popo to be my siblings’ tutor.”\nWater bombs, flour bombs, bug attacks.\nWhat kind of offer did he make? To make her the tutor of a pair of notorious twins with all kinds of vicious pranks!\nWith a very sweet one of course.\nThe devil’s temptation shook Sera’s life."]},{"title":"I’m a Doll, but the Tyrant Is Obsessed With Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m a Doll, but the Tyrant Is Obsessed With Me / 인형인데, 폭군이 집착합니다 / It’s a Doll, but the Tyrant Is Obsessed With It / The Tyrant Is Obsessive With Me, a Doll / 人形ですが暴君に執着されています / La Poupée du tyran","“Are you really Chloe? No, who are you?” Others usually appeared as human when they possessed a character in a book, but I possessed a doll. It was also a favorite doll of the tyrant whose neck went flying because of the male lead. ‘I’ve already died once, but I don’t want to die again!’ To survive, I must edify the tyrant. To do that, I must first move my body… What? Oh, it’s moving? “Are you really Chloe? No, who are you?” A young emperor of the Burgundy Empire and a tyrant with the end faith of dying. Reclaim my body while edifying him!"]},{"title":"The Corrupted Witch Has No Choice But to Become a Villain","tags":["Fantasy","Romance"],"disc":["Read The Corrupted Witch Has No Choice But to Become a Villain / Hei Hua Monv Zhihao Chengwei Fanpaile / 黑化魔女只好成为反派了","Once a powerful and kind sorceress, Sera’s life is turned upside down when she is betrayed and cursed, causing her magic to turn dark and twisted. Forced into the role of a villain, Sera must navigate a treacherous world filled with enemies and scarce allies. As she battles her inner demons and external threats, Sera discovers that embracing her darker side may be the only way to reclaim her destiny and uncover the truth behind her curse. Join Sera on her journey of transformation, betrayal, and redemption in this captivating manhua."]},{"title":"9th Class Sword Master: The Guardian of the Sword","tags":["Action","Drama","Fantasy","Manhwa"],"disc":["Read manhwa 9th Class Sword Master: The Guardian of the Sword / 9클래스 소드 마스터 : 검의 구도자 / The Ninth-Rank Sword Master: Sword Seeker / The Ninth-Rank Sword Master: Conquering the Sword Forms","At the end of the “War of Trust,” that was fought to protect humanity against the forces of “corruption,” Karil MacGavern, a Sword Saint, faces the betrayal of his close friend and emperor, Oliven. Having ultimately killed the emperor, Karil travels back in time to set things right. Now, armed with the power he couldn’t obtain in his previous life, both a sword and magic. He stands at the crossroads of two paths, determined to change the future."]},{"title":"Since The Red Moon Appeared","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Supernatural"],"disc":["Read manhua Since The Red Moon Appeared / 从红月开始"]},{"title":"Requiem of Subdued Souls","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Requiem of Subdued Souls, Subdued Soul Chronicle, 진혼기","If there is an omen of disaster in the Hwarang, who else could it be besides Seol Yeongrang, who controls spirits?","Hwarang Seol Yeongrang was prophesied as one who would bring forth disaster. The only way he could return to his ranks is by solving incidents, in turn proving he wasn’t the omen he was painted as.","And whilst he ventures, a mysterious mad man named Zaha appears.","In the era of Silla, where humans, yokai, and spirits roam, a hwarang’s requiem unfolds."," "]}]