[{"title":"I Became The Black Swan Mother of The White Swan Princess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became The Black Swan Mother of The White Swan Princess / 我成为了白天鹅公主的黑天鹅母亲 / 백조 공주님의 흑조 엄마가 되었습니다"," "]},{"title":"Romantic Flow","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Romantic Flow / 로맨틱 플로우","First rule of the workplace: don’t date your boss. It’s a rule that should be easy for workaholic lawyer Hyeonseo Cha to follow, especially since her new boss, Jeonghyeok Seo, has a reputation of being a heartless playboy who only cares about money. But despite his infuriating smirk and arrogant tone, Hyeonseo finds herself slowly being drawn to him as he wears down the armor of cold indifference she’s worn over the years. But does he feel the same towards her? Or is Hyeonseo just setting herself up for a devastating heartbreak?"]},{"title":"Holy Alice Returns","tags":["Comedy","Drama","Fantasy","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa Holy Alice Returns / 홀리 앨리스 리턴즈","‘Alice’ Those who were chosen as a sacrifice to ‘Fate’ were called ‘Alice’. The reason for their sacrifice was to wash away the Emperor’s sins. “You were chosen as the 56th Alice.” The long stopped clock of fate began to move its needle."]},{"title":"Take Me","tags":["Drama","Fantasy","Manhua","Mystery","Romance","Shoujo","Supernatural"],"disc":["Read manga Take Me on manhwaclan\nLiving together with a crush…but he’s a ghost?"]},{"title":"The Evil Empress Loves Me So Much","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Evil Empress Loves Me So Much / The Villainess’s Bestie / Villain Empress Loves Me So Much / The Evil Empress Adores Me / 악녀 황후님이 날 너무 좋아해","A common woman who is jealous of the queen of evil for her beautiful beauty and is killed by an extra… He was reincarnated as Charlize Fortunately, he’s only five years old! I decided to avoid the emperor and empress until the original work began…… “Shaar, what did the Emperor say? ” “I’m Ebizi.” “Isn’t Sharul the best in the world?” ” The evil queen loves me so much…?"]},{"title":"The Witch And The Warm Man","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa The Witch And The Warm Man / Monu Yu Nuan Nan, Mónǚ Yu Nuǎnnán / Mónǚ Yǔ Nuǎn Nán / The Witch and the Warm Boy / Monu Yu Nuannan / 魔女与暖男","The two young main characters live a messy life, but they meet each other and start a romantic, heart-warming and funny life together. The two people accompany each other, heal each other, and gradually transform while becoming inseparable from each other……"]},{"title":"The Distance Between Us","tags":["Josei","Romance"],"disc":["Read manhwa The Distance Between Us / 30cm Between Us / À 30 cm de toi / 君との距離、30センチ / 우리 사이 30cm / The Distance Between Us (YUJU)","Haemi is an ordinary high school art teacher. Sure, she gets scolded by the principal a lot, but her personality makes it impossible for anyone to hate her. While Haemi has her eyes set on one of her fellow teachers, things start to get a little more complicated when her old childhood friend steps into the picture. Between the confusion and the drama, the three of them keep crossing paths in unexpected ways."]},{"title":"Palawari’s Choice","tags":[],"disc":["Read manga Palawari’s Choice"]},{"title":"The Lost Lady and the Crimson Duke","tags":["Romance"],"disc":["Read manga The Lost Lady and the Crimson Duke","Justine, a daughter of a fallen noble family, works as a seamstress named Elise at the Royal Palace while hiding her true identity. On the day of the royal wedding, a robbery incident occurs, where the Princess’ Royal necklace gets stolen! After a series of unfortunate events, Justine gets falsely accused by the crowd of stealing the Princess’ necklace. Just when Justine thinks there is no escape from being labeled a criminal, Lord Shimeon De Castille, the King’s nephew, comes to her side and helps her. He offers to keep Justine at his mansion until all suspicions are cleared. Justine knows Lord Shimeon is only being kind because of his good nature, but for some reason, she can’t help but grow feelings for him. However, her toxic relationship from the past tells Justine it’s better not to fall in love again. So, it’s only natural that she keeps her distance from Lord Shimeon, right?"]},{"title":"Silkflower Fantasy Dream","tags":["Comedy","Drama","Isekai","Psychological","Romance","Shoujo Ai","Slice of Life","Tragedy"],"disc":["Read manga Silkflower Fantasy Dream","D List actress Bai Muzhi just received her chance to shine but she ends up getting tortured to death by film director Ye Ze. Afterwards, she’s reborn…as Ye Ze’s secret wife, Yun Xiaoran?! She never thought that revenge would involve so many…men!"]},{"title":"The Legendary Fossil","tags":["Action","Adventure","Fantasy","Historical","Isekai","Magic","Mystery","Reincarnation","Romance"],"disc":["Read manhwa The Legendary Fossil / Legendary Fossil / 传说的复学生 / 전설의 화석","Ashley Lute, who finally came back home after three years of grueling adventure, returned to the Academy at the request of her sister Carneline. Already famous as the only returning student, she tried to finish her remaining years at the Academy in peace. In addition to that, as the Second Prince Luke and the young lady of the Vellock Duchy approach her, the attention on the newcomer grows even more."]},{"title":"I’ve Become The Villainous Empress Of A Novel","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’Ve Become The Villainous Emperor Of A Novel / The Rebirth of a Tyrannical Empress / 소설 속 악녀 황제가 되었다","After a night of heavy drinking, I found myself transmigrated inside a novel as the villainous Empress Yulia, who will be executed for treason in three days. This is a project to find a way for the workaholic empress to live, to exact her revenge and prevent treason from happening. Will I be able to become a good and wise ruler? The constitution of an unexpected empress. The turbulent reign of the straightforward and gentle looking, but iron-fisted Empress Yulia."]},{"title":"Black Dragon’s Taste","tags":["Fantasy","Romance","Webtoon"],"disc":["Read manhwa Black Dragon’s Taste / Black Dragon’s Choice / Black Dragon’s Preference","To others, Im Jinha is a superstar. But to attorney Cha Yoolli, he’s just a loyal customer at her mom’s book rental shop who exclusively reads books with dragons in them. After Yoolli gets fired from her job, Jinha offers her a spot on his agency’s legal team, with her law school senior as her boss! However, Yoolli doesn’t know that her new workplace holds an ancient secret. Something… draconic. Could it be that Yoolli and Jinha’s relationship goes beyond just books?"]},{"title":"I Know What You Think","tags":["Manhua","Romance","School Life"],"disc":[]},{"title":"This World is Mine","tags":["Adaptation","Drama","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa This World is Mine / 이 세계는 나의 것","Wooyeon is a reclusive web fiction writer. Her mundane life is changed forever when Princess Charlize Rod Crosel, a minor character in one of her bestselling web fictions, decides to take destiny into her own hands by kidnapping Wooyeon and bringing her into the fictional world. Will Wooyeon and Charlize be given the opportunity to change the future and find their happy ending?"," "]},{"title":"The Antagonist’s Pet ( The Pet Of The Villainess )","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Antagonist’s Pet ( The Pet Of The Villainess ) / La Favorite de l’Héritière / 악녀의 애완동물 / 悪女のペット / 毒皇妃也有可爱闺蜜？"]},{"title":"Adapted Male Lead","tags":["Adaptation","Drama","Josei","Romance","School Life","Slice of Life"],"disc":["Read Will You Be My Male Lead? (Official) / Adapted Male Lead / Adapted Namjoon / Adopted Boys / Dramatized Male Lead / 각색남주","Yeo Ju, planned to confess to her childhood friend through a novel and even signed with a publishing company. Yeo Ju then is bound by money when she tries to leave the publishing company."]},{"title":"IF Future","tags":["Romance"],"disc":["Read manhua IF Future","Wei Lai accidentally picked up a mysterious camera that can take pictures of the future but found that it only has an effect on her secret crush, a senior."]},{"title":"Snow Song of Ten Thousand Miles","tags":["Fantasy","Historical","Manhua","Romance","Slice of Life"],"disc":["Read manhua Snow Song of Ten Thousand Miles / 万里雪歌","In the middle of the Tang Dynasty, amidst a revolution , two teenagers, by chance, meet each other, both dressed as women. Together, they travel across countless stretches rivers and mountains, with no destination in mind."]},{"title":"Dear Anonymous Sponsor","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Dear Anonymous Sponsor / 친애하는 익명의 후원자님께"]}]