[{"title":"Temptation of Wife","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Temptation of Wife / 아내의 유혹","Tender-hearted Jerenia is married to the most uncaring and disrespectful husband, Vincent Mercier. Her in-laws undermine and abuse her daily, but Jerenia believes that if she bears a child, she could be respected as part of the dukedom. After trying for seven years, she finally conceives a child, only to find out that Vincent’s been cheating on her with her childhood friend, Erica. Vincent conspires to kill his wife, but surviving the murder attempt has turned Jerenia into a woman of vengeance."]},{"title":"I Got Lucky and Pulled a 10th Rank Summon","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa I Got Lucky and Pulled a 10th Rank Summon / 10-Star Player Strengthened by Drawing Card / 뽑기로 강해진 10성급 플레이어","In the most realistic VR game “Last Savior”. Every player will get a chance to summon a Follower Spirit. The Follower Spirits are ranked from 1 – 9. And Obviously, everyone wants a rank-9 spirit. However, the one that I pulled has an unheard-of rank… [What on earth is going on?] “Yeah…” I don’t get it either."]},{"title":"For Snow White","tags":["Fantasy","Romance"],"disc":["Read manhwa For Snow White / 백설을 위하여","On the day of the empress’s funeral, I remembered the disastrous ending of the prince, who was his brother beat the emperor and the empress, as well as the head, and seized the bloody throne. To avoid tragedy, you must persuade the emperor, not be hated by your brother, and finally get sympathy from the knight who beheaded you. Like the hunter who couldn’t kill Snow White and helped him escape. That’s how I thought I’d get sympathy for him… . “Hey, can’t we just make eye contact and talk?” “… Wouldn’t it be uncomfortable?” “It’s uncomfortable. It’s as pretty as a camellia flower.” Why am I pitying you! * “If I could come back with glory… .” “… At that time, would you please allow me to stay by your side?” It is only when the crying reaches the end of the throat that you vaguely realize it. the reason for this feeling. The reason I think of you from time to time, miss the times we spent together, and wish for your happiness so earnestly is because you have become precious to me. Because I fell in love with you."]},{"title":"Spirit of the Dead","tags":["Drama","Fantasy","Manhwa","Mystery","Romance"],"disc":["Read manhwa Spirit of the Dead / Ghostly soul / 귀혼 / Peculiar Marriage"]},{"title":"The Final-Boss Prince is Somehow Obsessed with the Chubby Villainess: Reincarnated Me","tags":["Fantasy","Romance"],"disc":["Read The Final-Boss Prince is Somehow Obsessed with the Chubby Villainess: Reincarnated Me","After dying of illness, she has been reincarnated as Celine, the selfish, fat, villainous duchess, sister of the heroine of a popular novel. If she stays this way, she will be killed by the hero prince and die a miserable death, just as in the novel. She vows to reform herself with all her might and begins to struggle, but she finds herself caught up in unexpected doting and obsession..! Will Celine be able to find “peaceful happiness”? A fantasy love story about a reincarnation in another world where she is loved too much by a Yandere."]},{"title":"The Heavenly Demon Becomes an Idol","tags":["Adventure","Drama","Manhwa","Shounen","Supernatural"],"disc":["Read manhwa online The Heavenly Demon Becomes an Idol/천마는 아이돌이 되었다 at manhwa website","One day, a mysterious figure dressed in martial arts attire with long hair trailing down to his waist appeared and introduced himself as “Heavenly Demon.”","I wonder how many would simply nod and accept that?","“It seems you find it hard to believe, so let me tell you again, you scoundrel—I am the Demon, Wih Wajin.”","Out of the blue, he barged into an idol agency, causing utter confusion.","So, why exactly was he here!?","“I, too, will become an idol.”"]},{"title":"Originally A Lady With One Line","tags":["Fantasy","Romance","Webtoons"],"disc":["Read manhwa Originally a Lady with One Line ; 한 줄짜리 영애였을 터, Originally A Lady With One Line, I Was Just An Ordinary Lady, The Heroine of Drayfox","A sassy prospective college student, Kim Hansol, meets her end due to an unlucky accident. She gets reincarnated as a beloved lady in a family of heroes in a world with magic, spirits, and dragons. “I’m going to return to my original world no matter what!” But while struggling to return to her Korea, she loses control of her magic and ends up causing a catastrophe. Yet her family loved her regardless, and moved by that, Kim Hansol acknowledges her reality and begins to live as Finnea of McKaira, one of the five legendary houses in her new world."]},{"title":"Eternal Love","tags":["Drama","Fantasy","Josei","Manhua","Romance"],"disc":["Read manga Eternal Love / First Frost / Hard to Deceive / 难哄","When Wen Yifan returned to her hometown for work, she met the rumoured “First-Class Handsome Guy” in a bar, but he turned out to be Sang Yan, whom she hurt and rejected in high school! In a twist of fate, the two people who could never get along kept bumping into each other. They even rented the same unit by chance and became housemates! Unspoken feelings refusing to see the light of day, strong emotions stirring beneath it all… Let’s see how Sang Yan, the “Peak Ideal Boyfriend” interprets and expresses deep affections and sweet love!"]},{"title":"I Adopted a Male Lead From a Prison Shelter","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Adopted a Male Lead From a Prison Shelter / 수인보호소에서 남주를 입양해버렸다","She possessed Sienna Lovett, the villain of the tragic novel. The greatest leader of the Tigers in the original novel when his Tiger Clan abandoned him for being a mutant, but that didn’t last long before the Duke came looking for his son.","I’ve convinced my father to let him live with us somehow, but now I just need to succeed in protecting Ivan until the Duke comes…","But when the Duke arrives, the unexpected happens.\n“I’ll take she too.”\nhuh? I?\nDo I really want to continue living with my parents?"]},{"title":"The Devilishly Trash Duke","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Devilishly Trash Duke / 개쓰레기 공작이랑 누가 결혼해?","After a fatal tragedy, our heroine wakes up as Aurora, a character from a novel she once read. While coming to grips with her new reality, she’s sent to marry the Duke of Ettica, a.k.a. infamous piece of trash. This trash duke knows no bounds! “Could you punch me right now?” Not only is he a scumbag, he’s a perv too?! “If I end up falling for you, I will become your loyal little dog.” What has Aurora gotten herself into? Perhaps it’s the start of a puppy love…? Or perhaps it’s leading to something more…"]},{"title":"The Fake Saintess Bears Tainted Robes","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Fake Saintess Bears Tainted Robes / The Fake Saintess Doesn’t Want to Die / 가짜 성녀는 죽음을 원치 않기에","Alicia Sorcelion is a Noble Lady of the Empire, whose only sin was believing in love. When a doctored prophecy matches her likeness, Prelate Libenthius, a religious leader of the Empire’s Central Pantheon, conspires to take advantage of Alicia, puppeting her as the “Saintess” of the empire and betrothing her to the Crown Prince, Viktor Lawrence. While she is praised by the masses, she conceals her apparent lack of divine power, and lives a secluded and lonely life, only finding solace in her love for Viktor, who she believes to reciprocate her feelings. After Viktor becomes Emperor, he reveals that he too was using her as a pawn in his ambitious plans, and with the appearance of a new “True Saintess” appears, Alicia is branded as a traitor and “False Saintess” in the eyes of the public, eventually sentenced to burn at the stake as a witch and traitor of the Empire. Given another chance at life from the heavens, she opens her eyes in the past, with evidence of living a tragic future branded on her. Determined to avoid the prophecy at all costs, she aims to become a religious servant of the Empire, immune to the prophecy and the influence of her traitors. However her journey is not so easy, as her fate is tangled with a helping Cleric, Edwin, and her past tormentors continue to enact their conspiracy from her past future."]},{"title":"Useless Cinderella’s Feeble Attempt to Save the Kingdom","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read Useless Cinderella’s Feeble Attempt to Save the Kingdom","The Kingdom of Belveron flourishes with the power of water magic used by the Vilcast Family, earning it the title of “Land of Beautiful Waters.” However, Lara, the daughter of the Vilcast family, unable to use water magic, lived being treated with disdain by her family as the shame of the household. One day, a proposal of marriage from the Kingdom of Tulumhut, which is struggling with water pollution, arrives at the Vilcast household. The Kingdom of Tulumhut arranged a political marriage, investing considerable wealth, to save their homeland using the power of water magic. The other party is the 38-year-old bachelor “Former Crown Prince who has fallen behind.” However, the Vilcast family plans to force the useless Lara onto the marriage proposal, instead of her step-sister, Mary, who excels in water magic. Lara ends up marrying into the Kingdom of Tulumhut to save the nation as the “Goddess of Water.” What awaits Lara, who cannot use water magic?"]},{"title":"Becoming A Legendary Ace Employee","tags":["Adventure","Comedy","Drama","Office Workers","Webtoons"],"disc":["Read ,ậm Becoming A Legendary Ace Employee / Become a Legend as an All-Rounder / The Legendary All-Rounder / 만능사원 전설이 되다","Kim Tae-seok, a former construction worker, receives a notification that he has passed the document screening for a major corporation called El Sung. Soon after, a system message pops up before him. “You have gained access to the tutorial for ‘The Path of a Regular Employee’. Would you like to proceed with the tutorial?” Follow Kim Tae-seok’s struggles and adventures in his quest to become the legendary ace employee at the company!"]},{"title":"How to Clear a Dating Sim as a Side Character","tags":["Adaptation","Drama","Game","Historical","Isekai","Manhwa","Reincarnation","Reverse harem","Romance"],"disc":["Read manhwa How to Clear a Dating Sim as a Side Character / A Trivial Extra in a Dating Sim / 미연시게임 속 하찮은 엑스트라","When Yewon opens her eyes inside Midnight, the top-ranked dating simulation game, she realizes things aren’t quite as fun when her own life is at stake without a “Load Save” option. The only way to clear Midnight is to reach a happy ending with one of the five love interests, but each route poses a different set of problems. Meeting the master of the mage’s tower will lead to almost certain death, the crown prince doesn’t even try to hide his animosity towards her, the merchant seems to be missing a few screws, and another barely speaks. The swordmaster seems relatively normal, but it turns out he’s a devout follower of the temple she’s desperately trying to escape. Will Yewon be able to capture the heart of one of these men and use her insider game knowledge to clear the game?"]},{"title":"I Became the Greatest Heiress of the Empire","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Greatest Heiress of the Empire / I Became the First Heiress of the Empire / 제국 제일의 상속녀가 되었습니다"]},{"title":"Admission is a Waste of Time","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Admission is a Waste of Time","How about a university where you attend classes at the Tower of Babel?","Ban Yoo-won possesses the extraordinary ability not only to interpret unknown languages but also to see and absorb “concepts” from the things he observes.","Since childhood, Yoo-won’s grandfather has told him: “Our family descends from the ancestor who led people to build the Tower of Babel with the power to make everyone communicate. With that same inherited power, you will be able to reclaim the lost Tower of Babel.”","At first, Yoo-won thought it was just a far-fetched story. But while waiting for his university acceptance results, he is suddenly summoned to an academy from an unknown dimension. There, he witnesses the legendary Tower of Babel, which he had only heard about in stories.","Driven by a somewhat materialistic desire to reclaim his family’s lost building and become its owner, along with a sincere wish to fulfill a long-standing family dream, Yoo-won enters the academy. Finally, he begins his climb up the Tower of Babel—a dungeon filled with dangers and monsters, where the power of constellations and, at its peak, the power of the gods, awaits him!","Chapters list"]},{"title":"Describe Your Feeling When Being Reincarnated as Your Husband’s Mistress","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Describe Your Feeling When Being Reincarnated as Your Husband’s Mistress, Describe How You Feel About Being Reincarnated as Your Husband’s Mistress, Describe How You Felt About Being Reincarnated as Your Husband’s Mistress, Describe Your Feelings About Reincarnation as Your Husband’s Mistress, Please Describe How You Feel About Reincarnating as Your Husband’s Mistress, Reincarnating as My Husband’s Mistress, 남편의 정부로 환생한 심정을 서술하시오","As the glass-bodied Duchess, I lost my life to a severe seizure. No, I thought I lost it. “…I want you.” And I was reincarnated as a woman who looked exactly like me. But this woman’s body is very strong, isn’t it?"," "]},{"title":"Heavenly Grand Archive’s Young Master","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts","Murim"],"disc":["Read Heavenly Grand Archive’s Young Master\n[By the studio that brought you !] The soul of the charming and imposing Murim Alliance Leader, Hu Gong, suddenly possesses the body of a darn young man’s body one day. That young man’s name is Beom Hang. He’s the young master of the ‘Heavenly Grand Archive’, one of the three major archives of the jianghu, yet a sorry excuse of a person. In order to determine why his soul has swapped bodies, Hu Gong begins to train Beom Hang’s body. When the possessed young master of the Heavenly Grand Archive’s movements are totally different from how they used to be, it starts to attract the attention of the jianghu…"]},{"title":"Captain! Is this battlefield here?","tags":["Adaptation","Comedy","Drama","Isekai","Manhwa","Webtoons"],"disc":["Read manhwa Captain! Is this battlefield here? / Reporting for Duty, Duchess! / 대위님! 이번 전쟁터는 이곳인가요?","Elite Special Forces Captain Lee Yoon-ah, who is said to be Korea’s nerd.\nAs a soldier to the bone, there was no romance in her life.\nHowever, a completely different world unfolds in front of her, who lost her mind after being hit by a shell while dispatched overseas.\nBeing possessed by a romance fantasy novel written by a friend!\nShe also becomes an extra ‘Rosalie’ who lives a miserable life.\nTaking a deep breath and shaking her head for a moment, she considers this a battlefield and decides to change her life.\n“This is a class society.”\n“Because I’ve experienced enough to get tired of a hierarchical society called the military.”\n“Are you disobeying my orders now?”\nCaptain who conquers the duke with absolute charisma!\nHowever, she unintentionally seizes the romance…\n“Duke, how does it feel to kneel down to the Crown Prince? It’s the first time you’ve kneeled down to anyone other than the Emperor.”\nThe original male lead, not the female lead, falls to her knees.\nCaptain, who didn’t care about love, can you win this battlefield?"]},{"title":"Roots of the Heart","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Roots of the Heart","William is a city boy who has just turned 18. He’s finally old enough to do everything he wants, right? But his life is turned upside down when his family moves to the country, putting the brakes on all his big plans. Will he resist his new life, or will he let new relationships in?"]}]