[{"title":"Do You Believe in Fate?!","tags":["Drama","Romance","School Life","Slice of Life"],"disc":["As fate would have it, men appeared in front of Jinah who didn’t believe in fate! Who will be her fate?","운명을 믿으시나요?!"]},{"title":"Opening My Eyes, I Was a Princess!","tags":["Adaptation","Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa Opening My Eyes, I Was a Princess!","I was reborn as the youngest daughter of the royal family?! Expecting to be showered with love and luxuries, I found myself gravely disappointed when my father seemed to have no interest in me. Not only that, but what’s going on here?! “I’m thinking of marrying you off to the Imperial Emperor.” How could you say such a thing to your newborn daughter?!"]},{"title":"In the Sunshower","tags":["Comedy","Fantasy","Romance","School Life","Supernatural"],"disc":["Read manhwa In the Sunshower / Fox on a Rainy Day / 여우비 내리는 날에","Yoon Seul appeared in Sae-byeok’s life for a brief moment, then disappeared like a fleeting sunshower. But mysterious circumstances have brought her back to the human world and into Sae-byeok’s life once more. She needs to reclaim what was once hers. And in order to get it, Yoon Seul needs something from Sae-byeok that’s more important now than ever: his love."," "]},{"title":"I Picked Up the Second Male Lead After the Ending","tags":["Fantasy","Historical","Isekai","Manhwa","Romance"],"disc":["Read manhwa I Picked Up the Second Male Lead After the Ending / Happily Ever Afterwards / Ending Hu Seobeunameul Juwotda / 傲嬌男二攻心計 / 完结后捡了个男二 / 엔딩 후 서브남을 주웠다","I transmigrated inside the novel of my favorite character, the second male lead. A tsundere who listens to all the words of the female lead while grunting, with a straight forward personality, and a handsome face. Matching all my preferences, he was even single after the ending. Nice! I’ll pick up the second male lead! However, I overlooked one thing… The tsundere, who had been abandoned by the female lead blackened, and had become a terrifying man! “Get lost.” …I, Is it safe for me to pick up the second male lead?\nOn the way back:\nThe expression “there is something unusual”, “smiling alone”, “feeling cocky”.\nIt is a happy, proud mood.\nBuy oil to light so that when she comes home her house becomes bright.\nWhen you go home:\nTattoos entered to clean up briefly, explaining the mess because of the lack of women’s hands. Act awkward but honest, rustic.\nWhen Grandma Tu had not returned, Trang had a feeling of “fear” because she was worried that her wife would leave because the family was too difficult, afraid that happiness would slip out of her hands."]},{"title":"Hurdles to provocative","tags":["Action","Comedy","Drama","Fantasy","Manhua","Romance","Shoujo","Webtoons"],"disc":["Read manga Hurdles to provocative / 越界招惹 / Cross Border Provocation / Cross-Border Provocation","Wen Xian strayed into the no-man’s land, and was almost seen as a poacher. Captain Luc, isn’t it good for them to pick people’s things as soon as they meet? Lu Tieu Thien looked at the daring woman in front of her with a cold expression, attacking, kissing, and seducing at night…"]},{"title":"I’ll Divorce You Gracefully!","tags":["Fantasy","Romance","Shoujo","Villainess"],"disc":["I’ll Divorce You Gracefully manga, Karei ni Rien Shitemisemasu Wa! 華麗に離縁してみせますわ！\nRosa married Adrian, who had a lover. “I’ve never seen a woman as ugly as you.”\nAlthough she was told such word on their wedding night, she had no feelings for Adrian, as she had only married him on her Father’s orders.\nIn order to escape from her Father’s control, she is determined to save up money, get divorced and get her freedom back.\nOn the other hand, Adrian is slowly getting attracted to Rosa, a single-minded woman who does everything from cleaning, cooking, taking care of the kids to working in the fields and sword fighting…\nThe Long-Awaited manga adaptation of “The 14th Annual Romance Novel Award” Winner from Alphapolis!"]},{"title":"My Nine Wives Told Me Not To Be Afraid","tags":["Action","Comedy","Harem"],"disc":["Read manhwa My Nine Wives Told Me Not To Be Afraid / Nine Female Teachers Told Me Not to Be Scared / 九位师娘叫我别怂 / 师娘，请自重","My Nine wives told me not to be afraid. Chen Xuan, who has admitted to Dongling University, went to Dongling, to prepare for his studies. His first wife, Lin Suyi, explained that if he went to Dong ling, he would remember to find his fiancee to fulfill the marriage contract. Chen Xuan entered the city and began to unlock all kinds of wonderful opportunities. The charming and domineering eldest Jiang Wushuang, the iceberg beauty Xiao Yuan, and the gentle like water Jiu Shi Niang At the same time, Chen Xuan began to have friction with various spheres of influence, and gradually discovered the hidden genocide in himself. hatred. From then on, Chen Xuan wiped out the royal family, fought against the Temple of Heavenly Kings, overturned the heavenly world, and there is no rival in the world!"]},{"title":"Her Peculiar Visitor","tags":["Drama","Fantasy","Manhwa","Mystery","Reincarnation","Romance","Shoujo"],"disc":["Read manhwa Her Peculiar Visitor / 기묘한 그녀의 밤손님 / 彼女の奇妙な夜客.\nThree dates to save the bookstore?! Banished from the celestial realm for interfering in the fate of a mortal, Juhee now lives a mortal life herself as the owner of a bookstore. When she suddenly receives an eviction notice, she visits her landlord to plead her case. But what will she do when he makes her a peculiar offer?"]},{"title":"A Love Story of Heaven and Hell","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Tenou and Devil’s Wedding / The Marriage Story of Heavenly King and Demon King / 천왕 마왕 결혼한 이야기\nOil meets water. Cat meets dog. That’s the best way to describe the relationship between Sara, the Queen of Hell, and Marshall, the King of Heaven. Originally forced into marriage to end the brutal conflict between Heaven and Hell, Sara immediately assumes that there’s no way she’ll actually fall in love with Marshall. Not only is he barely of age, but he is much too sweet and submissive for her fiery personality. Yet Marshall persists in worming his way into Sara’s heart, doing his absolute best to dote on her and get to know her better. And despite interference from Sara’s jealous ex-fiance and Marshall’s scheming older brothers, Sara becomes slowly (and awkwardly) attached to her puppy-dog of a husband. Will the Queen of Hell learn to love Marshall in his entirety, despite her heart of ice?"]},{"title":"The Chubby Female Lead is Popular","tags":["Adventure","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Red manhwa The Chubby Female Lead is Popular","thrifty beauty.\nThis was the description of Crepe, the main character of <I want to be ugly for one day>.\nDid you believe that and I ate too many desserts?","“You’ve gained weight.” said the little brother who would betray the family.","“No, why are you saying that? Our crepes are already incredibly beautiful!” said my eldest brother, who would die when I was ten.","Plump cheeks, convex belly, plump forearms.\nActually, none of that mattered.\nI will correct the gutter-like original content.\nI will change the future and win happiness!","But at the time I didn’t know.\nAfter all, life is a novel written by God for fun."]},{"title":"The Daughter of the Albert House Wishes for Ruin","tags":["Comedy","Fantasy","Romance","Shoujo"],"disc":["アルバート家の令嬢は没落をご所望です, The Daughter of the Albert House Wishes for Ruin, Albert-ke no Reijou wa Botsuraku wo Goshomou desu\nNoble’s daughter Mary Albert, in the middle of the school opening ceremony, remembers that this world was an otome game she played in her previous life, and she turns out to be a character from that game. The Mary inside the game was a villain, harassing and interfering with the heroine, and was met with destruction at the end: the so called “villainous girl’s downfall route”. And so the obvious reaction is – “This isn’t a joke!?” and carefully avoids the destruction end – or not!\nInstead she trudges headlong towards the destruction end!"]},{"title":"The Saintess Returns as a Villain","tags":["Comedy","Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa The Saintess Returns as a Villain / 성녀는 악역으로 회귀한다","Beatrice has lived as a saint for 10 years to prevent the disaster of the empire and win the love of her family. One day, her place as a saint was taken away by a girl named Lina Cumbell with her black hair… . “I will kill you, your family and all your followers.” She is framed as a warlock and executed. Beatrice’s second life began like that. “Even if this life becomes a villainess… Lina, I will avenge you!!” The new life of Riche, a true saint who decided to become a villain, is redrawn."]},{"title":"I’m not really the son of luck","tags":["Action","Adventure","Fantasy","Harem","Isekai","Romance"],"disc":["Traveling through the world of immortality, Shen Tian found that he could see the luck and fortune of others around him. With the idea of ​​rubbing the aura of the protagonist of the boss, Shen Tian began to take the initiative to make friends with the children of luck. Later, everyone gradually discovered that no matter who they are, as long as they practice with Shen Tian, ​​they will inevitably encounter great opportunities, and there will be no exceptions! From that day on, Shen Tian became the most popular mascot in the world of immortality.\nGenres:\nAction, Fantasy, Harem, Romance, Adventure, Isekai"]},{"title":"You’re Perfect for Me","tags":["Comedy","Josei","Manhwa","Romance"],"disc":["Read manhwa 내게 딱인 너 / 내딱너 / You’re Just Right for Me\nBaek Mir: an aspiring webtoon author who’s never dated before. Kang Hyeok: the handsome and wealthy CEO of Sophist Hotel. To avoid his mother’s pressure to get married, Hyeok suggests a contractual relationship with mismatched Mir. …But why does it feel so real?"]},{"title":"I picked up my daughter whose engagement was abandoned and taught me that I’m good ~ Eat delicious food and make it fashionable, and produce it as the happiest girl in the world!","tags":["Comedy","Fantasy","Romance","Slice of Life"],"disc":["Konyakuhaki Sareta Reijou wo Hirotta Ore ga, Ikenai Koto wo Oshiekomu , I picked up my daughter whose engagement was abandoned and taught me that I’m good ~ Eat delicious food and make it fashionable, and produce it as the happiest girl in the world!, 婚約破棄された令嬢を拾った俺が、イケナイことを教え込む～美味しいものを食べさせておしゃれをさせて、世界一幸せな少女にプロデュース！～\nIn the back of the forest lives Allen, the people-hating wizard. He is feared by the people around him and called the “Demon Lord”. One day, while living out his life as a hermit, he finds a young girl named Charlotte who collapsed. Although innocent, she was accused of evil wrongdoings, had her engagement broken and was forced to flee her country. Upon hearing that, Alan recalled the bitter experience of being betrayed by a party he once believed to be his companions. Hearing the story of the 17 year old’s exploitation, Alan decides, “I’ll let her live in my mansion, and I’ll teach her all sorts of bad things…”"]},{"title":"Aishiteru Game wo Owarasetai","tags":["Comedy","Manga","Romance","School Life"],"disc":["Aishiteru Game wo Owarasetai , I want to end the game that I love, 愛してるゲームを終わらせたい\nChildhood friends who have been together since they were little. They both realize their feelings for each other, but are too close to be honest. What connects them is the “I love you game” that they have been playing since they were little. The end of their love is decided in this simple game where the winner is the one who makes the other embarrassed!"]},{"title":"Return of the 8th class Magician","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Return of the 8th class Magician / 8 클래스 마법사 의 회귀 / 8th Class Magician Returned,\nIt’s been many years since I’ve bloodied my hands for the United Empire and it’s emperor, Ragnar. I wanted to return to my home town and live a quiet life as if to repent for my sins.\nHowever,\n“You are a great 8th class magician who is able to overthrow me and the empire at any time”\n“How could I let a monster like you stay alive?”\nAfter being betrayed on the verge of death by Ragnar, who was my friend as well as my Emperor, He stabbed my heart with a dagger that had time magic applied to it.\n“The redemption I want, is to put everything back to its place.”"]},{"title":"My Goodness, Your Majesty","tags":["Adaptation","Adventure","Comedy","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Goodness, Your Majesty / Dear God, Your Majesty / 아이고, 폐하!\nSistina, who spent her days in peace while running the Grand Grand Bakery. Suddenly receiving favor to become emperor.\nWhen she was tormented by the piles of work after becoming an emperor overnight, she wisely tackled each job thanks to her know-how in running a bakery…\nOn the other hand, because she has the life of a witch, she feels anxious that her most important ‘search for fate’ has been delayed. And since she was aware of who her knight was, it was Sir Raiden.\nFinally, she sent a letter.\nCan this lovely witch find her ‘destiny’?"]},{"title":"The Small Village of the Young Lady Without Blessing","tags":["Fantasy","Isekai","Reincarnation","Romance","Slice of Life"],"disc":["The Small Village of the Young Lady Without Blessing manga, A Young Girl in a Village Without Protection, Kago nashi Reijou no Chiisa na Mura,\nI reincarnated as the villainess in a game world— I’m not afraid of banishment, I’ll manage my territory and live as I like! I reincarnated as Celistina, the villainess of an otome game. As the fiancée of the crown prince, in this world where everyone is gifted with blessings by the gods and spirits, I’m the “young lady without a blessing”. As a result of being a fan of the game, I know that the crown prince will be with the heroine sooner or later, and he will break our engagement. Alternatively, if they don’t end up together, I will be executed…\nThe Small Village of the Noble Lady Without Divine Protection ~Now, Let’s Begin Managing the Territory!加護なし令嬢の小さな村 ~さあ、領地運営を始めましょう!~"]},{"title":"Because It’s Love","tags":["Adaptation","Comedy","Drama","Manhwa"],"disc":["Ki Seung-joo is a young, multi-talented top star who has it all. Yoo Lee-hyun is a newcomer to the celebrity scene, but quickly making an impact. While they navigate the twists and turns of celebrity life, Lee-hyun is also intent on resolving something from her past. Both are hyper-focused on their careers. But their chance meeting on the set of a variety show sparks something in them that neither have felt before…\nBecause It’s Love / 사랑이라서"]}]