[{"title":"The Cold Beauty At School Became My Pet Cat","tags":["Animal","Drama","Romance"],"disc":["The Cold Beauty At School Became My Pet Cat manga, 知的でクールな後輩美女、俺の飼い猫になる\nThe real identity of my beautiful kouhai who acts cold most of the time but gets shy when she wears a pair of cat ears is..?"]},{"title":"Fiancee be Chosen by the Ring","tags":["Fantasy","Romance","Shoujo"],"disc":["Fiancee be Chosen by the Ring manga, 指輪の選んだ婚約者 Yubiwa no Eranda Konyakusha\nAn Engagement ‘Love Fantasy’ that all started with a ring!\nDaughter of the Countess, Aurora, attended an evening party. Despite attending, she wouldn’t talk to anyone and only stared at the embroidery on the various dresses.\nThen she was suddenly hit with a single ring!? What in the world could this mean…?"]},{"title":"Queen of Avalon","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Queen of Avalon / 아발론의 여왕","“Queen Arthur. That is your name from today.”\nI was summoned to save the kingdom that King Arthur had rolled over.\nAs the Archmage Merlin said, I am the possessor of the same soul as King Arthur.\nIf I find the Holy Grail and complete my mission, will am I be able to live with love?\nBut why are knights so rude?\nXian, who has been living a life of bliss for 20 years.\nWhen I woke up one day, I became a character in a legend!\nThe magical story of her becoming"]},{"title":"HIS MAJESTY HIGH PRICE BABAY ( The Treasure Fell Off The Emperor’s Sky )","tags":["Adventure","Fantasy","Webtoons"],"disc":["Read HIS MAJESTY HIGH PRICE BABAY ( The Treasure Fell Off The Emperor’s Sky ) / 皇帝陛下的天价宝贝","Little Princess who has become a king? Is the world patriarchal? The minister can execute the grand princess of a country at will? So, in order to survive, she can only please the king and the naughty brother? No, Gu Coo is not willing! Not only does she not want to please these men, she also wants to compete for the throne as a queen! And in the presence of thousands of ministers scolded her king father as shit! Strangely, after the scolding"]},{"title":"My Son, Quickly Rely On Your Father’s Prestige","tags":["Action","Adventure","Fantasy"],"disc":["Read My Son, Quickly Rely On Your Father’s Prestige / Wǒ Er Kuài Pīn Diē / 我儿快拼爹","Qin Chuan travels to a fantasy world, and not only gets Qin Zi’s naughty son, but also gets a cheat that can make him stronger as long as his son causes trouble. After learning that Qin Zi was the son of the Feichailiu, Qin Chuan disappeared forever on the way to deceive his son."," "]},{"title":"Journey to Another World Filled with Alcohol and Fruit","tags":["Fantasy","Isekai","Josei","Shoujo"],"disc":["Journey to Another World Filled with Alcohol and Fruit, Trip Saki ni Osake to Kajitsu ga Ippai Atta Monde, トリップ先にお酒と果実がいっぱいあったもんで\nPlain-Jane Sanae ends up in the land of fluffy-eared people…!?\nDuring the summer of the year she turns twenty, Sanae Iijima was enjoying her vacation at her grandparents’ house with her twin brother… She suddenly falls into another world that looks like something out of a historical drama.\nAn unexpected turn of events put her in the care of the gorgeous tiger-man, Towa, and pretty rabbit-boy, Inaba…\nWhat? She needs to revitalize the village and think up a plan to encourage girls to visit?\nUsing the information saved on her phone, she is determined to help. With abundant alcohol and fruit from the mountain on hand, she gets to work …!"]},{"title":"June and Alice","tags":["Comedy","Fantasy","Historical","Manhua","Romance","Royal family","Shoujo Ai"],"disc":["Read manhua June and Alice (Official) / Chun and Alice / Chun Et Alice / Chún Yǔ Àilìsī / 淳与爱丽丝","June, an oriental girl in a foreign country, becomes the queen’s dress-up doll to make a living! June wants to escape once she earns enough money, but she gets caught up in a bigger conspiracy struggle for power.","“Warning: Yuri content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”"]},{"title":"Defend the Rose","tags":["Fantasy","Historical","Magic","Manhua","Romance"],"disc":["保卫玫瑰\nBorn into poverty, Boole fights to rise through the ranks of the personal guards for one sole purpose, and that is to be closer to the Saintess. However, in a series of events, he winds up being the royal family’s pawn to to defeat the church. On one hand is the girl he has longed for since ages ago, but on the other is the omnipotent crown prince. Which will the young knight choose?"]},{"title":"The evil witch’s survival plan","tags":["Fantasy","Isekai","Romance","Shoujo"],"disc":["Read manhua The evil witch’s survival plan / Evil Sorceress’ Survival Strategy / The Villainess’s Survival Plan / 反派魔女自救计划\nHi! This is the remake for The Evil Sorceress Plans to Survive!\nXiao Yao is the daughter of a famous family. She died of a terminal illness, but when she awoke she discovered that she had become Abella, the evil sister of the heroine “The Imperial Knight fell in love with me.”\nAs a princess, she has no magic, and under her father’s indulgence, her personality turns arrogant and stubborn.\nShe caused quite a bit of trouble, in the end, for the throne, she killed her father and sister, spoiling all good things.\nThen Xiao Yao decides to go save everyone, but finds that the development of the story seems to have some slight changes…"]},{"title":"Classmate Gui, Please Be A Little Bit More Patient!","tags":["Manhua","Romance"],"disc":["Read Classmate Gui, Please Be A Little Bit More Patient! / Classmate Gui, Please Be Patient a Bit! / Gui Tongxue, Qing Naixin Yidian! / Guì Tóngxué, Qǐng Nàixīn Yīdiǎn! / 桂同学，请耐心一点！","After failing to reincarnate countless times, Tao Zhi, a young girl, finally found a way she might enter reincarnation: to help a human teenager, Gui Zizhuo, who collaborates with the Ghost Realm, to raise the ratings of his ghost exorcisms. That being said, could Gui Zizhuo, whose exorcism methods were oversimplified and crude, get any good reviews?! Tao Zhi was once again deeply concerned about her chances at reincarnation…"]},{"title":"Hidden Marriage Love – You Are My Best Love","tags":["Romance"],"disc":["Read manhwa Hidden Marriage Love – You Are My Best Love / A Hidden Love Marriage / Cinta Tersembunyi / Hidden Best Love / Our Bittersweet Marriage / 隱婚摯愛","They are the three best friends growing up together, but have three different lives perspectively. It’s a tangled and cheesy love triangle. Three years ago, someone framed her and made her vanish from sight. Three years later, when they met again, he still hated her. It took her three full years to forget him, but she still couldn’t give up her desire to see him. She planned to see him for one last time, but an unexpected conspiracy was lurking around…"]},{"title":"Safe Forever","tags":["Romance"],"disc":["Read manhwa Safe Forever / An Encounter With Beichen for a Life of Safety / 一世安然 / 一遇北辰一世安然 / 一遇北辰，一世安然","The first time I met Gu Beichen, the coldness of his tears and the warmth of his body made it impossible for me to forget him. The second time I met Gu Beichen, he smiled gently at me as his tremendous achievements left me in awe. The third time I met Gu Beichen, he stood quietly like a ray of sunlight outside the morgue, dispelling all the terrors in my heart…"," "]},{"title":"There’s A Teleportation Circle In My Basement!","tags":["Comedy","Fantasy"],"disc":["Read There’s A Teleportation Circle In My Basement! / 我家有个传送阵 ; My Home Has a Teleportation Array","Qi Xiaotian, a youngster staying by himself, accidentally discovered a mysterious magic circle in the basement while he was trying to expand his villa. Curiosity led him to place his hand on the seal and with a flash of light, a majestic blonde haired girl walked out from the circle! “Are you my…wait a minute! Why are you pulling out your sword?! Let’s talk this over!!”"," "]},{"title":"You’re Dazzling","tags":["Manhua","Romance","Shoujo"],"disc":["Sparkling Shine of You ; Your Glitteringly Shining ; Shanshan Faguang De Ni ; 闪闪发光的你 ; 閃閃發光的你 ; Shining You","Lin Xiaomu, whose life deeply revolved around playing the “supporting role,” had finally made contact with the school hunk, Huo Dongze, after an incident. In her eyes, he was “dazzling.” Who would’ve thought that he, too, cared a lot about her as well?! Maybe it was the day that I met you that my life had become dazzling and radiating…"]},{"title":"Emperor-in-law","tags":["Comedy","Fantasy","Medical","Romance"],"disc":["Read manga Emperor-in-law","A normal University student who works part-time suddenly finds as his wife the rich Sister Yu and also turns on the “life system”, as long as he follows the system’s choices, his dreams will become true? Children make choices, but I want everything for adults! Let’s look at how Li Fan, the son in law of a wealthy family, who holds the system in his hand, can counter attack and become the new Emperor-in-law"]},{"title":"The Law of Love in the Last of our Days","tags":["Action","Adventure","Drama","Josei","Manhua","Martial Arts","Military","Monsters"],"disc":["Read Last Love Once More / Last Phase Love Law / Mo Shi Lian Ai Fa Ze / 末世恋爱法则\nMu Yiran, an orphan girl, died with hatred in the post-Apocalyptic era. After getting a rebirth by chance, she goes back to three days before Doomsday and changed her destiny. She has managed to deal with the mistress and the guy who two-timed her in this life. She has obtained a unique space used for cultivators/immortals and uses it to stock as many supplies as possible within a relic of a pendant. Still, accidentally, things never go as planned, she suddenly gained a stepdad, obtained a massive inheritance, and she offends the strongest Marshal of the post-Apocalyptic era known in China, Ling Changqing with his protagonist Aura as he starts to take an interest in her daily menacing events. “Girl, you have no way to run!” “Ah!! this pervert! why does he keep chasing me!!” The romantic story between the stone-faced icy Marshal and the girl who is an Immortal cultivator therefore now begins."]},{"title":"Daytime Star","tags":["Drama","Manhwa","Romance","Shoujo"],"disc":["Read manga Daytime Star / Star in the daytime / 낮에 뜨는 별 / Star in daytime\nYura Hwang is an actress who has only played supporting roles for seven years, since she started her career.\nShe was betrayed by her boyfriend and married someone else.\nBut in that mess, she met the famous actor again, in her latest movie!\nWill her path to stardom come to fruition?"]},{"title":"King of the Mound","tags":["Action"],"disc":["Read manhwa King of the Mound","Through a combination of numerous injuries, a weak frame, and financial difficulties, the protagonist Lee Jinyong gave up on his path to being a baseball athlete and lived as a factory employee instead. One day, the spirit of Kim Jinho, the baseball hero who was hailed as a legend in Korea, as well as Lee Jinyong’s idol who passed away 10 years ago, appeared before him. At the same time, an unknown notice appeared, stating that the ‘Baseball Manager’ would start, and Lee Jinyong gained an ability that gave him the constitution of a pitcher, similar to a game avatar. He returns to the field to become <King of the Mound>."," "]},{"title":"My Majesty Wants to Ruin The Country","tags":["Adventure","Comedy","Fantasy","Manhua","Romance"],"disc":["Read manhua My Majesty Wants to Ruin The Country / Her Majesty Wants to Overthrow Herself / Her Majesty Wants to Watch the World Burn! / My Majesty Wants to Ruin the Country / 황제가 되었으니 나라를 망쳐보겠습 니다 / 我家陛下总想祸国 / 女帝の選ぶ未来","She always though she was just a parentless ophan, yet the mentor who took in her made her swear right in front of her that she would ruin a country to its demise? All of sudden now this girl is the emperor of the country and there is 6 male plaything for her to choose?"," "]},{"title":"The Mysterious Bodyguard","tags":["Adaptation","Fantasy","Historical","Romance","Shoujo"],"disc":["Yu Jun Xing/ Yujun’s Journey/ Yǔ Jūn Xíng/ 与君行/ 見知らぬ運命に導かれて","Gu Ai was living a happy life as the daughter of the prime minister until a scheming bureaucrat plotted for her family’s demise. Her family is devastated and separated from each other. Gu Ai goes into a life disguised as a man in order to save her father, who is accused of consorting with a rival state and treason. Then one day, she happens upon the second imperial prince and becomes one of his personal security guards…"," "]}]