[{"title":"When I Quit Being A Wicked Mother-in-law, Everyone Became Obsessed With Me","tags":["Drama","Fantasy","Isekai","Josei","Manhwa","Psychological","Romance","Tragedy"],"disc":["Read manhwa When I Quit Being A Wicked Mother-in-law, Everyone Became Obsessed With Me / Wicked No More / 不当恶婆婆之后我成了万人迷 / 意地悪な姑をやめたら、みんな私に執着します / 辞掉了我的坏婆婆，所有人都为我着迷 /악녀 시어머니를 그만 뒀 더니, 다들 내게 집착한다"]},{"title":"A Secret Contract and the Stallion Sage","tags":["Fantasy","MANGA","Manga","Romance","Webtoons"],"disc":["Read manga A Secret Contract and the Stallion Sage / Zetsurin Kenja to Himitsu no Keiyaku / 絶倫賢者とヒミツの契約"]},{"title":"My Favorite Manager","tags":["Drama","Fantasy","Manhwa","Mystery","Romance","Thriller"],"disc":["Read manhwa My Favorite Manager / 최애의 매니저","Lee YooonSU, a 29-year-old man whose mental state has collapsed due to continuous interview failures, falls in love with Yuria, a female streamer he happens to come across. He ends up joining Yuria’s affiliated management company, Blue Cloud, and becomes Yuria’s dedicated manager through his senior’s referral. He finds happiness in witnessing Yuria’s everyday life, but the moment he sees her true self, he is in for a big shock."]},{"title":"I Don’t Want the Male Lead’s Child","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I Don’t Want the Male Lead’s Child / 남주의 아이는 싫습니다"]},{"title":"Couple, How Far You Can Go?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Couple, How Far You Can Go? / 부부, 어디까지 가능해?","The real daughter appeared, and ‘Juha’ became the fake one.","In an attempt to escape her prison-like home, she goes on a blind date, and that man appears.","“When would you like to set the wedding date?”","Juha’s heart wavers at Sahyun’s bold advances, but…","“Sis, I want that marriage.”","Her younger sister, who took everything from Juha, now says she wants to marry Sahyun."]},{"title":"From Misery to Majesty","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa From Misery to Majesty / 異能持ちの孤児ですが、皇太子が優しすぎます！ / 황자님, 왜 잘해 주세요?","",""]},{"title":"Transmigrating as the Younger Sister of a Bigshot with Multiple Identities","tags":["Comedy","Drama","Romance","Shoujo"],"disc":["Read Transmigrating as the Younger Sister of a Bigshot with Multiple Identities / 穿成马甲大佬的妹妹","Dear Villainesses, you lost your fiancé and I lost my one billion! Just when I had received news that I inherited my family’s assets, I immediately transmigrated into a cookie cutter villainess story, as the hated villainess right after “I” made enemies of everyone in the story! Now witness me slither my way into everyone’s heart and reach the ending of the story in one piece!"]},{"title":"When the Witch’s Daughter Lifts the Male Lead’s Curse","tags":["Adaptation","Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa When the Witch’s Daughter Lifts the Male Lead’s Curse / 마녀의 딸이 남주의 저주를 풀면"," "," "]},{"title":"Dodolipyo","tags":["Drama","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Dodolipyo"]},{"title":"The Villainous Moriarty in Me","tags":["Comedy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainous Moriarty in Me / 악역 영애 내 안의 모리아티 / Moriarty’s Perfect Crime / 未来の黒幕系悪役令嬢モリアーティーの異世界完全犯罪白書","James Moriarty, the most fearsome criminal, met his demise after a confrontation with a famous detective at a certain waterfall.\nHe found himself possessed by a beautiful young lady from another world, and what he saw there was the insidious abuse by other noble daughters.\nHe has no memory, but his brain is still the same.\nHe wields the power of his lucid mind and the perfect crime equation to the fullest for the sake of only one girl in a world without a great detective.\nThe bullied young lady dies and is reborn as Moriarty, a villainess without blood or tears.\nThis is the official comic adaptation of the novel published by EVERYSTAR!"]},{"title":"I’ll Be The Matriarch In This Life","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance","Shoujo","Time travel","Webtoons"],"disc":["Read manhwa I’ll Be the Matriarch in This Life / I Shall Master This Family / I Will Become the Mistress of This Life / Ibeon Saengeun Gajuga Doegetseumnida / In This Life, I Will Be Lord / In This Life, I Will Be the Lord / In This Life, I’ll Become the Head of the Family / В этой жизни я – глава семьи / На сей раз я – хозяйка этой жизни / Я стану хозяйкой этой жизни / 今生我会成为家主 / 이번 생은 가주가 되겠습니다","Florentia was reincarnated as the illegitimate child of the richest family in the empire.\nShe had thought that everything would go well in the future.\nBut her father had passed away, her relatives left her at the doorsteps, and the honourable family she was so proud of was completely ruined….\nBut is this real?\nShe drank a little (a lot) and was hit by a carriage,\nWhen she opened her eyes again, she was seven years old?\nMoreover, the Second Prince, who was the enemy of her family in her previous life is following her around like a dog!\n“Tia, you’re prettier than me.”\n“….Are you kidding me right now?”\n“No. I mean it.”\nAlright, both the Second Prince and the family are mine!\nIn this life, I’ll have to become the Overlord."]},{"title":"Teachers Who Always Call Parents","tags":["Drama","Manhua","Romance","Yuri"],"disc":["Read manhua Teachers Who Always Call Parents / Zǒng Yǒu Lǎoshī Yào Qǐng Jiāzhǎng / 总有老师要请家长"]},{"title":"Your Majesty, I will raise you well in this life","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Your Majesty, I will raise you well in this life/ In This Life, I Will Raise You Well, Your Majesty! / I’ll Raise You Well in This Life, Your Majesty! / I’ll Atone by Raising You Properly in This Life, Your Majesty!  /이번 생은 제대로 키워 드리겠습니다, 폐하!","She gave her all to make her son, 3rd Prince Leon, emperor. On the day this dream was fulfilled, she went to the place where the emperor’s coffin rested, where she found her son dying from the poison he had drunk himself.","“I… have never been happy in my life.”","Only despair was left for Elisha, who was holding onto her son’s cold corpse. “Leon…”","However, after losing consciousness, she woke up to find that her young son was looking at her with his lovely face!","“If this isn’t a dream, if it’s a new opportunity… I stole a lot of things in the name of doing it for you, so if you ask me, I will do whatever you want.”","Elisha, who vowed to become a good mother in this life, instead of piling up dead bodies and squeezing blood in a war to claim the emperor’s throne, makes a different choice from the past by weaving ties with her stepson, the crown prince."]},{"title":"The Savior’s Bucket List","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Savior’s Bucket List / 구원자의 버킷리스트","Despite the repeated regressions, Yonghak, who couldn’t ultimately save the world, decides to give up on being a savior in the next regression. However, as disciples start to appear one by one… the world begins to be saved over and over again?! Can the Savior truly fulfill their own bucket list, as they long for some rest?"]},{"title":"Exciting Male idol Survival","tags":["Comedy","Drama","Fantasy","Manhwa","Music"],"disc":["Read manhwa Exciting Male idol Survival / Men’s Version Audition / 남장판 오디션"," "]},{"title":"I’m a Fake Saintess but the Gods are Obsessed","tags":["Drama","Fantasy","Historical","Reverse harem","Romance"],"disc":["Read manhwa I’m a Fake Saintess but the Gods are Obsessed / 가짜 성녀인데 신들이 집착한다","I reincarnated into the body of a fake saintess who will die when the real saintess appears five years later. If I were to gather the monthly allowance given to the saintess I can at the very least buy a building! But while I was carefully setting up a plan to run away after playing the role of the saintess… “Choose me, or else…” “I prepared a prison just for you. My goddess—” “…” The male leads reacted differently than I expected. [The bored divine beings have started to gain interest after watching you.] And Ariel who unexpectedly gained the interest of the gods. On top of that, the final boss who is going to put the world into despair On top of that, the final boss who is planning on destroying the world isn’t killing me, but helping me…? I have no interest in gaining the interest of the gods or destroying the world! So please just let me become a landlord like I wanted—!"," "]},{"title":"The First Sword Of Earth","tags":["Action","Adventure","Manhua","Martial Arts"],"disc":["Read manhua The First Sword Of Earth / Dì Qiú Dì Yī Jiàn / 地球第一剑\nWang Sheng was unexpectedly reborn to the night before the sudden increase in spiritual energy on earth.\n“I am not going to be mediocre and looked down on by others like in my previous life.” And so, he decided to go to Wudang to pay homage to his master from his previous life. And thus the daily life of the path to immortality begins…"]},{"title":"The Twin Swords Of The Sima","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa The Twin Swords Of The Sima / 사마쌍협 / The Demonic Righteous Duo"]},{"title":"Starting from Today, I’m a Princess?","tags":["Fantasy","Romance","Shoujo"],"disc":[" Read manhwa How Did I Become the Princess / Starting from Today, I’m a Princess? / 오늘부터 황녀?!","A warrior with the mission of defeating the Demon King even if it meant sacrificing her own life. Although it seemed like the rest of her life would be full of a glittering bright path… In reality, it’s the gutter! In order to re-find an ordinary life, after having been thoroughly exhausted, she makes a wish. “Please turn back time.” But where’s the ordinary life…? “I’m definite that this child is the Princess that was lost 12 years ago.” From a penniless warrior who didn’t even have a name she became Nanael, a princess who has it all!"]},{"title":"I Tamed the Male Lead’s Father","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I Tamed the Male Lead’s Father / 남주의 아빠를 길들여 버렸다","I, the sole daughter of a villain, was pitifully abandoned in the snow by my father due to my lack of ability. The male lead’s father saved me, bringing me back with him.","If they discovered I was the daughter of a villain, I would definitely be killed. I’d run away, but because I am only a newborn baby, I need someone to take care of me before I can step out into the world.","Well, I suppose there’s no choice but to flirt with the male lead’s father!","“Papa!”","Come here~ Come take care of me~\nAm I not cute? You can’t leave me alone when I’m so lovely, right?","He stared at me, unable to stop himself from falling to my charm.","“C-cute.”","Hmm? Papa, weren’t you acting so cold before?"]}]