[{"title":"Vampire Sphere","tags":["Action","Fantasy","Manhua","Mystery","Romance","School Life","Sci-fi","Shoujo","Supernatural"],"disc":["Read Vampire Sphere","Nine years ago, three seeds were planted, and now they turn into three roses. Behind the girls have been chosen, their wings of destiny open. Bloodlines and hunters, roses and demons, love is like a symphony playing a melancholy tune."]},{"title":"The King’s Forbidden Flower","tags":["Drama","Fantasy","Magic","Romance","Shoujo"],"disc":["Read manga Itsuwari no Ou no Omoi Hana / 偽りの王の想い花\nLosing her parents at a young age and forsaken by her uncle, Peony’s life is shrouded in loneliness. One day, she meets a mysterious boy named Zach in a forest. The two fall in love, but are quickly torn apart. Ten years have passed since then. Peony has given up all hope of reuniting with her lost love, devoting herself to becoming a bride of the lord. However, one fateful day the King himself comes to visit her academy, and is the spitting image of the Zach from her memories…"]},{"title":"I Saved The Cursed Duke","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read manhwa I Saved The Cursed Duke / Guardian Angel for Cursed Duke / Jeojubadeun Gongjangnimeul Guhaetseumnida / Я спасла проклятого герцога / 저주받은 공작님을 구했습니다 / Guardian Angel for the Cursed Duke","Asteria who lives protecting the grave of the gods. One day, a man who is on the verge of dying suddenly appears in front of her, disturbing her peaceful life. This man is none other than Duke Erhardt, the most handsome and youngest governor of the empire. Asteria saves the dying duke using her magical powers, but her magical powers can only be maintained if they are together. At Erhardt’s request, she came to the outside world and became the fake duchess. Will Asteria, who is slowly adjusting to her new life, be able to achieve love and solve the curse?!"," "]},{"title":"Otome Game no Mobu desura naindaga","tags":["Comedy","Fantasy","Isekai","Romance","Shoujo","Slice of Life"],"disc":["Otome Game no Mobu desura naindaga manga, I’m Not Even an Otome Game Mob Character Otomege no mobudesura naindaga 乙女ゲーのモブですらないんだが I’m Not Even an NPC In This Otome Game!\nGuy reincarnates into the gardening apprentice who works for the rival character of the heroine of an otome game. He doesn’t care and just wants to be a gardener."]},{"title":"I’m Thinking of Quitting the Villainess’ Entourage","tags":["Comedy","Isekai","Reincarnation","Shoujo"],"disc":["I’m Thinking of Quitting the Villainess’ Entourage, Beating the Heroine at Her Own Game, Akuyaku Reijo No Torimaki Yameyo to Omoimasu , Akuyaku Reijou no Torimaki wo Yameyou to Omoimasu , Akuyaku Reijō no Torimaki Yameyou to Omoimasu , Beating the Heroine at Her Own Gam\nDiet… to avoid the Bad End!\nIn a former life, Cosette was just a normal housewife. Now she’s been reborn into the world of an otome game, not as the heroine, or even the villainess, but as a chubby unnamed NPC?! Is she destined to be pushed aside as the heroine follows her route, or can Cosette avoid the dark future that awaits her?\nWith six years left before the game’s story begins, her first step is to improve her image. She’ll use all the high heels, training equipment, and knowledge from her former life that she can to get herself into shape!\nAs she works to carve her own path, she gets wrapped up in royal intrigue, and winds up getting to know the prince?!\nHow will things turn out in this unconventional love comedy?!"]},{"title":"The Strongest Deserter","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["The strongest genius died unexpectedly and was reborn on the weakest waste wood.","Relying on past life memories and exercises, he washed the marrow veins of the strongest waste wood, reshaped his body, and transformed from waste wood into a cultivation genius.","Even if you get divorced at the beginning, so what?","Watch how a genius cultivates immortals, climbs to the top, tramples those who looked down on him in the past, saves beauties, collects money, and reaches the peak of life.","The Strongest Deserter\nThe Strongest Abandoned Husband\nZuì Qiáng Qì Fū\n最强弃夫"]},{"title":"Prince Bastard’s Parenting Book","tags":["Fantasy","Historical","Psychological","Romance","Slice of Life","Webtoons"],"disc":["Read Prince Bastard’s Parenting Book / I Won’t Marry the Enemy Prince","Yan Xi, the invincible 7th prince, brought back a little princess after defeating the enemy state, State of Qi. Tao Xiaowei, the five-year-old princess, rumbled up the whole prince’s palace. This was Yan Xi’s first parenting experience. After years of fighting in battlefields, Yan Xi came back and found that the little princess has grown up into a peerless beauty. Since then, Yan Xi has destroyed all the enemy states and killed all the rivals in love. She is the only thing in his eyes."," "]},{"title":"Survival Marriage","tags":["Comedy","Fantasy","Romance","Slice of Life"],"disc":["Read manhwa Survival Marriage, 생존결혼\nNext to impossible coincidences seem to be connected to a shared dream… Is this destiny? Chayee springs out of bed after one of the most realistic and steamy dreams she’s ever had. After bringing herself back to reality, she goes to work as a T.A. at her former university. But, while on an errand for her professor, she meets Dohun and gets the shock of her life. He… seriously resembles the man she spent a hot night with in the dream. She finds herself unable to face him since every glance brings back the very realistic feelings of the night before! “By any chance, have we… met before?” Dohun also has unexplainable feelings of discomfort towards Chayee and puts as much space between them as he can. But, no matter how hard they try, fate keeps dragging them back towards each other. What’s going on?! When dreams and reality intertwine, anything can happen!"]},{"title":"Falling in Love Is Not as Good as the Boy Band, Crown","tags":["Comedy","Crime","Drama","Gyaru","Harem","Manhua","Reverse harem","Shoujo"],"disc":["Read Falling in Love Is Not as Good as the Boy Band Crown manhua / Tan Lian’ai Buru Gou Nan Tuan / Falling in Love Is Not as Good as Doggy Boys Group / Falling in Love Is Not as Good as the Boy Band, Crown / Tán Liàn’ài Bùrú Gǒu Nán Tuán / 談戀愛不如苟男團 谈恋爱不如苟男团","Yun Shang was reborn— before her debut with the little brothers, who are idols part of the popular band Crown, she found out she was reborn in the body of the “Vicious Female supporting actress” all the guys in Crown hated; Lu YoYo. The little cuties who believed they were helpless, pitiful, and weak, were big bosses who stabbed people’s hearts. To change this tragic fate of herself and the idols, Lu YoYo, clutching into her deteriorating heart, raised her flag and decided to change the fate of these idols."]},{"title":"Parasitic Lies","tags":["Romance"],"disc":["Read manga Parasitic Lies","Gu Yao is a winner in life in the eyes of others. She has a wealthy family, fair complexion, loving parents, and an outstanding boyfriend. Everything seems to be beautiful. Until one day, a man named Xu Shuo told her another version of the story"]},{"title":"The Fatal Kiss","tags":["Adventure","Fantasy","Manhua","Vampire"],"disc":["The protagonist of the manhua of “The Fatal Kiss” is Zheng Xuan Er and Jiang Yun. A brief description of The Fatal Kiss’; In the manhua, Zheng Xuan Er, who lives with a pair of vampire twins, has a headache now. The two little twins she wanted to protect, took the initiative to bring a vampire hunter to their house! And because Jiang Yun was also suspicious of these two children, he stayed at her house. When he knows the truth, what will be his choice?Notes from mangabuddyAll our manhua content is protected under copyrighted law.manhwaclan never gives anyone authorized or permission to publish our content on another website/app.If you’re publishing our contents on your website/app, it’s mean that you’re infringement our copyrighted of our works. Therefore stop stolen our works or else we will take legal action against you."]},{"title":"Different Every Day","tags":["Manhua","Romance"],"disc":["Read manhua Different Every Day","Li Wei Yin, who was originally a daughter of a wealthy family, became a bargaining chip for the marriage of two families. Wait a minute, the young master of the Xu family actually has an IQ of only eight years old! Oh my God, is she going to make herself married to a young boy? Although he smiled innocently and cutely, holding her hand and calling her elder sister, but she can’t spend her whole life with a young boy Huh? Not quite right, why did he become cold and domineering on the second day of the wedding? On the third day of the wedding became evil and seductive again? What should I do? My husband changes every day when I wake up? I’m afraid, I might go crazy!Please read at www.manhuasy.com. Thank you.Notes from mangabuddyAll our manhua content is protected under copyrighted law.mangabuddy never gives anyone authorization or permission to publish our content on another website/app. If you’re publishing our content on your website/app, it’s mean that you’re infringing the copyright of our works. Therefore stop stolen our works or else we will take legal action against you."]},{"title":"The Princess After The Revolution","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read The Princess After The Revolution","“Now, in this place, I punish the last royal daughter of the dynasty and declare a revolution.”\nPrincess Lumina died for the revolution. She is reincarnated in Korea with memories of her past life and becomes an ordinary office worker. A past life appears and interferes with her corporate life!"]},{"title":"How the Masked Earl Fell in Love","tags":["Fantasy","Historical","Romance"],"disc":["Read How the Masked Earl Fell in Love / Kamen Hakushaku Ha Kurosu Isho No Hanayome Ni Koi wo Suru","Tricked by her stepmother, Crysta’s freedom has been sold off in the name of marriage. Her soon-to-be husband is the always masked Lord Gerald who is notoriously cold and antisocial. He doesn’t seem to prove the rumors wrong, but little does Crysta know that he has a secret he has to keep from the whole world… An enchanting love story about an unfortunate bride and an awkward masked earl who misunderstand each other."]},{"title":"Cancel This Wish","tags":["Fantasy","Historical","Romance"],"disc":["Read 이 소원을 취소 ; This Wish Is Cancelled / Revoke this Wish!","“A growing romance fantasy in which I find my true self!” After graduating from the academy, Remiel, who is living a solitary life as an outcast (?), is unable to overcome her mother’s persuation and attends the party of the Marquis of Atrahasis. And there, Tyriel, whom she has had a crush on for a long time, and her roommate, Beryl, announce their marriage… . In shock, Remiel said, ‘I wish I was Beryl.’ The moment she thinks to herself, her necklace suddenly shone and she disappeared on the spot! And when he wakes up again, one day, Remiel has become Beryl from the Academy days… !?"," "]},{"title":"Would you like a cup of tea?","tags":["Action","Drama","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Would You Like A Cup of Tea? / The Extra’s Touch / 차 한잔 하실래요?","Not only was our MC reincarnated as the youngest daughter of an unweighted count in a novel, but she also realized that she’ll soon die as a result of the war that the protagonist will start—but thanks to her ability to see the past, she’s determined to avoid death this time."]},{"title":"After World’s Flower Viewing","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":[" "," "]},{"title":"Sweet Allegiance to the Lorenz Family Tonight","tags":["Action","Drama","Fantasy","Romance","Shoujo"],"disc":["Sweet Allegiance to the Lorenz Family Tonight, Koyoi, Lorenzi-ke de Kanbi naru Chuusei wo , 今宵、ロレンツィ家で甘美なる忠誠を\nRita, a young girl with the legendary “golden eyes”, is caught by traffickers and auctioned off on the black market. Rita, who has lost her voice due to past trauma and is in despair, is outbid by Albert, a mob boss. Rita obeys his sweet whisper, “You will be my bride,” but then she discovers that he has a cruel side that turns a gun on people with a smile! What will be Rita’s fate when she is welcomed by the dangerous mafia?"]},{"title":"Bloody Marriage","tags":["Fantasy","Romance"],"disc":["Read manga Bloody Marriage / 블러디 메리지","Scarlett was once the happiest girl alive. She was blessed with beauty, wealth, and a perfect fiance. She was supposed to be the shining star of her wedding. But early in the morning, the pure bride was brutally murdered. When she opened her eyes again, her whole world had completely changed.” “I’ve repeated this so many times already! I am Scarlett Antwerpen!” “I’m sorry ma’am, but the esteemed daughter of the count, Lady Antwerp is dead.” Waking up in a strange place, Scarlett couldn’t comprehend everything that had happened to her. Why could no one recognize her? Why was her fiance standing by another woman? Why was she “Vivian” instead of Scarlett? Why was she by the side of Alexis, the chief of police, and not by her fiance, Edward? Scarlett swore to herself that she would get her fiance back, and ruin the one who had murdered her."]},{"title":"The Runaway Flower Boy and the Young Girl","tags":["Romance","Shoujo"],"disc":["In order to find the life she wants for herself, Xia Yuan moved into a small run-down house in a little rural village. However, she didn’t expect that she would meet the Prince of the Flower Fairy Kingdom, Ellis, who was running away! From here, their story begins.","在逃的花儿与少女"]}]