[{"title":"Our Tyrant Became Young","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Our Tyrant Became Young / Our Tyrant Becomes Young / 우리 폭군이 어려졌어요 / 我的暴君变成小孩儿了 / Tiran kami jadi kecil","I had possessed a character inside of a book. Into the book where I pushed the ‘ Female Lead x Emperor’ pairing. The day I shed tears over the two characters that don’t end up together, I was sent here to experience the whole story. Of course I am!","“Stand in line to hear my prophecy!”","I began to make money from the contents of the book. Guys! You don’t have to end up together, but you have a lot of money but I don’t. So after three months, I am brought to the Imperial City by the name of the Emperor after spending money in prophecy, following the original truth, the law of Man-go, the golden almighty. Then I met the Emperor for the first time–","“You know everything.”","“Yes, I know a lot.”","“Yes, then can you tell me when I’ll come back to my original state.”","Finally, the emperor appeared beyond the white cloth was a four-year-old kid.","…why is he so young?","***","One day, in order not to be caught pretending to be a fake prophet, she struggled to find a way to solve the curse next to the baby emperor. He asked.","“Don’t you see me as a baby?”","“Yes.”","Persyllion’s eyebrows raised because of her firm answer. He didn’t like her simple reaction, so he looked at her face and raised his thumb.","“You look like a baby who is the cutest, most thrilling, and always gives us new cuteness……?”","“…….”","“Like an angel from heaven that had a task to defeat all evil with your cuteness!”","“Get out!”","Even before he finished talking, Persyllion threw a rabbit doll. Eyy, I should have bought a cat doll instead of a rabbit doll."]},{"title":"The Extra is Too Strong","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Extra is Too Strong / Extras are too strong / 엑스트라가 너무 강함","I received the same question every day, but the answer never changed. The only things I had left were sympathetic gazes and the monthly insurance payments. And the cruel reality of being half-paralyzed. They say that God only gives you trials you can endure, but I would rather have died. That was when I woke up— [This is the world of the “Magician Who Dominates the World.”] [From now on, you must live as the character “Mord Vernars.”] I became an extra in the novel I was reading overnight."]},{"title":"Cavier Falcon Princess","tags":["Comedy","Cooking","Drama","Fantasy","Romance","Sci-fi","Shoujo"],"disc":["Read manga Cavier Falcon Princess / Carrier Falcon Princess / Herald Princess / 전령새 왕녀님\nZelle, the eighth royal princess of Roymonde, who was driven to the brink of defeat in the war. She was kidnapped by the enemy, and when she woke up… She became a bird?! Fortunately or unfortunately, as the messenger bird of Commander-in-Chief, Valhayle! She struggles for her country even though she is in a bird’s body. But you can’t even do as much as treat me like a bird!! “Gweeckkk!”"]},{"title":"Broadcast Genius Youngest Writer","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Broadcast Genius Youngest Writer / Youngest Genius Broadcasting Writer / 방송천재 막내작가","After losing both her job and her work due to the schemes of the PD she worked with, Yeonwoo learns the truth and faces death from a heart attack. She thought her life was ending there, but when she opens her eyes, she finds herself back to her youngest writer days 20 years ago. Can this second chance at life turn into a successful one unlike before? The story of Yeonwoo, the youngest writer in broadcasting with a career-oriented perspective, begins anew."]},{"title":"What Can I Do Alone?","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa What Can I Do Alone?","Byeon Tae-in was an ordinary geek, completely engrossed in webtoons and internet culture—until one day, everything changed. Gates opened, monsters poured out, and humanity teetered on the edge of annihilation. But unlike everyone else, Taein didn’t feel fear; he felt a rush of excitement, as if he had been thrown straight into one of his favorite webtoons! “These monsters look like the weak ones that always show up at the start to highlight the hero’s new powers!” And then, something extraordinary appeared before him: [You have been chosen.] status window? Perfect! Taein had consumed every webtoon in existence. Now, if he becomes the strongest in this world… what kind of epic story will he write next?"]},{"title":"Prison Love","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Prison Love / 프리즌 러브","Having never done anything bad and lived a dilligent life, Shushu is suddenly framed for murder and imprisoned in a prison for women.\nIn order to survive amongst harsh and vicious criminals,\n“W-Will you be my prison wife?”\nshe becomes the wife of her very pretty but very scary roommate, who is also the prettiest(?) girl in the prison, Minicat.\nBut something is weird.\nWhy is she suddenly having the kind of feelings she would have for a man for this beautiful Minicat instead?\n“It’s a rule, cabbage. Close your eyes when we kiss and I’ll treat you nicely.”"]},{"title":"Quiet in the Office!","tags":["Adult","Comedy","Drama","Fantasy","Manhwa","Mature","Office Workers","Romance","Smut"],"disc":["Read manhwa Quiet in the Office! / Be Quiet and Don’t Ever Smile in the Office / I Say Please Be Quiet and Take Off Your “Something” / 사내에서는 정숙할 것","[Mature Audiences Only] There’s no such thing as work-life balance for poor Nayul, thanks to her evil boss, Sijin. Not only does he make her work overtime constantly, but she’s also dumped by her boyfriend because of it. Fed up with Sijin’s demonic ways, Nayul storms to his office to complain… and finds him jerking off! Though the sight is initially grotesque, Nayul finds herself oddly turned on. Somehow, she ends up banging her boss on his desk, which leads to an irritating yet steamy colleagues-with-benefits relationship. But how long can Nayul keep this shameful secret from her prying ex and gossipy coworkers?"]},{"title":"Nasty Fever","tags":["Adult","College life","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Nasty Fever / 열감기","No-eul enters college with a lofty dream of studying film. There, she meets Jooheon, who exudes an overwhelming presence. Despite everyone vying for his attention, Jooheon keeps a low profile, adopting an ambiguous attitude making it difficult for No-eul to discern whether he’s being grumpy or simply playful only towards her. No-eul falls deeply in love with him like a fever but bids him a cold farewell due to the sudden reality that confronts her. Ten years later, the two meet again…"]},{"title":"The Most Perfect Marriage","tags":["Manhwa","Romance"],"disc":["Read manhwa The Most Perfect Marriage / The Perfect Marriage / この上なく完璧な結婚 / 绝无仅有的完美婚姻 / 더없이 완벽한 결혼","Hyewon is in for the surprise of a lifetime when she suddenly gets a marriage proposal from her boss and longtime crush, Jihoon. Everything’s perfect except for the fact that it’s a loveless fake marriage! However, Jihoon’s sizzling kiss to seal the deal leaves her completely defenseless. Instead of refusing, she decides to seize the chance and accepts the two-year faux marriage to try and make him truly hers. Can she turn this fake arrangement into a genuine love story?"," "]},{"title":"Becoming the Lady of the Cursed Ducal House","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Transmigration"],"disc":["Read manhwa Becoming the Lady of the Cursed Ducal House / 저주받은 공작가의 안주인이 되어버렸다","When Hana wakes up in a novel as Cielina, a character who is destined to die, she decides to keep a low profile—until disturbing rumors surface that her husband, Duke Killian Seyfried, killed his own niece and nephew. Diving into the mystery, she uncovers a haunting family curse that renders the children monstrous in others’ eyes. Yet, Cielina’s touch reveals their true forms. As she digs deeper, Cielina discovers she’s been transported into this world by a goddess with a mission: to lift the Seyfried family’s dark curse. Can she unravel the family’s twisted secrets and alter her own fate?"," "]},{"title":"Worn and Torn Newbie","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Worn and Torn Newbie / Worn and Torn Newbie / Solo Smurf / 元ガチ勢、初心者に生まれ変わる / 全裸菜鸟在异世界被摩擦 / 닳고 닳은 뉴비","15 years remain till termination of service. The ending is known only to me. ‘I am a veteran’."]},{"title":"A Divorced Evil Lady Bakes Cakes","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Divorced Evil Lady Bakes Cakes / 이혼한 악녀는 케이크를 굽는다 / A Divorced Wicked Woman Bakes Cake / The Divorcée’s Dessert Cafe / 离婚的恶女爱烤蛋糕","I had been in the position of Duchess for nine years for my quiet and indifferent husband, but all I had left was contempt and indifference, and the only thing I was accused of having a love affair: “There’s a limit to what I can endure for this marriage. No matter how much you cry or plead to the Emperor, I can’t stand it anymore.” “Can I sign here?” “So if you pretend to be poor like last time, this time… what?” I waved divorce papers on an indifferent day. “I’m done. Can I go now?” “Oh, you don’t have to talk about alimony, dowry, just give me back my dowry” “What are you gonna do with that little money?” My husband, who had not cared what he had done for the past nine years, asked me a question in his voice. I laughed confidently and answered: – “I’m going to open a dessert cafe.”"," "]},{"title":"I Became a Renowned Family’s Sword Prodigy","tags":["Action","Drama","Fantasy","Historical","Manhwa","Martial Arts"],"disc":["Read manhwa I Became a Renowned Family’s Sword Prodigy / 위대한 가문의 검술 천재가 되었다","I Became a Renowned Family’s Sword Prodigy ManhwaBaek Woojin is the youngest son of a renowned swordsman family who has neither talent in swordsmanship nor an impressive Aura, despite trying harder than anyone. Although he was dishonored by his own family and killed, he reincarnates as the owner of a Magic Sword. His only goal is the destruction of his own family."]},{"title":"Evolution Begins With A Big Tree","tags":["Action","Adventure","Fantasy"],"disc":["Evolution Begins With A Big Tree, Cong Da Shu Kaishi De Jinhua, Evolution Begins With a Big Tree, Evolution From the Big Tree, 从大树开始的进化, Evolution From a Tree\nReborned as a willow tree! ? Resurrection of spiritual energy, rise of all things. The reborn willow has also embarked on the path of evolution. It can evolve infinitely, is it “divine power” or “curse”?"," "]},{"title":"The Villain’s Match Is Too Perfect","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villain’s Match Is Too Perfect / The Devil’s Match is Too Perfect / The Villain Match Is Too Perfect / The Villain’s Match Is Too Perfect / The Villainess’s Date is Perfect / The Villainess’s Blind Date Is Too Perfect / 恶女的相亲对象太完美了 / 悪女のお見合い相手が完璧すぎる / 악녀의 맞선남이 너무 완벽하다"]},{"title":"I’m From Alien Space","tags":["Action","Adventure","Fantasy"],"disc":["Read I’m From Alien Space / 我来自虚空","Xu Qian transmigrated to a world where he could contract spirit beasts, and obtained the status of a “corrector” during the journey. He awakened the system and contracted the first spirit beast, which was a space-time beast. After learning that the status of “corrector” represented after the meaning, in order to prevent the invasion of other worlds, the rules of this world were successfully revised. Xu Qian began to use the system to deal with the alien worlds, in order to strengthen the system and his own spirit beasts."]},{"title":"The Closet Fan Princess","tags":["Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa The Closet Fan Princess / Princess Who Hides Her Fandom / 일코하는 황녀님","Reincarnated into a novel where my favorite character breathes and lives. The beauty claimed to be the most beautiful in the continent. The jewel most cherished by the Emperor. The queen of the social circles. The time bomb of the Imperial Palace. I became Princess Agnes Saint, the one with all these titles and descriptions! It’s nice being from a rich royal family, but… Like Draco Malfoy who scorned Muggles in Harry Potter, the problem was that ‘I’ was the despised tr*sh that insulted my favorite character’s integrity. To make matters worse, she’s hopelessly courting another man. ‘My favorite character is Kylo, the male lead’s rival, and now I’ve reincarnated as a hardcore fan of the male lead…’ But now that it’s come to this… I will, at all costs, by any means possible, prevent my favorite character’s death and pave a flower path for him! But if I suddenly reveal myself as a Kylo fan, everyone would think I’ve lost my mind. Kylo himself would suspect I’m a madwoman. I didn’t want my kitten, Kylo, to be shocked in any way. So for now, I must hide this agonizing affection. Plus, revealing that you’re a fan has never done any good. So for the time being, I will perfectly… ‘Hide it.’"]},{"title":"My Wife Is From a Thousand Years Ago","tags":["Drama","Fantasy","Isekai","Manhua","Romance","Slice of Life","Supernatural"],"disc":["Read manhua Wǒjiā Lǎopó Láizì Yīqiān Nián Qián / 我家老婆来自一千年前 / Wojia Laopo Laizi Yiqian Nian Qian","Jiang He, a girl from the Tang Dynasty, traveled through a thousand years and appeared in front of Xu Qing. Fate brought together this love that spanned a thousand years. Everything the girl was familiar with has become history. Relatives, friends, and enemies have all been left behind 1,200 years ago. The boy is unreserved and leads the girl to start a new life. Pain, confusion, cheers, and laughter will remain in this new world."," "]},{"title":"KISSING YOU BEFORE GOING TO BED","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Super power","Supernatural"],"disc":["Read manhwa KISSING YOU BEFORE GOING TO BED / 키스는 자기 전에","After a childhood accident, Ji-ho acquires psychic abilities. However, controlling them is a constant struggle! For 18 years, he’s been coping with these unpredictable powers. In an unexpected revelation, Ji-ho discovers that physical contact with Ye-chan, the man living next door, can temporarily ease his psychic discomfort. Now, Ji-ho is thrust into a comedic and chaotic quest: he must win over Ye-chan to legally establish this essential contact. This story unfolds as a tapestry of spontaneous humor, romantic fantasy, and heroic action, all entwined with a twist of superpower mayhem!"]},{"title":"My Beloved Oppressor","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa My Beloved Oppressor, My Dear Oppressor, To My Beloved Oppressor, 사랑하는 나의 억압자","Annette Rosenberg, a descendant of the Padanian royal family and the only daughter of a military captain.\nAfter two years of dating, she married her father’s faithful servant, Heiner Valdemar.\nEverything was perfect.\n-Until her family fell due to her husband’s betrayal.\n“You will be unhappy by my side for the rest of your life.”\nAnnette suddenly realised something.\nThis man’s revenge is just beginning."]}]