[{"title":"Why Are You Doing This, Duke?","tags":["Comedy","Fantasy","Manhua","Romance","Shoujo","Webtoons"],"disc":["Read manhwa What’s Wrong With You, Duke? / Why Are You Doing This, Duke? / 왜 이러세요, 공작님!","“My sweet songbird– my eternal love–\nDon’t make such a sad face.\nWhen my little songbird gets sad, it feels like my entire world is raining.”The duke known to many as the grim reaper, “Rowan Peruka”.\nHe, the very person who was about to chop off my head last month, managed to become my husband?!\nHe took me in not as a second or third wife, but as a first one at that?!!I’d love it if this was true love, but this is all thanks to a mysterious magic spell. And the magic spell’s power’s been weakening to boot–!A marriage with a bipolar(?) husband where your own life is at stake,\nWhat’s Wrong with You, Duke?"]},{"title":"I Became the Villain in the Omniscience Game","tags":["Adventure","Fantasy","Manhua","Romance","Shoujo"],"disc":["I Became the Villain in the Omniscience Game manga, Third-rate web novelist Jia Yi unexpectedly picked up a handsome, powerful, and unfortunate young man in the game?! To find her younger brother, she took the risk of teaming up with him and entering S-class plot missions one by one, and teaching love along the way? Is such a good thing possible?! All the players think we’re just pretty faces, but all the instance records are broken by us! Are you getting angry?"]},{"title":"Strange Love Rivals Increased!","tags":["Drama","Fantasy"],"disc":["After I isekai’d as the female villain of an otome game, I just wanted to avoid the death ending and live a peaceful life. But why are the male lead and female lead fighting over me?"]},{"title":"I Once Broke An Oath","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Once Broke An Oath","The greatest evil was resurrected, and the youngest high-ranked magician, Diarin, died three times while trying to stop it, and was unable to protect those close to her.","In her fourth reincarnation:\nHer life is at danger thanks to her eternal soul’s fate, and she needs a different strategy to escape her future. Diarin promises divorce when she finds the prince that was engaged since he was a child, in exchange for him staying in her territory for one year. However…","…","Diarin leaned towards Yejet as best as she could, to try and look as natural as possible.\n“I will annul the engagement for you.”\n“Huh?” Yejet asked again, after blankly saying “Huh?” in the moment along with the driver.","Yejet’s gaze was very peculiar. It was only thanks to Diarin putting in all of her focus on Yejet, that allowed her to just barely notice that odd gaze. Yejet didn’t take his eyes off of Diarin’s once.\nHe asked her, “Are you talking about Duke Concul?”\nIt was a sentence spoken as quietly as Diarin’s. Excluding the driver, no one could hear their conversation.","“No way. Do you think the duke would actually let go of Your Highness? If he could, he would probably tie you up with a rope as tight as he could.”\n“Then?”","Diarin in the quietest voice, as though ice might shatter if she spoke too loudly, “I’m talking about you.”"]},{"title":"I Saved The Demon King","tags":["Action","Comedy","Demons","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read manga I Saved The Demon King / 救了个魔尊大大","The infamous Big Demon actually accepted a 4-year-old female apprentice! Do you want to see Demon raise a baby? The 4-year-old female apprentice said that she didn’t really think much about it. She was just a female college student who accidentally transverse into a book. What’s the matter with her fate and grievances and Xiuxian Daguai? But this villain Demon Lord seems to have something hidden…"]},{"title":"No More Prince","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read manhwa 노 모어 프린스 / No More Princes\n“All the princes say the same thing, they must really like Jeno, they only look hard to search for you” Unlike the well known tale of the princess who is trapped in the forest and the fire breathing dragon, Princess Mikaela and dragon Jeno don’t have a typical kidnapper and hostage relationship, but a butler? Guard? A never aging friend of Mikaela’s mother, Hildian? Whichever side you take, he is much better than the princes that wake Mikaela up in the morning, until one day, Jeno gets poisoned by a prince, loses consciousness and his body starts heating up!"]},{"title":"Positively Yours","tags":["Drama","Josei","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Positively Yours / 아기가 생겼어요\nTo Hee-won’s dismay, the BFF she crushed on and her other BFF are now dating! Seriously bummed, Hee-won decides to go wild just one time, and find solace with a handsome stranger.\nA very satisfying one night affair has now turned into more — she’s pregnant! Fate brings them together again, and now the regimented Doo-joon is determined to do the right thing and marry her.\nBut they’re basically strangers! Except… their bodies have been very intimately acquainted. What’s this mother-to-be to do?"]},{"title":"Your Fragrance","tags":["Liexing","Ping Ping Jun","Romance"],"disc":["When a top perfumer encounters a sweet, pretty office lady, a destined scented romance will now begin.\nAroa Shi starts her first day at work with much anticipation, but she never expects her superior to be the handsome ‘rogue’ she bumped into a few days ago. He doesn’t like socializing, but he actually participates in the gathering for Aroa… What motives does he have for approaching Aroa?"]},{"title":"Wish to Say Farewell","tags":["Historical","Isekai","Manhwa","Romance","Webtoon","Webtoons"],"disc":["Read manhwa Wish to Say Farewell / I Bid You Adieu / 이별을 희망합니다\nAyne le Poregrin has three “trophies” in her collection of men: a reluctant fiancé held hostage by his debts, a fickle assassin paid to be her lover, and a soulless pet dog won at a slave auction.\nBut to suddenly wake up one day as this femme fatale is the worst possible surprise. As the villainess of the novel “The Fairy Garden,” the new “Ayne” is fated to die a painful death at the hands of her very own trophies! To sidestep her grim future, she knows she’ll need to break up with all three. As soon as she tries to say goodbye, however, each man becomes attached and won’t leave her alone!\nCan Ayne turn their affections towards the story’s heroine and save her own life in the process? Based on the hit novel!"]},{"title":"A Sharp Sword to Protect the Country","tags":["Action","Drama","Fantasy","Harem","Manhua","Romance"],"disc":["Read manga A Sharp Sword to Protect the Country","Lin Xiao, The nine star commander in chief of dragon kingdom, was betrayed by his friend, and became a fool overnight. He was humiliated. Thanks to his fiancee Qin Wanqiu’s constant care for two years, Lin Xiao finally regained his mind and vowed that he would protect Qin Wanqiu, and would make those who humiliated him return ten times!"]},{"title":"Princess Agent","tags":["Historical","Romance","Webtoons"],"disc":["特工王妃虐渣记\nA good for nothing+ A cripple=? Time travelled to be the second daughter of the prime minister and get abandoned by her fiance? What a cliche?! I am the top of tops agent. And he is the scheming war god!"]},{"title":"Cling to me (Please Be Obsessed With Me)","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Cling To Me/ Please Be Obsessed With Me/ Obsessed Over Me / Please Obsess Over Me / 내게 집착하세요","Arabella is a forgotten princess who vomits blood as she moves.\nA rebellion took place against the oppression of the royal family.\nReturn after being killed.\nShe discovers that the retracement will only end if she survives until her 25th birthday.","Arabella is determined to find answers from the rebels to prolong her life."]},{"title":"My Multiple Personality Girlfriend","tags":["Adaptation","Harem","Manhua","Romance","Thriller"],"disc":["Read My Multiple Personality Girlfriend , 我的女友怪怪的 , My Weird Girlfriend","Appearing in front of Gu Bei, who had lost his memory, was the beautiful girl Su Mo who claimed to be his girlfriend. However, Su Mo had other personalities in her body. The problem for Gu Bei is that if he wants to date normally, it seems he has to conquer all the other personalities?"," "]},{"title":"Demon Asura Becomes A 5 Year Old Loli","tags":["Action","Comedy","Drama","Fantasy","Historical","Manhua","Martial Arts","Mystery","Romance","Shoujo","Shoujo Ai","Supernatural"],"disc":["Read manhua Demon Asura Becomes A 5 Year Old Loli / The Demon Queen Asura","The Demon Queen Asura whom many fear just hearing her name turns into a child overnight and bullied? Oppressed? Assassinated?Impossible! Not happening!Hey, you trash cultivator, be honored that you are tasked to send this deity back home!"]},{"title":"My Wife is Back","tags":["Drama","Josei","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa My Wife is Back / 아내가 돌아왔다 / Wife After Love / 아내가 돌아왔다 / Mantan Istriku Kembali!\n“We should get a divorce.”\nA marriage without love.\nChoi Mo-won was a man who thought marriage was solely for business.\nBut Lee Yu-rae, the woman he was married to, suddenly asked him for a divorce.\nThree years later, one day, in an unexpected place, they reunited in a strange relationship….\n“Do you want to go out with me?”\nHis wife is back.\nBut is she the same woman he used to know?\nHis once lifeless heart started to beat.\nAnd that too, for his ex-wife, who has returned."]},{"title":"Poor Father and Daughter","tags":["Comedy","Manhua","Romance","Slice of Life"],"disc":["It about a poor family of two: father and rebellious daughter. In order to make money the single father does a lot of odd jobs and at the school the daughter is incompatible with her classmates."]},{"title":"Rebel Princess: The Divine Doctor Outcast","tags":["Manhua"],"disc":["Read manga Rebel Princess: The Divine Doctor Outcast","A modern military doctor accidentally time-travelled during her mission. She became Feng Qingchen, the daughter of the late general of the ancient Tanglin Kingdom, and found herself in a bandit’s den. With her life endangered, Feng Qingchen grabbed a scalpel from the medical system and killed a few bandits. When she left the bandit’s den and was about to wander the world free and unfettered, Wanyin, the servant girl of the owner of her body suddenly appeared to stall her. Feng Qingchen’s fianc, Prince Luo, rushed over with his army just to find Feng Qingchen in dishevelled clothes. Doubting her chastity, he ordered her to commit suicide."]},{"title":"Is the demon king a healer? (manhwa)","tags":["Action","Fantasy","Manhwa"],"disc":["Is the demon king a healer? manhwa\n“If you are a healer, just heal at the back” This is the mindset of everyone in this world. Healer has been most unappreciated among the combatants. But the strongest man, the ‘demon king’, who is the target of everyone, was a healer?"]},{"title":"Yi zhi chong hun: Shenmi laogong re bude","tags":["Josei","Manhua","Romance"],"disc":["She was calculated by her family to be with a stranger. The next day, a group of black people “shelved” her to the Civil Affairs Bureau and she was forced to marry her “one-night stand” object. Her husband was tender and considerate but she had never been able to meet him. At the same time, the overbearing president suddenly broke into her life…"]},{"title":"Dukedom’s Legendary Prodigy","tags":["Action","Adventure","Manhwa"],"disc":["Dukedom’s Legendary Prodigy manhwa,\nSummoned into another world, Han Sung worked his entire life as the empire’s SSS-class monster hunter. After countless struggles, he lost his life and came back as the first-born son of the Jackson Duchy, ‘Dale’. He was the continent’s greatest dark magician and the leader of the dark tower, The Black Duke’s son. ‘I will destroy the empire with my own hands.’ Swords, magic, and the art of strategy. With his previous life’s knowledge and intelligence as his background, Dale is reborn as the genius of the duchy. Just how far will his abilities go? His adventure starts now without an inkling of hesitation!"]}]