[{"title":"Putting My Life on the Line, I Go All-in on Luck Enhancement","tags":[],"disc":["Read manhwa Putting My Life on the Line, I Go All-in on Luck Enhancement","Amano Kyouhei was a man abandoned by luck, but after hitting rock bottom, his fate finally begins to change. After a video of him defeating a monster goes viral on the internet, he becomes famous overnight.\nThis sudden reversal of fortune leads Kyouhei on a lifechanging journey of unforetold adventures. Will this stroke of luck bring him to true fortune, or will he face new trials to overcome…? The answer to that question will be found in his upcoming journey!"]},{"title":"It’s Useless to Hang On","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa It’s Useless to Hang On / It’s No Use Hanging On / There’s No Use in Hanging On / 매달려도 소용없어","The love of my life, Rakan, became the Emperor. At last, the coronation ceremony; I stood by him expecting to become Empress. However, the crown of empress didn’t become mine, it became Vienna’s, my younger cousin.\nI threw everything away to make Rakan the emperor, and all that’s left for me ahead was death. It wasn’t until I was abandoned that I realized he used me. Everything was a ruse. The carefully planned screenplay; its main characters being the love of my life, Rakan, and my cousin, Vienna. I was the only one who didn’t know that. In my last moments, I made a promise. If I had another chance, I wouldn’t love you again, even if I died.\nI’ve miraculously returned to the past! To when I was 18, the day all the disharmony began.\nI made up my mind in tears. This time, I’m going to give everything I’ve got to destroy you, Rakan. In my vow of revenge, I began to see something I had never noticed before. My fiancé, Paylon, has always looked my way.\n“Please be on my side. I don’t need love.”\nI’m not going to let you hang on to me this time!"]},{"title":"Marriage with the Archduke, I Know Now","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marriage with the Archduke, I Know Now","She became a journalist who exposes corporate corruption, but ended up reincarnating herself in a novel. And on top of that, like the bankrupt writer, who lost everything gambling! Rivel Ivela has to live as ‘Journalist Bel’, who investigates the corruption of the nobility, with no choice… “I approve of you two officially becoming a couple.” On the day he received a unilateral break-up notice from his fiancé, Rivel spends a night with a stranger on impulse. The next day, Rivel, who remembers nothing, receives a marriage certificate sent by the emperor."]},{"title":"The Heavenly Demon Destroys the Lich King’s Murim","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The Heavenly Demon Destroys the Lich King’s Murim / 천마, 리치왕의 무림을 부수다","An unknown voice disturbed me while I was levitating during my cultivation to reach the transcendent demonic state. My concentration had been broken, and I fell into an unconscious, overloaded state. When I awoke a month later, the Lich King had already taken control of the Murim. After the battle that ended with the destruction of the Heavenly Demon Cult, I awoke a hundred and forty years later in a Murim where magic and martial arts coexisted."]},{"title":"How to Protect My Male Lead","tags":["Drama","Fantasy","Isekai","Manhwa","Reincarnation","Romance","Royal family"],"disc":["Read manhwa How to Protect My Male Lead / 내 남자 주인공을 지키는 방법","Overcome with grief, Iris cradles her dying husband, Crown Prince Cedric, who was betrayed by her own bloodline. Suddenly, she’s transported to another dimension where Cedric’s life is written in a book, and pleads for the power to change the ending. That’s when Iris is sent back to the time before her marriage, armed with the knowledge of impending treachery and determined to reshape Cedric and her destiny. As the past unfolds anew, Iris must outmaneuver both her family and the emperor to secure a future for them both. But can she truly alter fate, or is tragedy inescapable?"]},{"title":"Pure Love Operation","tags":["Comedy","Drama","Manhwa","Romance","School Life","Supernatural"],"disc":["Read manhwa 작전명 순정 / Operation Name Sunjeong / Operation Name Pure Love\nI saw my boyfriend kissing my best friend. if that wasn’t enough, I was with a guy whose guts I hate from my class, Go Eun-Hyuk. I was already shaken up… But apparently there’s a given amount of love that a person receives in their lifetime? And the amount of love I’m able to receive is ‘0’??? Soo-Ae, who’s trying to change her pathetic fate, and Eun-Hyuk, who got involved with Soo-Ae, and their headwind operation! She was only going to ‘act’ like she’s cheating on her boyfriend, but she starts to develop feelings for Eun-Hyuk?! This plan… will it truly work?"]},{"title":"Clever Cleaning Life Of The Returned Genius Hunter","tags":["Action","Adventure","Fantasy"],"disc":["Read Clever Cleaning Life Of The Returned Genius Hunter, The Dungeon Cleaning Life of a Once Genius Hunter, The Smart Dungeon Sweeper’s Life of a Returned Genius Hunter Мудрая уборка жизни вернувшегося охотника за гениями สุดยอดฮันเตอร์สายคลีน 元・天才ハンターの華麗なる清掃ライフ 天才猎人的清扫生活 회귀한 천재 헌터의 슬기로운 청소생활","Kim Jun-Woo, the world’s first SSS rank genius hunter. He is an incredible user of ability, but his horrible personality leads to problems with his reputation. In the midst of his troubles, he was attacked and killed by an unidentified group. And when he opened his eyes, he had returned to the past of 10 years ago. Though he tries to become a hunter again and raise his rank, his skills were all sealed by the karma of his previous life. In order for that to be released, he needs to work as a ‘Dungeon Cleaner’, which is infamous for being extremely tough in this industry?! But this cleaner, he’s different! Not only monsters—troublesome hunters, superiors only taking up positions after they’re hired out of nepotism, and even people who will be colleagues with him. He’s making a complete mess to clean everything up. The ex-hunter, who is stronger than the current hunters, and his crazy cleaning begins!"]},{"title":"The S-Class Hunter Doesn’t Want to Be a Villainous Princess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The S-Class Hunter Doesn’t Want to Be a Villainous Princess, Class S Hunter doesn’t want to be a villain princess, S급 헌터는 악역 공녀가 되기 싫습니다, The S-Class Hunter Detests Being A Villainous Princess","She had transmigrated into a hunter constellation fantasy novel, and after 10 years, she finally attained the No.1 Hunter ranking and cleared the tower…\nBut now she transmigrated into a Romance-Fantasy novel as an exalted and infamously evil princess?\n【The ‘Vicious Blood Cult’ asks where on earth are we.】\n【The ‘Monarch of Waves and Healing’ is confused.】\n【The ‘Lord of Temptation’ is delighted with the familiar world.】\nBut if you look closely, this princess doesn’t usually live a bad life, does she? Every day, there are assassination attempts and all kinds of schemes…\n【The ‘Vicious Blood Cult’’s skill ‘Unsinkable Poison’ LV.999 purifies the Mandrake’s poison!】\n【The ‘Monarch of Waves and Healing’’s skill ‘Blessing of Water’ LV.999 heals wounds perfectly!】\n【The ‘Lord of Temptation’s skill ‘Temptation of Sleep’ LV.999 puts the assassin to sleep!】\nBut, what the hell. Everything’s so dull compared to my previous life.\nI planned to leisurely clear my missions while savoring the moments when I’d be able to take a break and rest,\nBut now, her older brothers and the male lead, who had previously tormented the villainess, began to follow me around…\nI will take revenge for you and grant you everything you want, so damn system, please send me back home!"]},{"title":"The Duke’s Daughter is Going on Strike","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Duke’s Daughter is Going on Strike / THE PRINCESS IS GOING ON STRIKE , 공녀는 지금부터 파업합니다","“Die for us, just like you’ve served our family all along.”Because of her crimson eyes and the dark splotch on her face, Arryl Brixia, the illegitimate child of the Brixia ducal house, had to live with a mask on her entire life. She tried desperately to win the acceptance of her family, but in the end, she met her death after being framed for treason.But now, she’s returned to the past.She can no longer see the hideous splotch in her reflection in the mirror. But her face isn’t the only thing that’s changed from before — Ethan, the heir to the Burstein ducal family, suddenly comes and finds her…“Lady Arryl, why do you wear a mask?”“Why do you ask?”“Your eyes.”“What?”“I saw your eyes. Your clear and confident eyes.”“People fear them because they believe it’s the sign of the devil. Don’t you think so, Sir Ethan?”“No, not at all. They look absolutely beautiful to me.”The satisfying revenge story of Lady Arryl Brixia, who was abandoned by her own family."," "]},{"title":"The Young Lord of House Finlanz","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa The Young Lord of House Finlanz/ Finrantsuka no Osanai Ryoushu / フィンランツ家の幼い領主","My name is Lizbeth, and I am a 7-year-old who will use the knowledge from my previous life to develop my territory! Lizbeth was born as the daughter of Margrave Finlanz. She was married off in a political marriage to Crown Prince Reinhardt as his 10th concubine. To distract herself from her loneliness, she exchanged letters with friends from other countries. However, she was falsely accused of a crime and imprisoned in an underground prison. With no one listening to her pleas, she drew her last breath alone, but… “I’ve returned to the past—?” When she came to, she found herself in her warm bed, back to being her happy 7-year-old self! The remote territory lady’s coming-of-age fantasy starts with a loop! Hip Hip Hooray~!"]},{"title":"The Tales of Heaven And Earth","tags":["Action","Adventure","Fantasy"],"disc":["Read The Tales of Heaven And Earth / 건곤불이기","The Divine Sword and the Demonic Blade. Two Experts who rule over the martial world. The lineage of the Demonic Blade is passed down to a seemingly ordinary child named Tongmi. He once resented his father, who was merely diligent and hardworking. But comes to realize just how extraordinary his father’s life truly was. It is at that moment that the power of Tongmi’s Demonic Blade begins to shine."]},{"title":"The Guide to Capturing a Black Lotus","tags":["Drama","Fantasy","Historical","Romance","Webtoons"],"disc":["Read manga The Guide to Capturing a Black Lotus / The Girl of the Black Lotus / Become the Girl of Black Lotus / Black Lotus Strategy Manual / 黑莲花攻略手册[穿书]"," "]},{"title":"The Young Genius Paintress","tags":["Comedy","Fantasy","Romance","Shoujo"],"disc":["Read The Young Genius Paintress / Genius Painter Little Wife / The Genius Painter’s Wife / 天才画师小娘子 / 천재 소녀 화가","Lu Zhijun, a gifted painter who had been raised without strict discipline since childhood, returned to the capital. Despite being over the marriageable age, she still actively participated in various blind dates organized by the nobles under the arrangement of her parents. Meanwhile, Pei Chongjin, a leader in Imperial Guards, made secret efforts to ensure that Lu Zhijun could only marry him."," "]},{"title":"The Tragedy of a Villainess","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Tragedy","Webtoons"],"disc":["Read manhwa I’ve Become A True Villainess / The Tragedy of a Villainess / The Case of the Legal Villain / 合法反派的诉求 / 합법적 악역의 사정","The social outcast, Seria, had changed.\nSeria Shuteren, the vile woman who had everyone trembling with fear at her feet, was now calm.","Truthfully, the woman had not just changed, she was a completely different person.\nRealizing she had possessed the wicked woman’s body in this romance novel, she decided to live on the low, having a hunch about the future.","She would end those dreadful habits of Seria, avoiding her death by decapitation at the hands of Kalis, the sub male lead."," "]},{"title":"The Dungeon’s Time-Bound S-Rank Beauty","tags":["Adventure","Drama","Dungeons","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa The Dungeon’s Time-Bound S-Rank Beauty / The Dungeon’s Dying S-Class Lady / 그 던전의 S급 시한부 영애","Top S-class hunter Shin Yuri helps protect Korea from the dungeons that have been wreaking havoc. And when all the hunters refuse to take on the “I’ve Possessed the Body of a Weak and Terminally Ill Noble Lady” dungeon, Yuri and her team head inside to challenge it. But while her comrades become an emperor, a pope, and a master of the magicians’ tower, she becomes a dying noble lady! They have one year to prevent the destruction of the continent, but can she help with this frail body of hers?!"]},{"title":"The Boy Next Door","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Boy Next Door / Someone Who Lives Next Door / 이웃집 연하","Someone from the next door who I almost spent the night with while drunk turned out to be Woo-gyeom Jung, the little kid who lived in the neighborhood 12 years ago. But Woo-gyeom, who I met again after 9 years, is a bit strange. He asked me to pretend to be his girlfriend and then kissed me right away. Now he says he wants to be my real boyfriend. How can I date you when you’re 6 years younger than me? How can Jin-eun avoid dating Woo-gyeom, who is like a bulldozer?"]},{"title":"The Daughter of a Wealthy Family Went Crazy After Being Reborn","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhua The Daughter of a Wealthy Family Went Crazy After Being Reborn, Haomen Qianjin Chongsheng Hou Sha Fengle, Háomén Qiānjīn Chóngshēng Hòu Shā Fēngle, Reborn: The Savage Heiress","After a fire, she saw clearly the warmth and warmth of people’s hearts; when she returns from rebirth, she will definitely turn her bleak life around! Fighting against a scumbag girl, severing family ties, and killing the wealthy daughter of the Bai family, she went crazy. If you want to ask why she is so arrogant, the miracle doctor, the hacker leader, the mathematical genius… are all her masks, and besides, she is the star in the heart of the Lu family.Menu [Hide]"]},{"title":"Don’t Trust The Goddess","tags":["Drama","Fantasy","Historical","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manhwa Don’t Trust The Goddess / 신녀를 믿지 마세요","Summary:\n[ I cannot forgive you for using me, the God of Astrology to deceive people] If fraud is a skill, Yoo Seolyeon who has a fraud skill score of 99, uses 100% of her talent to run a fortune telling shop. “Please save us, Goddess Diana!” Who am I? Where am I? Before I could even think, lots of people came in and the room falls into chaos… Soo Seolyeon, a fraudulent fortune teller possessed the body of the Goddess Diana. Will her morale work on this world as well?"]},{"title":"The Reincarnated Cop Who Strikes With Wealth","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The Reincarnated Cop Who Strikes With Wealth / Reincarnation Police / 재력으로 후려치는 환생 경찰","I was reincarnated as the son of a conglomerate leader. But I’m going to be a cop."]},{"title":"The Maid Wants to Quit Within the Reverse Harem Game","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Maid Wants to Quit Within the Reverse Harem Game / Mba iren mau mengundurkan diri / Maid To Love or Die / 역하렘 게임 속 메이드는 퇴사하고 싶습니다","The main character, who transmigrates into an exhausting reverse harem game as an extra, has seen it to the end six times but still does not return to reality? No matter how true she stays to her role as an extra, she keeps getting swept along with the characters’ tragic ending. Now she’s determined to leave everything behind live her own life. “It’s my resignation letter. I would like to leave this estate.” I’m sure the main leads will be fine without me, after all. However. “On who’s account are you leaving this estate for? Did you not say you’re my person, Iren?” “Irenea. I don’t intend to connect with anyone else but you. It’s only you.” “Don’t go, Lea. Stay by my side, alright?” “I would like for you to be happy, Miss Irenea.” Every character in the game has started to notice me."]}]