[{"title":"The Era of Luxury","tags":["Drama"],"disc":["Read manhwa The Era of Luxury / 명품시대","The Era of Luxury is a Manga/Manhwa/Manhua in english language, Manhwa series, english chapters have been translated and you can read them here. You are reading chapters on the fastest updating comic site. The Summary is","The main character, Jeong Chan-ho, who had a unique desire for money and pride since childhood. When he got tired of working as a professional golf instructor, he met with a customer who was extremely generous, Mr. Park. “Actually… it’s my fake.” “Do you make a lot of money if you do that?” The secret of Park’s wealth is ‘fake’?! After hearing that fake money can make a lot of money, Chan-ho jumps into the world of fake money by learning about it from Park…."]},{"title":"When I Was Favored by the Bishop-sama","tags":["Drama","Fantasy","Romance"],"disc":["When I Was Favored by the Bishop-sama, 被主教大人宠爱的日子"]},{"title":"The Ending, I Want to Change it","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manga The Ending, I Want to Change it"]},{"title":"My Lovely Bodyguard","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Lovely Bodyguard","During her flight back to Seoul, Sarah, a French-Korean teenage girl, saves K-Pop star Jaemin from a violent attack by an overzealous fan. At that moment, she couldn’t have imagined that her intervention would uncover deep family secrets…"]},{"title":"As Long As You Like It","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa As Long As You Like It / As You Like It, Margrave / As You Like It / Asal Kau Suka / Con tal de que te guste / Ddeusdaero Haseyo / Jue Shi Lianren / Mientras te guste / Oose no mama ni / Tant que vous m’aimerez / Tteutdaero Haseyo / 仰せのままに / 爵世恋人 / 뜻대로 하세요","Dian is a maid working for the Marquis of Lowell. To help her lady escape from an unwanted marriage, Dian sends her out the country and assumes her identity, going to the castle of Margrave Evenhart in her stead. The Evenhart family, famous for guarding the North for generations, but never leaving their territory, is a subject of great mystery to the outside world. Will Dian’s identity be discovered? What romantic story will unfold in these days of cohabitation?"]},{"title":"Third night only","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Third night only / For the Third Time / 첫날밤만 세 번째 / The third of first night only / Malam Pertama untuk Ketiga Kalinya","29 years old , Baek Dohee who feels hopeless and skeptical about her life , dreamed of escaping from a frustrated heart , meets Jun Won in place of her friend , Nuri. Due to an unknown attraction they end up having a one night stand , but at the climax. Dohee passes days without meeting Jun Won inorder to forget that day. Dohee reunites with Jun Won , who has taken the position of team leader. However, Jun Won who shouldn’t be able to remember “that day” , clearly remembers Dohee and everything that happened that night. No matter how hard she tries to push him away , she’s still dragged towards him who approaches her recklessly. Can the two men and women who became emotional hedgehogs for their own reasons , will be able to break down the wall and be happy together?"]},{"title":"The Possessed Genius’ Gaming Stream","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Possessed Genius’ Gaming Stream / The Genius Spirited Streamer / 천재의 신들린 게임방송","[By the studio that brought you <Return of the Mount Hua Sect>!]","The main character, Lee Gyeong-bok, lives by suppressing his innate divine energy.\nThis is because the recoil that follows when the divine energy is unleashed is painful, but there is no recoil in a gaming capsule?!","Gyeong-bok, freely using his divine energy in virtual reality, immediately captures the attention of viewers with his powerful action and grows into a game streamer possessed by a god!"]},{"title":"The Man Living Outside The Law","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The Man Living Outside The Law / 법 없이 사는 남자"]},{"title":"Counterattacking System Available At The Grand Ascension Stage","tags":["Action","Fantasy","Martial Arts"],"disc":["Read Counterattacking System Available At The Grand Ascension Stage, Dacheng Qi Cai You Ni Xi Xitong, Only in the Mahayana Period Does the Counterattack System Exist, 大乘期才有逆袭系统","Jiang Li, after crossing over, discovered he possessed no cheat abilities so he had no choice but to diligently cultivate. Five hundred years later, he became the strongest in the Nine Provinces. Suddenly, a system appeared, claiming it could help the host go from the Qi Refining stage to becoming the number one in the Nine Provinces. Jiang Li stared at the first task, lost in thought. “Host, please defeat your cousin (at the sixth level of Qi Refining).” “Your system seems to have quite a delay, doesn’t it?”"]},{"title":"The Tomb of Famed Swords","tags":["Action","Fantasy","Historical","Martial Arts","Romance"],"disc":["Read manga Tomb of the Great Swords / 名剑冢 / Famed Sword Tomb / Famous Sword Tomb / Ming Jian Zhong / Tomb of the Great Swords / 名剑冢 / 검령들이 나를 너무 좋아해!","The useless female lead suddenly becomes the head of the Sword Pavilion? Even after finding out the truth of the Famed Sword, facing the bloody hatred from fellow disciples, and receiving a scolding from her master, the girl who has no talent for cultivation still persists forward, unaware of the catastrophe lying ahead. As the only person who can save the Shenjian Sect from such a catastrophe, the girl says: In this sect where so many people know the skill of Dragon Claw, I really won’t be able to help anyone! Let’s see how the “weed” of the Sword Pavilion can turn the tide!"," "]},{"title":"No, Queen!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Queen, You Mustn’t! / No, Queen! / 여왕님 안 돼요!","There hasn’t been a queen like this before! The strongest monarch in Babel’s history called the God of War, God’s Daughter, Aroha Fenril Astrofortus! After her return from concluding a seven-year war, she finds that those bastard nobles have prepared a bothersome trap… ‘Your Majesty, you must choose a husband and continue the royal family’s bloodline!’ She wants to throw all of that away, but in consideration for the royal bloodline, she does have to get married. On top of that, she’s receiving a crazy amount of proposals from those that are vying for Babel’s second highest position. The husband candidates chosen by the Grand Chamberlain on special orders! The genius that is Babel Academy’s youngest professor in all history, an optimistic national guard, Babel’s General and the Queen’s reliable comrade, and the young hero of Babel’s political world, the most beautiful man. …Who will Aroha choose?"]},{"title":"The Prince’s Personal Physician","tags":["Historical","Isekai","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Prince’s Personal Physician","“Do no harm”—that’s the oath that Rhena swore as a young surgeon. But when she accidentally drowns on a dark and stormy night, she wakes up in a kingdom where medical knowledge is forbidden to women—and punishable by death! After arriving in this strange world, she saves the life of Zared, the Captain of the Royal Guard who swears to protect her… but to stay safe, she must disguise herself as a man and become the personal physician of the icy Prince Damien! Can Rhena save the sickly prince and reform this world’s antiquated ways, all while keeping her true identity a secret?"]},{"title":"Marriage B","tags":["Drama","Fantasy","Historical","Manhwa","One shot","Romance","Tragedy"],"disc":["Read manhwa Marriage B / 메리지 B","“You killed Melissa. If you let me go, she won’t!”\nI am married to Terio Alte, a friend from childhood. But Terio’s heart only goes to Melissa, my sister.\nNot long after that, Marquis Ancy Betelgius destroyed the Rubiet family. And Melissa, who was married to him, also died.\nTerio took out all his resentment on me, because I couldn’t stand it and decided to give up on this life…\nWhen I opened my eyes, I found myself going back to 7 years ago. I chose Ancy Betelgius over as Melissa’s replacement.\n“There’s no hope. Anyway, if life has decided my fate is death, I’ll choose a certain tragedy.”\nBut this man, why treat me with such affection…\n“If that’s the case…I hope you will keep this mask of affection for a long time. Until the day I take my own life”"]},{"title":"I’m Leaving Without Saving The Terminally Ill Villain","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m Leaving Without Saving The Terminally Ill Villain"]},{"title":"The Demonic Cult Leader Is Too Reluctant","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Demonic Cult Leader Is Too Reluctant / 전전긍긍 마교교주","“Crazy bastards, just leave me be.” The story of Do Yugang, son of the Heavenly Demon, who dreads becoming the Demonic Cult Leader."]},{"title":"I’ve Been Invincible for a Long Time","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhua I’ve Been Invincible for a Long Time / It Turns Out That I Have Been Invincible for a Long Time / Xuanhuan: It Turns Out That I Have Long Been Invincible / 原来我早就无敌了/ 才能ゼロが無敵になったわけ","Over a five-year journey around the world, Ye Changqing first believed he could be like other cool novel protagonist systems with a plug-in, but even the most common immortal cultivator cannot be. Living close to a sect in a small town was his only option, so he started a business. His small store eventually turned into the holy land of all the righteous individuals, and the dog he raised up turned out to be the feared demon king. From that moment on, everyone acknowledged Ye Changqing as a Supreme Master."]},{"title":"I Became The Youngest Disciple of The Mount Hua Sect","tags":["Comedy","Drama","Martial Arts"],"disc":["Read manhwa I Became The Youngest Disciple of The Mount Hua Sect / 화산파 막내제자가 되었다","In this era of mass transmigration into novels, where you never know when or where you’ll end up inside a story you’ve read, reading multiple books in parallel is dangerous.","“Master! There’s a baby at the entrance of the sect!”","You could end up transmigrating into a bizarre hybrid novel—a mix of a cute childcare romance and a bloody martial arts story—just for reading them together.","And not even as the cliché youngest daughter of a prestigious noble family, but as a baby abandoned on the treacherous mountaintop in front of Mount Hua Sect, with no parents!","“Alright, young one! Let’s make you a legend who wielded a sword before taking your first steps!”\n“The plum blossom! As a member of Mount Hua Sect, you must make it bloom!”","Don’t turn me into a mass-produced legend by giving a sword to a baby who can’t even walk.","“We must defeat those Wudang Sect bastards! How long are we going to live with people saying that the best sword sect under heaven is Wudang?”","Shouldn’t adults be careful not to put too much pressure on kids?","To top it all off, the young master from the Namgung family who once coaxed me to come to his home doesn’t even recognize me now…","“Is this all the swordsmanship of Mount Hua amounts to? I had high expectations for Mount Hua Sect, but it’s nothing special.”","Please, just keep your mouth shut, ugh.","From now on, I’ll only read one book at a time, so could you please send me into a proper, straightforward childcare romance novel?","***","Namgung Seheon suddenly grabbed my shoulders.","“Hey, don’t spar with anyone else.”\n“Did the shock of losing make you lose your mind? How is that possible?”\n“Oh, is that so…”","He nodded absentmindedly, then changed his tone.","“Then, don’t smile like that after sparring with anyone else.”","His dark eyes blinked slowly as he looked down at me intently.","“Only smile like that when I win.”"]},{"title":"A Red Knight Does Not Blindly Follow Money","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa A Red Knight Does Not Blindly Follow Money / The Red Knight Seeks No Reward / Ilmu Pedang Pesulap Merah / 적기사는 눈먼 돈을 좇지 않는다","The Imperial Knight Judith was once a scumbag that would do anything for money. She lived as a slave to money as a dog of the imperial family and a tool of the chief. Under the guise of destitution, she abandoned her guilt. But what was at the end was betrayal and death. However, when she opened her eyes, she went back to being a new knight after six years? ‘I’m not going to be a swordsman for money anymore!’ In front of Judith, who is determined to live a different life than before, the commander of the Red Knights and scouts appears… “I assure you that you will be treated fairly. Why don’t you join the Red Knights?” Judith decided not to pursue money blindly as a Red Knight, abandoning her past of being a Black Knight. Can she live this life without regret?"]},{"title":"The Villainous Princess Wants to Live in a Gingerbread House","tags":["Cooking","Fantasy","Isekai","Magic","Manhwa","Reincarnation","Romance","Slice of Life","Villainess"],"disc":["Read manhwa The Villainous Princess Wants to Live in a Gingerbread House / The Villainous Princess Wants to Live in a Snack House / The Villainous Princess Wants to Live in a Confectionary Store / The Villainous Princess Wants to Live in a Candy Store / The Villainous Princess Wants to Live in a Sweet Shop / The Villainous Princess Wants to Live in a Cookie House / 악역 황녀님은 과자집에서 살고 싶어","I thought I had reincarnated into a poverty-stricken family, until… “I have come to escort Her Highness Anastasia of the imperial family!” It seems I have been reincarnated in a novel as an imperial princess who coveted power and met a wretched end! I diligently baked pastries with the help of the spirit I made a contract with so I could fulfill my dream in my past life to become a patissier and prove that I wasn’t power-hungry. Surely they wouldn’t kill me if I fed them lots of delicious treats! But the cruel and coldhearted emperor (my grandfather), his eldest grandson and the novel’s male lead who will bring about my doom (my older cousin), the empire’s strongest knight and heir to a duchy (my friend), and the slave knight (an elf) who will kill me… “I like your lime pies, Your Highness.” …by any chance, have these people fallen in love with me instead of my pastries? This is the villainous princess Asha’s sweet fantasy story of baking and healing!"]},{"title":"Elskar","tags":["Fantasy","Romance","Webtoons"],"disc":["Read Elskar / Promise Jewel / 엘스카르","Hidden deep within the sanctuary of the forest lives the Rangae species, who form a precious jewel within their hearts once they reach adulthood. Viola, a young Rangae, has yet to form one when her village is attacked by human hunters. Due to her shocking resemblance to the late empress, she is rescued by Duke Khalid Alec Droy and assigned to serve the fifth imperial prince. Faced with the cruel hierarchy of high society and palace life, can Viola overcome her hatred of humans and discover the mysterious duke’s true intentions? All rights reserved."]}]