[{"title":"Surviving as an Illegitimate Princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Surviving as an Illegitimate Princess / 사생아 공주로 살아남기","“Don’t look down on me just because I’m young! Even though I look like this, I’m on my 10th life!” I’m an illegitimate princess whose life was cut short after being mistaken as kin of an enemy country. Later, I discovered the identity of my biological father in my 9th tragic regression. It was Faeon, a war hero who defeated the demon king and the strongest holy knight in the continent. He had a forbidden relationship with the princess, had me, and then deserted me! In order to survive the harsh royal palace, I’ve decided to use and then abandon this impudent father. I will become the strongest as fast as I can and escape from this disgusting country! And so, while I was building my strength, I happened to meet the demon king’s son, Leo. He wasn’t arrogant like his father, but he was pitifully living in captivity. So, I took care of him in secret. “Asha, you cannot get engaged to anyone.” “…Huh? Why?” “Because I’ll take responsibility for you forever.” “What?!” “We spent the night together.” …What is this prince saying? A father and holy knight who had (?) a forbidden love. Along with an enemy prince who is trying (!) to have a forbidden love. With them, can the unfortunate princess change her fate?"]},{"title":"Leaving for My Younger Husband’s Future: A Divorce Decision","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Leaving for My Younger Husband’s Future: A Divorce Decision / Toshika Otto no Mirai no Tame ni, Rikonjou o Oite Dete Ittakekka / 年下夫の未来のために、離婚状を置いて出ていった結果","[1st Piccoma Novel Awards – Annual Excellent Work Award: Reader Jury Award] The work that gathered enthusiastic support from readers is now being adapted into MANGATOON! In order to save the character I was rooting for, Alex, I decided to marry Yzabel, who was supposed to be a childhood friend of Alex. In our married life, Yzabel was treated as a family member, while Alex, who had been bullied by his family, was the one I focused my love on. After three years, I made a promise to Alex to ‘make it easier for you,’ but it was a secret that Yzabel held, and it was Alex who was left behind. The secret was erased from my memory, and I lost the memory of my beloved wife, so I had to choose a different path. However, the two of us achieved a reunion after eight years of separation. But what about Alex, who is said to be a cold-hearted person? …! I can’t believe it’s so different from what I imagined…! This is a love story of a jaded young man.”"]},{"title":"No More Regrets, Just Kill Me","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance","Villainess"],"disc":["Read manhwa No More Regrets, Just Kill Me / 後悔はいいから殺してください / koukai wa ii kara koroshite kudasai","Tsukishiro Yuina, a singer who lost her voice in a traffic accident, felt hopeless. In her despair, Yuina chose to end her life, but when she opened her eyes, she found herself in the world of a novel she had read before her death, The Saint Who Abandons Her Status. She had possessed the body of the novel’s villainess, Ariadeline. To make matters worse, it was at the point where the main protagonists were already married, and Ariadeline had been condemned. Even in the world of the novel, her miserable situation didn’t improve. Yuina (now Ariadeline) decided to take her own life again, but this time she was stopped by her former husband, Carlothian. “I don’t want you to die.” Even though he was the one who killed her in the original story, Carlothian repeatedly interfered with Ariadeline’s attempts to end her life. “Why won’t you kill me like you did in the original story…?” Thus begins the tale of the villainess who lost her dream, Ariadeline, and her tsundere former husband, Carlothian, as they attempt to redo their misunderstood love story."]},{"title":"The World’s Best Engineer","tags":["Action","Adventure","Martial Arts"],"disc":["Read manhwa The World’s Best Engineer / The Greatest Estate Designer / The Greatest Estate Developer; 역대급 영지 설계사; The Greatest Estate Designer; 史上最高の領地設計士;  史诗级领地设计师; Система всемогущего дизайнера; 史詩級領地設計師","When civil engineering student Suho Kim falls asleep reading a fantasy novel, he wakes up as a character in the book! Suho is now in the body of Lloyd Frontera, a lazy noble who loves to drink, and whose family is in a mountain of debt. Using his engineering knowledge, Suho designs inventions to avert the terrible future that lies in wait for him. With the help of a giant hamster, a knight, and the world’s magic, can Suho dig his new family out of debt and build a better future?"]},{"title":"A Night Soaked With You","tags":["Drama","Fantasy"],"disc":["Read manhwa A Night Soaked With You","Nameless actress Kim Young-won.\nThe role she had desperately wanted was snatched away by an old rival,\nbacked by the power of a wealthy sponsor.","Determined not to let it go, Young-won follows her and encounters a man known as the ‘sponsor.’\nIn a fit of anger, she impulsively kisses him.","However, this man is not the ‘sponsor’ she thought.\nIn fact, he is someone much more terrifying."]},{"title":"Second Life of a Trash Princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Second Life of a Trash Princess / Crowning a Spoiled Prince / 망나니의 누님이시다 / You are Mannai’s sister / She’s a Nerd’s Sister / She’s the Sister of a Maniac","The one and only princess of the Elias Empire, Regina B. Alfare.\nIn the rebellion of her fiancée, the Duke of Seulvei,\nshe lost all her people and her empire, and fought with the sword until the moment of her death.\nShe eventually threw her own life away, but when she woke up, she had returned to a time when everyone was unharmed.","The beginning of the collapse of the empire was\nthe awakening of Theor, the only fool in the imperial family.","After a series of accidents, he suddenly became a protector from a maniac, so the\nempire began to play in the hands of traitors.\nTo prevent the same thing from happening again, we must stop Theor from becoming a Hogu!","But that doesn’t mean I can’t leave him as an incompetent idiot.\nI have no choice but to help him grow into a full-fledged fool so he can become a full-fledged next emperor.\nIn order to do that, it is necessary to prevent the early death of the current emperor, and\nalso to turn the gaze of the nobles who valued themselves above his younger brother.","So what? I have no choice but to become a more idiot than Theor!"]},{"title":"I’m a Worthless Stepmother, But I Love My Family Madly!","tags":["Drama","Fantasy","Romance"],"disc":["Read manga I’m a Worthless Stepmother, But I Love My Family Madly!","Elsa grew up in a family devoid of love and warmth, leaving her neglected and uneducated, branded as useless by those around her. However, destiny has a surprising twist in store. She receives a decree from the Emperor, commanding her to marry the formidable Duke Rolf Eiberg, a man renowned for his prowess on the battlefield and whispered about in the shadows for his cruelty, earning him the ominous title of “war maniac.” Contrary to the expectations of those around her, Elsa views this marriage as a chance to change her life and find happiness. But upon arriving at the Duke’s grand residence, she is shocked to find that her groom is absent. Instead, she encounters his two sons: the fiery Wilbert and the enigmatic Hugh, both unaware of their father’s impending marriage. What follows is Elsa’s arduous journey into a family cloaked in secrets, where every heart is ensnared by the barbed wire of detachment and mistrust. Can she uncover the truths hidden within these walls and cultivate love in a place overshadowed by the past?"]},{"title":"Dear Villainous Husband , the One to be Obsessed with is Over There","tags":["Comedy","Drama","Fantasy","Manhwa","Mature","Romance","Tragedy"],"disc":["Read manhwa Dear Villainous Husband , the One to be Obsessed with is Over There / The Person Who Is Obsessed With the Villain Husband Is Over There / Villainous Husband, the One You’re Obsessed With Is Over There / 악역 남편님 집착할 분은 저쪽인데요 / 악역 남편님, 집착할 분은 저쪽인데요","I’ve transmigrated into the body of the wife of the mad villain emperor in an angsty novel!How will I escape? By running away quietly when the saintess he’ll become obsessed with appears. This love-blind emperor won’t even remember that I exist once he lays eyes on the saintess! I really didn’t do anything. All I did was lay as low as I could so that I wouldn’t get on my crazy husband’s nerves…. But the villain emperor has asked me to return to the palace with him, and not the saintess. But she’s already here! Why are you obessessing over me?"]},{"title":"My School Life Pretending To Be a Worthless Person","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Shounen"],"disc":["Read manhwa My School Life Pretending To Be a Worthless Person / 폐급인 척했던 학교생활 manhwa,\nMankind discovered the essence of the human soul, Edeya, and were achieving materialization.\nSociety was built around Edeya, which was invulnerable to conventional weapons. Humanity started to place all their focus into the combat power of Edeya.\nPark Jinsong, the main character, possessed an F-rank soul and F-rank combat power. After the introduction of a poor military program to his high school and the Edeya rank system, Park Jinsong became one of the weak, and suffered under his peers’ contempt for 10 years…\nHowever, in reality, the Edeya he had awakened was actually the S-rank “Absolute Killing Intent”.\nPark Jinsong was greatly disturbed by the fact that the essence of his soul revolved around the thought of killing others, and continued to live his life while thinking of himself as a worthless F-rank.\nWill Park Jinsong, with a soul for killing, be able to get his killing intent under control and prove that there are no ranks to one’s soul?"]},{"title":"The War Lord and His Fake Bride (Official)","tags":["Drama","Fantasy","Romance"],"disc":["Read  manga The War Lord and His Fake Bride (Official)","“I’ve come to get my wife.” On the day of the wedding, the groom, Koumei Oh, showed up soaked in blood. The bride, Meirin, couldn’t hide her horror at the sight. The Oh family, a military family, has been cursed to die by the age of 30 due to their violent acts in battle. In this age, doctors have lost their position in society and the Xian have been entrusted to save people. The emperor, hearing rumors that “those who make a vow with a Xian and produce descendants shall never perish,” arranged for Koumei to marry Meirin, a Xian. However, Meirin doesn’t actually possess the powers of the Xian and is marrying Koumei in place of her older sister, Shenrin. Meirin fears she may be killed if this lie is discovered, but Koumei turns out to be different from the rumors, and Meirin begins to fall in love… Published by Comicle Original…"]},{"title":"I Raised My Husband Wrong","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Raised My Husband Wrong / 夫の育て方を間違えました / 남편을 잘못 키워 버렸다\nFrom a young age, Levertisha, who was thirsty for blood on the battlefield, was called by many names, like “Bloodthirsty Killer” and “Mad Dog of the Battlefield.” After the war ended, she received a marriage proposal from a duke, but the person was… “Who are you? Go away.” How could my marriage partner be a child?! After going through the twists and turns of events, she still ended up getting married, but during a mission, she found herself trapped in an unknown space, and, when she finally got out, 10 years had already passed. But… “Now stay with me, Letty.” Where did my baby-like little husband go, and why is my grown husband obsessed over me?!"]},{"title":"Adored By The Beast That Killed The King","tags":["Drama","Fantasy","Historical","Manga","Romance"],"disc":["Read manga Adored By The Beast That Killed The King","Lilia, the legitimate heir of the Count’s family, was oppressed by her stepmother after her father’s death and she’s been courted by her stepbrother. From the birth, Lilia possesses a special ability to communicate with animals. And her knly solace is to escaping to the forest and seeing the animals she loved whenever life became difficult. One day, she encounters a beautiful man who is injured in the forest. He turns out to be Cain, the first prince of the country who has been accused of the crime for murdering the king. Cain, a man with the arrogance and ferocity of a beast, and Lilia, with her strong and gentle heart, are drawn to each other."]},{"title":"When the Black Wolf Calls Me","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Supernatural"],"disc":["Read manhwa When the Black Wolf Calls Me / 검은 늑대가 나를 부르면","You can’t make me your possession. The one who can kill me is not you, but myself.” I took my own life in front of my ex-husband who massacred my family, but regressed once again. To get off the influence of my ex-husband Hyo Jo’s obsession, and keep me and my family safe… I intend to give myself to another man. “Hwita, I will become your woman!"]},{"title":"The Symbiotic Relationship Between the Rabbit and the Black Panther","tags":["Action","Adventure","Animal","Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Supernatural"],"disc":["Read manhwa The Symbiotic Relationship Between A Rabbit And A Black Panther / Symbiotic Relationship Between Rabbit And Black Panther / 토끼와 흑표범의 공생 관계 / Little Rabbit and the Big Bad Leopard\nI was a rabbit shapeshifter who couldn’t even transform into a human by my coming of age ceremony.\nMy family said that I was just a half and placed me in a basket…\n“You’re crying? Go on, cry more.”\nI was then picked up by a black panther with a mean personality.\n“You’re lacking in stamina. I’ll eat you the day after tomorrow, so keep trying.”\nThis fierce beast.\nStaring at my trembling face, the black panther’s eyes glistened.\n“Seems like I just felt thrilled.”\nMom, I think he’s crazy!\nTo survive a fairly crazy black panther.\n“The wild beasts are possessive, no matter what it is.”\n….Is it possible?"]},{"title":"I’m the Villainous Male Lead’s Terminally Ill Aunt","tags":["Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa I’m the Villainous Male Lead’s Terminally Ill Aunt / I Am the Nanny of the Villain / I am the Terminally Ill Nanny of the Dark Male Lead / 흑막 남주의 시한부 유모입니다"]},{"title":"Raising the Princess to Overcome Death","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Raising the Princess to Overcome Death, Raising the Princess After Her Death, A Princess Is Raised After Death, The Princess Is Raised After She Dies, 正規エンディングまで異世界ループ転生, 공주는 죽어서 키운다","The long-term public service exam candidate, Minseo, finds himself trapped in the game, “Raising Lena” as he tries to escape his grim reality. In the game, Minseo becomes a character named Leo, and he must navigate through a world with three different scenarios to accomplish his mission of turning the protagonist, Lena, into a princess. However, the game “Raising Lena” boasts an overwhelming level of difficulty due to enemies who are set to thwart Minseo with their immense power and influence. Will Minseo be able to complete the game by making Lena a princess and return to reality?"]},{"title":"Devil’s Wish","tags":["Adult","Comedy","Demons","Drama","Fantasy","Magic","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Devil’s Wish / The Devil’s Wish / 惡魔的願望 / 악마의 소원","One day, Seo Doyah, a demon, has a strange dream. And on that same day, he meets So Won, who is a freshman at his school. Unlike Doyah’s heart, his body reacts strangely when he brushes against her. On the other hand, So Won attends the freshman welcome party and receives an invitation to the house of Woo Jaehyun, a popular actor in the Theater and Film department… As Seo Doyah and Woo Jaehyun keep on getting entangled, will So Won be able to have a peaceful school life?"]},{"title":"I Quit Being The Male Lead’s Rival","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Quit Being The Male Lead’s Rival","One day, as usual, Annabelle remembered the memories of her previous life. It was revealed that she has been reincarnated as the second most popular character in a novel. She also did all kinds of bad things to the male lead, and in the end, she is the person who will end up in prison! ‘In the end, I’ll get caught. It’s crazy!’ Anabelle begins to save Ian from danger by intercepting the conspiracies that were laid out one by one to prevent her impending doom. But in the process, she caught the attention of some unexpected people… “Oh my, that’s the spirit of chivalry our family pursues! I like that a lot!” Ian’s mother’s eyes began to sparkle at her. “Would you like to be my partner to the opera?” After saving Ian, the prince keeps flirting… “Ian, I’ve decided to quit being your rival and live a new life.” “A new life?” “To stop paying attention to a man like you who’s always up and down, marry a man with no character, and live a normal life.” “Who’s the opponent? And why am I up and down?” The male lead, Ian, keeps obsessing over me for some reason. “Why do you not talk harshly to me these days…? Do it again.” Everyone just seems to be a little weird!"]},{"title":"High school queen","tags":["Action","Drama","Fantasy","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa High school queen / 여고생왕후","Kim Cheong-ha, a legendary swordswoman and the Queen of Joseon, meets a tragic end in a palace conspiracy. Reborn as Park Da-jin, a high school student tormented by bullies, she channels her royal spirit into a fierce counterattack. With centuries of wisdom and unmatched skill, she’s ready to deliver justice."]},{"title":"Asura","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Asura","The commander who was sent to discover the secret of immortality by the absolute ruler who first unified the continent never returned. The ruler believed he would find the secret no matter what corner of the world he had to search. But by the time the ruler died and the empire fell, he never came back, leaving only countless speculations. Eventually, he was gradually forgotten in the memories of people. And after a long time passed…"]}]