[{"title":"The Guidebook for Villainesses","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Guidebook for Villainesses / The Guidebook for Wicked Women / 악녀들을 위한 안내서","Laviore Bailey—the ‘fake saintess’ who banished the innocent princess and stirred up bad blood to wage war.","She’s the villainess with a façade of a saintess.","“I love you. So just shut your mouth and die. Okay?”","But the moment her trusted lover chose her as a sacrifice to the demon, and she realized her father was behind the plan, she killed herself by swallowing poison.","It hurt. It was so painful that she could not even scream. But it was fine. Because she knew this was not the end.","“I will save you this time.”","Then, she came back for her second life. She was determined to rescue those who were unlucky because of her and restored her life back.","“You do whatever you want for the man in your dream.”","Demian said with a rough smile.","“Read at kaiscans.com to support us!”","“I’ll also protect you the way I want to.”"]},{"title":"Once Married","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Once Married / First Comes Marriage / Let’s Get Married First (Yeon Seo Nah) / Let’s Start With Marriage (Yeon Seo Nah) / Una vez casados / Начнем с брака / วิวาห์แลกรัก / 怪物公爵との結婚 / 怪物公爵好像很宠我？ / 일단 결혼부터","Always gloomy weather, infested with criminals, and depression is the norm –\nthe cursed land where the sun never rises, the East.\nAnd the monster that rules there, Duke Eckard.","Hedel, who was on the brink of marrying her cousin, gets a proposal from the Duke of Monsters.\nEveryone opposes it, but Hedel has no choice but to accept the duke’s proposal… … .","“This is the first time I’ve eaten food like this!”\n“I can always see the sun after my mother came… … !”\n“The East can no longer live without Madame.”","Did you tame the people of the East better than you thought?","Starting with marriage, Hedel’s story of occupying the East.","***","“Then you did a good job?!”","Thunder thundered behind his back with Hedel’s shout.\nThe clear sky suddenly darkened, and suddenly it rained heavily.","“… … .”","Confused, Cassian looked at Hedel without saying anything.\nBefore he could catch him, Hedel immediately left the study.","(Read the lastest chapter on harimanga)","After a while, a harsh knock was heard.\nWondering if it was Hedel, Cassian quickly ran to the door and opened it.\nThen the servants, including the butler, came pouring in.","“What the hell did you say that made your madam angry?”\n“The weather was really nice today… … !”","They all shouted together.","“Please tell the devil that you are wrong!”","Cassian sighed.\nAfter Hedel got married, it was Cassian’s responsibility for raining in the east."]},{"title":"Hawar Of The Winter Garden","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Charlemann’s fourth princess, Canola F. Incana Charlemann.","She was expelled from Charlemann because of her brother’s fight for the throne, and she was informed that she should marry the only son of the monarch of Tripol, whom she knows neither face nor name.","The road on the way to Tripol over the rugged winter mountains for a wedding. She meets Ethel, the heir of Tripol, her bethrothed, her husband-to-be…","“Princess, hurry and greet him…”","Canola didn’t answer the reminder, just staring straight ahead.","Canola, who was blinking her eyes and making such a s*upid expression, covered her mouth with her hand and turned around.","“I think I’m in love.”","Such a pure and pretty man! She can’t help but love him!","*","“A man who cannot protect his companion cannot become a Tripol warrior. We are… We still have a long way to go to become an official couple, but it is my job to protect you.”","When Ethel had finished talking, he drove the beast he was riding and drove it far ahead.","Canola, who had been staring at the back of his head, slowly returned into the carriage.","There was a red blush on her face.","“See? Did you see? Look. Aren’t you in love with him?”","I think they are interpreting the meaning of my words with a very distorted view."]},{"title":"The East Wind of the Altas","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read The East Wind of the Altas / 알타스의 동풍-후작 부인 스캔들","The people of Genevu always pay their debts. So when peasant girl Claire throws herself under Marquess Balt Morenheitz’s favorite horse, forcing him to kill the animal to save her life, she must repay him by spending a night in his bed. But Balt isn’t satisfied with just one night and moves Claire and her family to live at his palace so that she can “service” him whenever he pleases. However, Claire may end up paying Balt back more than he could’ve imagined… because Claire isn’t quite the simple peasant girl she appears to be. As Balt becomes increasingly embroiled in the empire’s political mayhem, Claire’s true identity will become a deciding factor in his success, or else a catalyst for his downfall. Whichever it may be, Claire will be sure to repay her debt before she leaves!"]},{"title":"I’ll Twist The Neck of a Sweet Dog","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I’ll Twist The Neck of a Sweet Dog / 다정한 개새끼의 목을 비틀겠습니다\nChloe Garnetsch, who gave everything for the man she loved, but eventually died miserably.\nFoolish Chloe realized too late.\nShe was a bait for a man to throw at the emperor, and a man was a beautiful son of a bitch disguised as tenderness.\n“I like you uncle.”\nSeventeen I was just as young and immature as I could not hide my growing heart.\n“I’ve been in love, for a long time.”\nMy body shuddered at the sight of me looking over my body with my chin on my back, but I plucked up the courage and took a step closer to him.\n“Love. You’re already that old.”\nHis fingertips swept down my face. (Manhwa translated by hari manga team)\nDespite the unexpected confession, he was overly relaxed and adept.\n“I like you too, Chloe. I’m in love.\nHow can I not be pleased with you, who will bring me your brother’s neck in the future.””\nThe man I was in love with was so sweet that he was even crueler.\n“Give birth to the Emperor’s child.”\n* * *\nWhen I opened my eyes again, he looked down at me with a pale face.\nA man who trampled on my love and destroyed me."]},{"title":"Nulliitas: The Half-Blood Royalty","tags":["Drama","Fantasy","MANGA","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Nulliitas: The Half-Blood Royalty","Dreaming to be a knight, an unnamed girl who grew up as a boy. In fact, she was actually the illegitimate child of Count Romagnolo, who she worked under as a servant. Eventually, the Count found out her existence, and she was sent as a replacement bride for her blood-related sister that the Count endeared more. So she was given the name “Núllǐtas”, and let’s see how her life changes onward."]},{"title":"The Villain Discovered My Identity","tags":["Crossdressing","Fantasy","Manhwa","Reincarnation","Romance","Time travel"],"disc":["Read manhwa The Villain Discovered My Identity, 악역에게 정체를 들켜버렸다 Caught by the Villain on manhwaclan\nAlthough she had been a promising practitioner of kendo in the past, due to an accident she was forced to lead a plain life. After Seo Yuri gets into a car accident during a trip back home, she reincarnates into the novel, “The Song of the Moon,” and becomes the elder twin sister of a side character who meets a destructive ending- Selena. Selena hopes to prevent the destruction of her family, however, she is forced to take the place of her runaway brother, Celestine, in the knights’ squadron! Will she be able to avoid the villainous Crown Prince, Ignis, and survive?!"]},{"title":"Taeju’s Brother, Taehee","tags":["Manhwa","Romance"],"disc":["Read manhwa Taeju’s Brother, Taehee / Adik Tae Ju / Tae-Joo’s Younger Brother, Tae-Hee / Taeju’s Brother / The Younger Brother of My Best Friend / ともだちの弟 / 태주 동생 태희","With her wedding ruined by the groom’s secret girlfriend barging in, Kangwoo crashes at her best friend Taeju’s place, not expecting to run into her little brother Taehee in the morning. Despite their awkward first encounter, Kangwoo finds him to be perfect little brother material. But after he protects her from her obsessive ex’s harassment, she sees him in a different light. He’s tall and good-looking, he’s a great cook, he’s funny, he’s sweet… Wait, has Kangwoo already fallen for Taehee?!"]},{"title":"Long-awaited Feelings","tags":["Adaptation","Drama","Romance","Shoujo","Shoujo Ai","Time travel"],"disc":["Read manga Long-awaited Feelings"]},{"title":"The Male Lead’s Handsomeness Is a Big Problem","tags":["Manhwa","Romance"],"disc":["Read manhwa The Male Lead’s Handsomeness Is a Big Problem"]},{"title":"I am the Precious Daughter of the Greatest Villain in the Fantasy World","tags":["Fantasy","Historical","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manga I Am The Precious Daughter Of The Greatest Villain In The Fantasy World / Precious Daughter of the Greatest Martial Arts Villain / I Am the Precious Daughter of the Greatest Villain in a Martial Arts Novel / La preciosa hija del villano más grande del mundo de las artes marciales / 무협지 최고 악당의 귀한 딸입니다","I thought I was reincarnated as the daughter of a wealthy family, but it turns out I was born as the child of the greatest villain in the fantasy world of martial arts. My father doesn’t care about me, I’m ostracized by the others, and I’ll eventually be murdered as a side antagonist by the male lead, after suffering from my one-sided love. Even worse, this is a world where the weak are the prey of the strong, conceited antagonists. So, before it’s late, I need to learn martial arts and escape! However, there was a fatal flaw in my plan… Because of my notorious father, there were too many people who sought to end my life. “Wahhh! Dadda! (Daddy!)” …Will I ever be able to escape safely? [One-shot Promo Manhwa for the Novel]\nPrecious Daughter of the Greatest Villain in a Martial Arts Novel"]},{"title":"There’s A Rat In Our House","tags":["Adaptation","Drama","Ecchi","Josei","Manhwa","Mature","Psychological","Romance","Seinen","Webtoons"],"disc":["Read manga There’s A Rat In Our House / 우리 집에는 쥐가 있다","Amidst the freezing winter, a solitary being huddled on the snow-covered pavement, bearing the burden of deep loneliness and faded scars. It had forsaken itself, fragile and vulnerable. The reason for welcoming this nameless creature into the home was straightforward. “What… does this mean?” “You helped me, and I wish to return the favor.” In the complete darkness where no trace of light could penetrate, only two warm bodies occupied the space."]},{"title":"I Want to Live a Good Life","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Want to Live a Good Life / 착하게 살고 싶었답니다","The best in the world, excellent martial arts, overflowing money and pleasure—-the center of the magical world, Black Astronomy. Kang Hee-ran, the granddaughter of the owner of Heukcheonmun, lives a life that has nothing to lack and nothing to be envied of, but dies at the hands of her stepmother. And for some reason, Heeran reverted to her younger self! In the life that started again, she goes down quietly and kindly with her warm nanny. The first step of revenge begins with making the third Confucius, Kang Lun, the king of the underworld who will soon rule Black Astronomy, into a man of Heiran…!! I was trying to live…"]},{"title":"Primal Hunter","tags":["Action","Adventure","Fantasy"],"disc":["Read Primal Hunter","Jake, a seemingly average office worker, unexpectedly finds himself thrust into a fantasy world teeming with dangers and opportunities. Rather than succumbing to fear, Jake thrives in this unfamiliar realm. As he navigates the expansive multiverse, his power grows and he transforms—evolving from a mundane office worker into a true apex hunter."]},{"title":"Elegant Desire","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa Elegant Desire / Elegant Desire / 우아한 욕망","An open hotel elevator on a late night. In it, stood my longtime first love and a middle-aged woman. I had dreamt of a romantic encounter with him, but all I felt now was betrayal. My first love had become a plaything for a wealthy, married middle-aged woman. My first love is not the kind of guy to commit adultery with some older married lady. My first love. I made up my mind to make him mine."," "]},{"title":"Maxed Out Leveling","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Maxed Out Leveling / Leveling Beyond the Max (Official) / EXCEEDING MAX LEVEL / Level up From Max Level /カンストからのレベルア","After a car crash mysteriously transports him to a land of martial arts, Cha Shinhyun trains for 140 years and becomes the strongest being in Murim. But when he returns to Earth, it’s nothing like he remembers. Though he is finally reunited with his sister, the home he once knew is now filled with people called “hunters” who defeat monsters to level up their powers in a constant race for survival. Now he must start back at level 1 and work to exact revenge on the person who altered his fate!"]},{"title":"Noah’s Contract: I’m an NPC in Another World","tags":["Action","Adventure","Fantasy"],"disc":["Read Noah’s Contract: I’m an NPC in Another World  / 我在异世界当NPC","Players, this is a continent overrun by monsters. Danger lurks everywhere, so please make full use of your talents and help us eliminate the monster army.\nWhat? You ask who I am? I’m just a NPC."]},{"title":"From Goblin to Goblin God","tags":["Action","Adventure","Fantasy"],"disc":["Read From Goblin to Goblin God","Lin Tian reincarnated as a goblin, the lowest rank of magical creatures, and initially, he had to lie low. Later, he fully unleashed the true nature of a goblin. Blessed with many offspring, the more children he has, the stronger he becomes thanks to the blessings from the gods!"," "]},{"title":"The Castle: Ghost-eyed Bride","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Castle: Ghost-eyed Bride / 더 캐슬 귀안의 신부","",""]},{"title":"I’m the Main Character’s Little Sister","tags":["Comedy","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read I’m the Protagonist’s Younger Sister / She’s the Protagonist’s Sister / My Brothers, the Protagonists / 주인공의 여동생이다","Until recently, I had three wishes that I could only hope to come true.\n‘Please let my missing oldest brother come back.’\n‘Please let my Second Brother awaken so he could stop working as a rift porter.’\n‘And my youngest brother…As long as he can open his eyes…’\nThere’s nothing I wanted but happiness… was what I thought…!\n“Keuhk…I’ll only play for 10 years so I can keep the darkness inside me, so work a little harder, youngest!”\nMy oldest brother spoke as though he were still in his adolescence.\n“Since hyung is playing for 10 years, I’ll also play for 10 years, too!”\nMy second brother who returned as an awakener from the future (as he claims to be) said.\n“You foolish pig, I’ll give you an opportunity to serve this noble soul.”\nMy Third brother… let’s just move on since it makes my head ache just by thinking about him.\n“You unemployed parasites! Why can’t you all go out and find jobs?!”\nCan the future of Lee Bobae, a girl with nothing more to wish for, be full of happiness?"]}]