[{"title":"I Tamed My Ex-Husband’s Mad Dog","tags":["Action","Adventure","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Tamed My Ex-Husband’s Mad Dog / I Tamed My Ex–Husband‘s Crazy Dog / 전남편의 미친개를 길들였다"]},{"title":"Regenerate Top Players","tags":["Action","Adventure","Fantasy"],"disc":["Read Regenerate Top Players / Apex Gamer Returns / 重燃吧，T0级玩家! / Rekindle, T0-level Player / 重燃吧T0级玩家！","“Bai Qi”, an unknown game anchor, is about to reach the pinnacle of his life when he accidentally dies while streaming a game called “Soul Throne”. Unexpectedly, he is reborn into the world of this high-difficulty action game. With his “T0-Level” game skills from his previous life and the blessing of the system’s “100 Full-Achieved Max-Level Accounts”, can Bai Qi ascend to the throne once again and become the one and only king of that world?"]},{"title":"Max Level Player","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Max Level Player, Max Talent Player, Talented Player, 만렙 플레이어, The Maxed-out Player","The virtual reality game, Olympus. A means to support reality after all the knowledge and records accumulated by mankind had disappeared overnight. ‘My real life starts now!’ Absolute evil appears in such a world!"]},{"title":"Regressor of the Fallen family","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Regressor of the Fallen family / Regressor of the Fallen family / A Flame Reborn / 멸망한 가문의 회귀자 / Returner of a Ruined Family\nA life filled with regrets.\nOnce he realized his faults and decided to lead a new life, it was too late. His family was already gone.\nHe had borne through each day with pure rage. Finally at the end of his misery, his wish reached the heavens—an unforgiven one.\nHe goes against fate to raise his sword."]},{"title":"I stole the child of my war-mad husband","tags":["Drama","Fantasy","Historical","Isekai","Loli","Manhwa","Romance"],"disc":["Read manhwa I stole the child of my war-mad husband / My Warmonger Husband / I Took My Warmonger Husband’s Child / 전쟁광 남편의 아이를 빼돌렸다 / I Stole the Child of My War-Mad Husband","He’s a warmonger, people call him ‘demon’, a nickname filled with awe and fear, and I, reincarnated as the harlequin male lead’s wife.","If there’s a problem, it’s that in the original works, right as it starts, she, together with her blood-related daughter were murdered as the ‘Wicked Previous Wife’!","My daughter that’s slated to die with me is a 5-years-old kid who’s boundlessly cute, and my husband is good-looking but scary.","I tried various things to fix my bad-personality husband. But I think for me, the one who isn’t the female lead, fixing him is impossible…","OK! First, I’m going to take my daughter and run away. Then after that, let’s think about the future."]},{"title":"A 0.0000001% Demon King","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa A 0.0000001% Demon King","The 72 Demon Kings, who received the order to destroy the earth, each went through a trial by the Great Demon King Astrea. Those who passed the trial earned the title of Demon King, and each Demon King was granted special powers by the Great Demon King. So far, each Demon King had been granted extraordinary abilities. When Karos became a Demon King, he received a power from the Great Demon King, but… “Great Demon King, no matter how much I think about it, there is a problem with my power.” “Problem?” Among the Demon Kings with extraordinary abilities… Karos received the “Gacha” ability. “Gacha as the power of a Demon King? How am I supposed to rule the world with Gacha?!’”"]},{"title":"The Real Daughter, She Is an Almighty Boss","tags":["Drama","Fantasy","Harem","Romance"],"disc":["Read The Real Daughter, She Is an Almighty Boss / Zhen Qianjin Ta Shi Quanneng Da Lao / 真千金她是全能大佬"]},{"title":"The Empress’s Beast Selection","tags":["Animal","Drama","Fantasy","Manhwa","Romance","Royal family","Villainess"],"disc":["Read manhwa The Empress’s Beast Selection / 황후의 짐승간택","The only human empress in the Human Beast Empire, Sephia continues her dry marriage with the Emperor, Demios. However, a woman named Titi appears one day, claiming she has the Emperor’s name engraved to her! as Sephia watched the emperor fall for titi, she fell into despair. Then Roxanne, a war hero appeared. A love triangle romance filled with the scent of two wolves competing for Sephia!"]},{"title":"Let’s Live Together","tags":["Adaptation","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Let’s Live Together / We Live Together / 私たち一緒に暮らしましょう / 우리 같이 살아요"]},{"title":"Trapped By The Crazy Twins","tags":["Mature","Romance"],"disc":["Read manga Trapped By The Crazy Twins","I am “kept” by the mad love of these twins. What is the sweet ending to this twisted form of love…? When Hokuto Yonaga turned five, her father took her to the Fudou Zaibatsu mansion. There they met the heirs to the Fudou family, the beautiful identical twins Tsuzuri and Katari. For thirteen years since her father sold her to them as a plaything, Yonaga has been at the mercy of the whimsical and sadistic twins, who are the complete opposite of their beautiful appearance. She secretly harboured feelings of hatred towards the twins who had ruined her life. However, when the three of them start living together on the occasion of entering university, the relationship between Tsuzuri and Katari over Yonaga gradually begins to unravel. Then one day, a man called Yagami appears in front of Yonaga… A forbidden love-hate story full of beautiful madness begins here."]},{"title":"There’s No Such Thing as a Bad Hero in the World","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa There’s No Such Thing as a Bad Hero in the World / There Are No Bad Heroes In This World / 세상에 나쁜 용사는 없다","“A man once called the strongest in the world.","The heavyweight champion of the world’s largest martial arts league.","Choi Hyun-seok, who was once the mightiest man, begins a new life as a hero in another world after his death.","‘A hero who monopolizes wealth, fame, and beautiful women!’","Dreaming of a glorious future, he arrives in the other world, only to encounter a monstrous beast with a head one size larger than his own.","The monster, a high-ranking officer of the Demon King’s army, asked:","‘Hero? Are you the so-called hero?’","‘Uh… I guess I’m the hero…?’","And so, hell began.”"]},{"title":"Murim Login","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Murim Login / Log-In Murim / ログイン武林 / 登录武林系统 / 로그인 무림 / 로그인무림","An era where hunters thrive on hunting monsters that come from Gates. Jin Tae-Kyung is a low-rank hunter who picks up a VR machine and accidentally logs into the game, which is set in the world of Martial Arts.\nAfter many ups and downs, Tae-Kyung is able to escape this world. The strength and skills, which he received in the Murim were able to be carried over back to the real world. This allows him to continue making a living a hunter. But he decides to return back to the world of Murim, out of care for his NPC friends."]},{"title":"The Purpose of Marriage","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Purpose of Marriage / 결혼의 목적","Yoon Seol-young faces a harsh reality: a cheating boyfriend of three years, a forced blind date with a divorced man ten years her senior, and the burden of financially supporting her suffocating family. Just when she wishes to escape her stifling life, Ki Tae-hwan, the executive director of Shinhwa Group, rumored to be gay due to his excessively clean private life, approaches her with a proposal: “Let’s get married. I’ll take you to a higher place.” Overnight, Seol-young goes from being the secretary in the executive director’s office to becoming his daughter-in-law. But what is the true purpose behind Tae-hwan’s marriage proposal?"]},{"title":"Without the Male Lead, My Grades Will Fall","tags":["Romance"],"disc":["Read Without the Male Lead, My Grades Will Fall / My Grades Will Fall if There’s No Male Lead / 남주가 없으면 내 성적이 망한다","The protagonist, Han Jiseo, finds herself unexpectedly reincarnated into a shoujo manga as an extra character, a perennial second-place student with no real impact on the plot. The twist? She’s stuck in the world of a high school shoujo manga, and despite her status as a background character, she has no major worries and gets through each day carefree—until she fails a surprise quiz. What makes it worse is that the top student, Joo Iwon, the male lead, is absent that day. Jiseo realizes that in order to get into a good university, she needs Iwon to stay in school and maintain his perfect attendance. The story follows her attempts to ensure the male lead attends school regularly, all while trying to navigate her own future and break out of her background character role.","This setup combines elements of school life, reincarnation, and shoujo tropes with the added pressure of needing to support the male lead for academic success. The stakes are high, as she tries to manipulate the narrative to ensure her own future while helping the male lead succeed!"]},{"title":"How To Reject My Obsessive Ex-Husband","tags":["Adaptation","Drama","Fantasy","Historical","Isekai","Romance","Shoujo"],"disc":["Read manhwa How To Reject My Obsessive Ex-Husband / 전남편의 집착을 거절하는 법","When Yu Seohyeon sacrificed her life to save her first love, Ciel de Leopart, she never expected to wake up as Irene de Closhe in a world straight out of a book. Amidst this bizarre twist, she reunites with Ciel, who has now become a supporting male lead destined to betray the crown prince. As her unique guide abilities resurface, Seohyeon is haunted by Ciel’s intense, madness-filled gaze, a stark contrast to the man she once knew. Tangled in a web of past love and new identities, Seohyeon must navigate a treacherous path where past and present collide."]},{"title":"I Become The Youngest Disciple of The Martial Arts Leader","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I Become The Youngest Disciple of The Martial Arts Leader","The strongest in the martial world, leader of the Hojeongdan, Lee Hwan!","During a mission, he battles the Heavenly Demon of the Demonic Sect, Deung Gwang-cheon, and loses consciousness…","When he opens his eyes, he’s at home? No… This is my childhood home?","It’s hard to believe, but if I really have returned to the past, this time I won’t just stand by and do nothing!","On the night of August 8th, when he was 17 years old,","a sudden, splitting headache strikes, and something comes to mind.","“Cheonsu Ilgi Hap (Thousand Hands One Energy Unification), Deukwon Gang (Obtain Original Strength)…”","He muttered absentmindedly and then paused.","“Wait, this is the Absolute Demonic Art of the Heavenly Demon! How do I know this technique? Am I going crazy?!”"]},{"title":"Demon Lord’s Martial Arts Ascension","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Demon Lord’s Martial Arts Ascension / Martial Demon King / The Demon Lord Levels Up With Martial Arts / レベルアップする魔王様 / 무공으로 레벨업하는 마왕님","“Demon Lord.” That’s… What they used to call me in my past life, before I became human."]},{"title":"The New Empress","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The New Empress / 새황후","The symbol of the Apollinerian Empire is none other than the ‘bird’!","There was a legend in the empire that held birds as sacred and worshiped…","[On the day the (Divine Bird), made of silver and gold descends to this land, the empire will have everlasting glory.]\nIt was a trust that came down from the distant past.","Each interpretation was different, but people waited for the ‘(Divine Bird)’ to come down to this land one day.","One peaceful day, hundreds of years later. A fist-sized “egg” from heaven descended onto this land."]},{"title":"I will escape from the flower of ordeal","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I will escape from the flower of ordeal / 시련의 꽃에서 탈출하겠다","I was exhausted from reading the script all night and fell asleep, but it was about a kimchi fight, a secret birth, and an amnesia. I suddenly possessed Cha Ye-ryun, the villainous girl from the drama ‘Flower of Ordeals’, which is full of all kinds of absurd situations. “I will protect you, Cha Ye-ryun.” “If I can’t go back to reality even after the drama ends, then I will be you.” Cha Ye-ryun only has one goal. Avoiding her unfortunate ending where she has to spend the rest of her life in prison. In this drama, for a happy ending for the heroine, Han Seo-ri, the villain, Cha Ye-ryun. Slowly the colors of this macabre drama will show its true colors… … . “who are you?” However, the condition of Park Eun-woo, the sub-male lead in the play, is suspicious. He, who should have sacrificed himself for the heroine Han Seo-ri, keeps hovering around Cha Ye-ryun… … . Will she be able to overcome the unfortunate ending and escape the Flower of Ordeal?"]},{"title":"Tears on a Withered Flower","tags":["Drama","Josei","Manhwa","Mature","Office Workers","Romance","Seinen"],"disc":["Read manhwa Tears on a Withered Flower / 시든 꽃에 눈물을 / AIR MATA DI ATAS BUNGA LAYU","Na Hae-soo’s life unravels when her husband betrays her with an affair, leaving her burdened with debt and losing their child. In a devastating blow, she witnesses him with a younger woman. Broken and despondent, Na Hae-soo feels her life crumbling around her. However, a mysterious young man unexpectedly enters her life, asking to be taught about adult love. His vulnerability and sincerity begin to stir emotions within Na Hae-soo, challenging her to reconsider her path forward."]}]