[{"title":"Taming Master","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Taming Master manhwa / 테이밍 마스터\nThe best-known VR game in the world, ‘Kaillan’. A certified game addict well known in the virtual world, Ian. Despite having a Level 93 Archer character in the top leaderboards of Kaillan, Ian decides to delete it despite everyone around him telling him not to. All to convert to a hidden class he obtained by chance. The class he chose is the most worthless class in Kaillan, the Summoner class. If he wants to avoid getting an F in college, he needs to level up to his previous level within two months… Kaillan is notorious for its very cruel leveling system, where it is said to take over a year to reach level 100. His struggles to reach level 93 in only two months unfold… Level quickly, thoroughly and persistently. The legend of the ‘Taming Master’ begins!"]},{"title":"Superhuman Battlefield","tags":["Action","Adventure"],"disc":["Read manhwa The Esper’s Game / 초인의 게임 / Superhuman Battlefield / Superman’s Game","Seo MoonYeob was the world’s greatest superhuman, who sacrificed himself after saving humanity.","Thought to have been dead, he returns 17 years later to a now-peaceful world,\nand the superhuman sport faces seismic change.","The story of a modern-fantasy sports-action starts now!"]},{"title":"Perfect Heroine Wants to Possess Me","tags":["Drama","Isekai","Romance","Shoujo Ai"],"disc":["Bái Yuèguāng Nǚ Zhǔ Zǒng Xiǎng Dúzhàn Wǒ / White Moonlight Female Host Always Wants to Monopolize Me / 白月光女主总想独占我 / Perfect Heroine Wants to Possess Me","Ji Xiao accidentally transmigrates into a novel and becomes the Alpha villain who shares the same name as her. To save her life from disaster, she treats the perfect Omega heroine with the upmost care. The heroine, Wei Qingyu, changes her own feelings towards her enemy when faced with her abrupt change of character. She’s even gradually starting to like this “enemy”? The perfect heroine is always trying to possess the female villain, but when will she notice that the other’s heart has already been moved?"," "]},{"title":"We Are Not Dating!","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa We Are Not Dating! / 우리 안 사귀어! / We’re not dating!","Why do you keep asking if we’re dating? We’re just holding hands, we’re not dating!!” It’s a slice-of-life romantic comedy about couples who aren’t really couples! Meet them every day!"]},{"title":"The Kind Older Sister Is No More","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga The Kind Older Sister Is No More / No More Nice Sis / There’s No Good Sister / There is No Good Sister / The Kind Older Sister Is No More / There Are No Good Sisters / 착한 언니는 없다 / No hay buenas hermanas / There’s No Good Sister","“Because I’m the big sister, I have to give in to you. Can’t you just forgive her?”\nFor her sick little sister, Riel. Irene was forced to live like a shadow, contributing to her sister’s prominence.\nIrene thought she would do anything for her family. Until her sister took it all from her.\n“Don’t call me sister. I’m not your older sister from now on.”\n“Are you talking to me now?”\n“Why didn’t Riel die for me? I gave up everything for Riel…”\nOne day, she realized that she didn’t even have a place in this house. The house where she could not receive a single love.\n“I don’t want to have any more regrets”\nAfter realizing his own situation, unfortunately, it was too late. Irene has begun to figure out how to be independent.\nIn front of her, Noel Christian, the grand duke was in a similar situation.\n***\n“Do you want to marry me?”\n“If necessary”\n“That’s disrespectful. If you want to be a duchess, then you should just give up.”\n“No need for power, no need for love. Just a formal marriage is enough”\nNoel looked at her quietly. A strange atmosphere suddenly appeared around her.\nThe clouds cleared and Irene’s eyes filled with light. Irene told him directly.\n“Maybe we’ll be able to save each other”"]},{"title":"To My Husband’s Mistress","tags":["Drama","Fantasy","Mature","Romance"],"disc":["Read manwha To My Husband’s Mistress / 내 남편의 정부에게","Leticia Violett is a woman that dedicated all her life to her husband, but after her husband asked for a divorce so he can get married to another woman, she decided to take her own life, however, just on the verge of death a man appears claiming that he will protect her and help her take revenge on those who were driving her to death. Where is this revenge and betrayal story going to take us?"," "]},{"title":"One Step Divine Fist","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa"],"disc":["Read manhwa One Step Divine Fist / 일보신권","Born as the son of a wealthy family, ‘Jang Geon’ was destined for ruin. To turn his fate around, he had to live a simple life under the guidance of a virtuous monk. Given to the frugal monk ‘Gyeongmok’ at Shaolin Temple, Jang Geon spent his days in rough cotton robes, barely getting by on plain rice… While enduring hunger and minimizing movement in his daily life, he stumbled upon martial arts and managed to apply his mindset of thrift to it…?"]},{"title":"Keep A Low Profile, Sect Leader","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts"],"disc":["Read manhwa Keep A Low Profile, Sect Leader,\nTraveling to the world of Tian Xuan, can’t believe I’ve become a useless sect’s leader! Paying money in the city to be reborn in a game’s realm. Making the players my workers, collecting the main characters from the world as my underlings. If we’re talking about being pretentious, then I’ll only take the number one spot!"]},{"title":"I have an SSS-rank Trait, but I want a Normal Life","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa I have an SSS-rank Trait but I want a Normal Life / SSS급 특성을 받았지만 적당히 살고 싶다\nEven though strange beings like monsters and constellations appeared, my personal philosophy did not change.\nBut with the sudden awakening and blessing of an SSS-rank trait, my peaceful life went bye-bye.\nI have no choice but to level up if I want to protect myself now!"]},{"title":"I Became A Level 999 Mastermind Demon King","tags":["Action","Adaptation","Demons","Drama","Fantasy","Isekai","Magic","Manhwa","Monster","Monsters","Romance"],"disc":["Read manhwa I Became A Level 999 Mastermind Demon King / I Became the Level 999 Demon King / レベル999黒幕公女になりました / 레벨 999 흑막 공녀가 되었다","I was reincarnated into the otome game, “In This World, With The Power of Love” not as the heroine, but as the Lv. 999 Demon King. I was cast out by my family and sent to the freezing north, but I wonder if I could just melt the snow with my magic? I’m trying to find a way to create a farm here and live a carefree life, but… the capture targets keep coming at me one after the other. Umm, I don’t really care about you guys, so won’t you please disappear already?"]},{"title":"My Dad Is Too Strong","tags":["Action","Adventure","Fantasy","Isekai","Manhwa","Martial Arts","Reincarnation"],"disc":["My Dad Is Too Strong manhwa, 아빠가 너무 강함\nLee Dojun was a desk worker for the government that was a part of the rift management team. One day, he got into an accident and woke up in the world of murim where he learned to fight and a single crucial skill. was a skill that he had gained when he first appeared in and it resurrect him a day before after his death. Through many years he rose to the top of the ranks becoming the strongest, but just like that, he blinked and came back to the world he was originally from. Dojun continued to go to work and live at his home, but the only thing that changed was gaining a daughter through his “Dad Contract”."]},{"title":"The akashic record which only i can read","tags":["Action","Adventure","Fantasy"],"disc":["Read manga The akashic record which only i can read / 俺だけ読めるアカシックレコード","“I, who know all the world’s secrets, will change this doomed future!”","In a world where dungeons exist, Yuya Shirasaki, an awakened warrior, risks his life to conquer them, aiming to earn enough for his ailing sister’s medical treatments. Yet, despite his efforts, his sister dies, and Yuya himself falls to the mightiest of monsters—or so it seems. In the instant before his death, Yuya awakens the forbidden skill, Akashic Record, allowing him not only to gain all knowledge but also to return ten years into the past.","With a second chance at life and armed with the wisdom of both past and future, Yuya sets out to rise at an unstoppable pace in this monster-filled world. “If it’s to save my sister—and this world—then I’ll become the strongest there is!”"," "]},{"title":"How to Make My Tyrant Husband Love Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How to Make My Tyrant Husband Love Me","The notorious Empress Belita, famed for her myriad romantic entanglements! Just when Belita is on the verge of being killed by her tyrant husband while attempting to elope with a prince from a neighboring kingdom, “I” becomes Belita. “I”–now Belita–narrowly escapes death and vows to cease her unfaithful behavior to dispel the emperor’s suspicions. Amidst a palace rife with numerous paramours, distrustful emperor, and the looming specter of war, can Belita survive?"]},{"title":"My Second First Marriage","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Second First Marriage / 유부녀지만 결혼은 처음입니다","Demia Lawrence, the daughter of a fallen baron, secretly marries her childhood friend Dyrtehen Romerby. But contrary to her expectations, her married life is filled with mental abuse from Dyrtehen and physical abuse from her mother-in-law. She becomes increasingly overdependent on Dyrtehen who, almost right after the wedding, leaves for the capital for business and doesn’t return for five years. Meanwhile, Demia discovers that her mother-in-law is plotting to assassinate her and flees from the Romerby House. After much hardship, she arrives at Evan Hasworth’s house, another childhood friend. But Evan, once a sweet boy, has grown to be a mature man seemingly hostile to her for reasons unknown … Will Demia successfully escape the claws of Romerby and resolve the misunderstandings with Evan?"]},{"title":"Our Lovey-Dovey Marriage of Convenience","tags":["Drama","Fantasy","Romance"],"disc":["Read Our Lovey-Dovey Marriage of Convenience","As the daughter of a bankrupt Count, Leila’s fate hinges on repaying the loan her father took from the businessman Maximilian Volkov. Missing even one payment could force Leila into marrying him as compensation. With the repayment date approaching and little hope of meeting the deadline, Leila is unexpectedly saved by her first love, a wealthy Colonel named Silvester, who proposes marriage. Although Leila has always dreamed of marrying for love, Silvester insists theirs will be a marriage of convenience and refuses to consummate it. Despite her belief that divorce is imminent, their arrangement continues for three years. Then, one day, Silvester is attacked and loses his memory. Strangely, he begins treating Leila with utmost tenderness, showering her with affection. In a surprising turn of events, their relationship shifts from the brink of divorce to a loving, affectionate marriage with just one incident."]},{"title":"I Robbed The Storehouse Of The God","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I Robbed The Storehouse Of The God","The Tower’s peace was shattered by the Outer invaders and the Great War of Gods and Demons, leading to the extinction of humanity. In the midst of it all, the only survivor, ‘Jeong Sewoon,’ embarks on a mission to undo everything. He discovers the Demon’s Vault, created by the Demon of Greed, within the depths of the Demonic War. Inside the vault, he finds the Hourglass of Chronos, capable of turning back time! ‘If I go back to the past, stop the Great War, ascend the Tower, and personally fend off the Outers…!’ This time, I won’t let the world fall to ruin. With the powers I took from the Demon’s Vault! Follow Jeong Sewoon’s expedition through the Tower as he starts again from the tutorial! Now available in webtoon format!"]},{"title":"This Time, I Will Avoid This Marriage- a Method to Part Ways With You, Who Lacks Love","tags":["Drama","Fantasy","Romance"],"disc":["Read This Time, I Will Avoid This Marriage- a Method to Part Ways With You, Who Lacks Love","Lily married the cold-hearted King Amber, but was killed by a woman claiming to be his mistress. However, she suddenly realizes that time has gone back to before they met. And on top of that, she has this strange power to stop time for three seconds. Lily struggles to use her ability to avoid marrying Amber. But when they meet again, he smiles kindly at her. Can Lily really get a do-over in this second chance at life?"]},{"title":"The Devil Raises a Lady","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Devil Raises a Lady / Devil Brings Up a Lady / 악마는 레이디를 키운다","he downfall of a noble family. And a girl who risks her life seeking revenge. “Lady Ayana.” There was a knight who had been by her side for 13 years. The person who came to her mind before her own family was going to be annihilated . He risked his life for her, suffered wounds, hunger, and gave her everything. Now, he is looking at her while she’s waiting for her execution with a joyful smile. “Please show me another enjoyable story this time, my lady.” read at kaiscans.com! The devil smiled and extended his hand, and the girl took it. “I hope you get the ending you desire in the next story, my lady.”"]},{"title":"Regas","tags":["Adaptation","Adventure","Fantasy","Manhwa","Yaoi","Yaoi(BL)"],"disc":["Read manhwa Regas / Legas / 레가스","In this kingdom, the power of the dragon is passed down through the royal bloodline, and these royal family members require the special help of dragon tamers, otherwise known as the “Regas.” However, the current prince’s blood bears the markings of an extremely powerful dragon’s might. While everyone feared and avoided the aggressive young prince, Abel, a man trained in the traditional ways of the Regas, approaches him and teaches him about the world little by little. Will the young prince finally be able to open up his heart to this Regas and gain control of his powers amidst all the political strife…?"]},{"title":"In the Name of Your Death","tags":["Adventure","Comedy","Drama","Fantasy","Game","Historical","Isekai","Manhwa","Mystery","Romance","Shoujo","Survival","Time travel","Webtoon","Webtoons"],"disc":["Read manhwa In the Name of Your Death / 그대 사자의 이름으로\nSummary:\nYvonne, the blessed sorcerer, Eilech’s only dragon I left my lover for just one wish. ‘Be beautiful and be the king.’ I didn’t know then that it was the wrong choice. The lover’s death was the result of her choice. ‘It can’t be.’ The world without him was a night without light, a day without night. She put herself down without regret. The body of a strange woman named Noi Kalinger, never to wake up again……. “What happened?’ The world she woke up to was not the same as before. Abnormalities that occur everywhere, people who forget the past, dragons who have left, lovers who have come back who have forgotten everything. “……why do you look at me like that?” “How do you see it?” “Like someone who knows me well.” And the prophecy before her. 「Don’t love. You will destroy him. As it has been.」"]}]