[{"title":"The Northern Duke Needs a Warm Hug","tags":["Drama","Fantasy","Romance"],"disc":[]},{"title":"Surely a Happy Ending","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Time travel"],"disc":["Read manhwa Surely A Happy Ending / Must Be a Happy Ending /  Happy Ending In Need / 반드시 해피엔딩","Yeon-Woo’s husband died the day they ended their sham marriage. Yeon-Woo, who is swept in sorrow, is given a chance to return 100 days back in time! As she struggles to prevent the death of her husband Seon-Jae, their ‘real’ marriage has only just begun. This is the story of a late budding romance, faced with danger and a life at stake."]},{"title":"The Tears of a Jester","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Time travel","Webtoon"],"disc":["Read manhwa The Tears of a Jester / The Melancholy of a Clown / 어릿광대의 우울","Two princesses, one throne. Life is hard for a court jester. Not only do I serve as an emotional punching bag for the royals and aristocrats, forced to indulge their every whim, but now I’m also caught between two princesses. Is this a comedy? Or will this tale end in tragedy?"]},{"title":"Adventures of an Undead Who Became Paladin","tags":["Adventure","Fantasy","Ghosts","Magic","Manhua","Shounen"],"disc":["Read manga Adventures of an Undead Who Became Paladin / Marching Toward Klimatia / Mài Xiàng Kè Lǐ Mǎ Shā / 迈向克里玛莎","“Humility! Integrity! Compassion! Valor! Justice! Sacrifice! Honor! Faith!” He’s a lich, however, he’s knightly! He is a lich, but he keeps his faith in the light! “Fearless in the face of the enemy! Loyal and upright, he fights to the death! Why you may ask? Because protecting the weak is not against the law of the world!” ……………. This is the story of a cat with a bad mouth and a lich who gave his body and soul to the service of the Light!"]},{"title":"The duke picked up something in the forest","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The duke picked up something in the forest / What The Duke Picked Up In The Forest","  ","“I’ll do this one last time, so please let me go back to my good memories”\nHe died for her 29 times…She wanted to protect him with this hand. Want to be a shield for ‘her people’ for once.\nIt was Elysia’s 30th regression and also her last.\nEverything began to change as if fate had been predestined. A child born without ‘certificate’ in the family is blessed by God and has to live an extremely harsh life.\nShe gradually realizes that the curse disguised as a blessing from God all came from one person…"]},{"title":"I’m Stanning the Prince","tags":["Comedy","Fantasy","Romance","Webtoons"],"disc":["Read manhwa I’m Stanning the Prince / I Stan the Prince / 황자님께 입덕합니다 / I’m Stanning the Prince / Je suis devenu une fan du prince / Me convertí en la fan del príncipe","Angela’s fanfic became such a sensation that it even reached the Imperial Family. Leading her to get arrested on charges of treason.\nNevertheless, her fanfic improved the First Prince’s image, and his sister, the Princess, decides to take political advantage of this and keep Angela by their side.\nThe heroine who can now fangirl to her heart’s content, and the Prince who doesn’t know how to act around her. As they bicker back and forth, they start growing closer…"]},{"title":"The Saint Whose Engagement Was Broken When She Became Too Perfect is Sold Off to a Neighboring Kingdom","tags":["Adaptation","Drama","Fantasy","Manga","Romance"],"disc":["Read manga The Saint Whose Engagement Was Broken When She Became Too Perfect is Sold Off to a Neighboring Kingdom / 完璧 すぎて可愛げがないと 婚約破棄された 聖女は 隣国に売られる","Born into a family of saints, Philia’s childhood was filled with harsh education. Nevertheless, it formed her into a great saint and secured her engagement with the second Prince, Julius. But when she became too perfect and thus not cute in his eyes, Julius broke their engagement! That’s why she decided to leave her hometown and become a saint in a saintless neighboring kingdom in exchange for money and resources. Philia was prepared to be treated miserably but what awaited her was an unexpected welcome! Confused by her new circumstances, she began to use her powers to help solve the citizens’ problems such as creating a barrier against monsters and creating a cure for the illness that wreaked havoc on the land. With her new found position, Philia recollected her memories of being in a novel and the future outbreak of monsters that was to come. She used her knowledge and with the help of the people, they quickly dealt with the problem! But at the same time, the very same town that sold her off was also in danger-?!"]},{"title":"My Crazy Boss","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Crazy Boss / my crazy boss / 사장님이 미쳤어요"," "]},{"title":"They Live in the Princess’ Flower Garden","tags":["Comedy","Drama","Fantasy","Historical","Isekai","Magic","Manhwa","Reincarnation","Romance","Royal family","Time travel"],"disc":["Read manhwa They Live in the Princess’ Flower Garden / They Live in the Duke Daughter’s Flower Garden / 공녀님의 꽃밭에는 그들이 산다","Thanks to the seal of the king of spirits, she was born with the qualities of a master of spirits. Her parents and brother-in-law pour endless affection on her, and the Knights Templar often follow her around asking for her to be an escort. Furthermore… … “Why don’t you know that your light wish is my earnest desire?” The devil begs for a different look and says, “I want to become a good emperor. An emperor who makes an empire that will suffice for you to stay comfortably.” A childhood friend declares that he will build a strong empire for me. [All kneel in front of our chick!] It’s a bonus that the contracted spirits shout like a habit. A full-fledged walk on the flower path of a frenzied chick who couldn’t bite everyone!"]},{"title":"My Second Senior Brother Is a Mortal But Strong","tags":["Action","Adventure","Fantasy"],"disc":["Read manga My Second Senior Brother Is a Mortal But Strong, Er Shixiong Shige Fanren Que Hen Qiang, 二师兄是个凡人却很强","Cheng said, “They ascend during the day, and I find it hard to sleep at night.”","Junior Sister curiously asked, “Why can’t you sleep if others ascend?”","Eldest Brother quickly replied, “Because he has helped others to ascend while he himself is still a mortal.”","A second later, the Eldest brother, who was in the Tribulation Transcendence realm, passed on to the other world."]},{"title":"Fight for My Way","tags":["Adaptation","Childhood Friends","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Fight for My Way / 쌈 마이웨이 / サム、マイウェイ～恋の一発逆転!～ / Ssam My Way","Don’t settle. Fight for your dreams! Dongman dreamed of becoming a national taekwondo athlete. Aera wanted to become a successful news anchor. But who has time for childhood aspirations when there are bills to be paid? Follow Dongman and Aera in their fight to find love and success within the harsh realities of life."]},{"title":"The Portrait of the Late Prince","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance"],"disc":["Read manhwa The Portrait of the Late Prince / Portrait of the Dead Prince / 죽은 왕자의 초상"]},{"title":"Millionaire Lady","tags":["Manhwa","Romance"],"disc":["Read manhwa Millionaire Lady /  밀리어네어 레이디"," "]},{"title":"I Became the Chef of the Dragon King","tags":["Comedy","Cooking","Drama","Fantasy","Historical","Manhwa","Romance","Supernatural"],"disc":["Read manhwa I Became the Chef of the Dragon King / Dragon King’s Chef / The Dragon King and His Chef / 용왕님의 셰프가 되었습니다","Chong Shim threw herself into the sea of Indangsu! What will happen when she wakes up in a lazy dragon’s dungeon? Meet many cute monsters while living a delicious, symbiotic life!"]},{"title":"Forbidden Odd Melody","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Forbidden Odd Melody / Geumsu Byeolgog / A Forbidden Song / Geumsu Byeolgok / 금수별곡"]},{"title":"THE ONE WHO GAVE ME LOVE WAS THE DUKE OF DEATH","tags":["Drama","Fantasy","Romance"],"disc":["Read manga THE ONE WHO GAVE ME LOVE WAS THE DUKE OF DEATH / The Grim Reaper Duke Gives Love / Ai wo Kureta no wa Shinigami Koushaku deshita / 愛をくれたのは死神公爵でした"]},{"title":"I Became the Ugly Lady","tags":["Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manga I Became the Ugly Lady  / I Woke Up as the Ugly Duckling / I Became the Ugly Lady / 못난이 공녀가 되었습니다\nOf all things, I possessed an ugly noble lady.\nFor the sake of receiving the attention of those who despised her, Sylvia Atlante, in the midst of all the ridicule and disrespect, made herself known as the “ugly lady”.\nHowever, one day, I happened to possess Sylvia’s body, who drank poison and ended her own life. I didn’t want to live like her.\n“I’m rich and healthy, so why do I need to care about other people? This is my life, I’m going to live as I want!”\nI just wanted to live a quiet life, but…\n“Still, you’re my little sister, and you’re part of the Atlante family.”\nThe family’s a little strange.\n“I’m interested in you, not your younger sister.”\n“You must take responsibility for this body until the end. That’s the job of the contractor.”\n“I, Theve Hiddleton, swear to be the sword of Sylvia Atlante and devote everything to her.”\n“I won’t bother you. So please, keep me by your side!”\n“There’s nothing in this world I can’t find. So don’t even try to run away from me.”\nThe handsome guys who I thought I’d never get involved with stuck around.\nWhat’s wrong with everyone? Isn’t this too different from Sylvia’s memory? I just wanted to live a peaceful life?!"]},{"title":"Cradle of Heaven","tags":["Adventure","Demons","Drama","Fantasy","Historical","Magic","Manhwa","Romance","Supernatural"],"disc":["Read manga Cradle of Heaven / 천신의 요람","Three years ago, the celestial empire came under attack by the demons. With his kind on the verge of extinction, the celestial being and emperor, Kasin, is tasked to go down to the human world and find a way to restore peace. After three years without much progress, he encounters Daran, a merchant who has disguised herself as a man to travel and sell medicinal herbs. Daran was born with the power to heal anyone with a single touch. This ability makes her the exact person Kasin needs on his quest. Although Kasin swears he has no interest in men and is only keeping Daran with him as an aide, the more time passes, the more he finds himself becoming attracted to the special merchant…"]},{"title":"Elixir of the Sun","tags":["Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read manhwa/manga/manhua Elixir of the Sun / The Lord of Sun / 태양의 주인","Bayan is an outcast amongst the Siyo, a people who have healing powers. Considered worthless because she doesn’t have the ability to heal others, Bayan is sent to the court of Dhan, the Great Sun Emperor, who is cursed with unrelenting bloodlust and slaughters his concubines mercilessly. It seems that Bayan’s fate is sealed the moment she reaches the emperor’s palace and Dhan is fated to suffer from madness forever… But together, Bayan and Dhan just might be able to change each other’s destiny."]},{"title":"That Man’s Secret Day","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa That Man’s Secret Day / 彼の密かな一日 / 그 남자의 은밀한 하루","Haru works for a company that specializes in breaking up with people on behalf of their clients. One day, she mistakenly breaks up with the wrong person, who turns out to be her boss, Woo-Hyun. This mix-up leads to Woo-Hyun actually breaking up with his real partner. Feeling guilty, Haru is surprised when Woo-Hyun makes a proposition to her: “Let’s date for one year.”"]}]