[{"title":"Princess of Doom","tags":["Fantasy","Romance"],"disc":["Read manhwa Princess of Doom / 파멸의 공주님 / The Adorable Princess of Doom / Princesa de la Perdicion / Princess of Doom / 灭亡的公主 / 파멸의 공주님","The Demon King, Kaon broke the taboo and tried to revive his dead lover. However, the magic went beyond his expectations and created a new existence, a little girl who looked exactly like his dead lover. However, her soul was that of a Korean woman, “Lee Eun”.","The Demon King tried to kill the child and failed. Hence, he thought that it was related to the will of his deceased lover. As such, he made her a princess. And that was how “Luciana Road Moon Bloodlane”, a combination of the power of mankind’s greatest magician, “Asela”, and the Demon KIng, Kaon, was born.","But that was the Demon King’s position!\nLee Eun had suddenly fallen into another world on the very day she had won the lottery!","“Send me back! I could’ve been happy in the modern world!”","But why am I liking this place more and more?\nWhat is the prophecy of destruction?","In a world full of secrets, you’ll meet friends and family, forging friendship and love that didn’t exists in the modern world. A new world unfolds and the even the pain of the past is healed.","“Asela, tell me why.”","Tell me why we met."," "]},{"title":"The End of This Fairy Tale is A Crazy Drama","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa 그 동화의 끝은 막장 드라마 / The End of This Fairy Tale is A Crazy Drama / The Beginning of Our Story / The End of this Fairy Tale is a Soap Opera / The End of This Fairytale Is a Drama","Once upon a time, there was a man named John who lived in a small town. One day, he met a girl named Lily at a coffee shop. They started talking, and John was immediately drawn to her sparkling eyes and infectious laugh. They hit it off right away and started dating.","As they spent more time together, John and Lily fell in love. They went on long walks, watched movies, and shared their dreams for the future. John had never felt happier.","However, one day, something strange happened. John woke up feeling different. He had an uncontrollable urge to bark and chase after squirrels. He was confused and scared.","Lily noticed that something was off with John. She asked him what was wrong, but he couldn’t explain it. It wasn’t until he started growing fur all over his body that he realized what was happening.","John was turning into a dog.","Stop copying our content or one day you’ll turn into a dog as John.","At first, Lily was shocked and didn’t know what to do. But soon, she realized that she loved John no matter what form he took. She stayed by his side, helping him adjust to his new life as a dog.","John was grateful to have Lily’s support. He may have lost his human form, but he gained a lifetime of love with the girl he fell in love with.","And so, John and Lily lived happily ever after, with John as a loyal and loving dog by her side."]},{"title":"I Raised the Villains Preciously","tags":["Drama","Fantasy","Harem","Historical","Josei","Manhwa","Romance"],"disc":["I will become a nursery teacher for the children who would become the future Black Sorcerer, the Heads of Dark Guild, and Psychopath Emperor. I didn’t want to get entangled up and sneak out of the nursery, but I decided to raise the poor little villains with full sincerity,","“Teacher, are you leaving us behind?”","——","“If you look at this handsome face a little more, you won’t be able to win.”","Masha, who had taken off his dress and wore a neat uniform, grew up as a narcissistic adult.","“Teacher, the more dangerous I am, the more likely you will not take your eyes off of me. I’m weak at the poor things.”","Although he is the Empire’s number one in rough and fierce ways, Jeremy, who is strangely soft for Hannah, but his way of affection was little off.","“I’m going to listen to whatever you want. Whatever it is, whatever it is for. Instead, the teacher should stay with me.”","Ian, who became emperor, and his actions, which are still unknown, is Ian really a pushover and foolish? If so, is he hiding something else?","Oh, come on.","I think I raised them properly, but I think there’s a bit of a problem?","“I have a lot of impure things I want to do with you.”","Hello, Pope, what’s wrong with you?"]},{"title":"Wish Upon a Husband","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Wish Upon a Husband /  두 집 살림을 하는"]},{"title":"Bon Appétit","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Bon Appétit / 맛본 김에 꿀꺽! / Bon Appetit / Gulp while you taste it","“Are you eating in this situation?” “Of course! I’ll have to keep savoring the taste until I die. Do you want one?” She was reincarnated in a novel as Luana, the abandoned princess. And her death was already decided. She just wanted to let people know about her cooking talent, but she was misunderstood as a witch because of her cheese jerky! The General of the conquering army, Duke Legion, who had lost his sense of taste, took her to the Empire for her extraordinary jerkies and to break the curse that had come down from generation to generation. “It is delicious, isn’t it?” “Prepare the same for the dinner.” She was happy to be able to cook and eat as much as delicious food as she wanted… But now, she also wanted to look after Legion. ‘Eat three meals a day, and make sure to make dessert. I’m sure he will be able to gain some weight…!’ – The Duke took the jerky from the princess. On the surface, it was no different from any beef jerky. But when he took a bite of it, it felt like a new world had opened up. The jerky, made by the princess, felt more tender than the others as he gently crushed it with his teeth. The taste of condensed meat smudged his tongue as he chewed on. It was just as she said. He could feel the savory taste of the spicy meat, and at the end of the day, he wanted to have more. The desire that he had, faded for a while. “I didn’t really want anything, but now I think I do.”"]},{"title":"The Beastly Girl","tags":["Comedy","Romance","School Life","Slice of Life"],"disc":["Read manhwa The Beastly Girl / 야수파 그녀","Yeonho Kang is a veterinary student with a strange ability: communicating with animals. Ironically kicked out of his residency program because of this, Yeonho is imposed to figure out how to get back on track, until he is offered a chance to work as a school nurse**.** There, he meets a strange and mysterious girl named Yeoul — a “feral child,” unlike anyone he has ever seen before. A girl so different, yet in the most unexpected way, so similar."]},{"title":"Married to my boss","tags":["Drama","Josei","Manhwa","Romance","Slice of Life","Webtoons"],"disc":["Read manhwa The President’s Special Instructions / My Boss’s Special Request / Married to my boss /사장님의 특별지시 / 成为总裁的合约丈夫 / 社長の特別命令"]},{"title":"Married for 120 Days","tags":["Romance","Shoujo"],"disc":["Read manhwa Married for 120 Days / 120일의 계약결혼","Ellouise Starwood is looking for a mate for her adopted daughter.\nShe comes from an aristocratic family that has faced financial difficulties for many years. As a result, her father and Louize (Juliet’s older sister and mother) run away.\nThe sister returned to Ellouise with Juliet but died a few days later of a severe fever. Ellouise has now adopted Juliet and decided to find a suitable husband for her daughter in the aristocratic city of Cliff, where the social circles are more relaxed and do not discriminate.\nUpon arriving at the Cliff, she meets Marcus Hanger, the heir to a mining corporation, where the family is often looked down upon by the nobility for its lack of prestige and title. Marcus is sent to Cliff, where his aunt resides, after a series of romantic conquests in the capital.\nHe meets a widow in the Cliff. Duchess Bellona, ​​and have flirted with her to no avail. He later learned that the Duchess was extremely wary and would only associate herself with married men or young men.\nMarcus believes that Duchess Bellona is his true love so he convinces Ellouise to marry her on paper for 120 days so he can continue flirting while providing Ellouise with a safe haven as they find her. looking for a suitable husband for their daughter, Juliet."]},{"title":"Sleeping with nemesis","tags":["Manhwa","Romance","Webtoons"],"disc":["Read manga Sleeping with nemesis / Sleeping With Enemy on manhwaclan\n“Haven’t you thought about becoming an actor? It was the only thing I could see from afar.”\nGod’s hands in the entertainment industry, golden eyes, Lee Yeon Shin.\nThe people she hires are always big stars.\nThe one she fell in love with at first sight after several years and abandoned her on the street\nIt’s Taejin Yeo.\nFrom her pretty face to her perfect body, it’s an award that no matter what anyone says, she will become a great actor!\nHowever, at that time I did not know.\nHe is the CEO of competitor Jin Entertainment.\nHe must be a spy who came to steal his minting secret….\n“Maybe it’s not that I didn’t recognize the star at first, it’s not that I fell in love at first sight.\nThis?”\n“I wonder if it was Shinee’s secret casting or was it Shin Yi-yeon?\nIs that God? ”"]},{"title":"First Miss Reborn","tags":["Adventure","Liexing","Ping Ping Jun","Romance"],"disc":["First Miss Reborn\nWhen she was hit by labor pain, what greeted her wasn’t words of comfort but vile accusations of infidelity.\nKilled in defense of her unborn baby, she vowed to take revenge on them all…and God granted her a second chance.\nHowever, it seems that she’s not the only one brought back. Who’s that silver-haired guy in mask? Why does he seem to know her every move, yet still willingly provide unconditional help regardless?\nReturn for Revenge"]},{"title":"Fight For Her Gifted Son","tags":[],"disc":["Read manga Fight For Her Gifted Son / My Clever Mummy / Tiancai Baobei de Fuhei Diniang / 天才宝贝的腹黑嫡娘 / 킬러는 육아 중","A 21st century top-class assassin travels back in time one day to find that she’s been transformed into the Second Miss of the Duanmu Family, one of the five great aristocratic families of the Xuanyuan Dynasty. But, this Second Miss was naturally useless, obsessed with men and a mother out of wedlock! Fine, since she was there already, then she should live coolly. When she appeared in front of everyone with her genius son, she was no longer “her”. She wandered Jianghu with her son, killing everyone that got in the way. How would she survive in this chaotic world? And, out of all the handsome men that followed by her side, which one was her child’s father? Finally, who would win her heart? My Clever Mummy / Tiancai Baobei de Fuhei Diniang / 天才宝贝的腹黑嫡娘 /"]},{"title":"Don’t Touch me!","tags":["Historical","Romance"],"disc":["Read manga Don’t Touch me! / Can’t Touch This Princess","Six years ago, with a thoughtless remark, the downcast Princess was forced to marry the powerful Governor of the East Chamber? A real princess and a fake eunuch, what a weird couple! On the wedding night, Governor Shen pushed her against the couch and smiled harshly, “I have an old debt to settle with the Princess.” Changning looked at the handsome man at her feet with teary eyes and trembled, “Don’t come near me, back off! But, why is this old debt a bit sweet?"]},{"title":"Oh, Be Patient My Lady!","tags":["Adventure","Comedy","Demons","Drama","Fantasy","Historical","Magic","Monsters","Mystery","Romance"],"disc":["Read manhwa Oh, Be Patient My Lady! / Oh, Come On! / 아, 쯤 참으세요 영주님! / 아, 쫌! / Ah, Hang on a Little Longer, My Lord","Rose, the lord of a small and poor territory, White. She just wanted to eat well and live well with the residents there, but all of a sudden, there’s an increasing surge of immigrants moving in from other areas, and they’re getting caught in incidents?! The delightful romance fantasy of Rose, a strong and capable lord, and the great Archmage Yggdrasil, who wants to secretly hide her in the estate and protect her!"]},{"title":"To possess the Heavenly Body","tags":["Action","Comedy","Drama","Fantasy","Manhua","Shounen"],"disc":["Read manga To possess the Heavenly Body / Ruling a Planet","Both the immortal emperor Xia Guixuan’s generation and his old nemesis were injured, so he withdrew to the core of a distant planet in the universe to recover his wounds. The fairy spirit flowing from him gradually modified the planet’s atmosphere, and it became a livable planet with ample aura.\nTo cultivate and establish their own civilization, the original creatures began to change into humans. Human exploration spacecraft from the Milky Way arrived here a few years later.\nUnknown powerful entities began to target this area on all levels. Many factions collide, and heroes unite."," "]},{"title":"It’s the First Time for Both of Us!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa It’s the First Time for Both of Us! / We’re Both New to This! / 우리 둘 다 처음이라서요!","As the daughter of the fated heroine and possessing the ancient witch’s power, Marionette found herself brutally slain at the temple! Losing her mother and meeting her father for the first time, Only to discover he already stood at the threshold of tyranny. Am I doomed to perish as well…? “No, it can’t be. How did I survive?” This won’t do. First, I need to make my father see me as a human! But could there have been an issue with my training? Not only my father but everyone’s affection seems overwhelming. Am I on the verge of losing myself"]},{"title":"To Revenge, Divine","tags":["Action","Adventure","Manhua","Romance"],"disc":["To Revenge, Divine,\nHe was the gods’ tutor in the divine realm. He never expected that he would die at the hands of his own beloved disciples. Perhaps the God was touched by his grievance, that’s why HE gave him another chance to live! He was reborn as Ling Jianchen, whose martial spirit was ruined before he was killed. What’s worse, this poor guy’s fiancee came to his funeral, not for mourning, but to cancel their engagement…"]},{"title":"Pray To a Ghost","tags":["Drama","Fantasy","Horror","Manhwa","Romance"],"disc":["Read manhwa Pray To a Ghost / 귀비나리","A psychic high-schooler Tae-rin discovered the story of a ghost one day. After that she realized, humans are more dangerous than ghosts. Tae-rin then decides to help the ghosts get rid of their grudges with her childhood friend, Chang-woo."]},{"title":"School Bully’s Online Dating Got Overturned","tags":["School Life","Shounen Ai"],"disc":["Read manhua School Bully’s Online Dating Got Overturned / Cyberdate of School Tyrant Has Been Derailed / I Thought He Was A Girl / School Bully’s Online Dating Got Overturned / Xiào Bà Wǎng Liàn Fān Chē Le / 校霸网恋翻车了","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\n[Showoff Gap Moe School Bully X Ice Cold Possessive Academic Lord] Yu Yang thought he had picked up a cold and shy chick on the Internet, but when online date appeared, the other party turned out to be a 1.8 meters New Campus Academic Lord! The other party also witnessed his online date flop! Yu Yang: I treated you as my enemy, but you misses me? The two campuses merged, long-distance relationship became next door class. Yu Yang immediately went to the toilet after class, pretending to pass by the window of his next door class boyfriend coincidentally"]},{"title":"Sierra","tags":["Fantasy","Manhwa","Romance","Shoujo","Tragedy"],"disc":["Read manwha Sierra / 시에라","The price for a love that should not be paid was terrible ruin.\nSierra prays that she has lost everything she treasured.\n‘Please, let me make a different choice this time.’\nTime rewinds like that, and Sierra is once again faced with a choice.\nThe time she returned was just one night spent with the one she loved.\nIn their womb, there was a child they had coldly erased from the past before the return.\ncan’t be with him Because the relationship with him in the past was full of despair.\nBut the child who was the fruit of love, I wanted to save this time.\n‘I want to leave only one trace that he left behind.’\nSo, eight years after Sierra disappeared from the islands.\nThe love she had to leave has returned once again."]},{"title":"The Monster Duchess and Contract Princess","tags":["Drama","Fantasy","Manhua","Manhwa","Romance","Shoujo","Supernatural","Webtoons"],"disc":["Read manhwa The Monster Duchess and Contract Princess / The Monstrous Duke’s Adopted Daughter / A Duquesa Monstruosa e a Princesa de Contrato / Bản Khế Ước Với Nữ Công Tước Ác Ma / Canavar Düşes ve Sözleşmeli Prenses / Goemul Gongjagui Gyeyang Gongnyeo / L’enfant des ténèbres / La duchesse monstrueuse et la dame du contract / La duchesse monstrueuse et la princesse par contrat / La duquesa monstruosa y la princesa del contrato / Nữ công tước quái vật và công chúa hợp đồng / Putri Kontrak dan Duchess Monster / The Monster Duchess and the Contract Lady / The Monster Duchess and the Contract Princess / Witch’s Counterattack / Княгиня чудовищ и принцесса по контракту / داچس هیولا مانند و شاهزادهی قراردادی / 怪物公爵と契約公女 / 魔女的逆袭 / 魔女的逆襲 / 괴물 공작가의 계약 공녀","Leslie’s life was always used for the betterment of her sister, Eli.\nAfter a failed attempt to extract the black magic within Leslie to transfer to Eli; Leslie knocks on the door of the monster Duchess and pleads for the Duchess to adopt her?!"]}]