[{"title":"Almighty Royal Sister","tags":["Manhua","Romance"],"disc":["Read Almighty Royal Sister, 有能な彼女がまた身バレした本当の理由, 全能御姐又被拆马甲了"," "]},{"title":"Masked Queen","tags":["Historical","Manhua","Romance"],"disc":["Read manhua Masked Queen, 恶役皇后\nAs the heroine of an ordinary office worker, she accidentally travels into the Western Fantasy romance novel that she has been chasing. The embarrassing thing is that she is wearing the vicious queen she hates the most, but she has become the stepmother of the prince who she loves dearly. This is indeed a big difference! Thanks to myself relying on the original novel, this plug-in, to survive in the complex form of the palace, but I didn’t expect that there seems to be more than one person with the golden finger…"]},{"title":"To Julie","tags":["Drama","Fantasy","Manhwa","Psychological","Romance","School Life","Slice of Life"],"disc":["Read manhwa To Julie / Dear Julie / To Julie / 줄리에게","At the end of the first year of Joo-won’s High School, To meet / get his daily needs, He studied dedicatedly while working as a part-time job worker, Because he was the only support in his family, who can earn for his own. After being recognized for his skills and dedication towards his studies, he received a (transfer proposal) to get better education from a prestigious high school, So from the new semester he transferred to a private Hana High School. Joo-won, who said he would study consistently at the new school, For some reason he couldn’t get focused on his studies because of a soft pink wind which was flowing around him… And the woman he calls anxiously Julie? Who is she? His destiny or a strange person in his life After all, who will Joo-won choose, his dream or his destiny? let’s wait and see which path he will choose at the end…..!"]},{"title":"The Empress with No Virtue","tags":["Drama","Fantasy","Historical","Josei","Manhua","Romance"],"disc":["How the Queen Break the Rules / The Empress With No Virtue / The Empress Without Virtue / How the Empress Breaks the Rules / 皇后无德","Ye Zhenzhen was the granddaughter of the Prime Minister, and it was both her responsibility and destiny to wed the Emperor of Daqi Kingdom to strengthen Royal ties with her family. But, having always been the unconventional type, she was never ready to be a typical, docile empress! Sadly for the Emperor, he had no idea what an adventurous life awaited him. This is a story about how an unwillingly-wed young couple experience a series of misunderstandings, challenges, and obstacles."]},{"title":"Youngest Chef from the 3rd Rate Hotel","tags":["Comedy","Cooking","Manhwa","Shounen","Webtoon"],"disc":["Read Youngest Chef from the 3rd Rate Hotel\nKang Sunghoon, the youngest member of a 4 star hotel kitchen in Korea, has the ability to memorise different kinds of ingredients. However, as the youngest, he’s still unable to escape dishwashing duty"]},{"title":"The Maid and Her Favorite King of Darkness","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa The Maid and Her Favorite King of Darkness / Yami no Ou, Takaga Maid wo Henaisu. / 闇の王、たかがメイドを偏愛ス。","The King of Darkness and his maid…? Anna River is reborn as a character in her favorite novel “The Sacred Virgin and the King of Darkness”. Will she stay a side character like she’s supposed to, or will she take matters into her hands and save the infamous King of Darkness…?"]},{"title":"Food Truck Owner Inside the Dungeon","tags":["Adaptation","Cooking","Drama","Dungeons","Fantasy","Isekai","Manhwa","Romance","Slice of Life","Supernatural"],"disc":["Read manhwa Food Truck Owner Inside the Dungeon / Food Truck Owner In the Dungeon / 던전 안 푸드 트럭 사장님","“Don’t yearn for a world different from yours, just live a normal life.” Hunters, dungeons, I’m not interested in any of those. My life followed one single path that’s of cooking. But the moment I was about to open my first long-awaited food truck…. [Class: You have awakened as a Food Truck Owner (Hidden)!] [Item: Dungeon Business Permit (Personal/Non-Transferable)!] – Business is only possible inside the dungeon Min Jiun, 21 years old, awakened as the owner of a food truck inside the dungeon."]},{"title":"I’m A Villainess But I Received Hearts","tags":["Drama","Fantasy","One shot","Romance"],"disc":["Read manhwa I’m A Villainess But I Received Hearts","On the day of my wedding, my husband— “My real wedding is right now. Come on, let me kiss you. My bride.” “I love you, Cleas. Promise me you’ll be mine forever.” —blatantly cheated on me with my cousin from the very first night! She even cheated with my childhood friends who were like my siblings! A cheater hell filled with cheating man (husband) and cheating woman (cousin) and cheating men (childhood friends). These cheating men and women even went as far as to kill me. “If you give me a chance to turn back time, I would definitely put an end to all the cheaters in this land!” After praying to God, I regressed. And gained a special ability…. :̗̀♥ˎˊ: Congratulations on your regression:̗̀♥ˎˊ: The best choice for you who just regressed! ♥♡Banned Love Detective Agency★ ‘Banned Love Detective Agency?!’ The ability is a bit strange. The man who helped me the only one in the cheater hell before regressing. “Find me. So— I can save you.” ‘Save myself’ he said. But first, deal with the cheaters. The story of Nikearsha, who gained a slightly strange ability, Overcoming the cheater hell one by one, resolving past misunderstandings, meeting new connections, And reaching another truth."]},{"title":"The Girl Who Blooms Hard","tags":["Drama","Fantasy","Manhua","Romance","Showbiz"],"disc":["Read manhua The Girl Who Blooms Hard / Cô Ấy Thật Xinh Đẹp / She’s So Pretty / She’s So Beautiful / ときめき恋解禁♡年下の彼に胸キュン / 她真漂亮 / 너무 예쁜 그녀","Stunning and pure, she is like the camellia at night. Insensitive to romance, she fell for her bodyguard after many turns and twists. He was the boy who she considered her enemy 12 years ago. What’s worse, he was her senior whom she once flirted with…"]},{"title":"Raising the Royal Highness? Making Money Making Money","tags":["Drama","Fantasy","Romance"],"disc":["Read manhua Raising the Royal Highness? Making Money Making Money","After waking up, the heroine, who has been reborn for who knows how many times, is determined to convince her parents to leave the center of imperial power this time, so as to avoid being executed by the whole family when the government is in chaos. However, her family has been officials for generations, and her parents are worried that they will not be able to survive if they don’t become officials, so she must prioritize making money in this life. At the same time, by accident, the heroine meets the prince who did not exist in the previous rebirths. And the prince who has always been entangled in fate and abandoned the heroine also arrived as promised.\n!"]},{"title":"Genesis of the Battle God","tags":["Action","Adventure","Fantasy"],"disc":["Read Genesis of the Battle God","In an era where mythology and reality have fused together, the powers of gods and heroes from ancient myths like those of Greece, Rome, Judea, and Egypt have descended upon the modern world of the 21st century. Ken Yanagimoto, an “Awakened One” with physical abilities and senses far superior to those of ordinary people, has returned after five years of working as a mercenary overseas.\nUpon his return, he discovers that his parents have been killed and his sister has gone missing at the hands of the powerful organization “Seven Star Society,” which controls the political, financial, and media worlds. Enraged by the death of his parents and the disappearance of his sister, Ken vows revenge against the “Seven Star Society” and confronts various secret forces and injustices around the globe.\nAmid the grim reality of the dawn of a new era of human evolution, the story of one man who engages in mythical battles against the world begins."]},{"title":"Idol’s Scandal","tags":["Drama","Fantasy","Manhwa","Music","Romance"],"disc":["Read manhwa Idol’s Scandal","Aria is a fangirl who likes the idol group Light U up (L.U.P), especially Lexa, who is actually her girlfriend. Until one day Aria discovered she was pregnant. Not the promised responsibility but betrayal, Lexa had the heart to kill him. Like a miracle, he suddenly woke up in the body of a man named Lee Jaegu, the youngest member of the same group as the lover who betrayed him. This time, Aria wants to repay what Lexa did to her, but… is there something strange about Jaegu’s body?!"]},{"title":"I Don’t Want to Attack You!","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa I Don’t Want to Attack You! / 덮치고 싶지 않아!","On the way home, a drunken Heather helped a small pink elephant who was crying because of a cold nose. She did for the palm size elephant a nose cover, and the elephant claimed to be the God of s*xual desire and affection. “For your help, I’ll let you share a passionate love with the most handsome man of the continent.” However, this was not a blessing from God, but a curse. “Ugh, shameless… How, while I was sleeping, ha… You stole my v**ginity.” “Ah, priest, it’s okay.” “Now, stop, please stop this filthy act, ha…” ‘It’s you who is shaking your waist, you crazy bastard.’ Ashur was praised as the noblest and most beautiful man of the continent. But as soon as she runs into him, it’s normal for the two of them to end up locked in a closed room, where a strange situation arises between their rubbing testicles. *** There was a breathtaking silence. One of the countless reporters instinctively pressed the camera shutter. Click. The sound became a signal, and the shutter sound poured from all sides, and the buzz filled the hall. “Oh… Look, I really didn’t do that.” I wanted to throw the white priest’s robe, no, the piece of cloth in my hands. Ashur kept his head down. Her shoulders were trembling. There was an incompatible chill around him. She felt wronged. “I only touched it lightly, but I never thought it would tear like this… ” But no matter what she says, Ashur would not be able to hear him, who has stood up in front of thousands of people just in his underwear. ‘It wasn’t me, it was that crazy pink elephant!’ Ashur turned his head slightly and looked back at her. His eyes were stained red, full of contempt while looking at her. ‘To end my blessing, I have to make passionate love with the most handsome man on the continent.’ But if he keeps this up, she’ll be shackled as a mol*ster before she can make passionate love with anyone."]},{"title":"Love Roasting","tags":["Manhwa","Romance","Shoujo"],"disc":["Read manhwa Love Roasting / 러브 로스팅","A fresh and raw romance of a young couple in their twenties on campus, and a mature yet complex love story of a couple in their thirties. These two couples cross paths in the confined space of Jeju Island, each dealing with their own worries and conflicts, deficiencies, and healing processes. The delicate love observation diary of the Okdom Couple and the Toast Couple as they navigate their cohabitation in Jeju Island."]},{"title":"The Lost Cinderella","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Lost Cinderella / Missing Cinderella / The Missing Cinderella / 사라진 신데렐라","Ciel avoided her brother’s obsession and entered into a contract marriage. She was betrayed by her fiance who fell in love with someone else, so she decides to start a new life somewhere else. By chance, Ciel meets her neighbor Otestad, who saves her life, and ends up discovering that he is actually the prince who was fleeing a threat. A romance about two people who want to fight against destiny and free themselves. Will Ciel be able to fulfill his wish of not having his life stolen again?"," "]},{"title":"Hoping for My Death","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa Hoping for My Death / Hoping to Die / I hope to Die / 죽음을 희망합니다","In pursuit of a natural death, Silvia reluctantly agrees to a strategic marriage. To deceive the gods, she must convincingly play the role of a married couple. “Shall we turn off the lights then?” “Why would we…?” “Don’t we have to consummate our marriage on the first night?” “Why is that necessary?” Isn’t my husband too conservative? Silvia, who yearns for a chance to die, and Randal, who struggles with conflicting emotions, embark on an unexpected healing romance."]},{"title":"If a Mad Dog Bites a Cub","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa If a Mad Dog Bites a Cub / 미친개가 몽둥이를 물어버리면","[‘Adrian,’ the female knight known as the ‘Mad Dog,’ and Celeste, who is drawn to her because she resembles his first love.]","After winning the war, Adrian was exiled to the south.","It was her brother and the emperor who led the charge to exile her.","They commanded her to go to the southern province, now a vassal state, and retrieve the golden incense.","It has always been said that no brother who meddles in his sister’s life ever does any good, and this was no exception."]},{"title":"Into the light once again","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Into The Light Once Again / Once Again Into the Light Alone / Once Again  Into The Light / Kakak ku Idaman Wanita / Ritorno alla luce /다시 한 번, 빛속으로","I was falsely accused of attempting to kill my younger sister, who was worshipped as a Saintess.\nThere was not a single person who believed in me, nor was there a person who stood up for me.\nNot even my blood-related family.\nI was 14 years old, and it was winter.\nI, who was Edenbell’s Fourth Princess, was miserably beheaded in front of the masses.","After the end of my death, I awoke and what came was…","“My baby, my precious younger sister.”","With a delightful smile, he held my small fingers.\nThat warm gesture, warmth, and touch.\nHe sang me a lullaby as he held me gently and swayed."]},{"title":"Logging in as a Monster","tags":["Action","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Logging in as a Monster / 몬스터로 로그인 / 最強ランカー、モンスターで無双する","Lee Jinhyuk has enjoyed his decade-long reign as Cornsilk, the undefeated number one PVP player in virtual reality game “The Abyss.” But with the sequel “Abyss World” resetting all players as newbies, Jinhyuk accepts a sudden sweet deal from his Abyss Studios developer half-brother Jinho to log in as the infamous boss monster Black Knight. After slaying 100 rankers during the opening event, Jinhyuk agrees to keep the monster login scheme going… but will his unmatched talent blow his cover?"]},{"title":"Infiniseed","tags":["Action","Fantasy"],"disc":["Read Infiniseed","Allan Rose, an orphan awakener with the potential to be one of the strongest S-rankers has been stuck at level one for eight years. He often dreams of reaching his full potential but is always awakened to the cruel reality of being a poor F-ranker who must steal to put food on the table. One day his best friend convinces him to go on an illegal expedition so that he can finally see what it’s like to be a true awakener. Unfortunately, things go south, and Allan finds himself standing at death’s door. Against all odds he survives, and finds out that whatever was keeping him from leveling up has disappeared. Now, with the ability to level up, he is doing whatever he can to gain strength so that can he bring happiness and luxury to his orphanage family."," "]}]