[{"title":"Shining Nana Nana","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Shining Nana Nana / นานาที่เปล่งประกาย / 閃閃惹人愛！娜娜 / 青春スパークル / 빛나는 나나나나","After being bullied and living as a reclusive loner addicted to gaming, she gains the courage through Chan, whom she met in a brilliant game. Could a disguise help her go outside? And on the day she went out in disguise for the first time, she couldn’t even recognize the girl who used to torment her…?! From wigs, contact lenses, makeup, posture, to voice tone, she transforms her appearance and decides to go back to school. With this new look, she’s confident! But the guy she ends up living with in a share house is so cold towards her! But… could that guy possibly…? Can she manage to keep her double life as “Bright” a secret?"]},{"title":"There Is No Perfect Married Couple","tags":["Drama","Josei","Romance"],"disc":["Read manhwa There is no Perfect Couple / 완벽한 부부는 없다\nOn the day of their 3rd wedding anniversary, her husband announced the end of their arranged marriage. “Let’s get divorce.” Yeonhwa, who has been in love with Geonwoo for a long time, went to his company and refused to divorce and got into an accident while returning home. “Who are you?” Yeonhwa, who wanted to avoid the divorce, pretended to have lost her memory. Suddenly her husband changed? “Lets take a shower together.” “Do we shower together?” “We did, every time.” “When did we? What in the world is this guy up to!” Can we, who are imperfect, be the perfect couple?"]},{"title":"Storm Inn","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts","Murim"],"disc":["Read manhwa Storm Inn, 풍운객잔","The Crimson Demon of the Battlefield, Jang Kirin. He spent his days in blood splattering war in the North for the last 13 years.\n“Live a normal life.”\nThose were the last words the general left me.\n“The best way to live normally is to be an innkeeper!”\nThe youngest of my unit gave me this advice.\nI came all the way to Hangzhou believing his advice.\nBut why is living a ‘normal life’ so much harder than fighting in a war?"]},{"title":"My Dragon System","tags":["Action","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa My Dragon System / Life, Once Again! / 인생, 다시 한 번!","Sometimes, as we go about with our lives, we all happen to think of one specific thought at least once. What if… I could go back to “that” time? The funny thing is, the moment you think such a thought is the precise moment when you came back to the past, from the future."]},{"title":"Queen Cecia’s Shorts","tags":["Comedy","Historical","Romance","Slice of Life"],"disc":["Read manhwa Queen Cecia’s Shorts / Empress Cesia Wears Knickerbockers / Yeowang Cecia’eui Banbaji / 여왕 쎄시아의 반바지","Queen of Valencia, suffering with complicated relationships and heavy corsets. She ordered her trusted brother, Duke Ennon Lionheart, to bring her comfortable clothes.\nYuri is a clothing designer. She was killed in an accident after receiving a meager minimum wage at a mid-size clothing company in South Korea.\nShe was reincarnated in a medieval country ruled by Cecia. Yuri vows to revolutionize the problem of outdated clothing. So she dressed up as a man and worked as a designer at the continent’s highest court for ease of doing business.\nBut, what will happen when Ennon discovers Yuri’s true identity?"]},{"title":"Death Is The Only Ending For The Villainess","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read Death Is The Only Ending For The Villain / Death Is the Only Ending for the Villainess / Kematian adalah Akhir Sang Antagonis / Villains are Destined to Die / 恶役只有死亡结局 / Villains Are Destined to Die","Penelope Eckart reincarnated as the adopted daughter of Duke Eckart and the villainess of a reverse harem dating sim. The problem is, she entered the game at its hardest difficulty, and no matter what she does, death awaits her at every ending! Before the “real daughter” of Duke Eckart appears, she must choose one of the male leads and reach a happy ending in order to survive. But the two brothers always pick a fight with her over every little thing, as well as a crazy crown prince, whose routes all lead to death. There’s even a magician who’s enamoured with the female lead, and a loyal slave knight! But somehow, the favourability meters of the male leads increase the more she crosses the line with them!"]},{"title":"Exclusive Possession: Young Master Ji’s Beloved Wife","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Exclusive Possession: Young Master Ji’s Beloved Wife / Dujia Zhanyou: Ji Shao de Fu Hei Jiao Qi / Dújiā Zhànyǒu: Jī Shǎo de Fù Hēi Jiāo Qī / Exclusive Possession The Benevolent Wife / Exclusive Possession: Ji Shao’s Black-Bellied Wife / Exclusive Possession: The “Benevolent” Wife / Exclusive Possession: The Benevolent Wife / Exclusive Possession: Young Shao’s Two-Faced Loveable Wife / Ji Shao’s Two-Faced Beautiful Wife / 今度こそ華麗なる復讐を / 姬少的腹黑娇妻 / 独家占有：姬少的腹黑娇妻","In her previous life, her sister took everything from her and imprisoned her in a dark place for three years! Thank God for giving her a second chance to live. Watch how she makes a comeback, starts a beef with thots and scumbags, and win over the Prince Charming."]},{"title":"Hidden Love","tags":["Drama","Romance","Shoujo"],"disc":["Read manga Hidden Love / Hidden Love: Can’t be concealed / My Secret Crush / Cinta Tersembunyi / 偷偷藏不住","That year, Someone secretly wormed their way into Sang Zhi’s heart. Falling in love with her brother’s friend Duan Jiaxu. This elder brother has beautiful peach eyes and casually calling her a “kid”. The surprise when they first met made Sang Zhi want to slowly get closer. But the 7-year-old age difference seemed to be an insurmountable gap for them. Not knowing when it started, the secret love buried in her heart gradually sprouted, and slowly, it spread into his heart too…"]},{"title":"I Stole the Heroine’s First Love","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Stole the Heroine’s First Love / 여주의 첫사랑을 빼앗아 버렸다"]},{"title":"It’s Lonely to Be Invincible","tags":["Action","Adventure","Fantasy"],"disc":["Read It’s Lonely to Be Invincible","Lin Fan was transported to another world, into the body of a normal disciple. Given the environment he was in,","Lin Fan faced the risk of being killed at any time. However, something was out of place.","Starting the system.","Ding: You’ve received an infinite level buff: Immortality","From then on, everything changed. To Lin Fan, if anyone could kill him, he would concede defeat. Otherwise, he would turn them into mincemeat.","To his opponents, they have given up because it was impossible to kill Lin Fan."]},{"title":"The Gambled Bride, Loved by a Wicked Lord","tags":["Comedy","Fantasy","Romance"],"disc":["Read manga The Gambled Bride, Loved by a Wicked Lord / Kakerareta Hanayome wa Akutoku Koushaku ni Mederareru / 賭けられた花嫁は悪徳侯爵に愛でられる","Living in the slums, Claire must work herself to the bone to support her alcohol addicted father. One day, he decides to wager her off at a gambling house in order to pay his debts…”I bet my own daughter!” Claire’s fate is now in the hands of whoever wins her in a game of dice."]},{"title":"Shao Hua Long: Rebirth of the Evil Concubine’s Counterattack","tags":["Fantasy","Romance"],"disc":["Read manhua Shao Hua Long: Rebirth of the Evil Concubine’s Counterattack / 韶华珑：重生之恶妃逆袭","The noble concubine Wan Hualong was only one step away from the throne, but she was seriously ill and trapped in the palace for seven years. Before her death, she knew that the emperor married her only to use the power of her family to claim the throne. In this life, he was poisoned by pillowman and betrayed by his biological father. After being reincarnated, with the means of her previous life, she got rid of her fiancé, took revenge on her miserable father and stepmother, and let her bullies learn a lesson. After escaping from all the evil fates in his previous life, he ran the first silver building in the world and finally embarked on the Shaohua road."]},{"title":"The S-Classes That I Raised","tags":["Action","Adventure","Comedy","Drama","Fantasy","Shounen","Supernatural"],"disc":["Read manhwa The S-Classes That I Raised / My S-Class Hunters / An F-rank Hunter","That too, a useless, pathetic F-rank hyung who dragged down his amazing S-rank brother.\nTo me, who’d halfheartedly lived a disastrous life that’d ended up devouring my brother’s life and making me regress, the title given, was…\n‘Perfect Caregiver’\nThat’s right, this time, instead of fussing about myself, let’s quietly look after those amazing bastards…\n…was what I’d thought, but the S-ranks are… a little weird."," "]},{"title":"Rebirth of the Wonderland","tags":["Action","Adventure","Comedy","Drama","Fantasy","Romance"],"disc":["Read manga Rebirth of the Wonderland / 乐园复兴 / Lèyuán Fùxīng","A young girl named Ji Yue, finds herself drawn into the world of “Alice in Wonderland,” a fairytale book left behind by her missing brother. Alongside Long Ya, an apprentice librarian at the Ark Library, they discover that the once idyllic fairytale paradise described in the book has transformed into a twisted haven of sin. Pursuing clues related to this darkened paradise left by her brother, Ji Yue and her companions set off on a quest to find her brother and unravel the true nature of this distorted wonderland."]},{"title":"Ghostly Spirit","tags":["Drama","Horror","Manhwa","Romance"],"disc":["Read manhwa Ghostly Spirit / 귀령","By the Author that brought you Eternally Regressing Knight Seamdang, a small hermitage nestled in the foothills of Jirisan, is filled with the fragrance of pear blossoms. Hayeon, a descendant of a shaman from the southern provinces and the reincarnation of a heavenly maiden, meets Geonwoo, a young man who can intervene in the spirit world through his vajra. Together, they resolve the sorrows and grudges of the world while vanquishing evil spirits."]},{"title":"Alien Abyss: Restart Era","tags":["Action","Adventure","Fantasy"],"disc":["Read manga Alien Abyss: Restart Era"]},{"title":"Hunter Academy’s Strongest Battle God","tags":["Action","Adventure","Fantasy"],"disc":["Hunter Academy’s Strongest Battle God, Hunter Academy’s Battle God, Hunter Academy’s Greatest War God, 헌터 아카데미의 최강투신","Synopsis :","With an F-rank Trait, deemed the worst of the worst, 5-year-old Shin Yu-sung is abandoned by the Shin-oh family, which is famous for raising hunters.","The same year, he meets one of the strongest hunters, the Fist King, at the orphanage and is adopted by him.","The Fist King became the strongest not through his Trait or special abilities — but by training his body.","He takes note of Shin Yu-sung’s physique instead of his Trait—","Nine blocked yin pathways. “Your blocked pathways cause your body’s mana to overflow, giving you an exceptional mind and god-like looks! But you also pass away before coming of age…”","An abundance of bodily yang. “Your body is overflowing with the energy that can cure your nine blocked yin pathways!”"]},{"title":"I Didn’t Save You To Get Proposed To","tags":["Drama","Fantasy","Isekai","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Didn’t Save You To Get Proposed To / I Don’t Need A Proposal / Princesse malgré moi / 我只是单纯的想救你 / 白月光男主非要娶我 / 皇子を助けたら求婚されました / 청혼하라고 구해준 건 아니었는데","An ordinary woman is reading her favorite novel on her way home when she gets into an accident. As she loses consciousness, she hears a voice say, “my name is Elsia Artize. Please save him for me!” When she awakens, she finds she’s become Elisa herself! Destined to die early, the new Elisa knows the only way to escape death is to save her crush, Prince Ixion, from assassination. Though she succeeds and is now ready to live her own life, the prince complicates things when he proposes marriage!"]},{"title":"I Underestimated My Oshi’s Attachment","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Synopsis I Underestimated My Oshi’s Attachment\nEstefania worked herself to the bone for her family’s sake, while they took her for granted. One day, Estefania realized that, reincarnated in the world of her favorite novel, she was a supporting character who didn’t have much time left to live. She closed the book on her days of living in her family’s shadow, and set out to meet her oshi, the Grand Mage Synil Crown. However, as Synil is cold-hearted and ruthless, she had thought to be satisfied with just seeing him once, but before she knew it, she became the target of his attachment―!?\n“S- Synil-sama, isn’t this a bit too close…?”\n“In what way?”","Note: An “oshi” is a favorite member in an idol group or a favorite character from a story, movie, game, etc."]},{"title":"The Last Immortal’s Theorem","tags":["Drama","Fantasy","Historical","Magic","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Last Immortal’s Theorem"]}]