[{"title":"Kiss Sixth Senses","tags":["Comedy","Romance","School Life","Shoujo","Supernatural"],"disc":["Read manhwa Kiss Sixth Senses / 키스 식스 센스","The moment Hong Yesul kisses, she can see the future! When accidentally kissing her boss, Cha Min-ho’s neck, she sees herself with Cha Min-ho in the future lying in bed! She tries hard to deny the terrible future so that it doesn’t become a reality, but Cha Min-ho keeps coming to her! Is there a real romance between them that is worse than their enemies?! A breathtaking, hot super-sensory romance ."]},{"title":"Why The King Needs A Secretary","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Mystery","Romance","Shoujo","Tragedy"],"disc":["Read manhwa Why The King Needs A Secretary / The Reason Why the King Needs a Secretary / 패왕에게 비서가 필요한 이유/ The Tyrant’s Secret Secretary","Celestia lives in the back alley of Golddina and has a skill that can dispel magic.\nShe thinks that her skill is useless and supports her talented friend Serengevan instead.\n“Get that crazy bit*h out!”\nBut he betrayed her and sold her as a s*ave even though they promised to get married.\nIn her inescapable despair, a man who looked to be a nobleman appeared before Celestia and seeing his condition, Celestia proposes a deal to him.\n“I can heal the disease you are suffering from.”\n“…Where did you hear about me?” The man’s face was getting increasingly scary but Celestia wanted to live.\nShe eventually got what she wanted, and arrives at a place which resembled the imperial palace.\n“In the future, call me ‘Your Majesty’.”\n“…Your Majesty?”\n“Of course, I’m the one and only Emperor of the Burg Empire, Van.”\nSurprisingly, the identity of the man is…\nThe Emperor of the Burg Empire, known as the Red-Eyed Psychopath.\nCelestia became one of the emperor’s subjects.\nCan she survive safely?\nThe Reason Why the King Needs a Secretary"]},{"title":"Governess of a Tyrant","tags":["Drama","Fantasy","Historical","Isekai","Magic","Romance","Royal family","Supernatural"],"disc":["Read manhua Governess of a Tyrant / Blackened Duke Strategy Plan / Hei Hua Gongjue Gonglve Jihua / Hēi Huà Gōngjué Gōnglüè Jìhuà / 黑化公爵攻略计划","Ann is a book lover, and her newest addiction is a novel called Death of The Evil Duke Gerald. In the story, Duke Gerald is hated due to his cruelty but as Ann dives deeper into the story, she wonders if his demise could’ve been avoided had he not lost the people he loved. She shakes off the thought, realizing that she cannot change the story’s ending…that is until she gets transported into the novel. Ann is informed that she has 90 days to change the duke’s fate and if she fails…she will never be able to return to her world again."]},{"title":"Travelling Through the Universe’s Flower","tags":["Fantasy","Historical","Romance"],"disc":["Read manhua – Travelling Through the Universe’s Flower / Blooming Through Time / Chuānxíng Shìjiè Zhī Huā / The Flower of the World / 穿行世界之花 ","I’m a renowned genius in the History Department of my college, but I can’t believe that I’ve travelled back in time into the body of a princess whose country was defeated in war!\nWas my being a genius in history all for nothing?! And not only am I stuck in the past, I’m having an arranged marriage with the Westerners as well! Moreover, I’m being married off to a country that runs of magic and has severe gender inequality issues.\nBut don’t you dare underestimate me! You’re looking down on me, a princess of a defeated country? Well, I’ll show you who’s the real expert here!"]},{"title":"The brightest giant star in the world","tags":["Comedy","Drama","Manhua","Romance"],"disc":["Read manga The brightest giant star in the world / The No.1 Superstar","She, the prodigious girl that stood at the pinnacle of the Global Martial Arts Competition, won the championship for five consecutive years, dominated the arena, and was dubbed the undefeatable king! He, a top tier superstar born into a wealthy family, possessed transcending beauty, was cold and black bellied, and had countless fans. When she accidentally reincarnated, as his fiancée, a sky full of blackmail material from trivial white formicas flying around, facing a world full of black fans, Lin Fan laughed coldly: If the whole world dissed her, then she’ll make the whole world tremble! Even if the wind blows against her, she would never back down!"," "]},{"title":"Ignorant me Became a Princess in another world","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Ignorant me Became a Princess in another world / The Ignorant Girl Becomes A Princess / I’ve Become a Princess Because I’m Ignorant of This World / I, Who Am Ignorant of This World, Became a Princess / 이세계에 무지한 내가 공녀님이 되어버렸다"]},{"title":"Kidnapped by the Earth","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Kidnapped by the Earth"]},{"title":"What Should We Eat?","tags":["Comedy","Cooking","Drama","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa What Should We Eat? / I Need a Meal / 식사가 필요해","Really? Chocolate for breakfast? Despite having 0 interest in food, Mia is a longtime fan of the famous cooking YouCuber Woonha, aka “Cook-it-All.” In a strange turn of events, he ends up moving into her place, where he discovers her horrifying eating habits. This just makes him want to make her a nice, home-cooked meal…!"," "]},{"title":"Mademoiselle Will Mess Around","tags":["Drama","Liexing","Ping Ping Jun","Romance"],"disc":["Read manga Mademoiselle Will Mess Around\n“To revenge is one thing. To conquer the bossy president is another.” Tong Yue has witnessed her mother’s death in childhood. The nightmare still hunts her over years. This time she comes back to the Tong’s mansion and swear she will take what belonged to her back. However, Han Tianlin, the most wealthy man in Long City, appears in her life. Tong Yue considers it a great idea to make use of him. But smart as Han Tianlian, would he be played around? What would he do when he finds out the plan of his tricky mademoiselle?"]},{"title":"Moracmorac Crown Prince","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Moracmorac Crown Prince / 雾气袅袅王世子 / 모락모락 왕세자님 / Morangmorak Wangsejanim"]},{"title":"A World-Class Walkthrough","tags":["Action","Adventure","Fantasy","Isekai","Manhwa"],"disc":["A World-Class Walkthrough manhwa, 초월급 엑스트라의 공략집\nThe main character, Kim Kyung-Sam, is an orphan preparing for the civil service exam while working part-time at a convenience store.\nWhile immersed in the game ‘God Forsaken World’ and playing the scenario of ‘Gilosan Ello D’ Baltic’, the fallen Third Prince of The Empire, without realizing it, he is transmigrated into that character.\nThe worst part is that at the time it happened, the fallen Third Prince, better known as ‘The Pig Prince’, has been kidnapped and is on the verge of execution…!\nWe will see how Kyung-Sam uses his knowledge of the game to overcome various crises!"]},{"title":"The Hidden Saintess","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Hidden Saintess / 숩겨진 성녀\nMany years ago, there lived a knight who loved a saintess. Not wanting to hurt her with his personal feelings, he made sure to always keep a safe distance. However, the saintess eventually died in his arms and the devastated knight swore, with bitter anguish, ‘If you get a chance at another life, I’ll make sure that you will no longer live as a saintess.’ After a long 300 years, the saintess was reborn. Will their wishes finally come true in this life?"]},{"title":"Queen Of Kisses","tags":["Drama","Josei","Mature","Romance"],"disc":["Read manhwa 키스의 여왕 / The Queen of Kisses\nA woman who makes anyone want to kiss the moment she sees it, world star Son Yu-ri, nicknamed the ‘Queen of Kiss’, holds a grand wedding after a dramatic devotee to Dave Chun, a billionaire in the IT industry. Rejecting her mediocre honeymoon and embarking on the greatest honeymoon on earth, she finds herself caught up in a storm of mad love and immense fate on her romantic first night… “The man you knew is dead.”"]},{"title":"Lady, Shall We Go Together?","tags":["Manhwa","Romance"],"disc":["Read manhwa Lady, Shall We Go Together? / Dear, Come With Me / 레이디, 함께 가실까요?","Crown Prince Cael appeared before Irene, the knight abandoned by the kingdom to whom she had been loyal all her life. He had declared to worship her, kissing the ground she walked on, for he desired to be her husband. For a moment, Irene’s heart shook. Will Cael be able to capture Irene’s heart?"]},{"title":"Hanyang Diaries","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Hanyang Diaries / 한양 다이어리"]},{"title":"Heilang: The Bride Of The Black Wolf","tags":["Action","Fantasy","Historical","Romance"],"disc":["Read The Black Wolf’s Bride / Heukrang: The Black Wolf’s Bride / Heugrang: The Bride of the Black Wolf / 흑랑 : 검은이리의 신부","Black wolf. A spirit being that protects the northern land and a black wolf who hunts for the wandering souls. he, who had no desire had but something he craves. A spirit medium who was born into the human world.\n“I can’t promise to be with you for the rest of my life. nevertheless, I’m craving for you”.\nThe only woman who makes heilang’s indifferent and insensitive heart was move with emotions. his world began to change due to the cunning and innocent person."," "]},{"title":"A Chance at Last","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa From Now On, Romance  / 이제야 연애","Sisters Ju-eun and Hyejin grew up in absolute poverty. After their mother’s death, Hyejin accepts the offer to join their estranged father’s wealthy family. But when Hyejin turns out dead just three years later, Ju-eun is grief-stricken. She grabs at the chance to travel back in time and take her sister’s place where she meets the kind but mysterious Iho."]},{"title":"My Secret Roommate","tags":["Drama","Romance","Shoujo","Webtoons"],"disc":["Read manhwa My Secret Roommate / 은밀한 나의 동거인","Sooha, who’d licked her lazily like a languid predator, tilted his head and tried to kiss her. Hyemin leaned her upper body back as much as possible. Sweat traveled down her spine. As he continued, sounds she heard outside made her nervous. They can’t get caught. Never, at least for the sake of her life’s peace and serenity! “A-At home.” She bit her lips and whispered seriously, as if trying to negotiate. At that, his languid eyes briefly lit up. “Home?” “Yeah! I’ll discharge you from the hospital. So at home…” “Let’s continue?” Irritated, she pushed his shoulder. But in the end, she couldn’t slip out. “No.” He, who kissed her glistening lips repeatedly, smirked and placed his body over hers again. “I don’t want to. I can’t wait, Honey.” Song Hyemin is a fourth-year resident at Songlim University Hospital, facing the worst crisis of her life thanks to A-list celebrity Lee Sooha, who suddenly visited her. My secretive and dizzying roommate story, as hazy as it is lovely."]},{"title":"The Dukedom Is Inhabited by a Monster","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Dukedom Is Inhabited by a Monster / The Dukedom Is Inhabited by a Monster / A Monster Lives in the Duchy / Beast in Territory of the Duke / 그 공작가에는 괴물이 살고 있다","Freesia has always been shunned by everyone around her because of her red eyes.","However, she still wanted to express her heart to Ben on his birthday, her benefactor.","But on the eve of her birthday, she found Ben with red eyes drinking blood in the woods…","So she learned the true identity of Ben, a vampire in the fairy tale?!"]},{"title":"Beware of the Villainess!","tags":["Drama","Manhwa","Romance"],"disc":["Read Beware of the Villainess! / 그 악녀를 조심하세요! / ¡Cuidado con la mujer malvada! / ¡Cuidado con la villana! / Geu Angnyeoreul Josimhaseyo! / 恶毒女配今天不营业","I became the villainess of a novel! Do I hate it? No! I find it rather nice. A duke’s daughter = a jobless rich person. How I can miss out on a chance like this?! This is the best chance to just enjoy life. I should throw out the main plot and just live life how I want to! Not long after waking up as the villainess, I witnessed my fiancé, the novel’s male lead, the crowned prince, cheating. I saw him embrace a lady other than I and he was smiling so bright. I was brought to tears… Just kidding, I didn’t cry! My tears are worth too much to be wasted on that garbage. Instead of tears, I yelled out, “Your highness, are you trash?” The main character with a personality of a refreshing soda! The girl-crush protagonist that will completely throw out the main story! Why? Because it’s a waste for a girl to be surrounded by cheap cars. (cars = men)"]}]