[{"title":"Underworld Emperor Only Favors His Yin-Yang Concubine","tags":["Historical","Manhua","Romance"],"disc":["Read manhua Underworld Emperor Only Favors His Yin-Yang Concubine / Míng Dì Dú Chǒng Yīn Yáng Fēi / Underworld Emperor Only Favors His Yin-Yang Concubine / 冥帝独宠阴阳妃","He is the Nether Emperor who has the ambition to dominate the Three Realms, and she is the Onmyoji who guards the world. They are enemies for thousands of years, but they are entangled for thousands of years, and their love is unbreakable! She reincarnated for a thousand years, and he waited for a thousand years…"]},{"title":"Trapped in a Fan Fiction With My Bias","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Trapped in a Fan Fiction With My Bias"," "," "]},{"title":"My Wizard, My Destiny","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa My Wizard, My Destiny / I’m Your Wizard / Yo soy tu mago / Your Wizard / 당신의 마법사 입니다","Prophet Liye falls into a world where magic exists and wakes up as a woman that a shaman doctor resurrected when she was a little girl. Tanaril, a wizard cursed by a witch to never have children with any woman, meets Liye at a hotel bar by chance. After drinking cocktails from a bartender at the bar, they spend the night together. Tanaril misunderstands that Liye approached him on purpose and accuses her of approaching him to take advantage of his high status. Despite how she was offended by his accusations, she became pregnant with his child. After announcing the pregnancy through a magical letter, the two get married by contract for different reasons and purposes. She knows she shouldn’t fall in love with Tanaril, since she’s from a different world and all that. It’ll be a piece of cake since Tanaril is a cold, distant person, right? But her expectations are ruined when she discovers that Tanaril is actually caring and warm.."]},{"title":"Help, my boyfriend is a ghost!","tags":["Comedy","Drama","Manhua","Romance","Webtoons"],"disc":["Read Help, my boyfriend is a ghost! / Save Me, My Boyfriend is a Devil! / Help! My boyfriend is a monster","A traffic accident turned Fang Linlin into a cat. Not only does she now have a full-time job as a wet nurse to three kittens, she even has to deal with the chairman’s 24/7 assault on her fur! Chairman: “From now on, you’re my cat. Remember that.” “It sure is distressing, being this outstanding. It must be tiring being my cat, right?” Fang Linlin: “Haha.”"," "]},{"title":"A Song Dwelling In The Clouds: Love Inside The Cage","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua A Song Dwelling In The Clouds: Love Inside The Cage / 云想之歌笼中之恋","",""]},{"title":"Baby Empress","tags":["Comedy","Fantasy","One shot","Romance"],"disc":["Read manhwa Baby Empress / 아기 황후님","The child of a prophecy is born to save the world. “I need to get married to save people…? I’ll do the marriage!” The emperor is a young and innocent boy. But… “I can’t give you my daughter! She will not be becoming empress.” My father interfered with my marriage! “Is my sister just a toy to you?” And my brother too! Will I be able to save the world?"]},{"title":"The Young Lady Tames the Main Leads","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Young Lady Tames the Main Leads / The Young Lady Tames the Male Leads /꼬마 영애님은 주연들을 길들인다","I was reincarnated as a young lady who had no importance in the novel.","My goal is to live a peaceful life!","However, I met all the main leads of the original story in kindergarten.","I can’t believe I’m meeting all the main characters!","“What are you looking at? Get out of the way.”","“……This body is scheduled for early admission to the Academy soon. The level is not right.”","“How dare the young lady think to talk to me!”","For a moment I was delighted, but somehow no one seems to be very pleased with me.","But I can’t miss the chance to build a solid network with future heroes!","So I started getting close to them one by one……","When I woke up, everyone was fighting each other to take my side.","Oh, what should I do with these dummies?"]},{"title":"If You Touch My Little Brother, You’re All Dead","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo"],"disc":["Read manhwa If You Touch My Brother, You’re All Dead / If You Dare Lay A Hand On My Little Brother, You’re All Going To Die / 내 동 생 건들면 너희는 다 죽은 목숨이다","I became sixteen-year-old Rosalette. After falling out of bed and opening my eyes, I had possessed a character in ‘Asterion of the Blue, Starry Night’, a classic BL novel with over dramatization, tragedy, blind passion, and madness. Moreover, it’s the character Rosalette. Rosalette is the older sister to Asterion, the male lead who commits suicide when his life reaches a dead end. Following the flow of the story, when I reached the end, I returned to the point when I possessed sixteen-year-old Rosalette. Thinking that was the wrong answer, my brother was then raised beautifully, only to be killed by an outside factor and I returned again. I decided to change course. I decided to focus on myself and train. This also doesn’t seem to be it. I learned magic but returned. I had a party celebrating the completion of my magic tower graduation thesis, yet still returned. Endlessly returning to sixteen-year-old Rosalette Roxburgh, I am looking for a way to peacefully die."]},{"title":"Silent Night","tags":["Action","Adventure","Survival","Thriller"],"disc":["Read manhwa Silent Night / 침묵의 밤","The famous writer Logan died, leaving behind a mysterious novel! His daughter, Leah, digs up the truth behind her father’s death and the stories of the villagers in the first part of the manuscript…\nNight of Silence"]},{"title":"Warrior High School – Dungeon Raid Department","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Warrior High School – Dungeon Raid Department / 용사고교 던전공략과","An Earth in the 21st century that has fused with another world. An era of “dungeons” teeming with monsters and the “adventurers” that raid them. Also, the most elite educational facility in South Korea that fosters these adventurers: “Warrior High School.” Although he was once considered the greatest adventurers in Asia, he has been accused with false chargers and, while dungeon smuggling in order to pay for his sick father’s medical treatments, Yoo Jaryong comes across one teen. “You there, get in Warrior High School.” This is a story about a young man who’s lost his dream, hiding his identity, finding himself once again."]},{"title":"The Tyrant’s First Love","tags":["Drama","Fantasy","Historical","Romance","Supernatural"],"disc":["Read The Tyrant’s First Love / Cinta Pertama Sang Tiran / El Primer Amor Del Emperador Tirano / 폭군황제의 첫사랑 / 侍女的帝君 / Le premier amour du Tyran / Pokgunhwangjeui Cheotsarang / Poggunhwangje-ui Cheos-salang / Pokgunhwangje-ui Cheotsarang / 暴君皇帝の初恋","From the moment she woke up in a foreign land with no memories of her past, Dia knew she was fated for misery. Taken in by a baron but beaten and abused for four long years, her only friend was the eldest son of House Knolls. Everything changed when the sadistic Emperor Caire, notorious for having a macabre hobby, barged into the mansion and gazed deeply into Dia’s eyes. Soon she is whisked away to his opulent castle, where gothic nightmare of blood and lust unfolds. Could the bloodthirsty emperor hold the key to unlocking Dia’s past?"]},{"title":"Beware Of Your Boyfriend","tags":["Drama","Manhwa","Philosophical","Romance"],"disc":["Read manhwa Beware Of Your Boyfriend / Watch Out For Your Boyfriend / Boy from the Future / Awas Pacarku Aneh / Beware of Your Boyfriend / 남자친구를 조심해","Da-In and Si-Hyun are in the same class, but they’ve never spoken to each other. One day, an unfamiliar guy appears and says he is the Lee Si-Hyun from the future, and that they’ll go out with each other. Da-In doesn’t believe him, but as his predictions come true, she starts to trust him. As Da-In shows interest in Si-Hyun, their classmates say they are flirting with each other. However, Si-Hyun has a twin who looks exactly like him. Just what is the identity of this unfamiliar guy…?"]},{"title":"The Killer Lives Next Door","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Killer Lives Next Door / 옆집에 킬러가 산다","A killer who can completely conceal all traces of his existence has been hired to deal with the target while keeping a low profile. However, the place where the killer infiltrated was an apartment in Korea that had poor soundproofing levels. Everyone can hear everything that is happening in the apartment. It is in this place that the killer is to monitor the target until given further instructions. All he wants to do is to complete his mission in peace. However, things just won’t go his way."]},{"title":"From the Serpent’s Eyes","tags":["Adaptation","Drama","Fantasy","Historical","Reincarnation","Romance","Shounen Ai","Supernatural"],"disc":["Read manhua From the Serpent’s Eyes / 遇蛇 / 蛇遇伝 / 뱀을 만나다 / Aux côtés de l’esprit serpent","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","The snake spirit Yi Mo and a scholar Shen Qingxuan met each other over a cup of tea. After Shen finally left with regret, Yi Mo realized that he counldn’t live without him, so he pursued Shen in his next lifetime… Can a mortal and a snake spirit fall into a romantic relationship?"," "]},{"title":"I Grow Stronger By Dying!","tags":["Action","Adventure","Manhua"],"disc":["Read manhua I Grow Stronger By Dying! / When I Die, I Will Become Stronger! / Wǒ Yī Zuò Sǐ Jiù Biàn Qiáng! / 我一作死就变强！","Lin Tian died unexpectedly while playing a game and crossed over to a different world, and obtained a perverted system where the more you die, the stronger you become!"," "]},{"title":"I Opened A Harem in Hell","tags":["Action","Harem","Manhua"],"disc":["Read I Opened A Harem in Hell manhua,\nZhang Xiao entered a game called “King of Hell”, but after his death, he came back to life in another body. From then on, he counterattacked and reached the peak of his life. Can he overturn the conspiracy of the whole hell on his own and conquer all the girls here!"]},{"title":"Hug Me, Bossy CEO","tags":["Liexing","Ping Ping Jun","Romance","Webtoons"],"disc":["Read manga Hug Me, Bossy CEO","After an accidental one-night stand, she left 200 bucks for the man as compensation.\n“We are strangers from now ooonnnnn—let me finish my sentence!”\n“You want compensate me? Then 200 bucks are far more than enough…I want a lifetime with you!”\nFollow the story with us and don’t forget to leave your comments. Hope that you will always support us <<teenmanhua.com>> thank you very much!"]},{"title":"I Don’t Want a Harem!","tags":["Comedy","Fantasy","Historical","Romance"],"disc":["Read manga I Don’t Want a Harem! / 我不要宫斗啊","The female leads who reincarnate into different worlds are usually both smart and brave, and possess special skills as the main characters. They avenge the original heroine who died a tragic death, then win over handsome men and conquer the world. But what would happen if a useless person reincarnated as the female lead of a harem story?"]},{"title":"The Touch of Your Magic","tags":["Fantasy","Magic","Romance","School Life","Slice of Life"],"disc":["Read The Touch of Your Magic","Getting struck by lightning, breaking a bone, failing examsㅡthese are the “accidents” that happen when one becomes friends with Jia. Bringing bad luck to people has been a condition of Jia’s for as long as she can remember… until she meets Gun and Hyunㅡ two mysterious brothers who happen to be wizards! With the help of magic, she’s determined to ward off her curse no matter what. But does Jia realize what kind of sorcery she’s actually getting herself into?"]},{"title":"I Met the Male Lead in Prison","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Met the Male Lead in Prison / 감방에서 남자주인공을 만났습니다","I met the male lead in prison. Okay. I get that I transmigrated into an R-19 tragic romantic novel, but why is he like this? “Bark! Bark! Bark! Grrrrrr…” I can’t believe this guy is held by a curse that makes him act like a beast…And that’s not the end of it, because when he returns to normal for a moment. “I-i-if you aren’t g-going to take responsibility for what you did to me, th-th-then don’t t-touch me!” At any rate, I felt relieved that I probably wouldn’t have any sort of romantic interactions with this guy. A year later… “Th-th-the day I leave this place, please…m-meet up with me!” Well it wouldn’t be a big deal to meet him once. But, then, when I was released from prison… *** “Welcome back. My lovely younger sister.” The day of my release, a man approached me. Turns out, I’m the villain’s sister. “You must have suffered going to prison in my stead. I waited only for you.” …F*ck. My brother’s the male lead’s sworn enemy? *** 3 years later, I met the male lead. He looked totally different than when I last saw him. “It’s been a while, Iana. I’m going to kidnap you now.”"]}]