[{"title":"The Fallen Sage Rises to Power with the UR Inheritor Skill","tags":["Action","Adventure","Fantasy"],"disc":["Read The Fallen Sage Rises to Power with the UR Inheritor Skill","In a world where “dungeons” connected to another world have appeared, people who awaken to mysterious powers and defeat monsters for a living are called “adventurers.” Yuto Kirishima draws the jackpot job of “Sage,” but for some reason, his magic power is zero! He is looked down upon as the weakest sage who can’t attack. Ultimately, he is abandoned by his companions and used as a sacrifice. Just then, a mysterious choice appears before him. “Do you want to perform this action?” When he answers, his abilities awaken and the UR skill “Inheritor” activates. This skill allows him to use the techniques of past sages! With the strongest skill in hand, the story of his struggle to rise as the strongest adventurer begins!"," "]},{"title":"The Archduke’s Flower Is In Jeopardy","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Archduke’s Flower Is In Jeopardy","Aidel Fluer was born as the only one in her family without scent or fragrance, which caused her to be treated as an “impure seed” and grow under constant persecution. However, despite longing for her independence, she ends up marrying Kaeron, a man of royal blood as intense as blue lava itself. For Kaeron, Aidel’s scent transforms him into a beast unable to control himself, which he finds deeply irritating."]},{"title":"Taming the Shrew","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Taming the Shrew / 말괄냥이 길들이기","A marriage that started unintentionally. But my useless husband demands a divorce on a whim. Leah, thinking she can’t just quietly get divorced like this, rushes off to a friend’s vacation home, where she encounters a leopard that saves her in a moment of danger. It turns out that the leopard is actually Yanok, the imperial prince and a shapeshifter. But this guy, despite looking all good on the outside, has a somewhat ‘cat-kid’ vibe…? “Leah, will you be my mate?” As this ‘cat-kid’ keeps pushing his way in, Leah starts to gradually tame him…"]},{"title":"I Failed To Throw The Villain Away","tags":["Drama","Fantasy","Historical","Isekai","Josei","Magic","Manhwa","Psychological","Reincarnation","Romance","Time travel"],"disc":["Read manga I Failed To Throw The Villain Away / My Dark Secret Haunts Me/ 흑막을 버리는 데 실패했다/ Failed To Abandon the Villain\nOne day, her father gave her a boy s*ave. He said he saved him from the battlefield because of his good looks.\n“He has a seal engraved on his heart. As long as you have this bead, he won’t be able to disobey you. So you can order him to do anything.”\n“Sit down.”\nThe boy looked rather grim after hearing what she ordered.\n“Ah, was I treating him too much like a dog?” As her father squeezed the bead, the boy then knelt at her feet.\n“Master”\nHis red eyes flashed, illuminating his eerie gaze while smiling madly.\nHe was the darkest of the darkest one. The future grand wizard and final boss of this world.\n“Well, you’re all that’s left now, Master.”\nAnd then, at the age of 22, he awoke as the Master of the Magic Tower and took revenge by killing her entire house.\n“Do you want to live? Then sit down, Master.”\nThe eerie red eyes turned to her.\n‘Why is he like this to me?! I tried my best to treat him properly!’\nMy Dark Secret Haunts Me\n흑막을 버리는 데 실패했다\nFailed To Abandon the Villain"]},{"title":"I Will Politely Decline The Male Lead","tags":["Action","Comedy","Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Will Politely Decline The Male Lead / I’m No Heroine! / 남주는 정중히 사양하겠습니다! / Namjoo will politely decline! / I respectfully refuse Nam Joo!","She was possessed as a villain in a novel in which she was miserably executed. I’ve tried everything to avoid the death flags, but in the end, only death surfaced. On the day of the third regression, I made up my mind. Let’s just live! “I’ll die if I live like this, and I’ll be killed if I live like that!” But was it because it had come too far from the original? The main characters’ interest in the original Female Lead seems to be directed at me somehow…?"]},{"title":"Youngest Son of the NamGung Clan","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read manhwa Youngest Son of the NamGung Clan / 남궁세가 막내공자","This is the story of NamGung DeSo, the youngest son of the NamGung Clan! After losing his dantian in the competition for the position of vice-patriarch, he then faces an unexpected death out of nowhere and regresses into the past… The youngest son of the strongest clan? Such a title is way too bothersome. Let someone else become the strongest person or whatever! Can the former trash of the clan make the most out of his second chance at life?"]},{"title":"For the Beautiful Juliet","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa For the Beautiful Juliet / 아름다운 줄리엣을 위하여","Enoch Latraki loves his wife, Juliet, even though she doesn’t love him back. But one day, she suddenly changes, becoming gentle and kind. Enoch is determined to find out why his wife has become so affectionate."]},{"title":"She Was Sent by God","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa She Was Sent by God / Your God Sent You / 너의 신이 너를 보냈구나","She mistreated her husband, thinking him heartless, until he died protecting her. Now, she’s returned to their wedding night three years ago. Determined to change fate, she vows to protect him as his wife, Agnes Arpad, no matter what."]},{"title":"I’m Done Being a Hero, Even If It’s Retirement","tags":["Comedy","Drama","Fantasy","Historical","kids","Manhwa","Romance","Royal family","Time travel"],"disc":["Read manhwa I’m Done Being a Hero, Even If It’s Retirement / 영웅은 됐어요, 은퇴라면 몰라도","In this life, I will never live as a hero! Retirement, maybe! “A hero should remain heroic until the end.” Adelia, a knight who dedicated her life to the empire and died as a hero. But when she opened her eyes… ‘Nine years old? Me?!’ She was back in her childhood! Back to when her family was still alive before the fall of their house! Alright, this is a chance given by the gods. This time, I will save everyone and enjoy perfect retirement in a quiet place! But then… ”Sister!!!” Not only did she awaken the holy sword that had been asleep in the temple for 600 years, “Does the lady prefer tall men?” “…What?” The Crown Prince, who was her superior in her previous life, is showing interest in her? What is happening! I just want to retire quietly!"]},{"title":"Running Away at Night","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Running Away at Night / 야반도주는 신중히","“I was transmigrated into a crazy novel. Damn it.” In other words, she’s the wife of a man named Carlisle, who is an illegitimate child of the emperor and grew up to be like a maniac. As a supporting character, Lyrian dies at the hands of the female lead Yuria. Lyrian raised a husband who would grow up as a lunatic, but the problem is that the husband does not even intend to be separated from her, and the day the original storyline begins is approaching. Lilian finally decides to get away with a fake lover… “I like you, Carlisle. But I have to be with that man. I’m in love with…” Lyrian flees, Carlisle chases her, and the stories behind the original story she didn’t know when they began to unfold. “Do not leave me. If the pain I suffered was the price to meet you, then I’m willing to pay again and again.” How long will she be able to run away from her husband, who is chasing after her?"]},{"title":"The regressor only protects me","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The regressor only protects me / 회귀자는 나만 지킨다","Humanity has been designated as a disruptive species to the cosmic ecosystem.\nA survival game, initiated by the cosmic overseers, begins to reduce humanity’s population. At the final stage, Jae-hee, a regressed player, reaches a conclusion.\nOnly Kang Sion can lead this game to victory. A genius with exceptional intellect, Kang Sion, a regressor who lost in the previous game, unravels the death game with overwhelming abilities."]},{"title":"The Ghostly Doctor","tags":["Action","Adventure","Drama","Manhua","Martial Arts"],"disc":["Read manhua The Ghostly Doctor / Fascinante Doctor Fantasma / Mesmerizing Ghost Doctor / 绝色妖娆：鬼医至尊","She, the leader of the hidden sect, specializes in poison and assassination. A genius, and a weirdo, in the eyes of others. After dying from an accident, she was reborn in the body of a disfigured lady. Having her identity changed and unable to return to her family, she abandoned them, but, if she doesn’t take revenge on those who caused her harm, will she be worthy of the title “The Ghostly Doctor “? As clouds gather, heroes fight to be the strongest! How will she conquer the world in a red robe, and fight among the strong heroes?!\nMesmerizing Ghost Doctor"]},{"title":"The Ultimate Wantless Godly Rich System","tags":["Action","Adventure","Fantasy"],"disc":["Read The Ultimate Wantless Godly Rich System / 终极肆意神豪系统 / The Ultimate Arbitrary Tycoon System","Hang Xingwang, who had been silently enduring life as a corporate slave, suddenly awakened the Ultimate Freedom System. The more he indulges, the richer he becomes! From then on, the lowly operations staff transforms into the top boss, stepping on simps and punching snobs in the face. Thus begins his journey as a godly tycoon!"]},{"title":"Growth-Type Superhero","tags":["Action","Adventure","Demons","Drama","Fantasy","Manhwa","Monster","Monsters"],"disc":["Read manhwa Growth-Type Superhero / 성장형 슈퍼히어로"]},{"title":"Invincible Territory","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Invincible Territory / 무적지경","I barely ‘escaped’ from my crazy master and made it out into the world of martial arts.","But from the start, I get entangled with the Demonic Cult… I won’t be used by them; instead, I’ll use them.","That crazy master. Until the day I can give that old monster a taste of his own medicine!"]},{"title":"The Crown Prince That Sells Medicine","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Crown Prince That Sells Medicine / 약 파는 황태자","I’m the crown prince? The frail and sickly crown prince in the novel? But I’m a traditional Korean doctor who specializes in medicine. I guess it can’t be helped. Reforming internal constitution, recovering of energy, invigorating vital energy, and increasing vitality. I’ll take care of my body from now on."]},{"title":"Seres’s Resolve: The Battle for Humanity","tags":["Action","Adventure","Fantasy"],"disc":["Read Seres’s Resolve: The Battle for Humanity, My System Is Serious, My System Is Very Serious, 勇者様のシステムは何かおかしい！, 我的系统很正经","I’ll never stop fighting tooth and nail to safeguard humanity and all people under heaven. It’s time to power up the system once more, ramping up its capabilities to meet this crucial challenge!"," "]},{"title":"I Became the Beastman’s Wife","tags":["Drama","Fantasy","Isekai","Romance","Shoujo"],"disc":["Read manhwa I Became the Beastman’s Wife / How to Tame Your Beast Husbands Comics / How to Tame Your Beast Husbands/ I Became the Beast Girl /  I Became the Beastman’s Wife / Chuān Chéng Shòurén Jiāo Qī Hòu Wǒ Huāngle / Passing Through to Be the Beastman’s Pampered Wife After I Get Panicky /  穿成兽人娇妻后我慌了","During her nightly programming session, Yin Zhu suddenly died and was transmigrated into a world of beastmen. She found out that the original owner of her new body drugged Teng Xiao… Her social awkwardness caused everyone to misunderstand her. She claimed to be uninterested in love and only cared about her career. From then on she used the system she created to help her tribe rise to the greatest from the wastelands. Starting from fine food, her covert changes stunned everyone. But why are whiny men coming to Yin Zhu every day telling her to stop doing business, and do them instead??"]},{"title":"Nine Dragons: COPÓKA","tags":["Action","Drama"],"disc":["Read manhwa Nine Dragons: COPÓKA / Record of Copoka: the nine dragons / Kowloon: Copoka / 구룡:사로카","Jin-tae becomes a killer after being saved by a man when he was at life’s lowest point. While searching for his long-lost sibling, he discovers that his younger sibling is in Hong Kong and deeply involved with the Triad, Hong Kong’s largest criminal organization. Thus begins Jin-tae’s journey as he confronts the Triad in the nighttime streets of Hong Kong while searching for his sibling."]},{"title":"Rewriting My Tragic Ending","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Revenge","Romance"],"disc":["Read manhwa Rewriting My Tragic Ending / 나의 데드 엔딩 후에 / After My Dead Ending","A turn of fate… by your own hand. Alicia Melfont vows to restore the former glory of her house after the Dark God’s agent massacres her family. But when a mysterious book reveals that she’s only a supporting character meant to die for the true protagonist of the story, Alicia decides she won’t let some silly book determine her fate."]}]