[{"title":"The Gap Between You and Me","tags":["Manhwa","Romance"],"disc":["Read manhwa The Gap Between You and Me / The Distance Between Us / 그대와 나 사이의 간격","Harrietta, the daughter of a viscount in the countryside, helplessly falls in love with Edwin, the heir to the most powerful and affluent family in the kingdom. Knowing how futile her dream is to be with him, she spends fretful nights, lacking the courage to speak to him. And then arrives the news about his engagement, which deeply breaks her heart. After much suffering, she begins to recover from the pain and pulls herself together when… “Check his face. He’s our new slave. He’ll be living with us from today.” Edwin comes to Harrietta’s house as a slave."]},{"title":"Becoming The Legendary Concubine","tags":["Fantasy","Historical","Isekai","Romance"],"disc":["Read manhwa Becoming The Legendary Concubine / Seikei Bijin no Youkihi Tensei / La concubine légendaire / หยางกุ้ยเฟย สาวงามทะลุมิติ / 整形美人の楊貴妃転生 / 整形美女楊貴妃 / 성형 미인의 양귀비 환생","People have never been kind about Mikiko’s looks. In an effort to change that, she gets plastic surgery and transforms into a woman of unrivaled beauty, but is killed in an accident the same day. She wakes up in the Tang Dynasty of ancient times, taking over the life of legendary concubine, Yang Guifei, who had just been assassinated by Consort Wu Huifei, a villain who intends to make herself and the emperor’s son, Shou Wang, successors to the throne. Yang Guifei was later named one of the Three Beauties of the World and in historical fact, although she was once married to Shou Wang, Yang Guifei becomes Emperor Xuanzong’s beloved consort. However, Mikiko, who replaces Yang Guifei, finds herself confronting the power struggles of the inner palace and the hidden romance between her and the “fake emperor” Shou Wang, something buried in the depths of history."]},{"title":"The Hero’s Daughter Avoids Death Flags","tags":["Drama","Fantasy","Manhwa","Romance","Villainess"],"disc":["Read manhwa The Hero’s Daughter Avoids Death Flags / 英雄の娘は死亡フラグを回避する"]},{"title":"Cold-hearted wife – it is not easy to bully her","tags":["Comedy","Drama","Manhua","Romance"],"disc":["Read manhwa Cold-hearted wife – it is not easy to bully her / Don’t Provoke the Contract Wife / My Contracted Wife is Cold to Me / Istri Kontrak yang Dingin / 契约冷妻不好惹","Shi Xia Ben is the envy of the president’s wife, but did not expect that behind the scenes is a contract marriage. The three-year deadline is approaching, but the president of Ao Jiao has proposed “let’s really do a fake show”. What if my husband does not act according to the contract?"]},{"title":"My Financial Backer is Only 5 Years Old","tags":["Drama","Manhua","Romance"],"disc":["Read manga My Financial Backer is Only 5 Years Old / My Patronizer Is 5 Years Old / My Patron Is Only 5 Years Old / Wo De Jin Zhu Zhi You 5 Sui / Wǒ De Jīn Zhǔ Zhǐ Yǒu 5 Suì / Your Heart Is Safe Now / 幸せのカタチ～御曹司の5歳児と疑似家族になったら～ / 我的金主只有5岁","A strange 5-year-old child suddenly identifies Shiqian as his mom after watching her on a talent show. Moved by the cute kid after he saved her from a molester, she agrees to become his “mother” and personal psychologist. The kid’s father also happen to be a handsome and powerful CEO…"]},{"title":"The Evil God Descends, I Own Great Hell","tags":["Action","Adventure","Fantasy"],"disc":["In the apocalypse, an evil god descends, devouring humans and threatening my homeland, China! Little do they know, I hold the control of the Demon-Suppressing Hell, where countless gods and ancient monsters from China have been secretly imprisoned for thousands of years! All for this moment… to annihilate the foreign gods and cleanse the human world!\n— Of course, if you surrender, as the Warden, I might consider letting you evil gods into the Great Hell to work on sewing machines. Meals and accommodation are provided, of course."]},{"title":"If You Don’t Know The Novel, You Will Die","tags":["Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa If You Don’t Know The Novel, You Will Die / 로판을 모르면 죽습니다 / If You Don’t Know Romance, You’ll Die / Be RF Savvy or Die / 不懂西幻言情文会死","Summary:","One day I was in a world that I did not know. [The entrance to the quest has been successfully completed! ]. [Quest (Main) – «Fix the world!». Content: This world was created by mixing four novels – Child Care, Contract Marriage, XXX, XXX. Genres are unknown. You must return the four distorted novels to the original. ]. But… I have no memory of their content. If I make a mistake… then I’m going to die?! Besides, the distorted web novel characters are interested in me! What should I do?!"]},{"title":"Regressor’s Life After Retirement","tags":["Action","Adaptation","Manhwa","Webtoons"],"disc":["After the first Gate opened in 2018, Lim Dae-In survived for 20 years on Earth while being connected to other dimensions. The day after his long-awaited retirement celebration, he regresses by 20 years, back to when he had nothing…"]},{"title":"I Just Want To Mooch Off Your Luck","tags":["Adaptation","Drama","Fantasy","Reincarnation","Romance","School Life"],"disc":["Read manhua I Just Want To Mooch Off Your Luck / I Just Want to Freeload on Your Luck / 我就想蹭你的气运"]},{"title":"The Scandalous Secret of the Crown Princess","tags":["Adaptation","Comedy","Crossdressin","Drama","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Scandalous Secret of the Crown Princess / The Crown Princess’ Secret / Rahasia Putri Mahkota / 次期王妃のけしからぬ秘密 / 세자빈의 발칙한 비밀","Min Bo Ha has magical powers. She could see a person’s memory when she touches them. She was abandoned by her family because they considered her powers to be a curse. After being dumped, Bo Ha survives as a boy. One day his father asks her to return home and forced her to become the wife of the Crown Prince to replace her sister who was said to be dead. Bo Ha is forced to enter the palace and marry the Crown Prince. Bo ha has to keep her life outside the palace a secret from the crown prince. Can she keep her secret well? [ Summary copied from Dynasty Scans coz Lezhin’s seems inaccurate ]"]},{"title":"The Fangs That Pierce the Heart","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural"],"disc":["Read manhwa The Fangs That Pierce the Heart","Born as the illegitimate second son of Loxollum’s king, Iblonde is sacrificed by his pagan mother to ensure that one day, he sits on the noblest seat in the kingdom. A few years later, Iblonde has started a new life as Abel, a serf of a baron’s domain. Aside from his tragic past, Abel harbors many secrets, including the fact that he is actually a girl. But the greatest secret of all is that Abel’s resurrected body is now occupied by Belial, the seventh king of hell, who has come to slowly plague the land…"]},{"title":"Gyeongseong Detective Agency","tags":["Drama","Fantasy","Historical","Manhwa","Mystery","Romance"],"disc":["Read manhwa Gyeongseong Detective Agency / 경성탐정사무소 / Gyeongseongtamjeongsamuso","In Gyeongseong, the city of glittering lights and glamorous desire, Gyeongseong Detective Agency has opened its doors at No. 45, District 1, Myeongchijeong. Sohwa, a 16-year-old servant girl, has nothing to her name but her wits and bravery. When she accidentally gets caught up in a secret scheme, she meets Jeong Haegyeong, a young man running his own detective agency. Chased by memories from the past, they must work together to clear her name."]},{"title":"The Demon King Dad and his Hero Daughter","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Read manhwa The Demon King Dad and his Hero Daughter / The Devil’s Father’s Brave Daughter / Demon Daddy Warrior Daughter / 마왕 아빠 용사 딸\nSelene, the daughter who dreams of becoming a hero, and Shion, the demon king who adopted her. Shion has to conceal his true identity at all costs, unable to cheer on his daughter’s dreams or attempt to stop her.\nThis is the story of Selene’s journey to becoming a true hero amidst this dilemma… Or is it the parenting story of the demon king?!"]},{"title":"Regression of the Close Combat Mage","tags":["Action","Adventure","Manhua"],"disc":["Read manhua Regression of the Close Combat Mage / 2周目の大魔導士は近接魔法で無双する","My biggest regret is not choosing that magic this time Ill definitely defeat you!! The human race is on the verge of destruction at the hands of Vidrak, the evil god who suddenly descended. The hero, the strongest long-range mage, is defeated by the evil god, who can dispel all magical attacks. However, when he wakes up he finds himself 10 years in the past, hes regressed to the “Rite of Mastery” at the Academy of Magic! While the students choose the magic system best suited to them, such as , , and , the hero chooses [Close Combat Magic], which was considered the least popular magic of the time, and chosen by those of lower ranks who lacked magical power. This is the only magic that can stand up to the evil god! The protagonist chooses this style of melee magic, which is considered lacking in every way, but utilizes his specialty precise control of magic power,” to dramatically improve his skills and overturn the world’s common sense!"]},{"title":"Grim Reapers’ Corps","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Grim Reapers’ Corps","Mu-hyun, the captain of the ‘Yaksha Corps’—an evil spirit disposal unit within the underworld—has worked tirelessly for the afterlife. However, he lost his precious colleagues in an instant. In order to bring them back, he must establish a union in the underworld."]},{"title":"Debuff Master","tags":["Action","Adventure","Fantasy"],"disc":["Debuff Master / 디버프 마스터","Han Taesung, a livelihood-type gamer cornered at the edge of a cliff.\n“I have been watching you for a long time.”\nDeus, a hidden NPC of level 999, appears In front of Taesung!\n[Would you like to become the disciple of the hidden NPC Deus?]\n[Yes!]\nThus the master’s teachings began!!\n“Two blows are not cool, you must defeat enemies in one blow.” Taesung becomes a who knocks down enemies in single blow.\nEveryone will fall prey! Defeat them in one hit!"]},{"title":"My Revenge on the Crimson Queen","tags":["Fantasy","Romance"],"disc":["Read manga My Revenge on the Crimson Queen / Seijo wa Tsumi o Yurusanai /  聖女は罪を赦さない","Elisa, the daughter of the count and a priestess-in-training, was devotedly working towards the betterment of her kingdom.\nDespite her humble and clumsy demeanor, she lived a life of contentment and peace, cherishing what she had. However, her world was shattered when her beloved older sister, Iris, who was dispatched to the palace as a consort candidate, was unjustly framed by the despotic Queen Paris, leading to the execution of their entire family.\nRescued by Prince Luka from a neighboring kingdom, Elisa plunged into despair after losing her dear family. Overwhelmed by grief, she swore to avenge her family’s death and unravel the truth behind Iris’s alleged treason. Elisa then adopts a new identity as Elena Porshal, the daughter of Viscount Porshal.\nHaunted by the question, “Why did my family have to die…?”, Elena embarks on a mission to unveil the truth. She enters the castle as the king’s latest consort candidate, determined to extract the truth directly from Queen Paris herself…!"]},{"title":"24 Hours Resurrection of the Villainess","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa 24 Hours Resurrection of the Villainess / 24 Hour Resurrection of the Villainess / 악녀 부활 24시","The laughingstock of the entire empire, the half-wit lady Erne, has been possessed by the infamous villainess, Erquana. In front of her eyes, a strange mission window appears. [Mission] Find true love! [Completion Condition] Fall in love with the strongest person in the world and form a bond. [Penalty] Retrieval of the soul of the sacrifice (Reincarnation not possible ♥). If she fails the ‘romance mission,’ she will die again?! According to the mission conditions, there are a total of three candidates for the strongest person she must bond with: the revenge-driven Crown Prince Kiers, the tower lord Siel, whose kind face doesn’t match his personality, and the merchant lord Raizen, who treats the owner of this body like a child. ‘Forming a bond with those men? Can I really survive this?’"]},{"title":"Exclusive maid of the evil empress","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Exclusive maid of the evil empress / 악녀 황후의 전속 시녀","Became the exclusive maid of the notorious empress. But what about the bad girl? The Empress is nothing but a petulant cat, and strangely she likes me. “Your Majesty, I don’t need to make my social debut.” “If you’re noble, you should make your official social debut at the ball. There’s nothing else to care about. Because I’m here.” ……I don’t want to make a social debut or anything. The empress quickly examined my appearance and even caught my scattered hair. I think the role of the maid-in-law and the empress has changed, but it’s probably because of their feelings, right? “If you show up holding the crown prince’s hand, it’ll be the best social debut ever. It’s a moment that every aristocratic spirit in the system dreams of.” I don’t dream! I glanced, speechless. Towards the crown prince, the greatest beauty of the empire called the work of art in human masks. Dressed up by the empress, a maid dancing her debut dance with the crown prince. What the hell is going on here?"]},{"title":"Insector","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Insector / 인섹터","One day at school, the class teacher turns into a “huge spherical insect beetle” and kills half the students. The Black Ant that appeared at that moment, which was able to save the rest of the students, becomes the main object of attention of the media and social networks, and its existence is no longer a mere legend of the level of urban ghost stories. Eventually the government decides to infiltrate a team of Bug Reapers, insector-catchers on a secret mission and, according to survivors, on the heels of the Black Ant. Black Ant’s personality is an ordinary high school student, Ka Mi-sun, who has an anthill in his body. So that the insects living in it do not eat it, the guy has to become an enemy of the insects and reluctantly fight."]}]