[{"title":"Bear with Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Bear with Me / 私に耐えてください / 请忍受我 / 나를 견디세요","With her followers decimated by other churches, Granchia, the goddess of rightful revenge, is on the brink of destruction. Restricted and bound to human form, she must protect and support her one last true believer…or cease to exist. Can she find a way to gather her servants and muster enough power to avenge the wrongs done to her believer and his family? Or will her enemies succeed in their mission to destroy her last follower, dooming her to oblivion?"]},{"title":"Please Get Out of My Household","tags":["Drama","Fantasy","Historical","Magic","Romance"],"disc":["Read manhwa Please Get Out of My Household / Please Get Out of My Clan Family / 家門から出ていってください / 내 가문에서 꺼져 주세요","“Why did someone like you have to be born in my household?” You shame of the Closieux Family, you disgrace, you good-for-nothing… All those were words pointed at Guinadella Clochel, the young girl who, at barely 11 years of age, was abandoned by her family and had her life taken away. Well, no… Rather, she thought that her life was taken away. “They’re absolute fiends. To think that they would bully and try to kill a weak child just because she has no talent…” — Said the ancestor of the legendary great mages of old while possessing the body of the dying girl?! This is a story about a great mage regaining their powers to bring judgment to a rotten family, and a young girl whose emotional wounds are healed with the mage’s help; about a timeless bond that links them as if being drawn to each other. A kind-hearted girl’s revenge against her family begins now!"]},{"title":"The Adopted Daughter Saves the World","tags":["Adventure","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhw The Adopted Daughter Saves the World / Adopted Daughter Wants to Save the World / ลูกสาวบุญธรรมอยากกอบกู้โลก / 養女は世界を救いたい！ / 입양딸은 세상을 구원하고 싶습니다","Chelianne lost her parents at a young age, so she turns to books to escape her bleak reality. When she gets close to the tragic ending of a book called “The Legend of Arfia,” she’s whisked away to Modeth, the Kingdom of Darkness on the continent of Arfia. There, she meets Carlten the Demon King, who’s immediately smitten by her cuteness. He decides to adopt her, giving her the family she never knew. But Chelianne knows the book’s ending is imminent, and she’ll stop at nothing to save the world!"]},{"title":"My Ruined Academy","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa My Ruined Academy / My Ruined Academy Life , This Academy is Doomed , 아카데미가 망했다","Amon Drake arrives in the capital with dreams of success.\nOn his first day as a teacher at the prestigious Amonis Academy,\nhe is met with shocking news:","“Haven’t you heard? This academy is on the brink of bankruptcy.”","On top of that, the only people left at the academy are a gambling-addicted principal and drunken teachers.\nAmon thought,","“If the academy goes bankrupt, doesn’t that mean my contract would become void too?”","They say escape favors the intelligent.\nIf you don’t want to waste your life away, bring the academy to ruin.\nThe story of a wise man’s escape from the academy begins now!"]},{"title":"Beethoven Reborn","tags":["Comedy","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa Beethoven Reborn / Beethoven Born Again / 다시 태어난 베토벤","Only music sustained me from the maddening pain. If only I could hear my music… with my own ears… Even as my soul was falling apart, I prayed to God… and prayed again. Ludwig van Beethoven is considered the greatest composer in human history. I closed my eyes like that. And 180 years later in Seoul. The saint of music, known as an immortal genius, has been reborn. And then I began to hear the voice of an angel. “Dobin.. Dobin..” Only music sustained me from the maddening pain."]},{"title":"So I Married An Abandoned Crown Prince","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa So I Married An Abandoned Crown Prince / 그래서 나는 폐태자와 결혼했다","I was betrayed by my lover and even lost my child, so I was given a second chance.","‘I’ll pay back everything.’","I will send my deceitful lover and his mistress into the deepest hell.","My kind husband, who foolishly put up with me even though I only took advantage of him. I will only let him walk on a flowery path.","When did it start?","When did everything start to get messed up?","“Please, be happy with your loved one.”","“Wife, are you saying that you want me to meet another woman?”","“Queen, I won’t say I like you anymore, so don’t run away from me.”","Even the greatest assassin in the empire, who only cares about his interest, was clinging into me.","‘What’s wrong with everyone! I want to run away to another country and lead a peaceful life!’","Will I be able to escape safely?"]},{"title":"A Genius Writer’s Random Workplace","tags":["Comedy","Drama","Fantasy","Manhwa"],"disc":["Read manhwa A Genius Writer’s Random Workplace / Genius Artist’s Random Studio / The Genius Artist’s Random Studio / 천재작가의 랜덤 작업실","After working as an assistant writer for 6 years, Kim Jinwoo couldn’t endure the mistreatment any longer. In the end, he boldly threw the script at his boss’s face and resigned! The aftermath? Well, it’s either the talk of the town among high schoolers during the girl group music bank commute or while watching it live… Here I am, being a legend with this story… Suddenly, a status window appears before me, and a hilarious drama story pops up in my mind! Yeah! With this ability, I can debut as a drama writer too! But… the place to write is randomly assigned?!"]},{"title":"Corrupting the Heroine’s First Love","tags":["Drama","Fantasy","Manhwa","Romance","Transmigration"],"disc":["Read manhwa Corrupting the Heroine’s First Love / 여주인공의 첫사랑을 타락시켜 버리면","“I am a knight of Latem, and that means I cannot coexist under the same sky as you.” The body I inhabit after entering the book is, unfortunately, a member of a species that reigns as the evil of the world, Karina Apocolypta. However, in the original work, the novel’s plot begins to twist as she saves the life of Reneiger, the first love of the female protagonist, who happens to be a holy knight. Reneiger begins to doubt his faith, ultimately losing his brilliant platinum hair. Thus, the once sacred holy knight turns corrupt and eventually sympathizes with Karina’s fate… “Now we have each other’s desires,” Karina said while caressing his cheek. It was a feeling of being pulled in by each fascinating tendril of thorny vines. Reneiger couldn’t bear it. “It can’t be undone.”"]},{"title":"The Princess is Evil","tags":["Drama","Fantasy","Historical","Isekai","Magic","Manhwa","One shot","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Princess is Evil / The Wicked Little Princess / 황녀 님이 사악 하셔","I’m a witch that’s over 300 years old, but I died at the hands of a human I’d trusted. I thought I’d be stuck in the spiritual world forever, but I reincarnated as the princess of a violent and bloody imperial family, where siblings would murder each other for the throne. Honestly, at this rate, I should just become the next emperor. I’ll conquer the entire continent and attain my sweet revenge on Lacuz. And so, I turned to evil and wicked ways, as befitting my role as a witch. “You. Become my vassal.” I even won over the princes with my overwhelming strength. So I thought that everyone would fear me, but… “I picked this up for you. You can decide to eat it or throw it away.” “Can’t you touch me just once? If I tell others that you stroked my head, they would be so jealous.” …What the hell? What’s going on with them? Wasn’t this imperial family full of violence and murder? Shouldn’t they be trying to kill me? “Keep doing it more. You’re so cute.” “You’re cute no matter what you do, so do whatever you want.” “You’d be cute even if you killed someone…” The whole lot of them must have gone insane. They’re all showing such unconditional love and affection towards me. “What do you think of a man 200 years younger than you?” To make things worse, the head mage of the magic tower, a complete oddball, is now clinging to me. …Will I be able to sit on the throne?"]},{"title":"ROYAL MARRIAGE","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa ROYAL MARRIAGE / 로열 메리지 / Casamento Real / Pernikahan Kerajaan / Королівський шлюб / ロイヤル・マリッジ","A symbol of money and beauty, Tatiana Cartier, the best bride of the Empire.\nWith the overflowing love of her mother with absolute power and her four beautiful sisters, the only thing left for her is the Duchess.\nA thunderbolt fell ahead of the engagement announcement that will finally mark the pinnacle of life!","“Shhh, Duke. And what if your beautiful fiancé finds out?”\n“huh. It’s that doll. Just looking at the jewels held out in my mother’s arms will be enough for the day to pass.”","Who could have known that the betrayal of a trusted fiance would have a greater shock than this, even for a brief moment of despair.","“Hold on for a few days, what else can you do stupidly?”","Everyone in my family, whom I believed was on my side, knew my fiancée’s true nature.\nAt Tatiana’s insistence that she would never marry her like this, her mother, who loved her the most, turned her back on her first.","“It’s a week later. There is a banquet to celebrate the victory in the Imperial Palace. How good would it be to announce one more piece of good news on a good day?”\n“… … What if you don’t like it?”\n“Well. If you don’t like it, you should get out of this house.”\n“…….”\n“Of course I left everything I gave you.”","The remaining time is one week.\nIn the meantime, if I couldn’t find a husband, I would be kicked out on the street naked.\nBut all the groomsmen who clinged to me so desperately only looked at my mother’s eyes… … .\nThe last person that came to my mind at the moment when I wanted to see if this was the end!","The red-eyed reaper, Cainell Townsend, who returned from a illegitimate mercenary who was despised by all kinds of worlds to Freya’s war hero after three years.","“okay. It’s true that I was once interested in you. This is something that no one knows about, thanks to your handsome mother.”\n“… … caine. That was then.”\n“Don’t get me wrong. What I wanted back then was not you, but your body.”\n“Good for you. He wants what I have.”","Dead-end alley, the bottom line.\nIf you want to survive in this harsh world, you have to hold on to the devil’s hand.\nA contract marriage between a woman who fell from the queen of the social world to hell overnight and a man who lives in hell as it was then and now.","Even though we are different from the beginning, we are so different.","“Tatiana Cartier. You are now Madame Townsend, after all. If you came to me first and asked me to marry you, you will have to take responsibility until the end. Even if you come now and regret it, there is no way to turn it back, so wake up from your dreams.”","They say they don’t have money, they say they don’t care, they say they don’t like me.\nThe man’s sincerity, secrets, and more emotions that he gradually learns one by one.\nI’ve decided I’ll never trust anyone again, but it’s just a contract marriage. Can my heart race like this?"]},{"title":"How to Perfectly End a Contract Marriage","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa How to Perfectly End a Contract Marriage / How to End a Contract Marriage Perfectly / 계약 결혼을 완벽하게 끝내는 방법","To bring her beloved back, she turned back time, becoming terminally ill with only a year to live. She tried reuniting him with his past love but failed. “Marry me for just one year.” Why is he proposing this? “I’ll only have one wife. You’ll be my first and last, Charlotte.”"]},{"title":"Chitra","tags":["Comedy","Fantasy","Romance","Shoujo","Supernatural"],"disc":["Read manhwa Chitra / 치트라","I spent years preparing for the civil service exam.\nBut I can’t believe I died so unfairly…!","Is that so?\nI was reborn as a beautiful countess.\nI even got the ability to play games from the God of Beauty.\n‘Drawing..?’\nYes, I have the ability to draw for characters.","I have become the apostle of the God of Beauty and benefited the world widely by drawing out ultra rare characters.","[Rare-!]\n[Super Duper Ultra Special Rare-!!!]","Let’s fill the world with handsome men to benefit all the women!"]},{"title":"Adelia – Flower’s Bondage","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["The Gerrard family has been loyal to the royal family for 1,000 years. But the royal family returned that loyalty for thousands of years with a slap in the face.\nAdelia Gerard, who lost all her family, lineage and loved ones to the crown prince.\nShe fell asleep while determined to take revenge on the crown prince who killed a loved one. When she opened her eyes, she saw the dead living in front of her eyes.\n“Dream?”\nNo, this is an opportunity for Adelia. A hidden secret. Can she change everything and live happily ever after?\n“Do you want to live with me? If you agree, I will take good care of you”\n“Yes?”\nThe story is about a man pretending to be a bear and a cute girl who thinks she is a fox.","아델리아 – 꽃의 속박"]},{"title":"Legendary Blacksmith’s Vengeance","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Legendary Blacksmith’s Vengeance / 대장장이 지그","‘Berserker Bartz’, a legendary solo player of Arpedia Online, had his character hacked and deleted one day."]},{"title":"The Miraculous Physical Therapist","tags":["Fantasy","Manhwa","Medical","Supernatural"],"disc":["Read manhwa The Miraculous Physical Therapist"]},{"title":"First Love, Lasting Hate","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa First Love, Lasting Hate / First Love is Hate / My First Love Hate / 첫사랑은 헤이트","Eunha, whose dream is to become a teacher, has finally become a university student. However, she discovers that her childhood friend and first love, Ha Seungmin, is also in her class. Seungmin used to be a bully in middle and high school and had almost cut ties with Eunha. But now, he seems to be getting closer to her."]},{"title":"Laws of The Good Child","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Laws of The Good Child / 소년법칙","[By the Author that brought you “QUESTISM”, “Juvenile offender” & “Manager Kim” ] & Share the same universe as “Lookism.”","The private Russian orphanage “Dead Mansion” that trains young children as agents, and the legendary “Codename Sean” thought to have been lost due to a shipping error. He appears at a middle school in Korea!? This is a story from the perspective that shares the same universe with [Lookism.]"]},{"title":"I Was Seduced by the Sick Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Was Seduced by the Sick Male Lead / I Seduced the Sickly Male Lead","I was reincarnated as the earl’s daughter and the male lead’s fiancée when I was young\nThis body is a cruel villain, trying to separate the male and female protagonists, which ruined her family.\nLife is comfortable right now, but I can’t let my family get involved in other people’s love affairs\nSo I tried to stay away from the male lead who was recovering, but he kept approaching me.\nCassis went to the kitchen and complained about the side dishes\n“What? Mmph!”\n“Ogugu~ You’re eating well, aren’t you?”\n“Mmmmph!”\n“Huh? What? You want carrots? Okay”\n*According to information: Carrot is the thing that Cassis hates the most\n***\nWhenever I see him, the male lead starts to look sad, as if he’s attached to me while we argue loudly.\nBesides, the way he looks at me is getting weird?\n“Evelyn, do you want me to get well soon?”\n“Of course. Then you won’t have to do this nasty thing anymore.”\n“….I wish it could continue to hurt more.”\n“Really, what are you talking about? I don’t like that”\nI said a lot of bad things to get rid of him because we had to break the engagement anyway\nBut it backfired…?\n“Evelyn. I’m hurt”\n“Did I do something wrong to you, Cassis?”\n“No?”\nSo why does he keep getting hurt?\nIt’s spent.\nThe male lead has no intention of going home!\nAnd why is he fighting the heroine instead of me?"]},{"title":"Leveling Up, By Only Eating!","tags":["Fantasy","Isekai","Manhwa"],"disc":["Read Leveling Up By Only Eating!, 밥만 먹고 레벨업:\nThe main character is stricken by a rare condition that affects only two people in the entire world, bulimic deficiency. He organizes his daily meals to survive, but his hope of survival grows dimmer as the days go by. He consults a doctor, who suggests playing the Alternate Reality Game ‘Athens’, where he can eat as must as he wants without gaining any weight. He plays the game to save his life and grow in strength by doing nothing but eating! A Gourmet Fantasy Life!"]},{"title":"Return of the Legend","tags":["Business","Drama","Fantasy","Manhwa","Reincarnation","Shounen","Webtoons"],"disc":["Read manhwa Return of the Legend / The Legendary Return / 회귀의 전설\nDue to the situation like the second IMF, the security company Jang Taesan worked for goes bankrupt, and he becomes an unemployed man wandering around Noryangjin-dong. He loses his life saving an elementary school student who was almost hit by a car. But thanks to his good deed, he goes 14 years back in time and is welcomed to a new life.\nHowever the joy of being revived is short-lived. The thought of having to take the college entrance exam again makes me dizzy… But I remember all of the CSAT problems that I encountered while studying and the stock market graph I saw while working as a stockbroker…?! The last life was ruined, but the this next life will become a success!"]}]