[{"title":"Return of the Invincible Patriarch","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read manga Return of the Invincible Patriarch","Ye Yun traveled through the martial arts world full of gods, devils and demons, and becomes the patriarch of the Divine Dragon Sect. After 100,000 years of seclusion, he came back from the tomb of the fraudulent corpse, and shot the emperor-level, god-level, and even super-god-level magic weapons and techniques, which stunned the disciples. According to Ye Yun’s idea, one person’s invincibility is not enough to make the world submissive, a group of people is strong enough to make the world tremble! So Ye Yun led the Divine Dragon Sect, swept the heavens, suppressed the world with an invincible posture, suppressing the ten thousand realms, beating all disobedience in the face and rising strongly!"]},{"title":"Passive invincible from the start","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts"],"disc":["Reading manga Passive invincible from the start , Passive Invincibility at the start , 开局被动无敌\nWhat if the monster is too strong to defeat? Don’t worry, passively resisting fire ring, automatically bounce the monster, you can never hurt me!\nWhat should I do if I get ridiculed and defamed? Don’t worry, the passive Zaun quotes are dirty, and there are many people who have been scolded by me.\nWhat if your teammates are too weak to win? Don’t worry, passively strengthening halo, and teammates will always stay under my crotch for output. The stable boy Meng Fan, accidentally traversed to the monster world and opened the passive system!"]},{"title":"I Am A God Of Medicine","tags":["Action","Comedy","Harem","Medical"],"disc":[]},{"title":"I Became the Demon King’s Right Hand so I Will Alter the Original Story","tags":["Action","Drama","Fantasy","Isekai","Magic","Shoujo"],"disc":["I Became the Demon King’s Right Hand so I Will Alter the Original Story, Maou no Migiude ni Nattanode Gensaku Kaiaku Shimasu / 魔王の右腕になったので原作改悪します\nOffice Lady falls from a building is reincarnated into another world and ends up at the Devil Kings castle. Can she save him from the bad ending?"]},{"title":"I Brush The Levels From The Mirror","tags":["Action","Adventure","Comedy","Fantasy","Harem","Martial Arts","Mature","Supernatural"],"disc":["My name is Feng Yun. No cultivation resources, penniless? It doesn’t matter, I have a mirror, as long as it shines, whether you are human or beast, whether you are dead or alive, all things are projected out. What martial arts techniques, what heavenly treasures, what weapons, even talent qualifications are all projected for you! Ding! Dropped The Seven Stars Soaring Cloud Technique! Ding! Dropped Canglan Battle Armor! Ding! Drop Advanced Gold Talent!","Level up in the Mirror"]},{"title":"The Farewell of Canglan","tags":["Adaptation","Comedy","Demons","Fantasy","Romance","Tragedy"],"disc":["Read manhua Love Between Fairy and Devil / 苍兰诀 / 魔尊 / Cang Lan Jue / Разлука Орхидеи и повелителя демонов / ของรักของข้า","From loveless translations: After a great battle, the weakened demon tribe resurrected the ancient demon lord Dongfang Qingcang, whom they thought would lead the demon tribe to victory over the heavenly realm. Unfortunately, the mighty demon lord accidentally swapped bodies with an inexperienced flower-spirit. What should’ve been an epic war of destruction between the three realms became a slapstick romantic comedy that will create an uproar in the realms instead."," "]},{"title":"Endo and Kobayashi’s Live Commentary on the Villainess","tags":["Comedy","Fantasy","Magic","Romance"],"disc":["She’s always putting on that grumpy face even though she’s not actually that upset! Oh, why can’t she just be honest with herself…!?』\nShe is a tsundere, after all? When her embarrassment levels exceed a certain limit, she will explode into anger. However, the point that she’s suppressing under the surface is that she wouldn’t mind that sort of thing if it were in a less public place.』\nAs Endo-kun passionately reacts to the antics of Lady Liselotte, the villainess of an otome game, Kobayashi-san provides a painstaking breakdown of her tsundere behaviour.\nSuddenly, one person could hear their voices; Liselotte’s fiancée, Prince Siegward.\nThat is where this story begins."]},{"title":"Reincarnated as the Mastermind of the Story","tags":["Action","Adventure","Drama","Fantasy","Isekai","Magic"],"disc":["Reincarnated as the Mastermind of the Story manga,Monogatari no Kuromaku ni Tensei Shite 物語の黒幕に転生して～進化する魔剣とゲーム知識ですべてをねじ伏せる～\nThere was a globally popular game called “The Legend of the Seven Heroes”.\nRen cleared the sequel of that game at the fastest record in the world, and thus he obtained a bonus special data.\nHowever, no matter where he looked inside the game, he could not find the data.\nThe moment where Ren was about to give up the search, he decided to start playing the second round of the game.\nSuddenly,a notification message “Do you want to start a special story? appears on the screen.\nWhen Ren chooses “Yes” without hesitation, he loses consciousness, and when he wakes up, he was a baby. —-\nCould it be that he was reincarnated as one of the hero in “The Legend of the Seven Heroes”?\nRen, who thought such a thing was impossible, could not believe his ears when he heard his name from his mother’s mouth.\nIt was the name of a classmate who betrays the heroes in the middle of the story.\nOf course, he wishes to live in peace.\nBut in the game, he meets a saint whose life he’s supposed to take, and doesn’t.\nFurthermore, he ends up saving a character (the boss of a great noble family) who was supposed to die.\nAll of these things creates a development that he doesn’t know about coming to play…"]},{"title":"The king of cave will live a paradise life","tags":["Drama","Fantasy","Magic"],"disc":["The king of cave will live a paradise life / 洞窟王からはじめる楽園ライフ ～万能の採掘スキルで最強に!?～ / Doukutsu Ou kara Hajimeru Rakuen Life / Doukutsuou kara Hajimeru Rakuen Life ~Bannou no Saikutsu Skill de Saikyou Ni\nHiel was ridiculed for having a useless crest and was exiled to a remote island. When he grabbed an ice axe to reclaim the island, the true effect of his crest was revealed. With his production cheat he will reclaim this uninhabited island and start his life in paradise."]},{"title":"System Rules","tags":["Action","Adventure"],"disc":["Yoon siwoo, a master of the “fighting game bloodfist” got something special. Even in real life, he can see a system that usually appears while playing games. Feeling bored with the game, Siwoo began to turn towards actual combat and tried to use his abilities to conquer his school, but was defeated by Snow leopard “Hong Minjae”. To compete with him again, Siwoo joins the martial arts club Lara Paruza…"]},{"title":"The Villainess is oblivious to the Prince’s True Doting Nature.","tags":["Fantasy","Historical","Isekai","Reincarnation","Romance","Shoujo","Villainess"],"disc":["The Villainess is oblivious to the Prince’s True Doting Nature manga, The Villainess Doesn’t Know the Prince’s True (Doting) Nature , Akuyaku Reijou wa Ouji no Honsou (Dekiai) wo Shiranai, 悪役令嬢は王子の本性（溺愛）を知らない,\nIsekai, reincarnation, romcom of a Yandere Prince × super insensitive villainess daughter! In a meeting with Prince Dylan, Belltier suddenly recalls her previous life and realizes that she has been reincarnated as the villainess in an otome game. In order to avoid the bad ending, just as she thought to distance herself from the Prince, she was chosen as his fiancee. “Do not let the prince have a sad childhood!” It’s only 5 years until the lonely prince meets the heroine. She is a temporary fiance, but she decides to become a friend and support him until then. But as we get along smoothly, the skinship of the prince gets intense!? i love you so much. Not the heroine, but I have been doted on ──!!?"]},{"title":"Of course, I’ll claim Palimony!","tags":["Comedy","Drama","Fantasy","Romance","Shoujo"],"disc":["The Cost of a Broken Heart / Of course, I’ll Claim Palimony! / 勿論、慰謝料請求いたします！ / Mochiron, Isharyou Seikyuu itashimasu! / Of Course, There’s A Settlement Fee!","“I’ll annul our engagement!” My fiancé suddenly declared?! Apparently he’s in love with the recently transferred count’s daughter and is planning on making me the villain in order to annul the engagement. Although I have no lingering attachments about the engagement, I do have to claim a hefty consolation fee don’t I?"]},{"title":"I Was Born as the Seventh Prince What Should I Do?","tags":["Adventure","Comedy","Fantasy","Josei","Mystery"],"disc":["I Was Born as the Seventh Prince What Should I Do? manga,Dai nana Ouji ni umareta kedo nani surya iino? , 第七王子に生まれたけど、何すりゃいいの？\nIn rare cases, there are children that have reincarnated while holding the memories of their previous lives. Dependent on the god’s caprice, they will be reincarnated into another world. One such case is the seventh prince of a certain kingdom.\nThe eldest son is the crown prince, the second, the third a diplomat, the fourth is bewed to the princess of another country, and the fifth and sixth are geniuses in music and art. Wait? Then what’s left for me?"]},{"title":"Legend of the Tyrant Empress","tags":["Action","Adventure","Fantasy","Historical","Manhua","Martial Arts"],"disc":["Read Legend of the Tyrant Empress manhua english, Legend of the Phoenix english manhua; 霸凰传说"]},{"title":"Guide for A Princess-To-Be","tags":["Cooking","Fantasy","Historical","Romance","Webtoons"],"disc":["Read manga Guide for A Princess-To-Be","She was an A-list actress shooting a movie scene, accidentally she was tripped over and when she woke up again, she found herself time-travelled to the ancient time and became the first miss in the house of the Prime Minister! The only problem was, the new body she got was disfigured…"]},{"title":"The Moon Witch and The Sun King: My Salvation","tags":["Isekai","Romance","Webtoons"],"disc":["Read manhwa The Moon Witch and The Sun King: My Salvation / Kelas Rahasia Sang Permaisuri / Kouhi-sama no Secret Lesson / La Leçon secrète de l’Impératrice / My Salvation / Princesa Hechicera / Queens Secret Lesson / The Empress’ Secret Lesson / The Empress’s Secret Lesson / The Queen’s Secret Lesson / วิชาลับฉบับราชินี / 月亮魔女与太阳陛下 / 皇妃様のシークレットレッスン / 황비님의비밀수업 / The Secret Life of Empress Isana","When Lee Shana accidentally crossed into another world full of fantasy and beauty, sadly she had become a witch in the midst of an execution. Dying at such a wonderful age?! She couldn’t let that happen! She had to escape no matter what! But after her escape she offended none other than the crown prince Luther! What else could go wrong?"]},{"title":"Win Over The Dragon Emperor This Time Around, Noble Girl!","tags":["Action","Comedy","Fantasy","Romance","Shoujo","Time travel"],"disc":["The Returnee Noble Lady Attacks His Majesty the Dragon Emperor, Win Over The Dragon Emperor This Time Around, Noble Girl!, Yarinaoshi Reijou wa Ryuutei Heika wo Kouryakuchuu やり直し令嬢は竜帝陛下を攻略中\nThe curtains rise on the tale of a young lady who once stormed the battlefields now getting to start her life all over again! The young noblewoman, Jill, was sentenced to death by her fiancé, the Crown Prince. Just as she was on the brink of death, time rewinds back to when she was 10 years old, to the party where her engagement had been decided! Determined to avoid going down the same path to ruin, Jill hastily proposes to the person behind her, only to discover that he’s none other than Hades, the Emperor of the neighboring kingdom who’s (set to) fall into darkness, ergo the worst villain. This is the story of the redo-life of a noble girl who rushed headlong into battles, brought to you by the duo behind the adaptation of “I’m a Villainous Daughter, so I’m going to keep the Last Boss”!"]},{"title":"The Exiled Reincarnated Heavy Knight Is Unrivaled in Game Knowledge","tags":["Action","Adventure","Fantasy","Isekai"],"disc":["The Exiled Reincarnated Heavy Knight Is Unrivaled in Game Knowledge manga, Tsuihou Sareta Tenshou Juu Kishi wa Game Chishiki de Musou Suru 大ハズレだと追放された転生重騎士はゲーム知識で無双する\n“You good-for-nothing bastard. You are the son of a Sword Saint, yet you dare pull such a defective Class!?”\nDuring the〈Divine Blessing Ceremony〉of the 15-year-old Elma who came from a lineage of Sword Saints, he had manifested a commonly deemed defective class known as the Heavy Knight. He had been deprived of his position as the next head of the Edvan Household and was then exiled. The Heavy Knight class had an unbalanced status and useless skills, to top it off, it was even said to be a class cowardly and indolent people have.\nBut, Elma knew better—that this world was the world of the game he had used to play before—and that the Heavy Knight class was the strongest class to exist. Elma made full use of the knowledge he had in his previous life and began his efficient walkthrough of the world he was reincarnated into."]},{"title":"The Villainous Daughter’s Butler ~I Raised Her to be Very Cute~","tags":["Comedy","Fantasy","Isekai","Magic","Reincarnation","Romance","Shoujo"],"disc":["The Villainous Daughter’s Butler ~I Raised Her to be Very Cute~, The Villainous Daughter’s Valet, Akuyaku Reijou no Shitsuji-sama: Hametsu Flag wa Ore ga Tsubusasete Itadakimasu\nRegaining the memories of his previous life, Cyril realised that he was an otome game’s character, the villainous daughter– Sophia’s valet. At the rate things were going, Sophia would eventually have the prince stolen away from her by the heroine, fall into darkness, and be executed. Wanting to save the villainous daughter he was so fond of, Cyril moved to eliminate all the factors that would cause her to fall into darkness, raising her up to be a talented and beautiful girl who could win the prince’s love, however…\n悪役令嬢の執事様～俺が育てた彼女はとても可愛い～"]},{"title":"The Dragon Knight’s Beloved","tags":["Fantasy","Romance","Shoujo"],"disc":["Ryukishi no Okiniiri manga / The Dragon Knight’s Beloved / The Dragon Knight’s Favorite / Ryuu Kishi no Okiniiri / 竜騎士のお気に入り / 龙骑士的宠儿 / 용기사의 최애 그녀 / 용기사의 취향\nOn her 16th birthday, Melissa, apprentice of the royal castle, decided to work outside the castle’s limits. After becoming an official priest of the royal castle, she got to work with her beloved dragons, and well as the Dragon Knight captain, Hubbard, and his favored dragons. But all of a sudden, the captain quit!\nA popular “ichijinsha bunko iris” work, the fantasy love story of a tough Knight and a dragon lover"]}]