[{"title":"How to Change Angst Into a Feel-Good","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How to Change Angst Into a Feel-Good  / 피폐물을 힐링물로 만드는 방법 / How to Change a Tragedy Novel Into a Healing One","I got reincarnated! Into the prettiest, kindest, daintiest, most perfect female lead…’s little sister. The problem is that this story is an angsty R19 story. The male lead is an insane bastard with a streak of madness and my sister is doomed to be a mental wreck due to his obsession, facing a tragic ending where she loses her mind. I absolutely cannot let my beautiful and kind older sister meet such a miserable fate! From now on, I’m in charge of the genre—from an angst to a feel-good story! I’ll be fine. I’m not Astella. I’m not as pretty as her so the male lead would never fall for me. “Cute.” That isn’t the word that should be coming from the cruel and cold-blooded male lead’s mouth… …I’ll be fine, right? I don’t have Astella’s delicate wrist nor her small waist that could be encircled in one arm. Not to mention, her fair skin. Him falling for me would be out of the question. “You can’t escape. There’s no place for you to escape.” …Surely I’d be fine? Our first encounter wasn’t as passionate as it should’ve been in the story. Plus, the male lead wasn’t as insane as he was described to be. …So, I should be fine, right…? “How should I explain this urge to strangle the bastard who touched you?” I don’t think I’m fine!"]},{"title":"Call Me Master","tags":["Drama","Fantasy","Manhwa","Romance","Tragedy","Webtoons"],"disc":["Read manga Call Me Master / The Order Of Slave Breeding / 그 노예들의 사육법","If you cannot remember, listen to your body. If anyone discovers that slave master Ananse has lost her memory, she will be killed. So to save herself, she ropes in Solteo, a slave who hates her beyond compare. Her proposal? “Help me uphold my old image, and you’ll be freed.” His reply? “I’ll make you regret ever requesting that, my master.”"]},{"title":"Marry In Bed At 19","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Marry In Bed At 19 / 메리 배드 19세","“As a birthday present, i’ll give you my boyfriend.” Me Ahyeon and the top actress Seong Si-eun, seem like the closest and best friends in the whole world. The only thing is that Ahyeon’s is known as “the girl you can ask any favor” At Ahyeon’s birthday party, Si-eun announces that she’s bringing her boyfriend. And then, Ahyeon realizes that she was talking about Terry Nam, a guy who has always hated her… Can they share a boyfriend while preserving their friendship? No matter what you do, he says that “I’ll never be able to like you.”"]},{"title":"Snow Mountain Monster Princess","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Snow Mountain Monster Princess / 설산의 괴물 황녀","Valerie Bellov is exiled to the frozen mountains as punishment for her mother’s sin. There, she gains the freezing ability of a monster that terrified the Empire in the past. On her 19th birthday, she takes her life by her own hands, only to wake up and find herself back in her childhood at the age of 9. In order to change the past, Valerie seeks to meet her stepbrother, Emperor Millard, who exiled her."]},{"title":"Embodiment of the Assassin in the Murim World","tags":["Action","Adventure","Fantasy"],"disc":["Read Embodiment of the Assassin in the Murim World, 건객, Builder Woogi Kim,Guest Gun","No.1 Assassin Kim Gun falls into the world of Murim due to a mysterious accident.\nIn order to return to the Earth from which he came from, he learns that he must complete the mission of “conquering Murim”.","With two guns, Kim Gun’s adventure to settle the unfamiliar world of Murim begins."]},{"title":"Male Lead, Stop Following Me","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Male Lead, Stop Following Me / 쫓아오지 마세요, 남주님! / Male Lead, Don’t Follow Me!","One day, I found myself reincarnated as the friend of the female lead who is destined to die.","Thinking that I should tell the female lead everything, in the end, I decided to keep silent so as to not mess up the future.","I became frustrated and ended up entering the forbidden forest to ‘secretly’ curse the male lead.","“The male lead is a son of a b*tch!”","However, not expecting anyone to hear it, for some reason, rumors have begun to spread that the male lead, Duke Vishwaltz, was a gay.","Moreover, now he’s even going so far as to launch a full scale investigation to find the source of the false rumor…?","“…I can’t help but to notice your voice.”","Anyhow, I’m afraid my life is screwed."]},{"title":"Frauds-In-Law [Official]","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Frauds-In-Law [Official]","Yoon Jiwoo is both shocked and worried when her twin sister Jia drops a bombshell, saying that she secretly got married. Still, Jiwoo is determined to help Jia persuade their parents… until she learns that the groom’s brother is her ex-boyfriend, Moonkyung. What’s more, there’s a complicated history between the two families. Now they must work together to resolve the misunderstanding and change their parents’ minds. Will these unlikely allies successfully pull off this fraud and become family?"," "]},{"title":"I Became the Youngest Member of Top Idol","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became the Youngest Member of Top Idol / I Become Maknae of Top Idol / 탑아이돌의 막내 멤버가 되었다","“25…that’s too old to become an idol.” Do Seohan, who got eliminated from the successful idol survival audition program ‘Stardust Project’. Giving up his dreams, he is trying to find his way working part-time jobs. When all of a sudden, he wakes up 8 years in the past after an accident. Right before the ‘Stardust Project’ started! As the youngest (but most experienced), can he make it to the final lineup this time?"]},{"title":"I Can Copy Talents","tags":["Action","Manhua"],"disc":["Read manga I Can Copy Talents / 剑神无敌（原著）+维CC（主笔）+好饭（编剧） / Your Talent is Mine","The young boy Ye Tian gained the ability to replicate the talents of others, this changed his fate from time to time. In order to protect his sister, he struggles to survive in the apocalyptic world when aliens, beasts, and monsters have invaded. In order to to become stronger, he ventures out to the explore the unknown world, gradually finding out the secrets behind the invasion of different dimensions. . . . . . ."]},{"title":"Bluebird Lady and The White Lion Family","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Bluebird Lady and The White Lion Family / 백사자 가문의 파랑새 마님","In a 19-gold-waste novel, I possessed the character of villainess.","Sophina, the bluebird and former wife of the white lion male lead, who was obsessed with him and was thrown away.","A character who was stoned to death because of angry public sentiment?","‘Let’s get a divorce after grazing enough!’","As a result of my efforts, I became friends with the male lead instead of obsessing with him.","In the meantime, I became close to my mother in law and other family members of the male lead, and I gained recognition from helping in managing the estate, and my business also became a big hit!","Everything was perfect.","It’s time for the male lead who went to war to bring the heroine, so all he has to do is divorce me now.","But the problem was…","“I don’t want to divorce.”","It was because he became so attached.","Maybe I have arrhythmia? My heart kept beating fast or it seems I’m a bit excited?","So I was thinking of seducing the male lead…","***","“While I was away from the mansion for a while, I guessed you were thinking of running away from me.”","Ricardo’s dangerous and low voice, unlike his beautiful childish voice from my memory, rang in my ears.","It seems that the male lead, who has grown up as a sexy adult, has a useless misunderstanding.","And…","“Don’t leave, and don’t pretend that you don’t know me if you happen to throw away your husband.”","“This brother-in-law would educate his ugly brother. Please just don’t leave.”","“Okay, well thought out. Just live with me!”","Even my in-laws misunderstood and kept clinging to me.","Why does everyone keep misunderstanding?","Excuse me. I wasn’t thinking of getting divorced?"]},{"title":"My Clone is the Space Bug King","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa My Clone is the Space Bug King","In the future, humanity has successfully left Earth and colonized various star systems, evolving into a new breed of humans who are taller and possess incredibly long lifespans. Meanwhile, Earth, the once-thriving mother planet, has been reduced to a nuclear wasteland due to overdevelopment and severe pollution. The original inhabitants still living on Earth now face an average lifespan of just 40 years, leading to widespread discrimination from the new humans. The protagonist is one of these Earth natives, but unlike others who have succumbed to despair, he works hard to become a mechanic even more skilled than the new humans. Just when he thought he could finally live a better life, he is met with betrayal and treated as cannon fodder when the cosmic insect race attacks a human outpost. However, with a burning desire for revenge, the protagonist discovers that he has been reborn as one of the cosmic insects!"]},{"title":"A Golden Fate That Transcends Time","tags":["Drama","Fantasy","Romance"],"disc":["Read manga A Golden Fate That Transcends Time","Ensnared in a dark ploy by both her stepmother and half-sister, Eris was forced to marry the useless and pathetic Gellert. Her married life was rife with difficulties, yet she endured the insults and agony to raise her beloved son, Luka.\nBut when her husband’s carelessness led to Luka’s death, Gellert tried to comfort Eris by saying, “We’re still young. We can have more children.”\nDevastated by his words, Eris prayed to the heavens, begging to have her son back. Moved by her plight, the Golden Dragon manifested his powers to bring Eris back to the day when this all started. Eris was determined to have her revenge against her stepmother, her half-sister, and her ex-husband, but…\n“Do the rumors about us upset you?”\nTeodore Lehinal, a Duke that Eris had never even spoken to in her last life, seemed to have taken a sudden interest in her…"]},{"title":"If You Don’t Love, You Die","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa If You Don’t Love, You Die"]},{"title":"Top Tier Providence: Secretly Cultivate for a Thousand Years","tags":["Action","Adventure","Comedy","Fantasy","Martial Arts"],"disc":["Being reincarnated in a cultivation world, Han Jue realizes that he can live his life like a video game. He con reroll his cultivation potential and connate providence. In pursuit of longevity, Han Jue decides to cultivate in a low-profile manner. A thousand years later, generations of cultivators have become history. That is when the immortals start cleansing the mortal world. Han Jue can no longer hide and must do something about it. Then he realizes, immortals aren’t that powerful after all…\nSecretly Cultivate for a Thousand Years"]},{"title":"King of Violence","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa King of Violence","[By the studio that brought you <Return of the Mount Hua Sect>!]","Lee Gilsoo moved schools in order to avoid the hell-like organizational bullying.","At the new school, there are no bullies or bullying, but there is school violence?!","A world of fair violence among students, the “Fighting Arena.”","Within the Fighting Arena, students fight and enjoy violence.","Can Lee Gilsoo, who has only ever lived getting beaten up, adjust to this fierce world of violence?","This is the bloody school action growth story of the loner bully victim, Lee Gilsoo!"]},{"title":"The Immoral Ducal Family Needs to Learn Family Values","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["The Immoral Ducal Family Needs to Learn Family Values / The Immoral Duke Needs to be Homeschooled / 패륜 공작가에는 가정 교육이 필요하다","You three kids, I’ll teach you. Recently, there have been several changes in my life. The first is that I became the governess of Lord Bertha’s siblings, and the second is that I remembered my past life. Why did I recall my past life now? Could this be inside the novel I read in my past life? If I remember correctly, I, “Estella,” the governess, will soon die. All to protect the half-siblings from that immoral man, “Diego”! “You seem like a more capable person than I thought.” “You’d better look for a job at another estate because you’ll go crazy if you stay here.” But “Diego,” the man who I thought was a heartless psychopath, turns out to be surprisingly kind…? Alright, I’m going to organize a dramatic reconciliation between Diego and his half-siblings!! How could you possibly kill these adorable kids when they’re hugging you?!"]},{"title":"My First Love From The Future","tags":["Comedy","Drama","Romance","Slice of Life"],"disc":["Read My First Love From The Future / 미래에서 온 첫사랑","Soo-ah is about to marry a sweet man named Hamin. In front of her is Lee Gyeom, whom she has been crushing on for 19 years. Six years ago, Lee Gyeom left for abroad without saying a word, and for 19 years he refused to confess, He proposes to Soo-ah, who is three months away from getting married… “If you marry him, you will die.” Surprised by the situation, Soo-ah keeps him at arm’s length, but he begins to intrude into her life. “Why are you doing this now? Once, I loved him so much, but he hated me so much. Now, the man who promises to marry me and loves me only for me, Hamin. And the woman who is loved by both of them, Sua. The strange fate of three men and three women over 49 regressions."]},{"title":"Xuanmen Prodigal Son","tags":["Action","Adventure","Fantasy"],"disc":[]},{"title":"Invincibility Begins with a Broken Hand","tags":["Action","Adventure","Demons"],"disc":["Read Invincibility Begins with a Broken Hand","Chu Mingxuan, the weakest Awakener, faces death after being swallowed by a giant beast. Yet, in his darkest moment, he unexpectedly inherits a mysterious system. From that day forward, he begins an unstoppable ascent to godhood, growing stronger with each challenge.","But the secrets behind Awakeners and the origins of the system remain shrouded in mystery. Beneath the surface of this seemingly calm world, dark forces are at play. A bloody and catastrophic revolution is about to erupt, shaking the very foundation of existence."]},{"title":"Manager Kim","tags":["Fantasy","Manhwa"],"disc":["Read manhwa Manager Kim / 김부장","“Please don’t touch the guy wearing glasses…””Department head Kim, who quit his job as a special agent only for his daughter Minji and chose to be normal.”Then one day, Minji disappeared silently, and Manager Kim began to find his daughter by turning the country that monitors him into an enemy.[Lookism] [How to Fight] and [Life Destination] The world view of spinoff! (notice the description was mtled)"]}]