[{"title":"Children of the Rune","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Children of the Rune","[By the Studio that brought you {SSS-Class Suicide Hunter}!}\nOh, young boy, make sure you survive! After his uncle caused the downfall of his family, the only thing the young Boris had left was the family sword, “Winterer.” But who would’ve thought this treasure would soon become the cause of another crisis? Every time people targeted “Winterer,” Boris’s heart grew colder and drearier, like winter itself… Boris’s journey then began. To survive. To protect the family sword. What awaits at the end of this journey? What secrets does the winter sword “Winterer” hold?"]},{"title":"Revenge of the Iron-Blooded Sword Hound","tags":["Action","Adventure","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa Revenge of the Iron-Blooded Sword Hound / Regression of the Ironblade Hound / Return of the Iron-Blooded Sword Hound / The Return of the Iron-blood Sword Hound / 철혈검가 사냥개의 회귀","He was the hound of the Baskerville family: Vikir. Yet his loyalty was rewarded by the blade of a guillotine dirtied by slander. “I will never live the life of a hound slaughtered after the rabbit is caught.” In place of death, an unexpected opportunity awaits him. Vicir’s eyes glowed red as he sharpened his canines in the dark. “Just you wait, Hugo. I will rip out your throat this time.” It’s time for the hound to exact bloody revenge on his owner."]},{"title":"Ghost Romance","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Ghost Romance / 귀짤 로맨스 / Pacarku Hantu?!","Yoo Seon-woo, a 4th-year photography student working as a photographer, one day receives a collaboration offer from a famous foreign magazine. Seonwoo, who has recently been experiencing a ghostly phenomenon in every photo she takes, tries hard to solve the problem, but it’s not easy. Then, she finds the only subject who does not appear with ghosts in the photos… It is none other than the most famous playboy on campus, Choi Moo-young! “A Model? I’ll do it. But date me instead.” Will Seon-woo be able to take photos of Moo-young and successfully debut in a famous foreign magazine?! A dilemma-filled horror romance with a man she absolutely does not want to be involved with begins!"]},{"title":"Astral Pet Store","tags":["Action","Adventure","Animal","Fantasy","Manhua","Martial Arts","Supernatural"],"disc":["Astral Pet Store manhua, 超神宠兽店 Super god pet shop manhua\nIn the era of beasts, pet strength determines everything! The battle pet master works hard and slowly to improve the strength of the pet. Until a mysterious pet store came out of nowhere! In just a few days of cultivation, the lowly skeleton can kill the golden dragon with a single slash. Does the guard dog have ten secret skills of pet beats? The working girl even calls herself a god… As for the owner, Su Ping: Isn’t it a regular practice to breed cute pets into prehistoric king beasts?"]},{"title":"I Was Reborn as His Highness the Prince’s Little Evil Dragon","tags":["Fantasy","Romance","Yaoi","Yaoi(BL)","Yaoi(BL)"],"disc":["Read manhua I Was Reborn as His Highness the Prince’s Little Evil Dragon / Wo Chongsheng Chengwei Wangzi Dianxia De Xiao E Long / Wǒ Chóngshēng Chéngwéi Wángzǐ Diànxià De Xiǎo È Lóng / 我重生成为王子殿下的小恶龙"]},{"title":"Past Life Returner","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Past Life Returner / Jeongsaengja (2022) / Past Life Regressor (2022) / Reincarnator (2022) / 転生の太陽 / 转生者 / 전생자 (2022)","[Would you like to reverse time?] [All your abilities will be reset.] [Please choose the date.] “February 28th, 1985. The day I was born.” Financial power. I will gather all the fortune of the world— and create a monopoly. I will monopolize all the dungeons of the world. I will do this now, while the world is still peaceful… before it all begins."]},{"title":"Avoiding the Heavenly Emperor","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Avoiding the Heavenly Emperor / I Did Not Want to Be Chosen by the Tyrant Heavenly Emperor / I Did Not Want to Be Selected by the Tyrant Heavenly Emperor / 폭군 천제님께 간택되기 싫었습니다만","Bam Binee’s dream job is the position of grade 7 civil servant of the Celestial Palace! Luckily for her, the Heavenly Emperor is seeking a wife through the Heavenly Empress Selection, an event that also allows talented ladies to become civil servants. Thus, Binee dives into the competition, meeting new friends and forming alliances at the Celestial Palace. But as the stakes get higher with each match, she begins to realize that fulfilling her dreams may come at too great a price…"]},{"title":"The Baby Concubine Wants to Live Quietly","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Baby Concubine Wants to Live Quietly / Baby Concubine Wants to Live Quietly / La concubina bebé quiere vivir tranquila / The Resourceful Little Consort [Official] / お子様後宮妃は静かに暮らしたい / 小妃子只想安静生活 / 小嫔妃想要安安静静地生活 / 아기 후궁님은 조용히 살고 싶어","I possessed a supporting character in a reverse harem novel.","As a young concubine who gained the interest of the emperor. The concubines and male lords eventually killed her for treason.","Fortunately, I possessed her just as she was entering the Imperial Palace. Everyone in the Imperial Palace was wary of me, but didn’t hate me yet. I don’t need nor want to be loved by the emperor.","“Come to my room tonight. I’ll read you a fairy tale!”\n‘Woo, don’t cry. I’ll give you this.”","But why is everyone so soft towards me? I don’t understand."," "]},{"title":"I don’t believe in my twin sister","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read New Manhwa I Don’t Trust My Twin Sister / I don’t believe in twin sisters / 쌍둥이 언니는 믿지 않아요","I am viscountess Lorentia Aztec, the richest woman in the world. I have financial power, beauty and even honor. But my life isn’t happy at all. I found that my younger sister – Erusia pretended to be sick. She’s even colluded with my fiancé to steal my whole property.","At the moment I was giving it all up in pain, regretting believing in those traitors, I turned back to 11 years before I engaged.","I will send them all to hell, both my belief in Ercia and my love for the previous fiancé.","“Listen. From now on, there will be no good sister anymore.”","Being alone in this world, I swear that I will change my fate. First of all, I will cling to the hero of the empire by a contract.","“I’ll solve all the problems that you had to face. Instead, you’re gonna be my fiancé. Grand Duke Verdian.”"]},{"title":"The Witches’ Isle","tags":["Drama","Fantasy","Historical","Josei","Magic","Psychological","Romance","Shoujo Ai"],"disc":["Read manhwa The Witches’ Isle / Island Where Witches Live / Island of Witches / 마녀가 사는 섬","“Warning: Yuri content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.” Hannah, a tutor, receives a high paying job offer at a mansion on a remote island. There, she meets the young and kind owner, Ian, and his younger sister, Hannah’s soon-to-be student, Ailee. A tutor’s fresh start working on an island. However, when strange things begin to occur at the seemingly peaceful mansion, she finds that there’s more to it than meets the eye. Gradually, Hannah discovers the secret between the two siblings and the island itself… ※GL is included in the love triangle for this series and is being partly covered within the story. 마녀가 사는 섬"]},{"title":"Don’t Concern Yourself With That Book","tags":["Drama","Fantasy","Historical","One shot","Psychological","Romance","Tragedy"],"disc":["Read manhwa Don’t Concern Yourself With That Book / 그 책에 마음을 주지 마세요 / 그 책에 마음을 주지 마세요 / Don’t Give Your Heart to that Book","Living for the sole aim of escaping! ‘Light of Rusbella’ was a depressing romance novel. Wishing for a new life, Asili Rosé was reborn as the 8th wife of the Estrian Emperor. She thought she was born with a golden spoon, but it was actually just a gilded spoon? Once she realized that nothing but ruin awaited, she found a diary foreshadowing the future… It foretold Asili’s death by the hands of the Crown Prince, Castor! [“What does the empire mean to you?” After asking this, the Crown Prince smiled so very beautifully. And then he killed me.] Unfortunately, Asili kept coming back to life, and continued to be killed over and over again. As she continued to relive her deaths, she slowly lost her smile and changed. …Let’s try to survive first. ________________________________________________________________________________________ “What can I do for my elder brother?” “Well.” Pale sky blue hair fluttered finely in the wind. He smiled weakly, before parting his dry lips. “Call my name.” “…” My head quickly snapped up. “Call me… Amoru.” His fingertips skimmed along my inner wrist. ______________________________________________________________________________________ Note: This is a oneshot promotional manhwa for the novel of the same name."]},{"title":"I’m Not the Final Boss’ Lover","tags":["Adventure","Comedy","Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa I’m Not the Final Boss’ Lover / 최종 보스의 애인이라니 오해입니다","When our protagonist becomes the game character Jun Karentia,","she thinks she has it made.","She may be just a lowly support mage but with her knowledge of the game,","she knows she can finagle her way to the good ending","following around the main character, Fabian.","The problem?.. This game doesn’t end after one playthrough.","Jun is prepared to guide Fabian through the second playthrough to the true ending when… Fabian abandons her.","Now Grand Duke Mayer Knox—captain of the Dark Knights and the secret final boss—is determined to have her join his party.","Can Jun turn the final boss into the main character?","Why is Mayer Knox so intent on having her at his party?","And when will these rumors about being his lover stop?!"]},{"title":"In the Jungle With My Boss","tags":["Manhwa","Romance"],"disc":["Read manhwa In the Jungle With My Boss / 丛林里只剩我和老板 / 私のボスとジャングルで / 나의 보스와 정글에서","Secretary Mo Yeonhee had never even made eye contact with her boss, Kang Hajun. So imagine Yeonhee’s surprise when he calls her to fly out and join him on his business trip for a special task. Everything is going smoothly until… their helicopter suddenly malfunctions, and they are forced to jump! Stranded alone in the jungle, the two must find a way to survive and get back home. Will Yeonhee and Hajun be lost forever, or will they find their way out and into each other’s hearts?"]},{"title":"Lady Baby Is a Revenge Maker","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lady Baby Is a Revenge Maker / The little lady is a revenge maker / 아기 마님은 복수 메이커","One day, Sephiel, who returned to five years old, decides to get rid of the family that abused her.","The first thing to do is to enter the family of a powerful person who will protect you safely! By chance, the dragon family’s bride selection ball, full of sinister rumors, opens, and she manages to take the place of the crown prince’s wife.","“Why do you run away. Didn’t you say you wanted to marry me?”\n“How does this little thing know so much about my son?”\n“You’re pretty sassy for a girl… and quite cute.”","From her little husband to her father-in-law to her grandfather, she attracted a lot of attention from the dragons in the royal family. I must have made the dragons on my side now that this has happened… Should I take revenge on the evil humans?"]},{"title":"The Fantastic Spinsters’ Association of Joseon","tags":["Drama","Historical","Josei","Romance"],"disc":["Read manhwa The Fantastic Spinsters’ Association of Joseon / Joseon Enthusiastic Independent Woman / 조선열혈독녀단","No husband? No problem! A group of plucky, unmarried women is stirring up trouble in Joseon, a land of conservative and traditional values. The goal: make money and solve crimes! The ladies of the Spinsters’ Association, along with womanizer Eunho, set about investigating the mysterious disappearances of local women…"]},{"title":"I Went On Strike Because It Was A Time Limit","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Went On Strike Because It Was A Time Limit / Sierra On Strike / 시한부라서 파업했는데 / Hice una huelga porque mi tiempo era limitado\nAs high society’s most eligible lady, Sierra Fernein did whatever it took to please her family, despite their flagrant disregard for her. But upon discovering she has only a month left to live, she decides to go on strike from being a prim and proper lady and live life on her own terms. Shedding the Fernein name, she declares war on anyone who dares get in her way, including her family and a few pesky admirers. But with just 30 days left, can Sierra finally enjoy the life of her dreams?"]},{"title":"Be Crazy About Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Be Crazy About Me / 시한부라서 남주의 형과 결혼했더니 내게 집착한다 / Because I was Terminally Ill, I Married the Male Lead’s Brother, and Now He’s Obsessed with Me","Through the book, Ayla, who becomes a cannon fodder supporting role, will die at any time due to a strange disease. In order to save her life, she took the initiative to marry the elder brother of the male lead of the novel according to the setting in the book. Royden’s body is filled with the blood and is feared by others, and he is being used by the empire. In order to protect his brother’s safety, he could only keep a low profile and bear it. Originally, it was just a contractual marriage in which benefits were exchanged, but at some point it became a two-way rush to redeem each other."]},{"title":"The Blooming Violet in the Back Garden","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Blooming Violet in the Back Garden / Violets blooming in support / 후원에 핀 제비꽃"," "]},{"title":"The Wallflower Who Was Proposed to by the Tyrant","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Wallflower Who Was Proposed to by the Tyrant","Jisu Kim inherited a peculiar power from her mother: the ability to see and hear ghosts. When an old spirit starts to meddle in her life, she gets transmigrated to a novel she recently read but barely remembers. Now she must live as Fluerty Bebenia, the daughter of a duke. Trapped in the body of a side character doomed to die, Fluerty must use her power to change the novel and ensure her survival. If that means having to marry the handsome, aloof Grand Duke Dever Noctis, then so be it!"]},{"title":"Love From Every Direction","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Love From Every Direction / Romance Everywhere / Romance of the Four Guardian Gods / イケメン四神に狙われています / 사방팔방 로맨스","Four guardian gods, one heart to win! Blessed with looks and talent, Suji craves a quiet life—but four stunning boys, revealed as guardian gods of the cardinal directions, are determined to win her heart. With divine suitors on her tail, can Suji stay under the radar while juggling their heavenly affections?"]}]