[{"title":"Heavenly Demon Instructor","tags":["Action","Manhwa"],"disc":["Read manhwa Heavenly Demon Instructor / Backseating Heavenly Demon /My Master is a Backseat Gamer / 口を挟む天魔様 / 훈수 두는 천마님\n“Master, what’s the next lesson?!!!”\nA disaster that struck the earth, [Portal Impact], caused Park Hyunsoo, the MC, to lose his parents before his eyes.\nThe only family member he has left is his younger sibling who is unconscious.\nIn order to protect his younger sibling, he did his best but as a powerless support, he would always be on the other side of contempt…\nAnd that’s when a helper, Chungyeong, appeared!\nChungyeong, a murim martial master that has travelled through time to come here from the Murim to teach Hyunsoo martial arts…\n“Hey, disciple…”\n“Yes, Master.”"]},{"title":"Take Me In, My Lord","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manga Take Me In, My Lord / Lord! take me in / 盟主大人 收留我吧","I’m the daughter of the leader of Lingji Sect, a top killer organization. Though I’m not good at killing people, one day a strange man came to me and asked me to complete a mission for him. Strangely enough, he said I was the only one who can do the job. That is, to steal a secret letter from the man himself! Only it was the “him” from 10 years ago. Who exactly is this man? What does his future have to do with me…"," "]},{"title":"Poison-Eating Healer","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Poison-Eating Healer\nCheon Haesun is the protagonist who‘s terminally ill because of various poisons. Cheon Haesun, who was never welcome anywhere, will have his story of becoming the strongest hunter play out on an Earth upon which dungeons and monsters have broken out!"]},{"title":"My one and only (Mi Dou Bo Yi)","tags":["Romance","School Life","Slice of Life"],"disc":["Read manhwa My one and only / Mi Dou Bo Yi / Solely Mine / Wo De Wei Yi / Wǒ De Wéi Yī / 我的唯一\nA story about a chance meeting between a lonely school girl who has always struggled to fit in and make friends and the vice president of the student union. What sweetness does this story behold? Summary by Cloud of Unrelenting Nonstop Thirst"]},{"title":"The lady’s bodyguard","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The lady’s bodyguard / 영애의 경호관","A relationship that started for a NIS mission, but this young lady is suspicious?​"]},{"title":"I Might Be A Fake Cultivator","tags":["Action","Comedy","Fantasy","Martial Arts"],"disc":["Read manga I Might Be A Fake Cultivator","Why does the moon goddess sing so loudly in the middle of the night? Why do the 7 ladies make off with the forbidden fruits? Why do all kinds of mythological beasts unceasingly suffer at the hands of malignant agents? And what does lie hidden at the rear of the hundreds of immortal daoists dancing in the square? At the root of it all, is it that the immortals have gone mad or their morality has withered away? Let us follow this manhua, and enter Anlin’s imaginary immortal world, to start on this journey of exploration and discovery!"]},{"title":"Legend Princess","tags":["Adventure","Historical","Magic","Romance","Royal family","Time travel"],"disc":["Read manhua Legend Princess / National Doctor, Mad Concubine / 国医狂妃","Feng Sunuan, a famous doctor, accidentally time traveled to the ancient nation of Dali, and become Zhen Guogong’s foolish daughter. Not only did she get rejected from her own marriage, but almost lost her life too! She vowed that one day, she will get rid of all those people, so she would be ready for her road of revenge by acting dumb! As for her ignorant husband, as long as he doesn’t bother her, it’s all good! But why does this man say he dislikes her and, in the action, he’s getting closer and blushes from time to time?"," "]},{"title":"Stop this Marriage!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Stop this Marriage! / Stop This Wedding / Hentikan pernikahannya / 이 결혼을 막아라","After getting in an unfortunate accident, the twins transmigrated to another world together. The elder sister possessed the body of Princess Liliana, and the younger brother went into the body of Arvid, the 2nd Prince of the Revoluta Empire. But the two were engaged and their wedding is only two months away. How will the two stop this marriage?!"]},{"title":"Rebirth Of The Earth Immortal Venerable","tags":["Action","Comedy","Manhua","Martial Arts","Medical","Reincarnation"],"disc":["Rebirth Of The Earth Immortal Venerable / 重生地球仙尊","Chen Mo, a great cultivator of the divine transcendent realm, after dying with his junior sister while on their journey to the sacred land, he is reborn back on Earth in his senior year of high school, he rebuilds his cultivation base, he starts restoring his cultivation level, relying on his memory of his past life, he takes the initiative to plan, to eliminate all his mistakes and protect his friends and loved ones, to defeat the enemy forces, to crush all the conspiracies and to find his junior sister’s whereabouts."]},{"title":"The Blood Moon","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Blood Moon","Please don’t cry, my sweet vampire.\nAs soon as she comes of age, Linnea is married off to an aristocrat in exchange for a sizeable dowry. She finds solace in Aleksis, her new husband’s son. However, terrible secrets surrounding the family come to light as soon as they cross the forbidden line. Will she be able to escape from this hell?"]},{"title":"Bad Girl","tags":["Comedy","Drama","Manhua","Romance"],"disc":["Read manga Bad Girl\nEveryone gets reincarnated as the heroine when they’re dropped into another world, right?! So why am I a supporting character?! Worse still, I’m inside my own novel, one with a bad ending!"]},{"title":"Why She Lives as a Villainess","tags":["Drama","Fantasy","Isekai","Manhwa","Reincarnation","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Why She Lives as a Villainess / 그녀가 악녀로 사는 이유 / The Reason Why That Woman Lives as a Villainess / The Reason She Lives as a Villainess / Why She’s a Villainess / Her Reason To Live as a Villainess","I reincarnated into the body of the main character, the villainess. This was before the villainess went back in time. I know the original plot anyway. I don’t have to go back in time and redeem myself, do I? Let’s just destroy the original plot while looking for a way to live. In my own way, obviously. *** “Are you going to eat in such an inappropriate way?” At the Marquis’ words, Lesian responded carelessly. “The ancestors used to say that you should treat others the way you want to be treated. You say it’s impolite for me to eat in my pajamas, but it doesn’t seem like the Marquis treats his daughter politely either?” At those words, the Marquis shouted angrily. “You must have finally gone crazy!” “Yes, I am insane.” Is it a big deal to say that I’m crazy anyway when I’m currently possessing a villainess’s body?"]},{"title":"The Wicked Wife of a Scheming CEO","tags":["Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa The Wicked Wife of a Scheming CEO / Bad Wife / 坏妻子 / 나쁜 아내","Eunsang Hahm just caught her boyfriend cheating, and Kyungwoo Kang, the CEO of her company, is engaged to someone he doesn’t love. They both agree to a mutually beneficial fake relationship. After all, it’s just a business deal, so… what could go wrong? But as the two begin their scheme, it is clear that their connection runs deeper than what is written in their contract. With his rich family set on finding out the truth, and her nosy coworkers and the media watching their every move, how long will they be able to keep up the charade?"]},{"title":"Intercept","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Intercept / 인터셉트","A new love is coming to the Yoon Seo that’s tired of love!"]},{"title":"The Boss’ Shotgun Wedding","tags":["Drama","Romance","Shoujo"],"disc":["Read The Boss’ Shotgun Wedding / Repentido Contrato Matrimonial Con El Ceo / Shanhun Zongcai Qiyueqi / The CEO’s Pregnant Wife / The Wife Contract Ran Away Of Ceo / 闪婚总裁契约妻 / The Boss’s Shotgun Wedding manhua","Tricked by her best friend, her first time was taken away by the cold CEO of the company she works for. After she finds herself pregnant and forced to marry by his grandmother. He comes up with a marriage contract. What will their life be like, and will it turn as true love in the end?"," "]},{"title":"I’m the Main Character’s Child","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m the Main Character’s Child/ I am the Male Lead’s Child/ I am the Male Lead’s Child/ Reborn as the Protagonists’ Daughter /주인공들의 아이로 태어났다","One day, young Emiliette, who was bullied by her servants, suddenly recalls memories of her past life.","She had been reincarnated into a book she had read in her previous life, as a child of the main characters. Three years after the ending of the novel, her mother died while giving birth to Emiliette, leaving her father unattended with only his daughter left.","‘I can’t keep living like this!’","After the news of my father’s return came out, I decided to change the situation, but…","“Why is that thing in front of my eyes?”\n– The first meeting I was looking forward to, ends with only a cold glare.\n’…but I can’t give up!’","1. Frequent encounters.\n“Hewwo Papa! Papa, where are you gwoing?”","2. Attacking with presents.\n“Papa~ I’ll give you this. It’s a gift. Let’s be close friends from now on. I’ll come every day!”","3. Compliments!\n“Ah! It’s so bright~ I can’t get close to Papa because he’s shining.”","But something’s wrong.\nEven though he replies to everything I ask, his answers are…","“The office.”\n“You’ve brought something useless again.”\n– Yet you kept the useless thing.\n“…shut up.”","He’s especially shy about compliments. Does he really hate me?"]},{"title":"The Duke’s Dark Lady","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Duke’s Dark Lady / Devious Daughter of the Duchy / The Lady’s Dark Secret / House Garnet’s Archvillain / The Young Lady With the Black Soul / 公爵家の黒幕令嬢 / 公爵家的黑暗千金 / 공작가의 흑막 영애님","Estele, the illegitimate child of a duke, grew up under harsh abuse.\nAll her life, she tried to receive love from those around her, but ended up being betrayed and sacrificed to the devil.\nShe suffered in hell for 600 years.\nAnd one day,\n[Do you want revenge?]\n[If you want, I’ll let you shine the brightest. How?]\nShe suddenly heard the whisper of the devil. And Estele decided to take his hand. Return from hell.\nThe youngest daughter of the empire’s greatest house of Garnet. Bringing devastating destruction to all those who betrayed him.\n“I will take everything from the enemy and let them face the worst death”"]},{"title":"How to End an Unrequited Love","tags":["Comedy","Manhwa","Romance","Shoujo Ai"],"disc":["Read manhwa How to End an Unrequited Love / How to End a Crush / 짝사랑을 끝내는 방법","“Warning: Yuri content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","“Kim Boksil, is better known for having no success at love having gone with unrequited love for 20 years now. She’s now on her 9th failure of unrequited love since graduating from high school. Boksil, who vows that she will have a wonderful relationship when she becomes a college student, falls for her kind and handsome sunbae, Doyoon.”"]},{"title":"The Disciple Wants To Rebel","tags":["Historical","Shounen Ai"],"disc":["Read manhua The Disciple Wants To Rebel / 徒谋不轨 / My Disciple Become A Demon / Disciple’s Persuasion Plot / 徒谋不轨 / Rebellious Disciple","Mu Qingyi died in order to save the people of the world. Ten years after being reborn, he discovered that his obedient disciple had become the world’s greatest demon! “YinLi, please respect me , I am your master! “It is precisely because you are my master that I want to discuss the exercises with you like this”"," "]},{"title":"Like Husband, Like Son","tags":["Liexing","Ping Ping Jun","Romance","School Life","Webtoon"],"disc":["Read manga Like Husband, Like Son / 萌宝来袭 ; Meng Bao Lai Xi / Like Husband Like Son / Ma Mi Wo Die Di Ni / 萌宝来袭 / Si Kecil yang Menggemaskan\nThis should be the happiest moment of my life. In my wedding gown, waiting for my groom…didn’t even realize I lost conscious Until I woke up…after giving birth to a child? Where is my child and who is the father? Years after the fact, will I be able to find out what happened that day?"]}]