[{"title":"The Law Of Being Friends With A Male","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Law Of Being Friends With A Male / 남사친의 법칙","Jay is a guy that wanted to talk with his friend about their secret crushes, When Jay was about to confess who he has a crush on, his friend Jiwoon, who’s crush is actually towards Jay, was hopefull that Jay was going to confess his feelings towards her. But she felt shocked when she learned that actually Jay’s crush was someone else, after that, Jay asked her about her crush, Jiwoon tried to avoid the question and gave him a vague description which caused a misunderstanding that his crush was actually towards Jay’s friend Seohyun. She and Jay are just good friends without anything romantic going on between them, The way Jay interacts with her is just in a friendly manner and tries to help her to get her “crush”….Let the romantic drama begin at school!"]},{"title":"This Manhwa Ends When I Confess","tags":["Comedy","Romance"],"disc":["Read manhwa This Manhwa Ends When I Confess / A Manhwa That Ends When You Confess / 고백하면 끝나는 만화","Clumsy girl Song Sena can’t help but make mistakes! She’s had a crush on her classmate, Daese, ever since he lent her an umbrella. But somehow, every time she tries to confess, things go awry…! “Tomorrow, I’m going to properly tell him that I like him for sure!” Will Sena’s feelings ever reach Daese?"]},{"title":"The Fox’s Trap","tags":["Comedy","Drama","Fantasy","MANGA","Manhua","Manhwa","Romance","School Life"],"disc":["Read manhua The fox’s trap / 狐狸的陷阱","Human girl Chi Yan has a nightmare of a fox everyday, and this life was no exception. One day, she meets a real fox demon.\nNine tailed fox Yin Ran only has eight tails. In order to get back the tail bounded to Chi Yan, one of her wishes needs to be fulfilled. The girl, however, has no wishes and only wants to get rid of him. The bad fox, in response, messes up her life.\nA charming face appeared in front of the girl, “Would you like to make a wish now?”"]},{"title":"Silver Tree","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa Silver Tree / 실버 트리"]},{"title":"Netkama Punch!!!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Netkama Punch!!!","",""]},{"title":"High Society","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa High Society / 상류 사회","Adele, a shoe polisher from the slums and orphan of unknown origins, Has survived in the slums disguised as a man. However, she finds herself in a difficult situation where she will be sold off if she doesn’t come up with her protection fee in time. Then, by chance, she encounters Cesare, and ends up making an agreement with him to partake in some sort of scheme. “From today on, you will be my sister, who has been hidden from the public eye.”"]},{"title":"I Don’t Recommend Making a Mistake With Your Male Friend","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa I Don’t Recommend Making a Mistake With Your Male Friend","“You spent the night with the guy who was your childhood friend??!” From the obstetrics office to high school, I spent most of my life together with him, Ji Seo-jun. Thanks to his dazzling good looks, I, Moon Da-yul, his best friend, had to endure a difficult school time and swore I would never get involved with him again. But… after getting drunk, I woke up in a strange hotel room, and next to me was Ji Seo-jun! Can our 29-year friendship survive?"]},{"title":"Duke, that man is my real brother","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Summary: He’s my real brother duke / He’s My Real Brother, Duke / 그 남자는 제 친오빠인데요,공작님","In a fantasy novel, I possessed the hidden younger sister of the Male Lead, “Astel.”\nWhile my brother Cassian is struggling for the revenge of the family, it’s my job to find and deal with the final Villain that has not been revealed even at the end of the original!!\nIn order to do that, I must first enter the northern Duke Castle, where the family’s traitors are hiding.\nSomehow, I became an “imprint of companion” of Duke Anais, a beast of beast and a leading candidate for the final Villain.\nBesides……\n“Please kiss me now, Astel.”\nIn order to live, you need to have daily skinship with your ‘imprint partner.’，\nThere was no such thing in the contents of the original story!\n“’Shall we go see your favorite sea today?”\n” I …… I don’t think I can. I decided to meet Sir Cassian today .”\nThe Duke gritted his teeth with a cold face . I was slightly scared as I saw him. Maybe he’s teething. Because it’s a wild beast!\n* * *\nOne day after I received the Duke’s favor and consideration, My older brother Cassian left his nephew for a while.\nHowever, the Duke seems to have made a huge misunderstanding.\n“It will become our child.”\n“··What is that……?”\n“Casian Gray will disappear from this world now, so you will not become his bride.”\nYes……?\nWhen did I become Cassian Gray’s bride, we are relatives?"]},{"title":"Absolute Martial Arts","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Absolute Martial Arts / 절대무신"]},{"title":"Return of the SSS-Class Demon Lord","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Return of the SSS-Class Demon Lord / Return of the SSS-Class Demon King /  SSS급 마왕의 귀환","A man who fell into the demon world returns to Earth as the most powerful demon lord with absolute power.","However, what awaits him are mysterious monsters.","Slash!","Blood stitches the air, and the man’s voice echoes once more.","“I’ve finally returned.”","The Demon Lord’s return to Earth marks the beginning of the ultimate battle!"]},{"title":"The Guardian Dragon and the Fake Princess","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Guardian Dragon and the Fake Princess / The Guardian Dragon and the Princess of Lies / 守护龙与假公主 / 守護竜と偽りの皇女 / 수호룡과 거짓의 황녀","Seria was born as an ordinary serf, but her extraordinary beauty makes her an outcast in her village. Growing up without any friends, she meets a young guardian dragon, names him Sizrelia, and forms a deep bond with him. But because guardian dragons are symbols of the imperial family’s legitimacy, the emperor must hide the fact that a mere serf can form a pact with a guardian dragon by making Seria an imperial princess! But even with Siz by her side, can she handle life as a fake princess?"]},{"title":"The Duty of an Academy Student Should Be to Study","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Duty of an Academy Student Should Be to Study / Academy Students Must Be Studying / An Academy Student’s Duty Is to Study / Academy Student’s Job Is to Study / 아카데미생의 본분은 공부일텐데","Rose Bell, Commoner Scholar.","A small girl who never misses the top spot.","A prodigy who stays locked in the library every day, not mingling with anyone.","The most famous yet friendless student at the academy.","Such Rose Bell lost the top spot for the first time just before her graduation year.","Failing to maintain her scholarship, she also lost a way to pay for her education.","Rose Bell decided to drop out!","When many expected Rose to leave the academy, Jasper Conway, the son of a renowned duke, suddenly approaches Rose.","“I’ll cover your tuition, so you stay here.”","And even unexpected help.","In exchange for covering her tuition, Jasper demands to be taught magic engineering.","And so, their secret tutoring begins…"]},{"title":"Imprinted","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Imprinted","“Whether in joy or in sorrow, stand by my side through life and death. Do not seek to comprehend or excuse my actions; your only obligation is to love me. ‘Why did I have to appear attractive to him? I long for the ability to remain unnoticed, like someone of my nature.’ He embodies both darkness and illumination, despair and aspiration. The moment I beheld his face with my regained sight remains unforgettable. A perilous love flourishes amidst misconceptions and truths, obsession and retribution. The visage of ‘that man,’ who is distinctly not ‘that person,’ is indelibly imprinted in my memory.”"]},{"title":"You, I’ll Raise You Into A Superstar!","tags":["Drama","Romance"],"disc":["Read manhwa You, I’ll Raise You Into A Superstar! / 너, 내가 스타로 띄워줄게","“Wanna work as an actor with me then?” Byeol’s eyes were left wide open by Woohyeon, the new Executive of ‘Pine Entertainment’ Byeol, who was part of the ‘Lala Girls’ idol group that did not succeed and was on the brink of disbandment. But an offer of being an actor, not even a singer to her? Byeol opened her mouth cautiously. “Can I really succeed if I become an actor?” Byeol didn’t seem to know yet, but Woohyeon could see the ‘SuperStar Talent’ she had within her. Woohyeon said confidently, “Don’t worry, I’ll raise you into a superstar!”"]},{"title":"The Perfect Idol’s Handbook of Falling in Love","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read The Perfect Idol’s Handbook of Falling in Love / 完美爱豆沦陷手册","Mystyle, a girl group that has been a tepid group for three years, announced on its third anniversary that it will be splitting up. The team leader with a sexy and hot style is the former leader Windy, while the team with a sweet and lively style is not It’s the airborne captain Wangshu. Wangshu seems to be well-behaved and sensible. He clings to Windy every day. In fact, he seems to have a different kind of affection for this sister…"]},{"title":"Silver Lining (kikuatama)","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Silver Lining (kikuatama)","Gaby, who cannot speak, is often bullied by Sam, who used to be her best friend, because Gaby lives at Sam’s house and he feels that Gaby is robbing his family’s love. However, when the burden Gaby faced was too heavy, a boy named Vicky who was famous for his reliability saved her!! Those who are completely opposite in nature, are slowly becoming close?!"]},{"title":"When I Stopped Being Your Shadow","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa When I Stopped Being Your Shadow / I’m Nobody’s Shadow / 당신의 그림자를 그만두었을 때","He was the hand of God, the painter of the century. My husband became the best artist in the empire. And I was his shadow. Even when my work went viral under my husband’s name, even when people spoke ill of me behind my back. It was still good. Because I loved my husband. But on our wedding anniversary. “You are the only person I truly love.” I witnessed my husband whispering his love to my best friend. At the very moment when my husband saw me discovering his infidelity, his face contorted viciously and pushed me away. “Where are you raising your voice to your husband?!” I realized. I realized that that man had never loved me. So I decided to become the evil wife they spoke of. * “I have a special story for you.” Read on manhwaclan.com Ines suggested in a strained voice. A man as beautiful as God turned his eyes gently to her. “It’s a special story, our newspaper won’t print the case if it’s not good enough……..” “It’s the fall of the painter known as the Hand of God…” Ines continued in a tense voice. “Isn’t this good enough a scandal to be published in Elton, the greatest daily newspaper in the empire?” “Then what does Countess Brighton gain from the scandal?” “My life.”"]},{"title":"How To Turn You Around","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa How To Turn You Around / 너를 돌려차는 방법","Stop being interested in me! Yeo Eunsol is the best person in hiding. All he dreams of is a quiet high school life. Yet everything becomes ruined because of the popular Ra Jisoo! Airst love romance ♥︎"]},{"title":"My Sweet Enemy, Thy Name is Husband","tags":["Adaptation","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa My Sweet Enemy, Thy Name is Husband / Political Marriage With a Friendly Enemy / 상냥한 원수와의 정략결혼","My husband, my nemesis. Till death do us part. Canach Riadon — a slave who rose to emperor and the man I wed in my first life. Yet our ill-fated marriage left my family murdered and my homeland destroyed at his hands. Now given a second chance, I vow to succeed in this political marriage and save all I love… Or will his love save me first?"]},{"title":"Jakdu","tags":["Action","Fantasy"],"disc":["Read manhwa Jakdu / 작두","Kwon Yong-jin, a protagonist who doesn’t believe in superstitions, experiences unbelievable events right after his 16th birthday."]}]