[{"title":"The Player that can’t Level Up","tags":["Action","Adventure","Manhwa"],"disc":["Read The Player that can’t Level Up , Player Who Can’t Level Up,\nKim GiGyu awakened as a player at the age of 18. He thought his life was on the track to success, climbing ‘the tower’ and closing ‘the gates’… But even after clearing the tutorial, he was level 1. He killed a goblin a day, and he was still level 1. Even after 5 years, he was still level 1. “Who would have thought that this kind of player would exist.” No one knew."]},{"title":"The Awakening of light Magic","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The Awakening of light Magic"]},{"title":"The Magic Genius of the Marquis","tags":["Action","Adventure","Fantasy","Magic","Manhwa","Romance"],"disc":["Read Manhwa The Magic Genius of the Marquis, 후작가의 마법 천재","To survive… I have no choice but to become a genius. Starting today, I’ll do well, so please support me. Lee Hyun-woo finds himself possessed by Kyle Seltarion, an extra character in the game where he once reigned as the world’s top-ranked player. Considering the game’s storyline, he faces a situation where Kyle’s death is imminent.","What’s worse, he’s now in the body of a character who can’t use magic or aura, has a terminal illness, and has such a nasty personality that his reputation is at rock bottom!","However, upon discovering a new talent, he awakens his mana and begins to improve his condition and reputation using the hidden route knowledge he gained through grinding in the game. His immediate goal is to save his own life, but that goal is closely tied to preventing the world’s destruction…","To overcome this situation, he needs to gather allies and build his reputation! Let’s leave behind the past as a scoundrel and move toward a new chapter!"]},{"title":"How to Save a Time-Limited Young Master","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How to Save a Time-Limited Young Master / 시한부 도련님을 살리는 방법"]},{"title":"Talented baby squirrel","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Talented baby squirrel /Baby Squirrel Is Good at Everything / Маленька білочка вміє все! / ちびっ子リスは頑張り屋さん / 狮子公爵家的松鼠千金 / 아기 다람쥐가 다 잘해요","Beatty, the frail squirrel was born into a family of lions. So, she had to live in abusive situations at her aunt’s house.\nThe second prince is her only friend and fiance. The moment she said she was leaving to achieve her dream…\n“Ritter, you bastard…!”\nShe died from his fangs.\nWhen she opened her eyes again, she discovered that she had returned to the past. The time before getting involved with the second prince.\nWhat do you need most at times like these? That’s right, speed. Immediately, she pulled herself out and jumped into her father’s domain.\nEven though she’s not welcome, but if she let this shocking secret out, she wouldn’t be kicked out…\n“Welcome miss!”\n“My God! You’ve grown to this extent…”\n“Young lady is walking with cute little feet!”\nHuh, how is it possible to receive such a warm welcome? Ah, isn’t that statue me? Baby Squirrel Is Good at Everything"]},{"title":"I have possessed the body of the protagonist","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I have possessed the body of the protagonist / 제가 어딘가 빙의를 한 것 같은데요 / I Think I Have Transmigrated Somewhere","I love Romance Fantasy novels, and I even got transmigrated into one.","“Anyway, which book have I transmigrated into?”","I think I’ve read about 20 books that had brown-haired maids with freckles,\nI think I’ve read about 20 books with a southern lady who marries a cold-hearted duke from the north,\nAnd there seems to be more books with black-haired male leads and blonde female leads?","“Wait, is it even true that I’ve transmigrated as the female lead?”","No, I think it might not even be a Romance Fantasy to begin with?","“Read at kaiscans.com to support!”","Where am I, and who am I?"]},{"title":"An animal hospital in the border area","tags":["Action","Adventure","Comedy","Drama","Fantasy","Medical"],"disc":["Read The Legendary Beasts Animal Hospital / An Animal Hospital in the Border Area / An Animal Hospital Near The Border Area / Ветклиника на грани миров / 접경지역의 동물병원","Paris-flying veterinarian named after new recruits! Kim A-young, head of the animal hospital who is struggling with loans. One day you get a phone call. “Do you see reptiles there?” I’m doing reptile therapy, which is not my major for a living. It’s a reptile for use, isn’t it? A blue dragon is here to see a doctor! Ahyoung Animal Hospital, where word of mouth went out when she treated him after a faint blast. New patients line up. Looking at the animals in a state of unimaginable identity, Ah-yeong was briefly taken into consideration for their generous medical expenses. “Monster? Blue Dragon? I don’t know! Money is the best!” The veterinarian’s new medical device. Will Ahyoung be able to treat special patients safely and return to a peaceful daily life?"]},{"title":"I Didn’t Mean to Seduce the Male Lead","tags":["Fantasy","Historical","Isekai","Magic","Manhwa","Reincarnation","Romance","Time travel","Villainess"],"disc":["Read manhwa I Didn’t Mean to Seduce the Male Lead / 남주를 꼬시려던 건 아니었습니다","A baroness who lost her husband at an early age.\nI’ve possessed the body of “Eleanor Maurice”.\nBut in the original story, I have a mere four lines of dialogue!\nAfter pouring my blood sweat and tears, I’ve finally been able to achieve a respectable position within this society.\nTo this prestigious Eleanor, I’ve been offered a sweet deal. If I’m able to introduce the male lead to the female lead and help the original plot come true, you’re telling me a huge sum of money will be well within my reach?!\nHoping for a promising future, I head to the male lead, ‘Leon’s’, residence but…\n“Your problem is…”\n“I fell in love at first sight with you that other night.”\nYou don’t understand, I only went there to kill two birds with one stone!\nCondemned as the nation’s scandal maker despite her futile justifications, introducing Eleanor’s heart-throbbing yet bitter tale!"]},{"title":"The Lazy Swordmaster","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa The Lazy Swordmaster manhwa, 나태한 소드마스터\nHe is a warrior who was chosen by the Holy Sword regardless of his will for the sake of mankind, but he became tired of living for others. Out of salvation, he defeated the last enemy, the Demon King, and decided to die. In order to relieve the burden of being a warrior and a master of the holy sword, he was going to give up on his life and fall into eternal rest… “Oh!! It seems like the young master wishes to grab the sword as soon as possible!!” “Count! Look at the master! He must have already shown interest in swords!!” The youngest son of a master swordsman who gave up his life to escape the sword was reincarnated!? “I’d rather die again!!”"]},{"title":"A Kiss Is Not Enough","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Kiss Is Not Enough / It’s Not Enough Just to Kiss / キスだけじゃ足りない / 大明星的kiss教学 / 키스만으론 부족해"]},{"title":"The Mermaid I Loved","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Mermaid I Loved / 내가 사랑한 물고기 / The Fish I Loved / My Beloved Mermaid / My Beloved Fish / My Dear Fishmen","At the age of 12, when he experienced his first difficulty in breathing, Kai realized he was a merman from that day onward. Despite avoiding love due to the emergence of scales at the touch of a woman’s hand, Kai lives a resilient life as a self-imposed loner and he chooses to never date while facing loneliness and sadness. Suddenly, a mysterious woman named Yana appears before him! Whenever Yana is around, Kai unintentionally loses his restraint and his body responds involuntarily. But what should he do? Even when it feels suffocating, he finds himself liking her…! A breathless romance unfolds between a man who transforms into a merman with just a touch of his fingertips and a woman who wants to touch his hand."]},{"title":"The Legendary Assassin Reincarnated as the Beloved Youngest Daughter of a Royal Family","tags":["Drama","Fantasy","MANGA","Reincarnation","Romance","Royal family"],"disc":["Read manga The Legendary Assassin Reincarnated as the Beloved Youngest Daughter of a Royal Family / 伝説の暗殺者、転生したら王家の愛され末娘になってしまいまして","“Babuba, Babubabubabubabu!?” (Am I going to be a baby!?) Thoth, a legendary assassin in the underworld, was sold by his parents at a young age and was raised strictly as a killer, so he never knew the love of a family he lacked. Suddenly, he saves a cat and dies, but after his death, he’s destined for hell for taking countless lives. However, because of one good deed—saving a cat—he’s allowed to be reincarnated and is born again as a royal princess, Patricia. Then, God commands him to save the royal family—his family. He was supposed to be reborn as a helpless baby, but his assassin skills haven’t faded, and he continues to battle killers one by one. Gradually, feelings of wanting to protect the royal family members who love each other unconditionally just because they are family…?"]},{"title":"Do You Want Me to Lend You a Lighter?","tags":["Romance"],"disc":["Read manhwa Do You Want Me to Lend You a Lighter? / Can I Borrow the Lighter? / Would You Like Me to Lend You a Fire? / 불 빌려드릴까요?","In truth, I never wanted to become a teacher. In a moment when I was fulfilling my own responsibilities on the path I chose after giving up my dream, ‘Do you want me to lend you a lighter?’ A cheeky male student offered. It feels like my life as a teacher is at odds with this cheeky kid, who comes with genius talent, overflowing wealth, and fame as a bonus. A story of school life entwined with dreams, talent, and love."]},{"title":"Fighting Ward","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Fighting Ward / 格闘病棟 / 격투병동","A high school student, Kang Sun-woo, single-handedly defeats a group of illegal loan sharks who came to his house. At the hospital, where he goes for treatment, he is invited by a mysterious man to participate in a suspicious fighting tournament with a huge cash prize.","The prize is crucial for the survival of his family. Sun-woo must survive the fight ward!"," "]},{"title":"The Fifth Friend","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Office Workers","Romance","Smut"],"disc":["Read manhwa The Fifth Friend / No. 5 Friend / 다섯 번째 친구","Deputy Manager Jeong Ji-Soo is a solid office worker who is good at her work but she’s been single for the past 7 years. To pass those lonely nights she has five friends – First one is an ‘egg vibrator’, second one is a ‘internal vibrator’, third one is the ‘silicone dildo’, fourth one is a ‘suction dildo’ and the last fifth is the successor of the company – Han Se-Hyun ?"]},{"title":"Taste Of The Boss","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa Taste Of The Boss / 上司的味道 / 상사의 맛","It’s a dark, quiet night in a forest of buildings, to an empty office where the people who do the work have already left for the day. Who would have thought. A quiet, hard-working employee from Yeonju would walk into the office this late at night in a skirt and no underwear. “Why are you so wet?”"]},{"title":"Overpower Your Enemies by the Law","tags":["Comedy","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Overpower Your Enemies by the Law / 네 법대로 해라 / Do It Your Way"]},{"title":"Lips On The Tip Of a Knife","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lips On The Tip Of a Knife / Lips Upon a Sword’s Edge / 칼끝에 입술","The Mad Dog of the Empire, Arne, the strongest knight ever.","She is forced to marry at the torch of her parents.","“If you don’t like your husband, you have to kill him and come back.”","But nobody ever told me that my husband was so handsome?","“You’re like glass, so I’m afraid to have you broken.”","Besides, my husband treats me like fragile ceramics.","Arne, who is not weak at all, and her obsessed husband Cassian.","A narrowly illusory romance where misunderstandings and misunderstandings overlap!"]},{"title":"Obsidian Bride","tags":["Magic","Manhwa","Romance"],"disc":["Read manhwa Obsidian Bride / 흑요석의 신부"]},{"title":"Return of The Genius Swordmaster","tags":["Action","Adventure","Fantasy"],"disc":["Read manga Return of The Genius Swordmaster","In a world where humanity has gained magical powers to counter the Six Dragons—beings that threaten to bring about the world’s destruction—Agito Hakken, despite having no magic, masters swordsmanship to become a Sword Saint. Sacrificing his life, he saves the world from the threat of the Six Dragons. However, the Six Dragons’ ultimate goal was to summon a greater threat, a Divine Dragon, a hundred years in the future. With the world once again facing ruin, Agito, who should have died, awakens reincarnated in this future world. Determined to truly save the world this time, he takes up his sword once more to rise against the new threat."]}]