[{"title":"Reborn Tyrannical Slag: Pampering the Iceberg President","tags":["Romance"],"disc":["Read Reborn Tyrannical Slag: Pampering the Iceberg President / Chóng Shēng Nüè Zhā: Jiāoyǎng Bīngshān Zǒngcái / 重生虐渣：娇养冰山总裁","There’s no need for revenge after being reborn. There’s only him in my eyes, and I am willing to use everything from my past life in order to be with him again."]},{"title":"My Accidental Country Life","tags":["Adaptation","Drama","Fantasy","Manhwa","Police","Romance","Webtoons"],"disc":["Read manhwa Accidental Countryside Diary / Countryside Diary by Accident / 어쩌다가 전원일기 / Once Upon A Small Town\nWho said rural life is peaceful? Tricked by his grandfather, city boy Jiyool stumbles into Heedong village and is now the local vet. Nothing seems to go right for him in his new life, until in a sudden turn of events he is reunited with his childhood crush. Will he survive this bumpy ride on country roads?"]},{"title":"Who is the Prey","tags":["Drama","Josei","Mature","Psychological","Tragedy"],"disc":["Read manga Who is the Prey / 掌中之物\nA beautiful and successful lady tries to reclaim her life after she gets caught in a twisted game of revenge by a wicked and cruel man."]},{"title":"Divorce Is Easy, But Love Is Hard","tags":[],"disc":["Read manhwa Divorce Is Easy, But Love Is Hard / Divorce is easy, but dating is hard / 이혼은 쉬운데, 연애는 어렵다 / Perceraian itu mudah, cinta itu sulit"]},{"title":"Swiping Right On My Boss","tags":["Comedy","Romance","School Life","Slice of Life"],"disc":["Read manhwa Swiping Right On My Boss","Cao Mengran likes to go out of her way to attract people’s attention, but her boss Li Jiaxi sees through her disguise, and the two have had a conflict since then. Mengran accidentally finds out that Li Jiaxi signed up for a dating app, so she starts dating him in an attempt to get revenge. The two become a virtual couple. Will Menaran’s plan succeed? Or does Cupid’s arrow have other plans for them?"]},{"title":"Everyone else is a Returnee","tags":["Action","Adventure","Fantasy","Harem","Isekai","Magic","Manhwa","Martial Arts","Post apocalyptic"],"disc":["Reading manhwa Everyone else is a Returnee\nIn a primary school excursion I was left behind alone. In a junior high school camp I was left behind alone. In a high school field trip I was left behind alone. In the end I became a uni student but so what? This time I was left behind from the entire human race! While everyone left this world I was the only one to protect Earth! A legend will start when the human race returns and a disaster strikes!"]},{"title":"Grand Master Knight Has Become the Princess","tags":["Adaptation","Drama","Fantasy","Historical","Romance"],"disc":["Read Grand Master Knight Has Become the Princess / Himegimi wa Kishi Danchou / 姫君は騎士団長\nChristina, a girl raised like a boy, is the grand master knight of the guards assigned to Prince Leonardo of the kingdom of Lobolovsky, as well as the prince’s friend. One day, the prince asks her to pretend to be his betrothed for the sake of the country, to which she reluctantly agrees. This is the story of the kingdom’s strongest warrior getting used to life as a princess!"]},{"title":"Tales of Demons and Gods","tags":[],"disc":["Read manhua Tales of Demons and Gods\nNie Li, one of the strongest Demon Spiritist in his past life standing at the pinnacle of the martial world , however he lost his life during the battle with Sage Emperor and the six deity ranked beast, his soul was then reborn back in time back to when he is still 13. Although he’s the weakest in his class with the lowest talent at only Red soul realm, with the aid of the vast knowledge which he accumulated in his previous life, he trained faster then anyone. Trying to protect the city which in the coming future was being assaulted by beast and ended up being destroyed as well as protecting his lover, friends and family who died by the beast assault. and to destroy the Sacred family whom abandon their duty and betrayed the city in his past life.\nNovel Tales of Demons and Gods"]},{"title":"I Tried To Persuade My Brother And He Entrusted The Male Lead To Me","tags":["Comedy","Drama","Fantasy","Romance","Webtoons"],"disc":["Read manga I Tried To Persuade My Brother And He Entrusted The Male Lead To Me / Catching Two Birds with One Sweet Princess / I Tried to Persuade My Brother but He Entrusted the Male Lead to Me / J’essayais persuader mon frère aîné, et il a m’amené l’héros / Persuadí a mi hermano y me confió al protagonista masculino / Я не смогла соблазнить собственного брата / Я пыталась флиртовать со своим братом, но тут появился главный герой / お兄様を誘惑するつもりだったのに！ / 本想拉拢哥哥，男主却上钩了 / 오빠를 꼬시려 했는데 남주가 넘어왔다","Princess Clara fell in love with the abducted male protagonist. The Young king of Verona, her older brother was the one who kidnapped him from the Neraha Empire. The princess was a side-supporting character in the book Adriana, who helped the protagonist, Prince Daniel escape. ‘I would not live like that. ’So"]},{"title":"The Blooming Flower in the Palace Is Crazy","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Blooming Flower in the Palace Is Crazy / The Flower of the Imperial Palace is Crazy / 황궁 에 핀 꽃 은 미쳤다","The crown prince of the kingdom of Taesa, Lee Hyun, holds a loveless marriage with the daughter of the General, Seoh Ryu, to bring in his favorite commoner as his concubine.","But… Many people thought of Seoh Ryu as an obedient lady, but in reality, she is a woman full of charisma. An unexpected night makes Lee Hyun realize that he made a mistake, but it was too late. Everything is in Seoh Ryu’s hands.","The story of how the kingdom of Taesa and Lee Hyun is shaken helplessly by the fierce Seoh Ryu."," "]},{"title":"Unquenchable Thirst","tags":["Drama","Josei","Romance"],"disc":["Read Unquenchable Thirst / A Toxic Addiction / Terrible Addiction / 지독한 중독","Yeonji, the tenacious breadwinner of her family, had a bite-filled one-night stand with Joonwon. He reappears six years later, this time as the infamous Vice President of her company. Struggling as a temp, she clumsily tries to avoid his attention until Joonwon plops her into his personal office. Strangely enough, he won’t let her forget any detail from that night. Will he drag her into the twisted politics of his life? “This time, help me, Miss Nam”… “I don’t know if one night will be enough.” Does he want her body or something more? And how will her past come to haunt her? In this ever-twisting romance, Yeonji might experience enticing excitement or bittersweet heartbreak."," "]},{"title":"Keyboard Immortal","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Reading Keyboard Immortal / Earthern Keyboard Immortal / 陆地键仙 / Keyboard Crusader of the Mystical World","A lightning strike transmigrated Zu An into another world. In that world, he was known as the trash of Brightmoon City, but for some reason, he was married to the gorgeous and highly talented daughter of the Chu clan? What? I’m a transmigrator but I don’t have any talent for cultivation? Why are there so many people out for my life? And most importantly of all, how in the world did I get on the bed of my sister-in-law on my wedding night?! It was a nightmarish starting point for Zu An, but fortunately, as a famed keyboard warrior in his previous life, the world gave him a keyboard in this life too so that he could turn things around. Through his trolling and flaming, he shall stand atop the corpses of his burned enemies and rise to the top of the world."]},{"title":"A Misogamist’s Romance","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":[]},{"title":"Love at First Night","tags":["Liexing","Ping Ping Jun","Romance","Webtoons"],"disc":["After getting married for a few months, she never met her husband. Meanwhile, a cold CEO suddenly came into her life and began to pursue her passionately. On one side, it was the gentle and considerate husband she had never seen; on the other side, it was the CEO who has been with her for a long time.\nHow will she choose…"]},{"title":"The Book of Lagier","tags":["Action","Adventure","Fantasy","Magic","Manhwa","Martial Arts","Romance","Shounen","Webtoons"],"disc":["Read manga The Book of Lagier / 라지에르의 서","The Book of Lagier is a Manga/Manhwa/Manhua in (English/Raw) language, Fantasy series is written by Updating This Comic is About\nThe great Demon King, Embilden, was the first to unite the demon world.\nOne day, a human dared summon the Demon King. It was the greedy and fat,\nPrince Lagier Lou Jerlayla Rodwill!\nHowever, while summoning the Demon King, he had made a mistake in the process, which caused his death.\nLagier’s body is forcefully frozen because of the contract he had made with the Demon King…\n“Well, I might as well just grant him his wish.”\nThe Demon King decides to become Lagier and grant the wish the Prince had before he was frozen to death.\nUntil the day the kingdom of Jerlayla rules the world with power unmatched by anyone!\nThis is the start of a new legend……!\n“I should start by losing weight.”\n…I need to go on a diet first."]},{"title":"The Story of Park’s Marriage Contract","tags":["Comedy","Drama","Fantasy","Manhwa","Mystery","Romance","Time travel"],"disc":["Read manhwa The Story of Park’s Marriage Contract / yeolnyeobagssi gyeyaggyeolhondyeon / 열녀박씨 계약결혼뎐","A Joseon girl, Park Yeon Woo, has always believed that the fated love like in her favourite novel would come to her one day. However, on her first night of the wedding, her husband, Tae Ha, suddenly passed away. Unfortunately, she didn’t get to mourn for her husband’s passing as she has been kidnapped and thrown into a well mysteriously. The man who saved her certainly looks the same as her late husband, but this man is from Seoul of 2021! Would she be able to find true love this time?"]},{"title":"The Most Beloved","tags":["Drama","Fantasy","Historical","Manhua","Monsters","Reverse harem","Romance","Supernatural","Time travel"],"disc":["Read manhwa The Most Beloved","One more shot at life! After her untimely demise, Xue Rong is rewarded with the chance to be reincarnated — but this time as some sort of cute, furry creature! She soon realizes that not only is she in the distant past, but also smack dab in the middle of an academy full of beautiful men!"]},{"title":"My Husband Hides His Beauty","tags":["Fantasy","Historical","Romance"],"disc":["Read manhwa My Husband Hides His Beauty / My Secretly Hot Husband / My Husband Hides His Beauty / 남편이 미모를 숨김","There is a family, who for generations, were rumored to be monsters.\nThe lord of the Halstead castle, Erden. He adorns a mask to hide his scary face. Leticia, who was sent to marry Lord Halstead in place of her sisters, began to be referred to as ‘the woman who married the monster’ and was pitied by others. but there is a secret that they don’t know. “I’m always grateful to you, wife. You’re so kind to the unsightly me…” “well, since I’m Erden’s wife.” “I need to divorce you soon so you won’t be troubled by such things anymore… I’m sorry but I lost the divorce papers.” Well of course, that’s because I burnt them. “So I need more time…I think it’ll take more time.” I need to spread more scary rumors about the north to the lawyers. I am definitely not divorcing such a handsome husband!!!"]},{"title":"Idol beyond another dimension","tags":["Drama","Fantasy","Manhwa","Romance","School Life","Sci-fi","Slice of Life"],"disc":["Read manhwa Idol beyond another dimension / Another World Idol Beyond the Dimension / 차원을 넘어 이세계아이돌","Ordinary high school student Jururu is on the verge of death in a sudden accident on her way home from school as usual. But then a mysterious woman appears and saves Jururu by turning time back, and tells her that things like this will continue to happen in the future, however there is only way to survive. That is to help Gosegu to help her achieve what she wants! Jururu, who had no choice but to listen to it in order to live, She meets Gosegu, who has transferred to her class the next day, but Gosegu gives her an unexpected proposal… “Would you like to become an idol with me?!” “What do you mean, Segu…?” Jururu really helped Go Segu and became an idol. Will she be able to overcome her death?!"]},{"title":"Love and Blade: Girl in Peril","tags":["Adaptation","Crossdressin","Drama","Fantasy","Historical","Isekai","Reincarnation","Romance"],"disc":["Read manhwa Love and Blade: Girl in Peril / 사형 저 사실 여자예요 / I’m Actually a Woman","I was reborn as a web novel character and found out that I was destined to be assassinated by my rivals! My name is Moyong Ah-rin, a girl who just lost her parents and joined the Moyong sect, one of the strongest groups in Murim. To avoid the inevitable, I disguised myself as a boy and changed my name to Moyong Ah-hyun. But there’s one problem, my brother-in-arms and distant relative, Moyong Chun, is taking an interest in me… Stop obsessing over me, Brother Chun! If you love me, my fate won’t change!"," "]}]