[{"title":"The Villainess’s Debut","tags":["Fantasy","Josei","Manhwa","Mystery","Reincarnation","Romance","Shoujo","Villainess"],"disc":["Read manhwa The Villainess’s Debut / 악녀의 데뷔작 / The Villianess’s Debut Novel","Ma-go has started her 44th life this year. She is paying the price for the book she wrote 500 years ago, “Record of a Dreamlike Romance”. “Until all of your books are eliminated, you can never have eternal rest.” A single book had twisted the destinies of many. So the angry God of fate sent down the reaper, Ha-rib, on an errand… After living many cursed lives, only 5 copies of her book remain! With her curse coming to an end, she started preparing for her final rest, but… “I’m publishing that old book ‘Record of a Dreamlike Romance’ as an e-book.” An unexpected interview with Gyu-jin, the CEO of an online bookstore! If he does that, she might never be able to break this curse! Also, he has a crazy resemblance to her first love…? A woman trying to repay the karma for writing a cursed book, and… The grim reaper watching over her VS her reincarnated first love! A never-ending 500-year old romance between three souls!"]},{"title":"Eternal life","tags":["Action","Drama","Fantasy","Manhua","Martial Arts"],"disc":["Read manhua Eternal life","The Immortality, The mortal body metamorphosis, longevity, immortality, and eternal life. These five realms, step by step, reveal themselves in front of you. As a normal person, how can one try step by step to reach and open the door to eternal life?Between the heaven and the earth lies the mortal body, the mysteries of metamorphosis, freedom of longevity, the power of immortality, and the hope of eternal life. A story filled with endless new magic, a new world of immortal styles, people, demons, gods, fairies, magic, kings and emperors. A world of love and hatred, revenge, and mystical battle, all in “Eternal Life.”"]},{"title":"Shared Heart","tags":["Comedy","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Shared Heart / 共享心脏","",""]},{"title":"The Secret Work From Home","tags":["Comedy","Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa The Secret Work From Home / Covert Work From Home / Work From Home Privately / 은밀한 재택근무","",""]},{"title":"Fall in Love With the Empress","tags":["Adaptation","Comedy","Drama","Historical","Isekai","Romance","Shoujo Ai"],"disc":["Reading manga Fall in Love With the Empress / I’m Determined to Be the Dark Moonlight / Zhè Hūnjūn De Hēi Yuèguāng Wǒ Dāng Dìngle / 这昏君的黑月光我当定了","“Warning: Yuri content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","The Cold and Aloof Empress X A Kind and Intelligent Girl Description: Duan WeiYing dressed herself in attire befitting a delicate maiden before entering the world of Gongdou, where she is tasked to become the Empress of Gongdou. However, she had absolutely no interest in the legendary Shun Jun. Rather, her only motive is to abuse the bug in her tasks. But who would’ve thought that the current cold and refined Empress would gradually fall in love with her… [TL: BBLOVER , PR: ey]"," "]},{"title":"The Innkeeper Chronicles","tags":["Action","Adaptation","Adventure","Demons","Fantasy","Magic","Romance","Vampire"],"disc":["Read manhwa The Innkeeper Chronicles","On the outside, Dina Demille is the epitome of normal. She runs a quaint Victorian Bed and Breakfast in a small Texas town with her seemingly harmless Shih Tzu named Beast. But Dina is…different. Her Inn can magically defy the laws of physics, her broom is a deadly weapon, and her little dog is far from harmless. Under the circumstances, “normal” is a bit of a stretch for Dina. And now, something with wicked claws and deepwater teeth has begun to hunt at night….Feeling responsible for her neighbors, Dina decides to get involved. Before long, she has to juggle dealing with the annoyingly attractive, ex-military, new neighbor, Sean Evans—an alpha-strain werewolf—and the equally arresting cosmic vampire soldier, Arland, while trying to keep her Inn and its guests safe. But the enemy she’s facing is unlike anything she’s ever encountered before. It’s smart, vicious, lethal… and putting herself between this creature and her neighbors might just cost her everything."]},{"title":"All the Heroes Love Me","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read All the Heroes Love Me / Furen Ta Chengle Da Laomen De Tuan Chong / Fūrén Tā Chéngle Dà Lǎomen De Tuán Chǒng / The Madam Has Become Big Shots’ Favorite One / 夫人她成了大佬们的团宠","When Lan Jin went back to her own world three years later, she found that her reputation was ruined. What’s more, she had five fiancés and five sons who came from five time-travel worlds. She was not a loser anymore. And all the heroes loved her."," "]},{"title":"Becoming a Big Boss Starts with Spending Money","tags":["Manhua","Reincarnation","Shoujo"],"disc":["Read manga Becoming a Big Boss Starts with Spending Money, 当大佬从花钱开始\nHave you heard of a world of quick transmigration, bound by a prodigal system, where if you’ll die if you don’t spend money? The embarrassing missions involve spending money, taking revenge, and ensuring the well-being of a pretty boy. Chu Zheng had no choice but to accept these terms… the system is way too powerful. She can only advise everyone: if you want to become a big boss, start by spending money!"]},{"title":"Deep Purple","tags":["Historical","Romance"],"disc":["Read Deep Purple / Jiu Chong Zi Jiǔ Chóng Zǐ Nine Heavy Violets Nine Layers Of Amethyst Nine Layers Of Purple 九重紫 九重紫","Dou Zhao was reborn into her childhood and witnessed her mother’s death again. Yet what’s the truth behind her mother’s bitter tears? Why did she commit suicide? This secret of Dou’s mother, the tender disguise of her stepmother, the reason why father had to send her to court as concubine… Is this really the home that gave birth to her and raised her? Does her father really love her? Dou Zhao is confused. She had to pull herself together and live her life one more time."]},{"title":"Don’t Provoke the Puppy","tags":["Drama","Fantasy","Manhua","Romance","Royal family"],"disc":["Read manhua Don’t Provoke the Puppy / 别惹小狗"]},{"title":"I Gave Birth To A Murderer’s Child","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Gave Birth To A Murderer’s Child / I Raised the Son of a Murderer / Aku Melahirkan Anak dari Seorang Pembunuh / Dio a luz al hijo de un asesino / He dado a luz al hijo de un asesino / I Gave Birth to a Villain’s Child / I Gave Birth to the Villain’s Child / Le sourire de la Grande Duchesse / Tôi sinh con cho kẻ sát nhân / 带着萌娃嫁公爵？ / 살인귀의 아이를 낳았다"]},{"title":"Honey, I Want to Eat Up Your Money!","tags":["Comedy","Manhua","Romance"],"disc":["Read manhua Honey, I want to eat up your money! / 老公我要吃垮你！"]},{"title":"The Fabulous Lives of the Hillington Sisters","tags":["Fantasy","Historical","Isekai","Reincarnation","Romance"],"disc":["Read manhwa The Fabulous Lives of the Hillington Sisters / He Loved My Sister / 그는 내 여동생을 사랑했다","Hildea Hillington, the daughter of duke Hillington, always knew that she was a mere supporting role in the story. She also knew that her destiny was to watch her younger sister, Roserielle, get married to young and ambitious duke Gabriel Velkius. But something was definitely off. Why does Grabriel say that he loves me? He’s supposed to be in love with my sister!"]},{"title":"Some Hairy Business","tags":["Drama","Josei","Romance","School Life"],"disc":["Read manhwa Some Hairy Business","Who knew dating could be so hairy? After waking up from a night of drinking, Yeonhee is shocked to find herself in the bed of the hottest guy at school, Saeksi Ahn! And apparently she gave him a Brazilian wax?! Saeksi gives her an ultimatum — tell everyone they slept together and start dating, or he’ll reveal their hairy business!\n털털한 사정"]},{"title":"Picked up a Little Fox","tags":["Manhua","Romance","Supernatural"],"disc":["Read manhua Picked Up A Little Fox / Jian Dao Zhi Xiao Hu Li ~ Jiu Wei Zheng Duo Pian / 捡到只小狐狸 ~ 九尾争夺篇","The little fox goes downhill to avoid the calamity. She encounters the rich and handsome Professor Tian You. Getting along with each other day by day, the naughty and cute little fox gradually falls in love with Tian You. But the coming of the calamity makes the fox show herself in her true colours. And the identity of Tian You is also a mystery. At the same time, the brother of the fox who is a superstar also finds her and wants to take her away…\nThe Encounter with Fox"]},{"title":"Villain Lady Wishes to Be Like a Nightingale","tags":["Fantasy","Isekai","Shoujo"],"disc":["悪役令嬢は夜告鳥〈ナイチンゲール〉をめざす, Akuyaku Reijou wa Yoru Tsugedori wo Mezasu,Villain Lady Wishes to Be Like a Nightingale manga , The Villainess Who Became a Nightingale\nAn unpopular woman in her thirties, our protagonist’s only pleasure in life is reading all the web novels she can get her hands on while soaking in the bath. Tragically, she carelessly fell asleep in the bath and drowned, and before she had opened her eyes, she entered a fantasy novel world with a fictional Otome game theme. What’s more is that she transmigrated as the villainess Leysritt!\nAll I wanted was to be able to enjoy my second life quietly! But because I saved the prince’s life after he was run over by a carriage, the prince’s younger brother took interest in me, and now I’ve become his fiance?! With my knowledge from being a nurse in my past life, I want to be of help in this world. If I want to avoid a future of ruin… I must aim to be the Nightingale. (Synopsis: Gourmet Scans)"]},{"title":"Trapped in My Daughter’s Fantasy Romance","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Manhwa I Got Possessed Into a Romance Fantasy Written by My Daughter / Transmigrating to the Romantic Fantasy Novel Written by My Daughter / 穿进女儿写的欧风小说里？ / 딸이 쓴 로판에 빙의되어 버렸다","Park Soonja stumbles on a mountain and passes out, waking up as the heroine of her daughter’s romance-fantasy novel, Belita Partel. She first enjoys her new life and youth, until it hits her that her daughter is left all alone in the real world. She then tries everything to go back but nothing works. It seems the only way to escape is to marry the male lead of the novel, the crown prince. As she strives to achieve the goal, she unintentionally charms the male characters one after another. Can she ever get out of this novel and reunite with her real daughter?"]},{"title":"Next Door Boyfriend","tags":["Drama","Romance","School Life","Shoujo"],"disc":["Read manhwa Next Door Boyfriend / Boyfriend Next Door / 옆집남자 친구","Hi, everyone I’m the owner of Hyera Scanlation. Since I’m working alone, it’s very possible that there will be an error :’) Forgive me for that. I don’t have anyone to PR and QC—"," "]},{"title":"Love In Time","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Love In Time"]},{"title":"I am the Male Lead’s Ex-Girlfriend","tags":["Fantasy","Harem","Isekai","Romance"],"disc":["Read manhwa I am the Male Lead’s Ex-Girlfriend / I Became The Male Lead’s Ex-Girlfriend / 나는 남주의 전 여친이었다\nMy role in the novel begins with the appearance of the heroine: the woman who’ll change the life of the male lead. To sum it up, I’m supposed to cling to him and beg for his affection. The original Erika was a nasty ex-girlfriend. I didn’t want to be a s*upid villainess, so I put myself first and distanced myself from him… And yet, 3 years later, this very man reappeared in front of me. What a strange thing… This shouldn’t be happening…\n“I don’t think I can do this without you. I still like you.”\nWhat is this…? I’m not the woman you’re supposed to be obsessed with! And coincidentally, Zion – Leonardo’s best friend – has been acting strangely. I felt sorry for his fate as the sub-main character, so I’ve comforted him often… but have I gone too far?\n“I like being with you. I like you. Everything will be better if you’re by my side.”\n… I’m not the character you should like. I’m merely a villainous supporting character, and yet the men of the novel quickly begin to confess! Who should I choose?"]}]