[{"title":"North Snow Love Story","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa North Snow Love Story / 북설애담","A snow woman, Seolha, who hides her identity as a yokai and pretends to be human. She ends up marrying the Great General of the North, who ruthlessly kills yokai?! Will Seolha be able to keep her yokai identity hidden and live a happy married life?"]},{"title":"I Became the Wife of the Monstrous Crown Prince","tags":["Adventure","Fantasy","Romance","Shoujo"],"disc":["Read manhwa I Became the Wife of the Monstrous Crown Prince / The Little Princess and Her Monster Prince / I Became the Wife of the Monstrous Crown Prince / IBTWOAMCP / 괴물 황태자의 아내가 되었습니다\nShe transmigrated into the body of Ancia, the current wife of the monstrous crown prince, Blake, in an R-19 romance novel. In the original story, Ancia committed suicide on the day of their marriage, leaving Blake with massive trauma. But this time, Ancia wouldnt do such a thing. Blake was the second male lead in the original novel. He was portrayed as a beast that possessed an exquisite facade. Yet, right now, he was behaving just like an innocent rabbit. The only person who can remove the crown princes curse is the heroine, Diana. My role is to just keep this little boy from getting hurt and then step down in time, but.. Ancia, dont leave me! This little rabbit keeps chasing me."]},{"title":"Kalli the Champion","tags":["Action","Drama","Fantasy","Manhwa","Mature"],"disc":["Read manhwa Kalli the Champion, 권투사 칼리, Boxer Kali, Boxer Carly, Carly the Boxer, Return of the Boxer","After giving up his dream as a boxer, Park Kang-tae joined a gang. He was well-known inside the gang but got killed in the end. He had one regret when he died―Giving up his dream as a boxer. Did God know about his regret? In a world, where boxing exists in the form of pugilist games, Park Kang-tae pursues his unfulfilled dream."," "]},{"title":"The Devil Who Kisses My Feet","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Devil Who Kisses My Feet / 내 발등에 입 맞추는 악마여 / The Devil Who Kisses My Foot","Maria, who is in an unhappy marriage with her sadistic husband, unexpectedly receives news. Her husband’s half-brother, Lowell, was much younger than her husband. Maria, who had personally educated and raised him, learned that he had returned from the battlefield. Lowell, was not the small child or immature boy Maria remembered. He had the appearance of a grown man. With his appearance, a rift slowly began to appear in the seemingly peaceful Marquis Redford. Where would this relationship, which should never have begun, end?"]},{"title":"My Destiny, It’s Time to Get It Back","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Destiny, It’s Time to Get It Back / ชะตาของฉัน ขอมันคืนละนะ / My Destiny, I Want It Back","Stella Salcibia discovers that someone has taken over her body while she is trapped inside a mirror. “Give it back! Give me back my body!” When they finally meet again, her anger and sorrow transform into a painful plea. The other person responds with silence, leaving without a backward glance. She can only lament helplessly within the mirror, “I can take her life back.” It’s as if a devil’s temptation beckons her. “But before the world realizes that what should be one has become two, before the world chooses to erase someone, be the one and only Stella…”"]},{"title":"Princess player","tags":["Adventure","Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Princess player / プリンセス・プレイヤー / 프린세스 플레이어","“Sudden death from a delicious chiffon cake?! I was possessed by a game about a pufferfish princess!”","[I made eye contact with Dad and suddenly died!]","[I suddenly died because the cake was so delicious!]","What kind of game is this?","I have to survive as the pufferfish princess in this extreme difficulty level of a nightmare game!","But I’ve been possessed by that game…","Since this is the case, I’ll stake my pride as a gamer and aim for a happy ending.","Since I’m at it, I’ll save my mom and stop Dad from becoming a tyrant!!!","[No Princess Diary available, so new skill purchases are not possible.]","…I can do this, right?"]},{"title":"The Abyssal Seed","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua The Abyssal Seed, The Abyssal Seed, 深渊之种, The Book of Abyss","One day, after finishing a novel with an apocalyptic theme, Chang Ting found that the world was quietly transforming, as if the events from the novel were unfolding in reality.\nFrom the mysterious disappearance of skyscrapers to the appearance of monsters at fixed times and locations, everything was developing according to the script of the novel.\nChang Ting realized that in order to survive, he needed to acquire the special abilities mentioned in the novel. Using his advance knowledge of the plot, he waited patiently at the location where the first Abyssal Seeds were supposed to appear. When the time came, he successfully gained the exclusive talents described in the novel, becoming one of the first individuals with the ability to confront the challenges of the world. The apocalypse was inevitable, but Chang Ting, armed with the knowledge from the novels he had read, was ready to face the impending conclusion. As the plot he had encountered in novels approached its climax, the origin of the Abyssal Seeds was about to be revealed, unraveling all the secrets surrounding the impending apocalypse!"]},{"title":"Domestication of Divine Beasts at the Beginning","tags":["Action","Adventure","Drama","Fantasy","Manhua"],"disc":["Read manhwa Domestication of Divine Beasts at the Beginning / 万族入侵：开局驯化史诗级巨兽","All races have invaded Earth. Su Bai’s pet turtle evolved into the Black Tortoise , and his cat into the White Tiger . The Vermilion Bird and Azure Dragon , ancient sacred beasts, soon followed. However, these divine beasts have enormous appetites, which led Su Bai to become a notorious businessman that gives everyone headaches.“Brother, this is Black Tortoise blood, only selling for a mere ten billion. Hey, why are you cursing at me just because you’re not buying?”“The champion of the Hundred Schools competition wins ten billion? Help me up, I can still fight!”“The main city of all races has countless riches? As a human, I must protect my Dragon Country. I will lead the charge!"]},{"title":"Deeply In Love","tags":["Drama","Fantasy","Romance"],"disc":["Manhua to read Deeply In Love / 情靡 at manhua website","When Ji Xuan broke up with ex, Song Zhao Li appeared just in time like a prophet. Snow covered the entire sky. Leaning against the car while smoking, Song Zhao Li smirked and said, “Broke up, huh?” Ji Xuan looked up at him coldly and replied, “Even if I did, it wouldn’t be your turn.” Later, Ji Xuan and Song Zhao Li got married. Everyone thought Ji Xuan was aiming too high, but only Song Zhao Li knew that he was the one who overcame all obstacles and became the second male lead."]},{"title":"I’ll Pay for your Life, Let’s Both Go Crazy Together!","tags":["Action","Drama","Fantasy","Historical","Martial Arts","Romance"],"disc":["Read manhua I’ll Pay for your Life, Let’s Both Go Crazy Together!","I, Luo Yinyou, am a three-year-old cute baby who fell from the sky. I have lived two ridiculous lives (the second life can be ignored). In the third life, a vicious seal was placed in me; I would not survive for three years unless it was undone. But luckily I have a system, and I also found a “dad” who seems to be very powerful. A great, lively (chaotic, messy) life has begun!"," "]},{"title":"Under the Shade of Wild Roses","tags":["Drama","Fantasy","Manhwa","Revenge","Romance"],"disc":["Read manhwa Under the Shade of Wild Roses / 찔레꽃 그늘 아래 / Under the Shade of Brambles","The city of desire and turmoil, Gyeongseong. Within it, a flower blooms without a smile, the gisaeng Lee Sun. After 10 years, she meets again the man who took everything from her, Han Seojin. A pain that pierces her heart. Painful memories resurface with every moment. The only way to end it is to seek revenge against Han Seojin. Fate turns into a cruel connection, and a flower blossoms upon hatred. Inflicting wounds, devouring each other, and once again parting ways. In the melancholy city of romance, Gyeongseong."]},{"title":"Can We Become a Family?","tags":["Adaptation","Adventure","Drama","Fantasy","Historical","Josei","Manhwa","Psychological","Romance","Shoujo","Survival","Webtoons"],"disc":["Read manhwa Can We Become a Family? / Family is Needed / 우리가 가족이 될 수 있을까요?","“Navia Agnes”, adopted to marry the Crown Prince on behalf of Duke Agnes’s daughter with a time limit.","“I really want to be family.”","Navia, who held on to her family’s affection, did her best to become an Empress even while being abused. However, once Vivian, the Duke’s real daughter, is cured, she is abandoned by her family.","No, it would be right to say that she was abandoned on all occasions.","“Just how much more effort do I have to make? If I want to be your family.”","Navia took off her blood-soaked gloves.\nThen on her right wrist, a number that couldn’t be seen by others appeared.","1","She calmly admitted, looking down on the number.","“I’m going to stop playing with my family now.”","At that moment, the number on her wrist changed.","0","Just like that, her life began again.","“If you messed with me, you’re gonna pay for it.”","Will she be able to find a temporary family who will protect her until she becomes of age, and get revenge on Duke Agnes?"]},{"title":"The Way the Mage Faces Death","tags":["Action","Drama","Fantasy","Isekai","Magic","Manhwa","Martial Arts","Reincarnation","Romance","Shoujo","Survival","Webtoons"],"disc":["Read manhwa The Way the Mage Faces Death / How a Mage Welcomes Death / How a Mage Welcomes / How a Wizard Dies / How Wizards Welcome Their Death / Mabeobsaga Jug-eum-eul Maj-ihaneun Bangbeob  / الطريقة التي يواجه بها الساحر الموت / 마법사가 죽음을 맞이하는 방법","“I want it to end now.” Enthe, the archmage, lived a long 300 years, due to a curse that prevents her from dying until she rids the wicked dragon. Though she finally defeated the dragon, She opened her eyes not in the Netherworld, but in a dazzling noble’s home. Worse yet, she opened her eyes in the body of a young lady who only knows magic from romance fantasy novels…"]},{"title":"Two Heirs","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Two Heirs / The Accidental Heiress / 두 명의 상속인\nRiella, who runs a small flower shop, suddenly inherits all of the fortunes of Duke Hoson, the mighty jeweler because of her special ability. However, there was another original heir who was meant to receive the tremendous legacy. The king’s younger brother and jeweler, Grand Duke Haun, appears in front of Riella, who is confused the sudden new inheritor. “Everything with Hoson’s name was going to be mine. So l’m getting it back. Everything, including you.”"]},{"title":"I Accidentally Seduced the Male Lead’s Younger Brother","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Accidentally Seduced the Male Lead’s Younger Brother / 실수로 남주의 동생을 꼬셔버렸다","“No, I don’t want to.” I flatly rejected my ex-boyfriend’s proposal to have an affair with him. “The Young Master is not my taste. If I must say, your younger brother is much preferable.” “What? You prefer my younger brother?” Yeah. Not you, but your brother. *** That ‘younger brother’ came back to me as a beast with a decadent beauty. “I’ve never forgotten you for a moment. Please marry me, noona.” On top of that, he’s even holding the engagement document that I signed as a joke during childhood. No, weren’t we only playing house? “Could it be that your tastes changed while I was away?” Lexion’s eyes were full of life as he asked. It was as if he would kill someone right away if he were to find out they were my type."]},{"title":"Trump Cards","tags":["Drama","Fantasy","Magic","Manhwa","Romance","School Life","Supernatural"],"disc":["Read manhwa Trump Cards / Maîtresse des cartes / 트럼프 카드","Se-ryeong Moon is a bright high schooler who frequently combats boredom with made-up scenarios about the world around her. Thus, she is completely indifferent to the gossip and affairs of her classroom. After a particularly rowdy day at school, Se-ryeong visits a teacher’s house where she discovers a pack of special cards and learns that only she can bring to light what fate the cards hold. However, she underestimates the chance that her life and the lives of those around her might change drastically if she fails to use the cards properly…"]},{"title":"You Just Need To Hold My Hand","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Just hold my hand / Pegang saja tanganku / 손만 잡고 잘게 / You Just Need To Hold My Hand","I will hold hands to wake the prince from his eternal slumber.\nSodinor, an expert in dreams, she has the ability to make wishes come true even in dreams.\nShe was brought into the prince’s dream by the emperor’s order to wake Prince Marmell, who was unable to wake up.\nHowever, there is something very strange in the dreams of the prince, who is known for his kindness and gentleness. His dream world is desolate and colorless.\nSonidor, who infiltrates Marmell’s dreams with the image of an adorable animal, finds every reason why he’s sleeping like that…\nWill Marmell wake up from her eternal slumber?"]},{"title":"You Can Hear It","tags":["Fantasy","Romance"],"disc":["Read You Can Hear It / Can You Hear Me / 你听得见","During a big campus carnival, five people escaped to the beach to play a card game. Lin Weixia then got the chance to ask Ban Sheng a question. Lin Weixia: “What do you want to be?” Ban Sheng: “A shark.” He then paused and asked, “What about you?” “A fish tank.” she answered. Everyone knows that sharks and fish tanks can never be together. The handsome and arrogant boy × the cold and cool academic girl."]},{"title":"Ebony","tags":["Drama","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read Ebony","“Be quiet. Shut up and live like the dead”.Ebony Vonieck is a convicted felon for the murder of her fiance and father. While waiting for her execution in prison, she is suddenly released from her hell when she is informed that the Archduke of Schneider Castle is waiting for her. Expecting her life to become a living hell, what awaits her instead is a household of warm employees and servants. Ebony has no idea that the Archduke will help change her life.\nLady Evony"]},{"title":"Marriage and Sword","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marriage and Sword / Pernikahan dan Pedang / 메리지 앤 소드","House Targayel, the sword of the Emperor and the glory of the Empire.","House Targayel, whose name was respectable, was doomed. They weren’t just doomed, they were destroyed.","Just to make ends meet, Elje hides her identity and goes to war.","After returning home, Elje who made a name for herself through her amazing swordsmanship and gained a fortune thought that all she had to do was live a happy life.","Unexpectedly, a political marriage was arranged by the Emperor’s orders!","Her partner to be was Shan Crixus, deputy commander of the Imperial Army, who she saved in the war……"]}]