[{"title":"Virus Girlfriend","tags":["Action","ecchi 2","Harem","Manhua","Post apocalyptic","Zombies"],"disc":["Read manga Virus Girlfriend, My Girlfriend is a Zombie / Virus Girlfriend / 我的病毒女友","Faced with doomsday, the special power inside Ling Mo was woken up. He found out that he could control zombies. Therefore he could walk through the zombie crowd safe and sound using his power, and eventually he met his beloved girlfriend – Ye Lian, but only to find out that she has already been transformed into a zombie. To help Ye retreive her memories, Ling Mo started his survival in doomsday."]},{"title":"I, The Demon Lord am being targeted by my female Disciples!","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I, The Demon Lord am being targeted by my female Disciples! / Disciples Want to Kill Me / I Love the Demon Lord So Much That Even My Female / 大爱魔尊，女徒弟都想杀我","Bai Feng transmigrated into an ancient chinese style dating game and became the Demon Lord, Bai Qingling. The Bai Qingling in the game is cold-hearted and ruthless. In order to seek immortality, he cultivates the Path of Gu, makes human puppets, and does all kinds of evil. What’s even more hateful is that his three stunning female disciples he regards as pawns, are the villain bosses in the game’s “Pure Love” and “Evil Fall” routes! In such a desperate situation, let’s see how Bai Feng can turn the tables with the [Great Love System]!"]},{"title":"Catastrophic Priest","tags":["Action","Adventure","Fantasy"],"disc":["Catastrophic Priest , 我！灾厄级牧师","Global changes occur, the game becomes reality, and demonic disasters begin to wreak havoc. In order to resist all this, everyone must pick a class and level-up like crazy. Lin Ye awakens his god-level talent from the beginning, turning things around, and starts speed-running straight from the top dungeon. Priests are weak? If I use the healing technique, you might die!"]},{"title":"Virus King","tags":["Action","Adventure","Martial Arts"],"disc":["Read Virus King, Doomsday for All: Me, Virus Monarch, 全民末日：我，病毒君王","The world has plunged into the darkness of the apocalypse. In this grim reality, the entire world has become a brutal arena for evolution. It’s humanity’s greatest opportunity and trial, as well as a playground for gods and demons alike. Chen Bai is granted a second chance, going back in time to ten days before the apocalypse began. With a direct injection of the zombie virus, he awakens an SSS-level talent: the Virus King. Now, he embarks on an extraordinary path of evolution, wielding control over the virus itself."]},{"title":"The Baby Hostage Is So Cute","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Baby Hostage Is So Cute / The Empire’s Cutest Little Hostage / Baby Hostage’s So Cute / 아기 볼모가 너무 귀여워"]},{"title":"The Priest Dreaming of a Dragon","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Priest Dreaming of a Dragon / The Priest’s Dream Is to Ride the Evil Dragon of Eternity / 神官的梦想是骑上千古恶龙","The story of a dragon who mistook a priest for the princess and kidnapped him for ransom, and then got (became) scammed (attracted) by (to) the priest."]},{"title":"My Second Life is a Healing Life?","tags":["Action","Adventure","Fantasy","Magic","Manhwa"],"disc":["Read manhwa My Second Life is a Healing Life? / 두 번째 삶은 힐링라이프?","Eugene Felivia, the beloved youngest son of the noble Felivia family, known for its great warriors, gains a second life thanks to the grace of ‘Felin, the Wizard of Creation.’ Eugene dreams of becoming a wizard like Felin, who saved him, and using his powers to make the world a better place. However, the dark and harsh realities and his fate still refuse to let him go…"]},{"title":"Terminally-Ill Genius Dark Knight","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Terminally-Ill Genius Dark Knight","<Inner Lunatic> is a fantasy RPG infamous for its extreme difficulty.","However, to Yoo Chan, who was diagnosed with a terminal illness at a young age, this game was his entire life and has now become his reality.","From now on, Yoo Chan has to survive in this world as Nox von Reinharber, the worst villain in the first act of the game. Will he be able to reach the end of the story safely?"]},{"title":"Arcane Sniper","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Arcane Sniper / Mystic Musketeer [Official] / Arcane Sniper / Der Freischütz (LEE Subaek) / The Freeshooter / The Marksman / 魔弾の銃士 / 魔彈射手 (韓漫) / 마탄의 사수","A series about a hyper-realistic fantasy game! “Sargent Ha, you crazy bastard. You shot another full round of bulleyes?” The sharpshoter Ha LeeHa simply wanted to be a part of the army forever. However, due to an unfortunate accident, he became paraplegic and was tossed back into society. The revolutionary VR game [Middle Earth] presented a new life to him. Money obtained in [Middle Earth] has real world value! Yet, he ruined his chance by selecting the lowest-tier character! “I’m not like the others. This is all I have.” Black gunpowder, iron balls, and ramrods… I’ll show you all what a real ‘musketeer’ is!"]},{"title":"Bad Born Blood","tags":["Action","Adventure","Fantasy","Manhwa","Sci-fi"],"disc":["Read manhwa Bad Born Blood","Humanity’s home is no longer Earth. Intersellar travel is now a common occurence, and technology has replaced blood and flesh. Luka, who grew up in the slums, has turned fifteen and taken the selection exams. His aptitude is of the “Imperial Guard.”"]},{"title":"My Overly Sweet Boss","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa My Overly Sweet Boss / 내겐 너무 다정한 보스","The boyfriend who had been by my side for over 10 years left me without any warning or signs, announcing his engagement to my boss’s daughter. Just when everything in my life had dried up, he appeared… What I thought would be a week of vacation and a fleeting summer romance turned out to be much more… Because that man is now my new boss…?! “This is my first time meeting you, sir.” “Really? My instincts tell me that I know Secretary Hyun very well.” A thrilling adult romance between Seo Hyun-jin, the ‘ice queen’ secretary, and Cha Joo-wan, the ‘go-getter’ CEO."]},{"title":"Youth Lovesome","tags":["Romance"],"disc":["Read manhwa Youth Lovesome / Seasons of Lovesome","“It’s not blue, but it’s okay.” One year after the epilogue of the previous work, Youth Blossom, the story of youths begins again with Bo-mi’s college classmate, Purum, centered around the director’s newly opened ‘Café Blossom and Nemone Art Studio’. An all-inclusive story containing campus romance, school romance, and office romance. The Youth series has returned with another fun story!"," "]},{"title":"The Reincarnation of the Duke’s Daughter","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Reincarnation of the Duke’s Daughter / Reincarnated Princess / 환생 공녀님","**Hildegard of Akaraxia.** A genius sword mage, the first mage tower master, and the lady of the continent’s greatest duke’s house. She lacked for nothing, but for her family and her own ambition, she never rested. In the end, she gave her life to seal the Demon God and fell into slumber. … **”Wait, am I… not dead?”** Eighty years later, she wakes up in the body of a descendant. But… The golden fountain, the mage tower, the mines— All gone. A gloomy, run-down mansion. Stale bread and watered-down soup. Young descendants struggling to pay overdue debts. A bankrupt duchy? **”Just wait. I’ll restore the glory of the family I once built!”…"]},{"title":"High class","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa High class / 하이클래스","[By the author that brought you Lookism- Juvenile Law – Questism]","The boss of Chungcheong’s largest gang, “Jeolhwa,” is Wang Dok-pil, along with his son, Wang Dam. After his father’s passing, Wang Dam dreams of a new life rather than taking over the organization, so he impulsively heads to Seoul. But life proves tough, and his uncle, once part of the family, sets a condition: if Wang Dam can rank first at his new school, he’ll receive settlement money. However, his new school, infamously nicknamed “Bbang High,” is notorious for the sounds of daily fights. In this high school filled with the nation’s worst delinquents, can Wang Dam actually take first place?"]},{"title":"The Villainous Family Is Against Independence","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainous Family Is Against Independence / 악당 가족이 독립을 반대한다","I became an illegitimate child of a bloody villainous family with no family love. Elodie, who had a weak body and a nervous attitude, bullied the servants. ´Three years from now, my sister will be adopted. ´ The female lead, who was adopted as a political tool, will melt not only her father but also the whole family with her loveliness. Let’s get some money back and become independent from this family until the sister shows up! …I did. “Independent? What kind of bullsh*t is that?” “Who is the guy.” “Sister, are you sure you’re not going to run away from home?” Is my family against independence?"]},{"title":"Childhood Friend Complex (Eunhi)","tags":["Comedy","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Childhood Friend Complex (Eunhi) / Friends Complex / Sokkupchingu Complex / 소꿉친구 컴플렉스"]},{"title":"The Executioner","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Executioner / 사형집행관","In their days as heroes, they chose not to kill their enemies and instead imprisoned them. Now, as prison guards, they carry out executions with their own hands."]},{"title":"Trait Hoarder","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Trait Hoarder / 특성 쌓는 김전사","Kim Joonsoo, a free-to-play ranker in the mobile game, “Arcane Seoul,” possessed the tutorial character, Warrior Kim! He has to survive in a merciless world as a basic character. All he has to trust is his game knowledge as a ranker and Warrior Kim’s ability to swap out traits indefinitely!"]},{"title":"The Max Level Hero has Returned!","tags":["Action","Adventure","Fantasy","Isekai"],"disc":["Read manhwa The Max Level Hero has Returned! / The Max Level Hero Strikes Back / Max Level Hero is Making a Comeback! / The MAX leveled hero will return! / 만렙 영웅님 께서 귀환 하신다!","The weak prince of an insignificant country, Davey. After becoming comatose, his soul escaped to a temple where the souls of heroes gathered. He trained for a thousand years and has now returned as a max level hero! “Just you guys wait, I’m gonna face you all head on!” The refreshing story of Davey’s royal life and revenge has just begun."]},{"title":"Bullshit","tags":["Drama","Fantasy","Mature","Romance"],"disc":["Read manhwa Bullshit / 개짓","When CEO Jung Taeon mentioned he would stay for a month at Yeonghwadang, Sahee didn’t think much of it. He was merely a valued guest who would never get involved with someone as insignificant as her. However, the rude and endlessly arrogant man had a different perspective. “Yeon Sahee, why don’t we sleep together?” Sahee felt a mix of discomfort and unease, but his unpredictable demeanor continues to unsettle her…"," "]}]