[{"title":"The Broken Ring : This Marriage Will Fail Anyway","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Broken Ring : This Marriage Will Fail Anyway / This Marriage Is Bound To Fail, Anyway / 이 결혼은 어차피 망하게 되어있다 / This marriage is bound to sink","When six-year-old Inés laid eyes on the handsome heir to House Escalante, she promptly made the boy her fiancé. Since noble men are all the same, she figured she might as well choose a pretty one. But Lord Cárcel isn’t ready for this sort of commitment just yet, and he spends the next decade and a half avoiding the marriage at all costs! Luckily, that’s no trouble for Inés, as this marriage failing is exactly what she wants. In fact, he has her blessing to sow his wild oats as long as he stays out of her business. Unfortunately, being a playboy isn’t as fun when your fiancée gives you permission. And doesn’t this mean she’s cheating on him too? Now, Cárcel is determined to change Inés’ mind about him and prove he can be the husband she’s always wanted."]},{"title":"Get Out Of The Way, I’ll Decide The Ending Now!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Get Out Of The Way, I’ll Decide The Ending Now! / Step Aside, I Will Choose The Ending / 비켜요, 엔딩은 내가 정합니다"]},{"title":"Look-Alike Daughter","tags":["Thriller"],"disc":["Read manhwa Look-Alike Daughter / Like Mother, Like Daughter / Telle mère, telle fille / Wie die Mutter, so die Tochter / ลูกไม้หล่นไม่ไกลต้น / 如出一轍的女兒 / 如出一辙的女儿 / 瓜二つの娘 / 똑 닮은 딸","“I think my mother is a killer.” Gil So-Myeong, who has excellent grades, good manners, and an exemplary child, has lived as a perfect daughter according to the standards her mother demanded. However on the day that his younger brother rises from the river as a corpse, a terrifying suspicion rises in So-Myeong’s mind. A cruel mother-daughter thriller between a mother who tries to get rid of everything that interferes with her child’s life and a daughter who tries to escape from her!"]},{"title":"The Ash Salmon Quenches the Beast Monarch’s Desire","tags":["Drama","Fantasy","Mature","Romance"],"disc":["Read The Ash Salmon Quenches the Beast Monarch’s Desire / The Wolf’s Lair, the Gray Salmon / The Young Domestic Slave To The Tyrant / The Captive Lady Tames the Absolute Monarch / La Joven Esclava Doméstica Al Tirano / 囚われ令嬢は絶対君主を手なずけ てしまった"]},{"title":"The Duke and The Fox Princess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Duke and The Fox Princess / 대공가의 여우 황녀님","Nobility, dazzling appearance, and talent unparalleled. She had met all the conditions for the life of a princess. She could not be humbled as she walked the royal path. I’m being selfish? So what? She lived her life without caring about what others had thought of her. “Look at this white fur. It’s like a snowball. It’s fluffy.” Have you no shame?! You dare touch me?! No matter how much she yelled, her maids stood dazed. Princess Eristella, an archmage of unprecented abilities, was cursed and turned into a small fox. It wasn’t so bad for the princess to be showered with affection by her dukedom. The same people who used to grit their teeth. “Eristella”"," "]},{"title":"Getting Married Without My Badge","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Getting Married Without My Badge / 계급장 떼고 결혼합니다","“Damn it!”","She was not promoted because of her ex-boyfriend and superior.","Noah put up with it, but there was only one thing she could do, reaching the end of her patience.","“Let’s get rid of the insignia and fight!”","“It’s not fun. Let’s make the winner’s wish come true”","And the two of them…","~*~","“Are we going to share the sword as a wedding gift when we make our wedding vows?”","“If it’s okay to cut the lieutenant general with that sword, I will gladly do it.”","“You want a red dress? You are fierce, my bride…”","“Have you finally lost your mind?”","“By the way, my eyes are also red, did you wear it for me?”","“If only it could be stained with the blood of the lieutenant general.”","“Then, starting today, I will collect them one drop at a time.”","“Don’t suffer like that, I’d rather kill you at once.”","“Noah, you are so hot and fierce…! You should say that in bed!”","“Just die the first night.”","“Then bury me in a couple’s tomb. I’ll wait till you die. How about the sea?”","“I prefer the land.”","Noah shuddered as she pondered over and over what Leto had said. Why did she have a relationship with a guy like that?","“I’m not really crazy…”","No matter how much she thought about it, she couldn’t come up with a proper answer other than his face and body.","“…”","And Ami’s gaze at such a friend was only cold.","“You’re weird too.”"]},{"title":"How to Survive as a Maid in a Horror Game","tags":["Adaptation","Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How to Survive as a Maid in a Horror Game  / No Exit Horror / Bertahan Hidup Sebagai Pelayan Dalam Permainan Horor / 공포 게임 메이드로 살아남기"]},{"title":"Reborn as a Demonic Cultivator: Starting with a Zombie Planet","tags":["Action","Adventure","Fantasy"],"disc":["Read Reborn as a Demonic Cultivator: Starting with a Zombie Planet","Chu Xuan transmigrates to the Cangxuan world and becomes a demon cultivator of the Wuji Sect. Cultivating demonic arts involves siphoning the essence of heaven and earth and extracting the essence of all things. To become a supreme demon lord, one must slaughter countless beings. However, killing is intolerable to the human race’s celestial will, and the Wuji Sect is destroyed by the orthodox sects. In a moment of desperation, Chu Xuan accidentally acquires a blood mirror that can transport him to an apocalypse-ridden zombie planet. He is astonished to discover that this place is a paradise for demon cultivators."]},{"title":"The Baby Saint wants to avoid a bad future; you will give birth to me later","tags":["Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa The Baby Saint wants to avoid a bad future; you will give birth to me later / You Two Will Give Birth To Me In The Future, later you will give birth to me / 赤ちゃん聖女はバッド未来を回避 したい〜お二人は後日、私を生み ます〜 / 두 분은 훗날 저를 낳습니다","The protagonist, Ibuena, lost her parents at the age of six and became empress under the will of her father, who was a prince, but in reality she was used by her uncle and led a miserable life. As her country crumbles under her uncle’s schemes, she decides to travel back in time with the help of a book left to her by her mother, who was a witch. However, she travels back in time to a world shortly before she was born, and Ibuena herself has become a baby! After spending some time in the past, Ibuena realises that there were many unnatural aspects to her parents’ deaths, and decides to protect them in this life and change the future. As a baby in the world before her father and mother met, Ibuena’s challenges begin..!"]},{"title":"King of Gacha ~God’s Gamer~","tags":["Action","Adventure","Drama","Fantasy","Manga"],"disc":["Read manga King of Gacha ~God’s Gamer~ / ガチャ王〜神のゲーマー〜","Ryuuki has been betrayed by the people he trusted and has fallen to the lowest ranks of society. Hoping for his luck to turn for the better, he spends his days playing at the Randombox. His aim is the SSR-rank reward, the right to make an account for the game Labyrinth! Sadly, not only did he actually manage to pull his greatest wish, but that too got stolen from him. However, thats when Ryuuchis true luck started! As long as you can pull it, you will be able to use The System and defy all logic. Everything stolen from me But I will take it all back through Gacha!!"]},{"title":"Standard of Reincarnation","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Standard of Reincarnation / The Essence of Reincarnation / The Art of Reincarnation /  환생의 정석","The greatest martial family, Samion. Dayven, a member of the Samion family, is a one-armed martial soldier without a right arm. Despite the ridicule and contempt he got for only having a left arm, he surpassed the direct line of the Samion family like a genius. However, he got betrayed by his family and parents in the end, thus meeting a poor end. But, he was reincarnated. “I have a right arm?” He had a new family tradition. A naturally gifted body. Experience from his past life. And the god Yulion with him as well. After his reincarnation, everything changed, and a new adventure started."]},{"title":"Shadow’s Resurgence","tags":["Action","Adventure","Fantasy"],"disc":["Shadow’s Resurgence, The Betrayal of Shadow, 家族影子的背叛\nSal Cooper, the most loyal and efficient shadow of the family, was sent out as a sacrificial pawn by the newly appointed head of the Cooper family during the major distribution meetings after representing the family in victorious battles.\nHe became the object of abuse by the former subordinates who once served under him.\nAfter exerting all his efforts to kill those who had humiliated him and attempting to take Alan down with him, he discovered that as a child,\nhe was chosen by the family to be the “shadow” and was enchanted with magic, unable to harm Alan and instead bearing all the injuries Alan suffered,\nthereby enhancing Alan’s own abilities. Learning from Alan that his entire life as a shadow was orchestrated, Sal reversed the magic’s effects and,\nthrough his own death, reclaimed everything Alan had taken from him, including talents and abilities.\nAlthough Alan survived, he lost his vitality and the ability to intimidate other families, leading to the downfall of the Cooper family.\nHowever, Sal Cooper was reborn at the age of three, before the magic of “nourishment” was cast upon him."]},{"title":"I Build an Industrial Empire on the Magic Continent","tags":["Action","Adventure","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua I Build an Industrial Empire on the Magic Continent"]},{"title":"Serpent Ancestor","tags":["Action","Adventure","Fantasy"],"disc":["Serpent Ancestor Manhua , 老蛇修仙传\nSnake Immortal: Devouring the Immortal Emperor at the Beginning,\nThe Tale of the Old Snake’s Cultivation to Immortality,\nThe Legend of the Old Snake’s Immortal Cultivation","An old snake accidentally ate an elixir in a village, gaining intelligence and embarking on the path of cultivation. The life of a snake, though only for a brief decade, is lived without the fear of time, seizing every moment. This is the story of an old snake who became an immortal."]},{"title":"I Awoke as a God After Auto Battling For a Million Years","tags":["Action","Adventure","Fantasy"],"disc":["Read I Awoke as a God After Auto Battling For a Million Years  / 网游：挂机百万年，我醒来成神 / After Millions of Years, I Woke Up to Be a God!","An alternate world has arrived. Countless monsters have passed through the rifts, wreaking havoc upon human cities and plunging humanity into a doomsday crisis! Since then, a new era emerges where every human must embrace their destiny as Class Shifters. Kingdoms are proud to cultivate elite experts, striving for top ranks in conquering the otherworldly realms! When the first king of the Dragon Kingdom awakened from a million-year slumber, armed with boundless resources amassed during his prolonged idle state, the bosses from other worlds tremble. Even the world’s the top-tier Class Shifters can do nothing but kneel in reverence…"," "," "]},{"title":"Eternally Regressing Knight","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Eternally Regressing Knight","You’re a genius.” Those words he heard as a child were poison.\nEncrid dreamed of becoming a knight, but he soon realized it was futile. “You want to live by the sword with that level of skill?” Some laughed at him.\n“Just give up.” Some advised him against it. Despite that, his dream remained steadfast. He slept less, ran more, and trained harder.\nOne day, he died, having been stabbed in the neck. Encrid opened his eyes again to “today’s” morning."]},{"title":"Today to Tomorrow","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Today to Tomorrow / If Today is Tomorrow / 오늘이 내일에게","",""]},{"title":"Chronicles of the Demon Faction","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Chronicles of the Demon Faction","Chun Hajin, the strongest assassin of the Orthodox Murim’s Righteous Heavenly Alliance. Hajin loses his life as he tries to escape to find freedom.","And then…","‘The divine cult is immortal, may all demons submit. Congratulations on your recovery, third young master!’","He was reincarnated into the body of the Murim’s public enemy, the third young master of the Demonic Cult?!","The conquest of the Demonic Murim by Chun Hajin, the strongest secret weapon of the Orthodox Murim, begins now."]},{"title":"Cheating Men Must Die","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance","Sci-fi"],"disc":["Read manhua Cheating Men Must Die\nOne moment oppressing scum yields a moment of satisfaction. Continuously oppressing scum yields continuous satisfaction. Our female main lead, Su Lüxia is bound to the Female Lead Counterattack System and transmigrates to several small worlds. Using elaborate means, she beats up countless cheating bastards and bitches. Su Lüxia: “Only a cheating bastard’s tears of remorse, and the pained moans of a bitch unable to get what she wants bring me solace.” System: “Has my host tapped into her humanity today? Nope.”"]},{"title":"The lazy prince becomes a genius","tags":["Action","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa The Lazy Prince Becomes A Genius / Reformation of the Deadbeat Noble / 怠惰公子、努力の天才になる / Pangeran Malas Menjadi Jenius / 나태 공자, 노력 천재 되다 / The Lazy Lord Masters the Sword / 懶惰公子成長記 / От нерадивого аристократа до усердного гения"]}]