[{"title":"Reincarnated as a Genius Prodigy of a Prestigious Family","tags":["Action","Adventure","Fantasy"],"disc":["Read Reincarnated as a Genius Prodigy of a Prestigious Family","His talent was forged on the battlefield, but before he could fully develop it, he died.","However, when he opened his eyes again, he realized he had been reborn as Dane Sogres, the youngest son of a prestigious count.","The talent he now possessed… was not limited to just one field?!","A talent in spearmanship, assassination, magic, summoning, and even swordsmanship—which he had not been able to develop fully before!","He can finally nurture his endless talent in the embrace of the happy family he had always longed for.","“Spearmanship! Dane must absolutely learn spearmanship!”","“Are you saying that because you really don’t know how useful learning stealth and assassination skills could be?”","“Magic is the future, Father, Mother!”","“For my younger brother… summoning would also be really nice…”","…Mm, this is a happy family, right?"," "]},{"title":"Dark Fantasy Paladin","tags":["Action","Adventure"],"disc":["Read manhwa Dark Fantasy Paladin / 다크 판타지 속 성기사","Two years have passed since Eden was trapped in a dark fantasy game set in a medieval world with a reputation for extreme difficulty. He has struggled as a paladin and succeeded in destroying 49 demons, now finally able to proceed with the main story of the game. However, the more he plays, the more irregularities occur and the story and relationships with the NPCs change. Will he be able to prevent the destruction in the game and survive despite the numerous irregularities?"," "]},{"title":"Visible Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Visible Love / 보이는 사랑","Kim Soo-young, who was job hunting, takes on a housekeeping job to cover for her injured aunt, despite having a landlord who’s super sensitive to noise. However, trouble keeps brewing between Soo-young, who says exactly what’s on her mind, and the prickly landlord. But then… an unexpected romance starts to blossom between them, and they uncover each other’s secrets…"]},{"title":"Omniscient Reader’s Viewpoint","tags":["Action","Adventure","Fantasy","Webtoons"],"disc":["Read manhwa Omniscient Reader’s Viewpoint / ORV; 全知读者; 전독시; 전지적 독자 시점","‘This is a development that I know of.’ The moment he thought that, the world had been destroyed, and a new universe had unfolded. The new life of an ordinary reader begins within the world of the novel, a novel that he alone had finished."]},{"title":"There’s a Witch in the Emperor’s Bedroom","tags":["Adaptation","Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa There’s a Witch in the Emperor’s Bedroom / 復讐のためサイコ大公様と結婚します","Isabella, an orphan, is adopted by a noble family, only to endure unjust violence from her new family every day. When she reaches her limit, she seizes an opportunity to escape the mansion. However, as she flees, she is harassed by vagrants and finds herself in mortal danger. Just as she instinctively braces for death, the witch’s power within her awakens. Though she manages to escape the peril, she is caught in the act by her sister’s fiancé, the Grand Duke Genos. Expecting to be taken back to the mansion, Isabella braces herself, but instead, Genos proposes a contract marriage, saying, “Lend me your witch’s power, and in return, I’ll help you with your revenge.” A dramatic comeback from the brink! The cruel revenge of two people united for vengeance begins here…!"]},{"title":"I Taught You with Restraint, So Why Are You Obsessed?","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa I Taught You with Restraint, So Why Are You Obsessed?","Let’s Reform the Hopeless Male Lead Before the Heroine Returns! I, who was the ‘villainess’ in the original story. After being infuriated by the frustrating ending, I was hit by a reincarnation truck and possessed the ex-wife of the regretful male lead, ‘Ian Cloud.’ But this guy is even more stubborn and terrifying than I expected. ‘What is it?’ ‘Not needed.’ ‘Forget about it.’ … Aren’t we just going to repeat the frustrating mess of the original? So I made a resolution. I will reform this hopeless regretful man before the heroine returns! But… ‘Did you plan to leave me all along?’ ‘…What?’ ‘Did my wife not tell you? In a true relationship, each person becomes the one and only for the other.’ He gently kissed the palm of my hand. His languid indigo eyes were fixed on me. ‘I am solely yours.’ ‘…..’ ‘So, you must also become solely mine.’ Seeing his glittering gaze, I thought. This seems to be very wrong. No, more importantly, I never taught him to be obsessive!”"]},{"title":"Apocalypse Sword God","tags":["Action","Adventure","Fantasy","Manhua","Reincarnation","Sci-fi"],"disc":["Read manhua Apocalypse Sword God / 末日剑神：我震惊全球！"]},{"title":"Regressed life of the Sword Clan’s Ignoble Reincarnator","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read manhwa Regressed life of the Sword Clan’s Ignoble Reincarnator / Regressing As The Reincarnated Bastard Of The Sword Clan / How to Survive as the Bastard of the Regression Sword Clan / 회귀검가의 서자가 사는 법","Theo, the young master of the powerful Ragnar family, worked tirelessly but lacked the talent to break the chains of his bloodline,\nultimately being pushed out of the competition for the throne.","However, even as a powerless young master, his brothers sought to eliminate him, and he was betrayed by his own mentor.\nIn the end, Theo lost everything and faced his death.","In his final moments, filled with regret over all his life choices, the unbelievable happened: he experienced a ‘rebirth.\n“This life will be different.” The reborn young master takes up his sword and enters the competition for the throne."]},{"title":"Level 1 Player","tags":["Action","Adventure","Fantasy","Manhwa","Shounen"],"disc":["Read manhwa Level 1 Player / Forever Level One, Player Level 1 / 1레벨 플레이어","[The anomaly of the hunter world—a Level 1 capable of destroying rankers is here!] ‘You have Awakened.’ A miracle that he’d been longing for had finally come about, and things finally looked like they were on the up, but… ‘Wait. Why can’t I level up? …On top of trash stats, I have no skills!` It was while HyunSung was despairing over his bad luck that he noticed a weird unique skill in his status window: – Sell and Purchase. Will HyunSung be able to reign supreme as an Awakener with his unique skill?"," "]},{"title":"Slow Melting","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Slow Melting / Melting Slow / Slow Fusion /  멜팅 슬로우","My boyfriend is getting married. To my own sister, no less. I could handle the breakup. Betrayal was nothing new. But accepting the fact that once again my sister stole what was mine proved to be unbearable. In the midst of this heart-wrenching time, I encountered Yunhwan…"]},{"title":"Finally, the Dawn Came","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Finally, the Dawn Came / 마침내 새벽이","After eight years, Duke Ert returned to his homeland as a hero. He returned with glory and honor, but all he really wanted was revenge. Revenge for the wife no one remembers. “Liese,” who gave her life to protect him to the end. “Will you help me?” And for revenge he needed a woman. A woman to prove his status as an “adult” of age so he could trample on the pride of those conceited nobles. In that sense, this woman was a good fit. “Be my woman.” She was a refugee who had lost her home and was working alone to raise her daughter. The only thing about her that resembled his wife was her name, “Liese” But the more time he spent with her, the more the young duke began to realize something. Her resemblance didn’t end with just her name. It was then that he thought of a possibility, one he had been denying all this time. She might actually be his wife."]},{"title":"Unrequited Love Doesn’t End With Marriage","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Unrequited Love Doesn’t End With Marriage / Unrequited Love Does Not End in Marriage / 짝사랑은 결혼으로 끝나지 않는다"]},{"title":"Oppa, That Must Be A Mistake!","tags":["Manhwa","Romance"],"disc":["Read manhwa Oppa, That Must Be A Mistake! / Oppa That Must Be Wrong / 오빠 그건 오해야","On the day she was about to confess to her friend of 10 years, she stole his brother’s underwear. “This is all good. It doesn’t matter how many times you’ve been to my house while I’m away. But wouldn’t the story be different if it were my underwear in that hand?” “What underwear……” I reflexively grabbed his hand and felt the piece of cloth layered on the gift on my fingertips. “The underwear I was wearing too.” “!” “Have you still not made up your mind?” Damn it. “You liked me. It’s been about 10 years, right?” I couldn’t tell the truth in front of him who was so confident. Oppa, that’s a mistake. The one I like is your brother!"]},{"title":"Eleceed","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa Eleceed / 일렉시드","Kaiden – A mysterious ability user who hides inside the body of a street cat. He is later picked up by Jiwoo after being injured after a fight with another ability user. He has a stubborn and bossy personality. Jiwoo – an energetic and talkative high school boy who loves cats. He is very kind and also seem to have a special ability."]},{"title":"Darling, Why Do You Regret It?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Darling, Why Do You Regret It?","I secretly met my husband’s mistress. Delicate, lovely, and sweet, her name was Saira. “I’ll never leave the Duke!” “Now, *that’s* the spirit.” “W-what?” I had reincarnated as Tareia—a noblewoman with a wealthy family, beauty, and nothing to feel inferior about in life. But there was just one obstacle in my perfect plan: “Keep seducing my husband.” I was ready to toss him aside and live a fabulous single life. …Or so I thought. “I’m starting to find you fascinating.” “Can I call you… *Lea*?” “My lady, please, anything but divorce.” Why are these men suddenly acting like this?!"]},{"title":"The Most Handsome Man Becomes a Skeleton","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Most Handsome Man Becomes a Skeleton / 절세미남 망나니 해골 되다","In a world where even monsters can’t resist his charm, Louis, the most handsome man alive, faces an unexpected twist of fate. One day, a deadly plague sweeps through his village, claiming Louis as one of its victims. However, upon his death, he exclaims, “Where did my sculpted face go? What’s with this skeleton head?!” Now, as the strongest and most handsome man in the world—stripped of both beauty and ugliness—Louis embarks on a journey filled with trials and tribulations as a skeleton. Will Louis be able to reclaim his human form and return to his life as the world’s most handsome man?"," "]},{"title":"Odalisque","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance"],"disc":["Read manhwa Odalisque / 오달리스크"]},{"title":"Life of a Magic Academy Mage","tags":["Action","Adventure","Comedy","Fantasy","Manhwa"],"disc":["Read manhwa Life of a Magic Academy Mage / How to Live as a Magic School Wizard / Becoming a Magic School Mage / Magic Academy Survival Guide / Surviving as a Mage in a Magic Academy / Guide de survie à l’école de magie / 厌学魔法师想毕业 / 魔法学校で魔法使いとして生きる方法 / 魔法學校 魔法師로 살아가는 法 / 마법학교 마법사로 살아가는 법","[From the author and studio of !] Life as a magic academy mage. Graduate student Lee Han was born as the youngest son in another world’s famous family of mages. He swore he would never go to another place with the word “academy” in it. However, the magic academy known as Einrogard completely ignored what he had promised himself. Being self-sufficient is a must; monsters may appear, and the professors are all total nutjobs! This is the beginning of a pitiful academy life that you have never seen before. “Will I be able to… graduate safely?” Magic Academy Survival Guide"]},{"title":"Leveling With The Gods","tags":["Action","Adventure","Fantasy","Manhwa","One shot","Shounen","Supernatural","Webtoons"],"disc":["Read manhwa Leveling With The Gods / 신과 함께 레벨업","Gods from another world, the Outer Gods.\n《Despair that Reaches the Skies》, 《Gloom Trapped in a Swamp》, 《One Who Couldn’t Be Born》, 《Foolish Calamity》.\nNormal people lost their lives simply by looking at them. Such beings were tearing the world apart… After years of fighting, the final survivors came to a conclusion.\n“An Inner cannot beat an Outer.”\nIn that moment, Chronos, a divine being that could manipulate time, sacrificed himself and turned back the Clock Movement.\n“There is no way to win. For now.”\n“Return to an old world line. And start over.”\nThe person chosen by all the gods to return to the past, the last human to climb the Tower, yet the one who managed to fight with the gods to the end—Kim YuWon.\n“An Inner can’t beat an Outer. Even if that’s the case…”\n“I will still win in the end.”\nCan he regather his comrades that fought with him until the end, and lead the fight against the Outer Gods to victory?"]},{"title":"Turning the Mad Dog into a Genteel Lord","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Turning the Mad Dog into a Genteel Lord / Turning a Crazy Dog Into a Young Master / 狂犬な彼を貴公子に変えてみせます! / 미친개 도련님 만들기","Diarin, a priestess without any noteworthy family background or connections, always gets the toughest assignments. So when her boss tells her to help Ceres, a war hero, reintegrate into society, she decides to stop being a pushover and get as much as she can out of it, including a juicy promotion. But upon reaching Ceres’ manor, she’s greeted by a growling hound instead of a human. Tasked with the impossible job of turning the mad dog into a proper gentleman, she dedicates herself to caring for him. But his unexpected obsession with her was never part of her plan."]}]