[{"title":"Can I Bite You?","tags":["Drama","Fantasy","Romance","Shoujo","Vampire"],"disc":["Read manhwa Can I Bite You? / 물어보는 사이 / While Asking / Between Asking","Being bitten by a vampire makes you healthy!? Lee Chae-I, who unintentionally became an unfavorable celebrity because of a headache. She found out by chance that the top star Seo Lee Jun is a vampire and if bitten by him, she will become healthy for a while. To Chae-I who asks him, Lee Jun proposes a contract relationship!"]},{"title":"An Extra In The Family Is The First To Be Abandoned","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga An Extra In The Family Is The First To Be Abandoned / Stella: The Lost Star / Side characters are discarded first / The extra are the first to be abandoned / 엑스트라는 가장 먼저 버려진다\nI am the youngest princess, abandoned in the Imperial Palace at the age of ten.\nThe royal family, no longer in power, was caught in the flames of rebellion, and I was the first to be abandoned. So I have to live like Ethel, a commoner. Not Stella, a princess.\nAfter 10 years, until I returned to the royal palace where I was abandoned, because they wanted to see me\n“I need a replacement”\nThat’s what my sister, the first princess, told me.\n“Replace for my missing sister”\n“That’s a tempting offer, but I don’t want it, princess.”\n“Isn’t that a great offer?”\nThe threat is so clear, I will take my family hostage. So I went back to the palace to play the role of “myself substitute”. Humiliating people who don’t recognize me\nI will not forgive them. They tried to win the heart of the princess who awakened her powers, but in the end, I abandoned them.\n“In the end, I’ll be happy”\n“The splendid return of the abandoned princess.”\nExtras Are The First To Be Abandoned"]},{"title":"The End of the World","tags":["Adaptation","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The End of the World / Jusqu’au bout du monde / 세상의 끝 / 世界的盡頭"]},{"title":"The Survival Game Of The Villainess","tags":["Adventure","Drama","Fantasy","Manhua","Romance"],"disc":["Read manga The Survival Game Of The Villainess / 恶役千金的求生游戏 / The Survival Game Of The Evil Lady","Yu Luna, a modern company slave who is suspected of sudden death due to overwork, was lucky enough to get a chance to return to reality, but the premise is that she needs to successfully capture all the male leads in a Western fantasy-themed Otome Game. If you have the aura of the female protagonist, even if you haven’t played Otome Games much, it should be fine, right? But I was transmigrated as the useless rich noble lady who often bullies the female protagonist in the game!"," "]},{"title":"I Picked a Mobile From Another World","tags":["Action","Adventure","Fantasy","Manhwa","Shounen"],"disc":["Read manhwa I Picked a Mobile From Another World","In the midst of the devastation, only the soldiers’ bones remained.\nIt’s only a matter of time before the entire world is annihilated. To avoid this, Kyung-Hoon began searching for clues in another universe with the help of a ten-year-old phone he discovered in an abandoned building."]},{"title":"As Soon as I Became a Quasi-Sage, I Was Summoned by the Empress","tags":["Action","Drama","Fantasy","Harem","Historical","Manhua"],"disc":["Read manga As Soon as I Became a Quasi-Sage, I Was Summoned by the Empress / 刚苟成准圣，我被女帝召唤了 / 準賢者になった途端、女帝に召喚された","In the empress’ palace, the assassin fell to the ground. Lin Ke led a group of beautiful guards guarding the Empress’s bed. Looking at the empress on the bed, he said domineeringly: From now on, I will be the man behind the empress!"," "]},{"title":"The Lithromantic Duke","tags":["Drama","Fantasy","Romance"],"disc":["Read manhua The Lithromantic Duke, Dān Liàn Zhèng De Gōngjué Dàrén, Dan Lian Zheng De Gongjue Daren, The Unrequited Duke, 单恋症的公爵大人\nA new man has taken charge of the illustrious Duchy of Bolton. And here’s the bad luck – for unknown reasons, this notorious ruler suddenly became very interested in an ordinary maid! He simply dotes on her and is ready to sacrifice everything to fulfill her every whim! The new Duke is just having fun, or… Has his body been taken over by someone else?"]},{"title":"Empress of Hell’s Mission Guide","tags":["Action","Adventure","Drama","Fantasy","Historical","Josei"],"disc":["Read Empress of Hell’s Mission Guide / Nǚ Yánluó De Rènwù Zhǐnán / 女阎罗的任务指南","Qin NianNian, the SSSSS-level Queen of Mercenaries, became the ruler of the underworld after her death— The Empress of Hell! She is highly intelligent, callous, and cruel in her methods. With her adorable pet, TangYuan, she transmigrates into thousands upon thousands of worlds and switches on her ‘punishing scums’ mode!"]},{"title":"I Never Abandoned the Tyrant","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Never Abandoned the Tyrant / 저는 폭군님을 버린 적 없는데요","I was reincarnated as ‘Lari’, an evil maid who was destined to die at the hands of the male protagonist ‘Thierry’. To avoid death, I took care of Thierry with all my heart and thought I had turned him into a sweet person. One day, without knowing why, I died.","“The princess has woken up!”","When I opened my eyes, it was 7 years later… And I’m a princess?","“If you want to avoid war, send me the princess.”","Thierry, who grew up like a tyrant, broke in and said he would take me to his country. Why was I reincarnated as a princess? How did Thierry, who was so good, become a tyrant?!"]},{"title":"I Have No Health","tags":["Drama","Fantasy","Reincarnation","Romance","Shoujo"],"disc":["Read I Have No Health / I Am Not Healthy / 건강이 없습니다","I’ve gone into the body of ‘Ninaina’, the weakest character, who was fated to die once winter came!\nWith such with weak stamina that it’s hard to even take walks, eat, or just stand, let alone exercise, I have such a tragic life that I even have to endure assassination attempts from my grandfather…\n“I will definitely recover my health!”\n“Kaiser” who comes to Ninaina’s side with a cold gaze. Receiving the order that he has to keep Ninaina alive, he comes to her side and protects her.\n“You will not die. For now.”"]},{"title":"The Chaser of Dawn","tags":["Comedy","Drama","Fantasy","Harem","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Unknown Chaser / The Unknown Chaser / Finding Twilight / Tracker of Dawn / 잠시만 기다려주세요 on manhwaclan\nI accidentally spent the night with three men.\nOne of them was a childhood friend that I hadn’t seen in ages.\nOne was a feisty elf who I haven’t talked to for a long time.\nOne of them was a fellow researcher?\nTo make such a terrible mistake!\nKriserua failed an important quest on that day.\nI tried to erase their memories and focus on handling requests…\n“Have a child? You?”\nEventually, they found out that I was pregnant.\nWhat am I supposed to do with this nonsense?\nMore than that, I have to deal with failure first!\n“If you don’t mind, I’ll live thinking it’s my child.”\n“No one is more suitable than me as the father of the child.”\n“That day is my responsibility, so I will be responsible.”\nIn the end, they started chasing after me, who’s on a journey to rectify the mess.\n‘No! I don’t need you guys!’\nA delightful and exhausting adventure story of Kriserua, a tactless yet straight-laced person, and the unrequited love of three men who can’t communicate with each other!\nThe Chaser of Dawn"]},{"title":"Everybody Loves the Villainess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Everybody Loves the Villainess","High priest Sia awaits her peaceful death after leading a life devoted to helping other people. Instead of finding herself next to Lord Pleon the God, she finds herself in the body of Elena, a woman known to be wicked. While adjusting to her new body and new life as a universally hated figure, Sia continues to encounter men she had acquainted during her day as a high priest. What’s even more surprising is that those men seem to get increasingly obsessed with her. “I am no longer the high priest on whom everyone depended, so why are these men still getting obsessed with me?!”"]},{"title":"Utori: The Legacy","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa Utori: The Legacy / Utuli: THE LEGACY / Uturi: THE LEGACY / Wooturi: THE LEGACY / 우투리: THE LEGACY","Gyerim has been living by hiding skills that he has that others do not have. While hiding his identity, he has been teaching bullies a lesson. But then, one day someone by the name of “Juk” came to kill him. And this opponent despite dying again and again would keep reappearing thanks to his own skills. And just as Gyerim was about to experience death by Juk’s hands, an invisible man, Daesan, suddenly appears and saves him. Daesan tells Gyerim he is an uturi just like him…"]},{"title":"The Nameless Flower","tags":["Drama","Fantasy","Manhwa","Romance","Yaoi","Yaoi(BL)"],"disc":["Read manhwa The Nameless Flower / Alternative No Name Flower / 이름 없는 꽃","The little master son of an earl, Luan, while wandering in the forest, met a boy his age. He fell in love with a sweet and kind boy, although he does not know his name. Gradually he began to neglect his training as a successor."]},{"title":"Her Jealousy","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Her Jealousy / 걔의 질투","The story of a high school girl, Gong Hyeon-ha, who becomes the target of bullying at the beginning of the semester. To her dismay, Ji Hye-jin, a girl admired by everyone, reaches out to her. When Ji Hye-jin extends her hand, the bullies stop, and Gong Hyeon-ha develops deep feelings of gratitude towards her savior. However, one day Gong Hyeon-ha discovers that Ji Hye-jin has a tall and handsome childhood friend, Yu Gwon-young. This revelation triggers intense jealousy in Gong Hyeon-ha, leading her to become captivated by their peculiar relationship. </p>"]},{"title":"Fall for You","tags":["Drama","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Fall for You / Meet in Autumn / 秋、君と出会った季節 / 가을, 만나다","Hankook University’s Seo Jihyeok is the most popular professor on campus with female students. Because of this, he’s had trouble finding a T.A. who can get the job done and not fall in love with him. The dean of his department thus decides to bring in Yoon Heemin as his new T.A. Perfect at her job, she also immediately tells Jihyeok that she has zero interest in him. Although happy to have a competent aide, things take a turn when Jihyeok realizes he might be the one falling in love this time."]},{"title":"How to survive sleeping with the emperor","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga How to survive sleeping with the emperor / 황제와의 잠자리에서 살아남는 법\n‘It’s been several months since I became the Empire’s Queen, and I’ve been avoiding sleeping with the Emperor.’\nA mighty empire led by the bloodline heirs of the Golden Dragon, ‘Dhart.’\nAnd the emperor ‘Carmond’, the ruler of the empire.\nLobelia, the princess of the Negrad family, who married him and became the Empress.\nNow that she had become the Empress of the Empire, it was only natural to prepare to carry the line of a powerful royal family. To do this, she has to go to bed with the emperor… but she finds herself in a situation where she has no choice but to refuse to sleep with Carmond for her ‘true purposes’…!\nWill he be able to survive sleeping with the emperor and achieve his goal safely?"]},{"title":"Princess’ Dangerous Brothers","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga Princess’ Dangerous Brothers / 공녀님의 위험한 오빠들 on manhwaclan\nLestia, who grew up in the slums with her drunken uncle and managed to make ends meet by selling flowers. One night when her uncle, who was threatened by the thugs because of his debt, tried to sell her off.\n“Hey, get your hands off her.”\nA group of beautiful boys appeared out of nowhere. They defeat the thugs at once and say incredible things to Lestia.\n“It’s nice to finally meet you, my sister.”\nSurprisingly, she was the daughter of the Duke of Verchester, a family that has produced wizards for generations. But it’s hard to believe those words without any proof.\n“Come on, Lestia. Let’s go home.”\nBut did she want to hold on to any hope? She grabbed the boys’ hands, a little impulsively."]},{"title":"Father, I Don’t Want to Get Married!","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Yuri"],"disc":["Read manhwa Father, I Don’T Want To Get Married! / Father, I don’t Want this Marriage/ Papa Regis Menolak Tua / 아빠, 나 이 결혼 안할래요!","I’m Jubelian? The daughter of the duke and the villainess of this novel?\nI managed to avoid my death with some previous knowledge about my life, as this was my second time at it. Now, I should be able to live a peaceful life!\n“I’m not going to marry a man unless he has everything. I want the most wealthy, famous, and competent man there is.”\nI dreamt of a glamorous life as the daughter of the duke, but my father tells me the Crown Prince who is known to be a lunatic is to be my husband! As an extraordinary measure, I couldn’t help but start a contract relationship. That is, with a handsome side character that looks better than the main one.\n“Why are you trying to avoid being engaged to the prince?”\n“He’s scary. I heard that he even kills his own entourage if he doesn’t like them.”\nA few days later, the prince sent a terrible letter to me.\n“I will not kill you.”\nOh no, did I set up another death trap for myself?"]},{"title":"Evangeline","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Evangeline / Evangeline After the Ending / Evangeline After the Completion / 완결 후 에반젤린","When I opened my eyes, I found myself becoming a supporting actor in a novel I had written.\nEvangeline, who was executed for harassing the heroine.","While running and running alone to avoid the initial end,","“When I created the world, I copied the author’s novel.\nInstead, if there’s anything you want, I’ll give it to you.”","God bless you for inviting me here\nBeauty, ability, financial strength, and background are all completely forgotten.\nNow all I have to do is wait for a happy ending.","“Because she will be my companion.”","I tried to get along with the sculptural-looking duke’s eldest son, aka Kaidel boy,","“Evangeline will be my daughter and we will live together forever.”","It wasn’t easy because the duke prevented her from accepting her as a family treasure.\nare not! My conclusion should be “I lived happily ever after”!"]}]