[{"title":"Break up Pawn Shop","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Break up Pawn Shop / 실연 전당포","Losing the item means losing the love! A man finds out that his girlfriend has been cheating on him. In shock, he enters a mysterious pawn shop in the alley… “Are you sure you want to forget everything?”"]},{"title":"Quick Transmigration: Top-Notch Villain Must Be Cleansed","tags":["Historical","Webtoons"],"disc":["Read manhua Quick Transmigration: Top-Notch Villain Must Be Cleansed , Kuài Chuān Zhī Dǐngjí Fǎnpài Yào Xǐ Bái , Quick Transmigration: Top-Notch Villain Must Whitewash , Quick Transmigration: Top-Notch Villain Must Be Cleansed , Rapid Transmigration: First-Rate Villain Wants to Whitewash , 快穿之顶级反派要洗白","Quick Transmigration: Top-Notch Villain Must Be Cleansed summary is updating. Come visit MangaNato.com sometime to read the latest chapter of Quick Transmigration: Top-Notch Villain Must Be Cleansed. If you have any question about this manga, Please don’t hesitate to contact us or translate team. Hope you enjoy it."]},{"title":"The Son Of The First Emperor Kills Enemies And Becomes A God","tags":["Action","Adventure","Fantasy"],"disc":["Read  The Son Of The First Emperor Kills Enemies And Becomes A God, 大秦：始皇之子杀敌升级成神, Daqin: The First Emperor’s Son Killed Enemies to Upgrade to be God","Zhao Qi gets reborn to the warring period. At the time when the Qin emperor,\nYing Zheng, started sweeping the 6 nations, and rule the world. Enlisting in the army Without hesitation,\nI didn’t expect once I start killing enemies I would level up the system! Slowly but surely,\nZhao Qi became the commander for Da Qin’s army, when he saw emperor Qin he was immediately startled,\nhe is actually the son of the emperor, Da Qin’s prince!"]},{"title":"Top Star’s Talent Library","tags":["Adventure","Comedy","Drama","Fantasy"],"disc":["Read manhwa Top Star’s Talent Library / Top Stars Talent Library / 탑스타의 재능 서고","The talentless idol trainee Sang-Jun. The day he spoke about transferring entertainment companies with his director, Sang-Jun recieved the book, and unlocks access to the talent library. , are one of many talent books he borrowed from the library to gain talent.","Great, with this talent I’m going to become a top star!"," "]},{"title":"I Have Become The Hero’s Rival","tags":["Adventure","Comedy","Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa I Have Become The Hero’s Rival / Your Ultimate Love Rival / I become the rival of main characters / Became a Match For Namjoo / I Have Become the Heroes’ Rival /남주의 연적이 되어 버렸다","“I’m gonna live with Irene for the rest of my life.”","“….. What?”","“I said, I won’t get married and I’ll spend the rest of my life with Irene!”","I wish I heard it wrong. Regrettably, I couldn’t stop Claudia.","“As long as I have Irene, I don’t need anything else.”","The three men looked at each other, then glared at me with angry eyes.","The insane obsession of The Crown Prince’s possessiveness, the smiling Duke yet something malice hid underneath him, and the cold eyes of The Knight that sent chill to my bones. It’s as if they regarded me as their rival.","“Shit. What kind of situation is this?”"]},{"title":"The Duke’s Teddy Bear","tags":["Fantasy","Magic","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Duke’s Teddy Bear / 공작님의 곰인형 on manhwaclan\nShe is an illegitimate child of a count and is always careful not to tarnish her family’s name. Since childhood, she has a secret that no one knows, and that is everytime she goes to sleep, her soul leaves her body and wanders around ─ she can control and enjoy this ability of hers. One night at the ball, she got involved into an unpleasant situation with the Duke, and as she wanders around that night, she was accidentally sucked into a teddy bear which the Duke owned…"]},{"title":"Elizabeth","tags":["Comedy","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Elizabeth / 엘리자베스","Elizabeth, the most beautiful young lady in the village who has never lost her dignity, lives in fear every day selling strawberries in the Forbidden Forest, until the Duke, who is in desperate need of a wife, appears in front of her. “I’m called the Duke of Carluke here. My name is Matthias. I do not have a surname.” “Why are you taking off your clothes?” I’m sure he’s a great man, but a strange duke from somewhere. And on the first day we met, he refused to ask me out, and on the contrary, he offered me to work as a handmaiden. “I need a handmaiden in my uncle’s mansion. Elizabeth.” The old lord’s mansion. There was no handmaiden in that mansion. So there can only be one reason for making me a handmaiden of the mansion! Night service! “I don’t want to! Never!” The misunderstood romance fantasy of the innocent straightforward guy, the Duke, and the complicated young lady in the suburbs!"]},{"title":"Complicated Cohabitation","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Complicated Cohabitation / Impure Cohabitation / 不纯的同居同乐 / 불순한 동거동락","A businesswoman who is in her thirties, Yugyeong Seo. She’s in a relationship that seems to be sinking every second. One day, her younger brother’s friend, Ijun Gwon, abruptly comes into her life physically and mentally, starting an odd cohabitation. Ijun Gwon, although he is the perfect house husband material, good at all kinds of house chores, he seems to dislike treating Yugyeong as a senior. Why does he care for her so much? Why does he not like to treat her as Nuna? Well, maybe this cohabitation is rather impure."]},{"title":"The King Is In Love","tags":["Drama","Fantasy","Historical","Shounen Ai"],"disc":["Read The King Is In Love / 孤王在下\nSurgeon doctor Su Kai Ji accidentally transmigrated into the past, the first thing he saw was himself dressed in wedding clothes and being sent to the palace to be a consort? On the wedding night, the emperor faces the beauty in front of him. And when he went on to touch the flat chest underneath the clothes, he felt his anger rise. Emperor: I actually married a man?! Su Kai Ji: Marry? I would never be the one at the bottom."]},{"title":"May God Bless Your Demise","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa May God Bless Your Demise /  당신의 파멸에 신의 축복을","Will you still love me once you know my secret? Angie enjoys an idyllic life of reading and embroidering on Cullinan Island. But everything changes when she’s selected as the companion to Kylek, the enigmatic heir of House Blackwell. As their bond grows, extraordinary events unfold, unraveling Cullinan Island’s long-kept secret."]},{"title":"White Dragon Duke: Pendragon","tags":["Action","Adventure","Manhwa","Martial Arts"],"disc":["Read manhwa White Dragon Duke: Pendragon / Duke Pendragon / 白龍公爵ペンドラゴン / 백룡공작 팬드래건\nBorn as the successor of a low-ranking noble household, Raven Varte wears the sin of plotting a rebellion against the empire. To be granted amnesty, he was sent to fight demons alongside the worst corp of the empire, the ”Demon” corp. Most say that it is a place where most won’t survive for even a year, but Raven somehow managed to survive for ten. When his amnesty was in front of his eyes, on his last battlefield, he met the ‘Successor of the Pendragon Duke Household, Ellen Pendrago"]},{"title":"I plan to divorce my Villain husband, but we have A Child","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Am Trying To Divorce My Villain Husband, But We Have A Child / Elissa’s Whirlwind Marriage / I plan to divorce my Villain husband, but we have A Child / 악당 남편과 이혼하려는데, 아이가 생겼다","I already possess the body of a woman who will marry the devil. In a role haunted by her husband until death.\n“I will always be by your side!”\nI’ve decided to be nice to this poor husband for a while.\nBut before one day, when I had reached adulthood and planned to divorce. A little angel appeared in the night full of surprises. Oh man. So I tried to run away before being discovered…\n“Richard? something’s not right…”\n“I have no intention of letting you run away, even if you die, you must stay in my arms. Elisha”\nTrying to cry and beg with a pretty face is also not possible.\n“Where are you going to take our children?”\nDid he even chase after me with those cold eyes?\n…I guess I was wrong to run away like this. How to solve this situation?"]},{"title":"Sorry, My Skills Are Automatically Maxed Out!","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read Sorry, My Skills Are Automatically Maxed Out!, Baoqian, Wo De Jineng Zidong Man Ji! . I’m Sorry, My Skills Max Out by Themselves . My Skills Are Automatically Max Level! . My Skills Max Out by Themselves .\nJiang Li, after being reborn on the Blue Star, has passed eighteen years. With his excellent learning ability, he is praised by everyone as a genius.\nHowever, this genius, during the Awakening Ceremony at the age of eighteen, only awakened as an ordinary mage, mocked by his enemies.\nHowever, only Jiang Li knows at this moment that he has awakened a divine-level talent, and all his skills are automatically at max level! With his auditing talent,\nJiang Li levels up and clears stages all the way, establishing a guild and achieving unprecedented glory!"]},{"title":"Peach Branch Bubbles","tags":["Drama","Fantasy","Manhua","Romance","School Life"],"disc":["Read manhua Peach Branch Bubbles / 桃枝气泡 / Taozhi Qipao","Tao Zhi, an infamous figure in Laboratory School 1, dominated the bottom rankings all year round. One day, according to rumour, Miss Tao somehow fell for the legendary academic big boss—the school’s only hope to defeat neighbouring schools, the top scorer in the college entrance exam: Jiang Qihuai. Some research revealed that the boss’s type was someone who was 1) good-natured and 2) good at studying. Those who scored less than 700 points weren’t even worth mentioning. Tao Zhi wasn’t good-natured either, so she started practicing 5 exams/3 years*, turning herself into a ruthless test-answering machine that woke up early and stayed up late to study for 2 weeks, and scored 350 points. Tao Zhi: Look, I like you so much, how about you let this one go and let me take the test again? How to conquer a Bking**–from 300 to 700 points–in what world does a lady as beautiful as a flower who comes from a rich family like me get looked down on, isn’t it because you’re a coward king? *referring to a workbook that simulates 5 college exams and 3 years of school **internet slang for someone who acts cool/like a king"]},{"title":"Devil’s Luck","tags":["Drama","Fantasy","Josei","Manhua","Psychological","Romance"],"disc":["Read manhwa Devil’s Luck / For You, My Best Friend / 恶魔上上签","Her friend Jiamei committed suicide because of being bullied at work. In order to avenge her friend, Qianxia made a wish to the devil. Hidden cameras, indifferent bosses, attentive colleagues… With the investigation…"]},{"title":"I Just Want to Be a Normal Idol","tags":["Comedy","Romance","Shoujo"],"disc":["Read manhwa I Just Want to Be a Normal Idol / 아이돌만 하고 싶었는데 / aku hanya ingin menjadi idol"]},{"title":"The Raven Duchess","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Magic","Manhwa","Romance","Supernatural"],"disc":["Read manhwa The Raven Duchess / 까마귀 공작 부인 / Crow Duchess","Love, working is much more fun than dating! Melisa, the greatest jewel appraiser in the kingdom of Anabel. She loves using her pure abilities, to make jewellery, without magic like wizards do. I love my work and, I believe in my abilities more than marriage. And for her, the Duke of Winterfeld, Louis Winterfeld, who dreams of being in a romantic relationship, suggests a contractual marriage."]},{"title":"I Can’t Be the Sword God","tags":["Action","Adventure","Fantasy"],"disc":["Read I Can’t Be the Sword God, Wo Bu Ke Neng Shi Jian Shen, 我不可能是剑神","Li Chu traveled to Shilipo through time and became a young Taoist. In this world where ghosts were rampant and monsters were raging, weak and helpless Li Chu wanted to just live in Shilipo for the rest of his life. Until one day, when he had no choice but to go out into the world, he discovered… It turned out that everything in the world could be solved with one slash! If not, he would solve it with two slashes!"]},{"title":"Folding The Moon","tags":["Adaptation","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Folding The Moon / 折月亮","On the day Yun Li decided to give up on pursuing Fu Shize, she wiped off every possible trace of his contact information with teary eyes. A long time after they got together, Yun Li wasn’t good at communication and was debating if she should block a guy friend who had expressed interest for her. Fu Shize leaned against the couch and stared at her with droopy eyes. He let out a chuckle before saying in a cold tone, “You’re a piece of work.” Yun Li lifted her head. “?” “Back then, you blocked me without hesitation.” “…”"]},{"title":"The Civil Servant Hunter’s S-Class Resignation Log","tags":["Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Civil Servant Hunter’s S-Class Resignation Log / Civil Service Hunter’s Grade S Resignation Log / Civil Service Hunter’s S-level Resignation Log / 공무원 헌터의 S급 퇴사일지","Society has become a fantasy world, and I, who awakened as an F-Class Hunter, is still a low-level civil servant.","“System, you fucking son of a bitch!”","In the moment right when I was about to die, everything was changed with a single swear.","【Checking information about ‘Yoon Seora’, the Awakener who uttered abusive language towards the System Administrator.】","【Do you wish to sign a contract with the System Administrator?】","It was quite the emergency situation, so I did sign the contract first, but…","【The overall evaluation is readjusted.】","【Awakener ‘Yoon Seora’ (S-Class)】","My stats jumped from an F-Class Hunter’s to an S-Class Hunter.","Well, since I’ve become an S-Class, I’m gonna quit being an overtime-working civil servant!","“I’ve never seen you in the past. Who are you?”","“Hi, I’m the Earth Administrator’s contractee.”","–is what I thought, but somehow I wound up being right smack dab center of an incident where Earth is filled left and right with Returners.","Can I really quit?","SSS+ Class resignation difficulty, stay alive, salary woman!","F-Class Civil Servant Hunter Yoon Seroa’s S-Class Resignation Log, begins now!"]}]