[{"title":"I Thought You Were A Time-Limited Husband","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Thought You Were A Time-Limited Husband / Wasn’t My Husband Dying? / Wasn’t My Husband Terminally Ill / 시한부 남편인 줄 알았습니다만?","“Six months. Be sure to kill your husband within that time frame.”\nAt the order of her mother-in-law, she became the supporting role of a wife who kills her husband.\n“Wow…… handsome….”\nA husband too handsome to poison.\nAlice couldn’t bring herself to poison him.\nShe managed to avoid her mother-in-law from suspecting her by secretly using sacred power instead of poison.\n“Mother, I will be a priest as the former wife of the Duke! I will become a priest and pray for the Duke’s well-being for the rest of my life!”\nBut why did this happen?\nOn the very day she tried to leave the Duke, the unconscious Duke, her husband, woke up.\n“You were the one who pulled me out of the darkness, so take responsibility.”\nI saved a drowning person, and he had the nerve to give me a bundle."]},{"title":"Single Wizard’s Dormitory Apartment","tags":["Comedy","Drama","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa Single Wizard’s Dormitory Apartment / 독신마법사 기숙아파트","“Huh? I have to go to the Wizard’s Apartment?” Rangse Enna, an ordinary lady who become minister of foreign affairs. Due to the redevelopment of the civil servants apartment, she has to live in an apartment dedicated to wizards. Wizards that have zero life skills, zero common sense, zero empathy! Aren’t they weird people who aren’t interested in anything but magic?"]},{"title":"The Male Lead and I Are Trapped In A Horror Game","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Male Lead and I Are Trapped In A Horror Game / 우리 집에 갇혀버린 남주들 / 공포게임 남주와 감금당했다 / Confined Together with the Horror Game’s Male Lead / Imprisoned with the Horror Game’s Male Lead","I gave penalties to and guided the male lead who is trapped in the mansion and is trying to escape. I was just going to roughly fulfill my duties until the male lead finished playing.\n“As soon as I get out, I’ll lock you up the same way.”\nHe talked too much. As soon as this happened, I decided to help him escape.\n“Let’s eat, Dietrich.”\n“It’s a potion. You’ll heal right away if you apply it.”\n“The hint to escape this is over there….”\nI fed him well to prepare him for the next scene, gave him a potion to help him play efficiently when he got hurt, and even gave him hints about the problem.\nWell, now we can leave the mansion, right?\nHowever…\n“ Well, I don’t know about that.”\nWhat does he mean by that?\n… Dietrich had no intention of leaving the mansion.\n“Well, if you don’t go out, I will.”\nI was so annoyed at the thought of having to keep looking at him that I shouted in anger.\n“Didn’t you desparately wanted to get out of here?”\nHis eyes sank bitterly.\n“I’m telling you, I have no intention of getting out of here.”\n“What?”\n“And you can’t leave either.”\nHow on earth did this happen?"]},{"title":"I Tamed the Tyrant","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua I Tamed the Tyrant / 我驯服了暴君 / 転生して暴君を調教しました","Because of the tragic death of her favorite manga man, the girl was angry at the author tomorrow night, and she accidentally got into the book. ‘Don’t panic! Now that I’m here, let me save the fate of her male god.’ It’s just… ‘Who can tell me, how can this cute and adorable little guy in front of me be the future tyrant who killed the male god?!’"]},{"title":"Vampire Lord’s Greatest Wife","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Vampire Lord’s Greatest Wife","Vampire Lord’s Greatest Wife manhwa, Sylvania, a noble daughter who disguised as a servant named Miria, has always lived miserably ever since her family was killed by vampires. But when she married the mysterious Count Alaric, who knew about her original identity, Sylvania’s life changed drastically. What is Alaric’s true identity?"," "]},{"title":"I Confessed to the Boss","tags":["Drama","Josei","Manhwa","Office Workers","Romance"],"disc":["Read Openly Workplace Romance / Openly Dating / Outspokenly In-House Love / 대놓고 사내 연애 / 대놓고 사내연애\nEveryone loves Mr. Perfect, team leader Ji Dohoon– except for one person, that is. For the past two years, Dajung has only had eyes for her coworker, Hyunwoo. On the night of the company dinner, Dajung runs after him as he leaves and asks him to be her boyfriend. However, once the tall figure she confesses to steps out of the shadows, Dajung realizes she was talking to none other than Mr. Perfect himself! But what’s more shocking is… he agrees to date her! What in the world is he thinking?!"]},{"title":"Am The Heiress Of The Villain Family","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa Am The Heiress Of The Villain Family / 악당 가문의 상속녀입니다 / I’m the Heiress of a Villainous Household"]},{"title":"Attack Gamdori","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Attack Gamdori"]},{"title":"High School Mythology","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa High School Mythology / 고등신화전","One day, The son of God came to the school. Her name is Go Deung Shin.Since her arrival, Go Deung Shin has shown many miracles, such as raising a sitting person, knocking down the school’s bully, reviving the dead and other such miracles.And Bae Du Hong, a loser at school was reborn by Go Deung Shin and fights as the first apostle to prove the miracles of Go Deung Shin.But is she, or is he really the son of God? Or…"]},{"title":"Empress’s Harem","tags":["Drama","Harem","Romance","Webtoons"],"disc":["Read manga Empress’s Harem / El Harem De Una Princesa / Empress’s Harem / Queen’s Palace / 女帝的后宫","Super sweet and super-sand sculptured female statue against the harem! I often hear: “Three princes and three princesses! Your puppets are fighting again!” The overbearing female CEO traversed to the world of female honors and woke up with seven"]},{"title":"Ingram’s Lantern","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Ingram’s Lantern / Ingram’s Lamp / 잉그람의 등불"]},{"title":"Before I knew it, I had stolen the Dark Lord’s Heart","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Before I knew it, I had stolen the Dark Lord’s Heart","Seeing the relationship between Duke Willow, the Sword of the North, and her father who’s his guardian knight, Celine has been looking forward to meeting her lord, Damian.","However, the Damian she encountered was a skinny, frail boy with a bright smile that belied his Northern Majesty.","To fulfil her duty as a guardian knight, she decided to take her lord’s side, no matter what kind of person he was.","But there’s something fishy about this frail boy…"]},{"title":"The Wretched","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua The Wretched / Les Misérables (yoousi) / I Am the Bane of Others’ Existence / 我，天煞孤星","Ji YouChuan was investigating the mysterious organization Blaze in order to take revenge for his parents. 36 demons were released during one of the confrontation with Blaze and he signed a contract with the strongest demon, Chelsea. He joined the “Wrath of Heaven” team for the sake of investigating Blaze even more deeply and to retrieve the 36 demons, but after getting betrayed by his teammates, the sacrifice of his friend, wandering the wastelands and various other incidents, Ji YouChuan and Chelsea will uncover the thousand-years conspiracy behind the Red Rain catastrophe!"]},{"title":"Please, I Really Didn’t Want To Fall in Love With My Master!","tags":["Drama","Fantasy","Romance"],"disc":["Read Please, I Really Didn’t Want To Fall in Love With My Master! / Please, I Really Don’t Want to Fall in Love With the Sect Headmaster / 拜托，我真没想和掌门谈恋爱啊","Li Ran traversed to another world and became the Holy Son of a Demon Way Sect. The system has awakened, and the first task released is actually to fall in love? The Sect strictly forbids relationships between men and women. Li Ran took the risk of being expelled from the Sect and wrote a love letter to his junior sister, but it was sent to the master by mistake!"," "]},{"title":"Viewer’s Choice: The Dating Show","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Viewer’s Choice: The Dating Show / 대국민! 연애 참견 쇼","Mo Dahye only tried out for a reality dating show to show the producer, Lee Wongu, that she was totally over her one-sided love for him. What she didn’t count on was getting cast! Now, Dahye will spend a week with seven men who are trying to win her heart, all while Wongu watches. However, not everyone is who they claim to be, and some people didn’t join the show for the right reasons. Will Dahye be able to find the right man for her, and will the viewers agree with her call?"]},{"title":"Only Want It With You","tags":["Romance"],"disc":["Read manhwa Only Want It With You / I just want to do it with you / I Want to Do It Only With You / 너는 내 숨결이니까 / 너하고만 하고 싶은","Seo Yeorin’s happy love life ended when she discovered her beloved boyfriend had been cheating on her. Heartbroken, she wandered about aimlessly and almost fell into a frozen river, narrowly escaping death thanks to Jung Yeonseok, a handsome stranger. Little did she know that she’d meet him again while visiting her friends in Beijing, although… she doesn’t recognize him at all! Will their meeting bring Yeorin the happiness she never got or bring further pain to past scars?"]},{"title":"Love, How Do You Do That","tags":["Drama","Romance"],"disc":["Read manhwa Love, How Do You Do That / 사랑, 그거 어떻게 하는 건데","Bestselling author Lee Siwon. A murder case using the same method as in his crime thriller novel “Rope” happens in reality. There is a victim, and the culprit has not been caught yet. Siwon decides to write romance instead of thrillers due to guilt and trauma… “Siwon writing romance…? The same Siwon who kills at least five people in every novel?” In the end, Siwon proposes a romantic relationship to his longtime friend Sodam in order to learn about “love.”"]},{"title":"I Raised My Fiancé with Money","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Raised My Fiancé with Money / 돈으로 약혼자를 키웠습니다 / Raising My Fiancè With Money"]},{"title":"Please Lay Your Eyes on Jasmine","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Please Lay Your Eyes on Jasmine / Please Lay Your Eyes on Jasmine / 자스민을 봐주세요","Jasmine had an accident with her one-sided love, Duke Aion. The straightforward man, who didn’t bat an eye to her before, who is consistently ignorant of her, for some reason, was now catching feelings…","“Didn’t you like me? Was that a lie?”","“Why would I lie about that?”","“I know. You’re not that kind of person.”","She was at that phase where she decided her damned love, but instead it turned for the worse.","A enchanting love story between a noble couple that is at each other’s throats but in harmony during the night."]},{"title":"You’re Under My Skin!","tags":["Comedy","Romance","School Life","Slice of Life"],"disc":["Read manhwa You’re Under My Skin! / 소꿉친구가 자꾸 괴롭혀!","Nuri hasn’t changed much since she was in elementary school. She still has a temper, she still lives in the same house, and she’s still tragically short. Her childhood friend Homil, however, has changed a lot. Several years after he moved away, Homil returns as Nuri’s neighbor and high school classmate. Now, he’s not quite the same boy Nuri used to know. Sure, he’s still an idiot and a good friend, but something feels different, and Nuri is all too aware of it in a more-than-friendly way. She might not be growing any taller, but maybe some weird feelings about Homil are growing inside of her…"]}]