[{"title":"In This Life, I Will Survive Until the End","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa In This Life, I Will Survive Until the End , Dalam hidup ini, saya akan bertahan sampai akhir I Will Survive Until The End Of This Life Kehidupan kali Ini, Aku Akan Bertahan Hidup Sampai Akhir 이번 생, 끝까지 살아남겠습니다 / This Time, I Will Survive Until the End","In numerous past lives, the reason for my untimely deaths was apparently ‘marriage.’","Did I intentionally choose to be born unattractive in this life, God?","Taking on the role of the head of the family instead of the deceased father, Adette pursues","business success. Everything is going well, with the hope that this investment will be the key…","“You don’t need the help of a woman for the investment?”","If rejected for being a woman, Adette is determined to invest, even if it means disguising as a man!","Visiting as ‘Count Terusaf’ on behalf of the late uncle, Adette approaches ‘Duke Matelio,’","but the Duke seems uninterested in investment talks.","“If it’s okay, I’d like to meet the Count again.”","…But what is this man’s motive? Why does he keep getting closer?! Please, just stop!"]},{"title":"I’m A Villainess, But I Picked Up the Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I’m A Villainess, But I Picked Up the Male Lead / 악녀인데 남주를 주워 버렸다","I possessed the most powerful villainess in a novel, Countess Edina.\nTo be exact, the villainess who attempted to assassinate the male lead, took his heart, and sold it to a neighboring country.\nAnd so, I tried everything to avoid the male lead until I got his heart back. But then, I happened to find him one bloodied night.\nI tried to look away and just leave him there, but his condition was simply too terrible.\n‘Just this time, and only this time! I’ll help you and pretend I don’t know anything!’\nHowever, since this is the nth time I run into him, I think it would be better to just leave the male lead there next time.\nI’d rather just be nice to him for once, pay my debt, and get over everything!\n“No, I don’t need your kindness.”\nBut… I think the male lead despises me too much…\nCan I survive all this?\n******\n“I still remember those days when you would poison me and send assassins after me.”\n“Oh…haha…”\n“Yet, once again, I still love the Countess.”\n“Wait…what?”\nThe male lead, who saw me as an enemy just a year ago, is now confessing to me, the villainess.\n“Doesn’t this make me seem like I’m crazy?”\nI was frozen and couldn’t say anything, but it was I who felt crazy.\n“But that’s okay. Because I am a crazy bastard.”\nHe whispered softly to me in a deep voice.\nIt wasn’t that I disliked how he’d changed…\nHa. This is all too much. He’s exactly my taste-\nWhat should I do?"]},{"title":"The Life Of An Evil Empress","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa The Life Of An Evil Empress / 황녀가 깽판 침","I am an abandoned princess No, she was an abandoned princess. Until I met my lovely moneylender, the Marquis Joseph Patello. “If Your Highness wishes, we may throw the imperial family into the abyss.” Yeah, I can’t back off so easily. It’s time to take revenge on those who have looked down on me and reign as emperor. “Marquis Joseph, I will give you a chance to become my knight.” Now, let’s start a joke that pretends to be a comeback, shall we?"]},{"title":"Honey, Why Can’t We Get A Divorce?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Honey, Why Can’t We Get A Divorce?","She possessed an evil woman who loves the main lead and killed her husband.","Fortunately, the timeline was before she killed her husband.","And unfortunately, everyone knows she loved the male lead so much. In this case, she would have to get a divorce as soon as possible.","But why…","“Crazy, crazy, crazy. I just heard it. I didn’t know it was crazy,” my husband said, tearing apart the divorce papers I gave to him. “I can’t help it. I have no choice but to live with a crazy woman.”","No, you do have a choice?","Why can’t I get a divorce?"]},{"title":"Hidden House in the Apocalypse","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Hidden House in the Apocalypse","Three years ago, a doomsday prepper named Park Kyu, who predicted the world’s end and prepared for it in every way possible. As he expected, one day, a nuclear attack on Seoul led to a global nuclear war, resulting in an unprecedented apocalypse. Despite everyone’s ridicule, the protagonist Park Kyu spent his entire fortune over the past three years to quietly dig out his own bunker. Was it merely a coincidence that he foresaw all these events?"]},{"title":"Wedding Strategy","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Wedding Strategy / Marriage Strategy / 結婚攻略 / 결혼공략","Haru has a secret. She has the ability to go back to a fixed point in time every time she gets married. One moment, Haru is standing at the altar. But suddenly, she’s back on the subway on her way to work. But this secret of hers turns out to be not so secret after all. Oneul, who has the same ability, meets her and tells her that she and Oneul are both players in a dating simulation game. Will they be able to see the game to its end by getting married to their main storyline characters and escape from the time loop?"]},{"title":"Oh, Dear Nemesis","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Oh, Dear Nemesis / 오, 친애하는 숙적 / Oh, Dear Enemy / Oh, Dear Old Enemy / Oh, My Beloved Archenemy / Oh, querida némesis","The moment she believed she won, everything went back to the beginning.","Kalmia Phlox, whose dead brother came to life, was engaged to a man she was close to, and had a relationship with the man she was in love with. In her very different relationships, she comes closer to a truth she did not know in her previous life…","“It’s greed to wish for something you don’t have the ability to handle!”","“Yes, I know. I’m being greedy. Do I need permission to be greedy?”","She’ll be the Count again in this life.","It’s not a lucky title, but it was won with her own strength, so she’ll be a perfect Count who was nobody’s scarecrow."]},{"title":"Perfect Contract","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Perfect Contract / 완벽한 계약","A perfect man Do junwon and a woman who’s aware of her abilities and charms Hong Jui. “Let’s date. For the time being.”Sure, let’s get well together. For the time being.” After the stalker incident. We decided to be together on one condition not to fall in love with one another, but why is it getting so bothersome by the time? Why do I keep thinking about it? Let’s get this straight, we’re not in an actual relationship."]},{"title":"I Became the Rabbit Heroine’s Stepmother","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Rabbit Heroine’s Stepmother","After dying and coming back to life, I woke up at the wedding venue, and it’s not just any wedding venue, it’s the wedding venue of the wolf duke, the leader of the beast country. It’s bewildering to be born as Princess Gloria, a villainess who torments the female lead who isn’t even the female lead of the novel. And I have a cute, beautiful, and lovely daughter? she’s a rabbit, her cuteness is overloaded.\nLife with this cute and lovely rabbit daughter and a handsome and kind wolf husband is actually nice!"]},{"title":"As If Love Doesn’t Exist","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa As If Love Doesn’t Exist / 사랑은 없는 것처럼","Siyeon had the rug pulled out from under her when she realized that everything in her life was a lie– her parents are not her real parents, her fiance not really her fiance, and her cousin Eunhye is actually the birth daughter of this household. Siyeon is resigned to her misfortunes until Eunhye reveals to Siyeon that all of this was planned and orchestrated. Swallowing her tears of anguish, Siyeon makes a fateful wish that brings her 10 years into the past where she may be able to change everything… or can she?"]},{"title":"10 ways to get rejected by the Tyrant","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa 10 ways to get rejected by the Tyrant / Ten Ways to Get Dumped by a Tyrant /폭군에게 차이는 10가지 방법","I accidentally entered a fictional world and possessed a character inside. No! But, I got into Scarlet’s body, who gets brutally murdered by her fiancé, the Tyrant. So, to protect myself from following the original plot of dying, I planned my ways to get rejected."]},{"title":"The more I die, the more invincible I become.","tags":["Action","Adventure","Fantasy"],"disc":["Read The more I die, the more invincible I become.","Summoned into a world where the divine and martial arts coexisted, Qiao Mu can revive infinitely and level up.\nThe more tragic his death, the stronger he becomes after he is revived. The enemies are shocked to realize after defeating a young man an older man shows up, repeating infinitely!\nRumors started to spread about a legendary Qiao family… Wait, no one told me that reviving makes me older!"]},{"title":"I Work Nine To Five In The Immortal Cultivation World","tags":["Action","Drama","Fantasy","Manhua"],"disc":["Read manhua I Work Nine To Five In The Immortal Cultivation World / 我在修仙世界朝九晚五"]},{"title":"I’m Stuck On The Same Day For A Thousand Years","tags":["Action","Fantasy"],"disc":["Read I’m Stuck On The Same Day For A Thousand Years, I’m Trapped in This Day for One Thousand Years, 我被困在同一天一千年","Wu Chen transmigrated to a new world, Got trapped on the day of July 7, 2020, Constantly reincarnating! He used to indulge himself doing all sorts of evil things while running wild in despair, but every new day, everything would start all over again. In this way, he has been reincarnated for a thousand years, and on a new day, the sun rose as usual."]},{"title":"Versatile Sword Cultivator","tags":["Action","Adventure","Fantasy"],"disc":["Read Versatile Sword Cultivator","In a time when online games merge with reality, the number one magic cultivator inand the peak player in the Enlightened Realm, Lin Jichen, died when he was betrayed by his lover and his good friend. However, the Heavens did not abandon him, and Lin Jichen was reborn back to the day before the server ofgoes live. After gaining another life, he cast aside magic and followed the sword, carving out a future for himself and rewriting his destiny! When the game merges with reality, he’ll be standing above the rest!"]},{"title":"Cinderella Wasn’t Me","tags":["Comedy","Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa Cinderella Wasn’t Me / I Wasn’t Cinderella / 신데렐라는 내가 아니었다","People called Terryl ‘Cinderella.’\nIt was meant to be a charming nickname for her, who was a mere Baron’s daughter before falling in love with the second son of a Marquis.\nHowever one day, he abruptly bid adieu, leaving Terryl wounded by her lover’s betrayal.\nAnd suddenly, the so-called ‘King of the North,’ Duke of Rihan, stood in front of her.\nHe identified himself as Terryl’s biological father, whom she assumed was no longer alive.\nBecause she became the Duke’s daughter overnight, she had to put in a lot of work to become the Duke’s successor!\n* * * *\nThree years later, Terryl, seeking vengeance on her ex-lover, offers Cesio, the Marquis’ eldest son, a contract of engagement to take away what her former lover desired most, the title of ‘Marquis.’\n“I want an engagement with Young Lord Cesio.”\n“All right, take full advantage of me.”\nAs the two were engaged, they became more aware of one another, and as Terryl becomes closer to Cesio, she learns an unexpected secret about him…\n‘Terryl,’ who became the Duke’s heir overnight, and ‘Cesio,’ who inherited the Marquisa"]},{"title":"I’m In Trouble Because My Husband Is So Cute","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa","Mature","Reincarnation","Romance","Webtoon"],"disc":["Read manhwa I’m In Trouble Because My Husband Is So Cute / My Hubby Is Too Cute! / 내 남편이 너무 귀여워서 곤란하다 / 私の夫が可愛すぎて困る / 老公太可爱了怎么办 / หยุดน่ารักได้ไหมคะ คุณสามี","‘I was sad just for being reincarnated with a dirt spoon, and now you’re telling me I also have to marry because of a debt?’\nNot just that, but the person who will be my husband is the Heir Apparent of Duke Hessenweitz, the monster from all those horrifying rumors!\n“A monster doesn’t deserve good treatment.”\nHowever, in the castle of the duke, I saw my young husband being abused for being a monster. I felt pity for my young husband and since he was more like a younger brother to me, I tried to be a little nicer to him…\n“You are my miracle and my salvation.”\nOnly… I didn’t expect this kind of reaction at all?\nAnd not just that…\n“If I had a daughter who resembles my wife, she would be like you!”\nNo, why are you doing this to me? Even the father-in-law who had a bad temper?\nCan I survive this duke’s castle safely?\nTaken from Novel Updates."]},{"title":"Musician Genius Who Lives Twice","tags":["Drama","Fantasy","Manhwa"],"disc":["Read manhwa Musician Genius Who Lives Twice / 두 번 사는 음악천재","Even if a musician dies, he never dies. It’s just covered. Singer-songwriter Kim Han-seok, who became a legend in Korea with just a guitar… Waking up as a college student in the streaming era 30 years after his death!"]},{"title":"Heavenly Demon Wants to Be A Chef","tags":["Action","Adventure","Cooking","Fantasy","Manhwa"],"disc":["Heavenly Demon Wants to Be A Chef / 요리사가 되고 싶은 천마님"]},{"title":"Vanta Black","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Vanta Black"]}]