[{"title":"The Kids Have Changed","tags":["Adaptation","Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","One shot","Romance"],"disc":["Read manhwa The Kids Have Changed / TKHC / 애들이 달라졌어요"]},{"title":"Alissa and the Magic Diary","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Alissa and the Magic Diary / 알리사와 마법일기","One day, Alisa, a librarian at the Royal Library, discovers an ownerless diary. When she writes her name in the diary, she is sucked into an unfamiliar place and meets a boy who introduces himself as Louis.","Strangely enough, Alisa, who thought the world was nothing more than a diary, becomes friends with Louis through the diary and they often spend time together.","Then, I attended the Queen’s Selection Ball with a light heart, thinking that nothing would happen.","Why is the king interested in me?"]},{"title":"His Royal Appetite","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa His Royal Appetite / Appetizer Is One Night / Appetizers For One Night / One Night Appetizer / 애피타이저는 원나잇","After becoming a sous chef at a prestigious restaurant, Mina thought she could put her last job at the bar and her one night fling with one of its customers, Leo, in the past. Little could prepare her for finding out Leo was actually Leopold Desmet, a Duke of Brinovia! Is fate giving this relationship a second chance? Or is it warning her to avoid the scandals of the royal family at all costs?"]},{"title":"How to Protect My Sub Male Lead Dad","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How to Protect My Sub Male Lead Dad / I’ll Protect You, Daddy! / 서브남 아빠를 지키는 법","“You claim to know how to save Asta? If your words are false, you’ll pay with your life,” warned sub male lead Hart with a chilling tone.”Even if you save Asta, the original protagonist, he’ll probably use you and then kill you.”Suppressing my regret, I responded with a confident face, “Absolutely!””…Huh.”Hart looked down at my feeble fists with a mocking expression.While it’s a bit strange that this is my first meeting with my stepfather, I truly could help him.I’m here as a reincarnator, to save my sub male lead’s dad unfairly destined to die!Is there a rule that only dads have to save their daughters?’Although it’s a bit unsettling that this novel isn’t in the parenting genre, it’s okay. I’m not seeking love; I’m here to rescue my dad!’”Clean this up right away. I can’t stand kids.”… It should be fine, right?"," "]},{"title":"My Favorite Novel Has a Weird Epilogue","tags":["Comedy","Drama","Fantasy","Isekai","Manhwa","Reincarnation","Reverse harem","Romance"],"disc":["Read manhwa My Favorite Novel Has a Weird Epilogue / External Ordinary, Slightly Strange / The Side Story of My Favorite Work Is a Bit Strange / The Spin-off of My Favorite Work Is a Bit Strange / 최애작의 외전이 좀 이상합니다 / THE HEROINE HAS AN AFFAIR WITH MY FIANCÉ","Fencing champ Rina is on cloud nine after winning gold at the Olympics, but is pulled down to earth when she wakes up as an extra in her favorite novel. Though she thinks she’ll have a front-row seat to the hero and heroine’s romance, Rina learns that it’s been 25 years since they both tragically died. On top of that, their son, Leo, is being treated like a traitor by the very royal family his parents fought to protect! Fueled by her fangirl determination, Rina raises her sword to clear Leo’s name and give him the happy ending he deserves."]},{"title":"To deny the route","tags":["Drama","Fantasy","kids","Manhwa","Romance"],"disc":["Read manhwa To deny the route / How to deny the route / to deny the root / 루트를 거부하는 방법","—FAN TRANSLATION— “Oh, am I dreaming?” He lifted his hand to touch his face. I pinched a soft cheek that didn’t belong to me, and felt a slight pain that told me it wasn’t a dream. [Health is reduced by 1]. [Stamina is depleted and you lose consciousness (Max Stamina:1)] ……What the fuck? My newly acquired body was horribly fragile and weak. He collapses at the slightest shock, and the people around him are circling him, not letting him go outside, and it’s driving me crazy. I thought for sure I was dead……. I blacked out in a car accident and woke up in a game I’d never heard of. [Ains Root finds you adorable, would you choose the forbidden love, Brother Root? (Yes/No)] Are you fucking crazy?! Your brother! This isn’t even a normal game, it’s a homoerotic game! Jerry decides to try and change this bizarre world, and the characters he’s playing are trying to make him like them. (summary by ridibooks)"]},{"title":"I suspect the movie emperor is luring me","tags":["Shounen Ai","Supernatural"],"disc":["Read I suspect the movie emperor is luring me / 我怀疑影帝在钓我","It was supposed to be an act of kindness after he fell into the water. “Why did it develop into a companionship?!” A D-List celebrity with multiple scandals meets the popular award-winning actor whose an abstinent simp, an unexpected event that led to planned action. “This man who acts like a simp cannot be an award-winning actor!!!"]},{"title":"Even If Despair Consumes You","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Even If Despair Consumes You / 환멸이 그대를 삼킬지라도","In a life drained of luck through a deceitful pact with a devil, ‘Dokyung’ feels despair with her miserable existence. Enters another devil, ‘Hwamyung,’ who feeds on despair, in this fantasy tale of redemption through a contract. Dokyung, who has lived on the brink of despair, trapped in a life devoid of hope. At the moment she decides to end it all, the devil Hwamyung intervenes.\n“What is this? My life should’ve ended here… Why did you save me?”\n“Don’t die. For the sake of my pleasure.”\nEntangled in a contract with the devil of despair, can Dokyung recover her life that has been thrown to the ground?"]},{"title":"I Created a Harem to Avoid the Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa I Created a Harem to Avoid the Male Lead / 남주를 피하려다 하렘을 만들었다","This novel contains disturbing and oppressive relationships. …I ignored the warning and delved into the high-level trashy novel. However, to my surprise, it’s the ultimate edition of the insane trash that’s hell-bent on tormenting the female lead! So I left a review. [I can’t stand it because of the sweet potatoes -_-] But, just then, I suddenly got reincarnated into the female lead, Selina?! “P-People looking at me and t-talking is something I hate.” Afraid and stumbling over words, “Satisfying me is your job, Selina. A woman who doesn’t even know her place is no fun.” As scenes of the female lead being endlessly tormented by the trashy male lead flashed through my mind like a lantern, I made a decision. Let’s avoid the male lead and drive away the antagonist! Goodbye, everyone! I’m leaving to cast off my destiny and find happiness."]},{"title":"Half Day Fantasy","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa Half Day Fantasy / 半日ファンタジー / 반나절 판타지","Yeoreum, who is easily superstitious, accidentally put into practice the <How to Go to Another World by Elevator> posted on SNS, and ends up being transported to a real world.\nAfter half a day, she returns to reality, and begins to live as a serf in this world for 12 hours a day…\nAt first, she started it to escape reality, but as she worked, she realized that her true calling was farming, and so she farms every day to gain experience for farming in this world.\nIn the meantime, she meets Noel (Han Do-yoon), who also travels to this world for half a day and works as a warrior as a side job, and they get engaged while mistakenly believing that each other is from this world.\nHowever, her fiancee in this world turns out to be Han Do-yoon, her real-life classmate!\nOn top of that, she is constantly attacked by Emma, who has a crush on Noel, and the Duke of Charlotte, who tries to use her fiancee to pull Noel out of her position as a warrior. Amidst the summer when all they wanted to do was farm, endless commotion unfolds in this world and in reality!"]},{"title":"Your Kiss Scene!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Your Kiss Scene! / 너의 키스씬!","Entertainment writer Lee Seul, heard the news of her favorite idol, Block Shoot’s Seung-Chan, on her new entertainment program. Expectations of meeting her favorite for more than 10 years are brief, and she accidentally sees her favorite idol kissing someone else in secret at the broadcasting station. In addition, the entertainment program she was in charge of is a love variety program that’s full of dating amongst the cast… She has to watch her favorite idol flirting and dating someone else even if he’s her favorite."]},{"title":"Immortal Cultivation Is a Dead End","tags":["Action","Fantasy","Romance","Shounen"],"disc":["Read Immortal Cultivation Is a Dead End, Xiuxian Silu Yitiao, 修仙死路一条, I’ll Never Be a Greater Cultivator","Meng Nan, a relationship virgin from Earth, died in a car accident. He reincarnated in a world of immortals and heroes, and they even allocate wives?! Is this the beginning of a delightful new life?! Then he realized — The art of immortal cultivation! Is a. Dead! End!"]},{"title":"Golden Print","tags":["Adventure","Drama","Manhwa","Slice of Life","Time travel"],"disc":["Read manhwa  Golden Print / 골든 프린트\nA dream I have had since I was 12 years old and have nurtured since then. For thirty years I worked hard, not missing a single day, but the reality is that I’m a construction site manager constructing buildings for other people. If I hadn’t made that choice back then… Would I have become an architectural designer? Thirty years after all that, a miracle happened to me.\nI went back to my university school days 20 years ago, in 2010. I’m 22 years old, but with 20 years of field experience, I’m going fulfil my dream of being an architectural designer and make world famous designs of my own!"]},{"title":"Beneath the Lady’s Mask","tags":["Drama","Manhua","Romance","Shoujo"],"disc":["Read Beneath the Lady’s Mask / 夫人你马甲又掉了","Mother always said to Qin ran; Your stepfather is from a famous family, your eldest brother is a genius, and your sister is a top student in her high school. You, a country bumpkin, don’t embarrass them. Everyone with status in the capital received a warning from Mr. Juan of the Cheng family: Mr. Juan’s wife is from the countryside and doesn’t understand the current situation, and has a bad temper. In short, everyone should be patient. Until one day, when Master Juan was investigating a certain big boss, his men fell into a confused silence while looking at one of the waistcoats of his sister-in-law who was said to know nothing…"]},{"title":"Romance is Dead","tags":[],"disc":["Read manhwa Romance is Dead","Luce Granzia was a Cinderella that almost was. But just a night before the wedding, her engagement is broken off and she finds herself guilty for something she hasn’t done. Her life plummets, and Luce finds a job at the national laboratory in order to pay back a mountain of debt. Five years later, she’s build for herself a new life, new relationships—but with the crown prince’s orders, she must head back into high society."]},{"title":"Don’t Look For Me","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa Don’t Look For Me","The last surviving member of the Yurendal clan, Ufemia has the ability to connect with spirits. After running away from the family who has forsaken her, she is employed by the Duchy of Peredite as a caregiver and develops a special bond with Sirius, the duke’s aide. But she learns of his true identity—Cassius Peredite, the heir to the dukedom that had an ill-fated relationship with her clan. With their relationship hanging by a thread, what fateful choice will Ufemia make?"]},{"title":"This Game Is Too Realistic","tags":["Action","Adventure","Fantasy"],"disc":["This Game Is Too Realistic, The Game Is Too Real , 这游戏也太真实了, Zhe Youxi Ye Tai Zhenshile\nStarting with a shelter, tricking players into work for free, I am the administrator and chief customer service executive of Wasteland ONLINE——Chu Guang.\nAfter I accidentally opened a high-tech shelter after traveling into the post-apocalyptic world, I began to recruit “players” to be my slav- lackeys! Let them kill monsters so I can level up? TOO EASY!\nCome join me as I build the strongest base in an apocalyptic world full of mutants and monsters!"]},{"title":"Live as a Villainess","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Live as a Villainess / 악녀로 살라신다","“You have to become a villain to live? … But how do you do that?” One day, Da-jeong Kim, an ordinary Korean office worker who suddenly possesses the world of a novel. In fact, it is Christine Rosalind, the villain character who dies at the beginning of the novel in the series that she possessed. Perhaps because of Da-jeong’s possession, the original death is avoided, but that is only temporary. In a few moments, you die, and when you die, you return to the starting point of your life. How can I live without dying? The sky throws a clear answer to Da-jeong, who is in trouble. let her be a villain When she becomes a villain she can live without dying. … By the way, can she become a villain that only eats her heart? “A world collapsing, twisting characters. If you want to live, you have to remember who you are.” She said she could only live if she was a villain, did she mean that she could only live? After many twists and turns, she heard the voice of a villain, but Da-jeong’s life is hard and painful. It turns out that Christine was born into a civilization of ‘dead or bad’. Unexpected characters appear in front of Da-jeong, who is in such trouble. Raymon Myers, who is the man of the original story and is a perfect match for Christine, Diane Schneider, who was not found in the original, but has a reputation as a vicious witch in the world, and Cordelian Parker, who was possessed by the original author, the female lead of the original and the creator of this world. The three of them approach Da-jeong with different goals…"]},{"title":"Divorce plan with husband failed","tags":["Action","Drama","Fantasy","Historical","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manhwa Divorce plan with husband failed / I am Afraid I have Failed to Divorce My Husband / I Failed to Divorce My Husband /흑막 남편과의 이혼에 실패한 것 같다","I already have the body of a supporting character who is obsessed with the male lead, the husband I’ve been stalking and stalking for 10 years.\nOf course, at first I also intended to divorce peacefully before the heroine appeared. But I have found out that my little husband is being abused by his family.\nAt that moment, the sense of responsibility and duty of a fully grown person suddenly surged.","***","Aiden had his back turned away from her and suddenly grabbed her arm forcefully. The strength of his hands alone could have ripped her arms off. Erin timidly called his name and spoke.","“I already reminded you yesterday. We’re a married couple, so I’m always on your side.”","“…”","“So, everything is alright.”","She comforted him with these sweet words like it was a spell. And as if he was under her magic, Aiden stopped trembling.","***","The adult Erin requested to divorce her husband Aiden before the female lead appeared. As soon as those words left her lips, Aiden’s smile disappeared.","“A divorce? Never.”","Aiden tore the divorce papers into such thin sheets, the contents were no longer legible. Erin smiled at the sight."]},{"title":"A Beloved Existence","tags":["Comedy","Drama","Romance","School Life","Slice of Life"],"disc":["Read manhwa A Beloved Existence / A Loving Existence / 사랑하는 존재","__arim: Soyou, who received heart transplant surgery. The donated heart belongs to the father of the guy in her class?"," "]}]