[{"title":"The Devil’s Body Temperature","tags":["Drama","Fantasy","Romance"],"disc":["Manhua to read The Devil’s Body Temperature / 魔鬼的体温 at manhua website","Returning to the year 1996, Bei Yao, a 4 years old baby knocked open the opposite room’s door. Behind that door is the disastrous devil of the world 20 years later. Devil Pei Chuan is now 5 years old, with disabled legs, introverted and self-deprecating personality. Then they reached 17 years old, Bei Yao turned into the school’s crush. Pei Chuan, with a cold face, gripping the wheel chair, warned her: “Stop saying that you like me, if not…” Bei Yao put her hands around his neck, smiled sweetly. Being his girlfriend for two lifes, Bei Yao wants to know the devil’s body temperature. Sensitive and self-deprecating devil X Heeling angel, childhood sweetheart, loving everyday.","Móguǐ De Tǐwēn,\nMogui De Tiwen,\n魔鬼的体温"]},{"title":"If I Die, I will Be Invincible","tags":[],"disc":["Read If I Die, I will Be Invincible / If I Don’t Die Soon, I’ll Really Become Invincible! / Zài Bu Sǐ Wǒ Jiù Zhēn Wú Dí Le / 再不死我就真无敌了","Ye Ning obtained the golden finger through travel, and as long as he dies, he would be invincible. So he started to go crazy. But… Empress Da Zhou: “When I see Ye Ning’s life, if he dies, I will live alone.”. Upper world immortal ruler: “The world is so indifferent, but Lord Ye never hates me, I will try my best to protect him”. Hundreds of millions of people: “everyone in the world can be lacking, but Lord Ye is the only saint, only Ye Ning’er!” Ye Ning: I’m almost invincible, why don’t you let me die?"]},{"title":"I Accidentally Saved the Male Lead’s Brother","tags":["Adaptation","Drama","Fantasy","Historical","Romance","Webtoons"],"disc":["Read manhwa I Accidentally Saved the Male Lead’s Brother / I Accidentally Saved the Male Lead’s Younger Brother / 얼떨결에 남주 동생을 구해버렸다","She possessed Charlotte Rania, an extra that was not even mentioned in the original book. I only thought that the bloody social world and politics were stories from another world. Until she accidentally met her brother-in-law and saved him. But… “Theo is going to live with you!” This little kid started swearing that he wouldn’t go home. The male protagonist, Carlyle Heinst, who has to marry the original female lead by contract, offers Charlotte her contract marriage… A peaceful extra life, goodbye now!"]},{"title":"Just Peachy","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Just Peachy / Why Are You Doing This, Freshman?! / Why Are You Doing This, Shinseonnim?! / Why Are You Like This, Shinseon-nim?! / 왜 이러세요, 신선님?!","On the last day of each millennium, junior sages earn another thousand years of life when they consume celestial peaches bestowed upon their kind by the holy being Seowangmo. That’s all Cheon-rok ever really wanted – to finish her training and earn more time. But when she accidentally drops her celestial peach, that dream begins to unravel. Having fallen into the human realm, the mystical fruit tumbles through the fabric of time and space and into K-pop idol Kim Dowon’s heart, granting him a natural charisma and adoration far beyond that of any normal human. The only way to retrieve the peach without causing physical harm? Through a heartfelt kiss under the Seowangmo’s peach tree. Refusing to believe in the existence of mythical sages and stone fruit, Dowon must be convinced by Cheon-rok to cooperate before her time in this realm is up. As the two frenemies are pitted against each other, could they end up finding heaven on earth in one another’s arms?"]},{"title":"I Became the Tyrant of a Defence Game","tags":["Action","Adventure","Fantasy","Isekai","Manhwa","Webtoons"],"disc":["Read manhwa I Became the Tyrant of a Defence Game / 디펜스 게임의 폭군이 되었다","Tower Defense & Dungeon Attack RPG\nI saw the ending to the game no one was able to clear.\nBut, when I came to my senses, I was inside of the game.\nIn fact, I was in the tutorial stage, a place where strategy was impossible.\n“I’ll clear this bullshit game no matter what……!”"]},{"title":"Kissing with God’s Eyes Covered","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Kissing with God’s Eyes Covered , When Fate Finds Us, 신의 눈을 가린 채 입을 맞추면","One kiss could save my life.As a prophetess, Noemi can see the futures of those she touches. Yet sadly, as the wife of a god, she sees only death in her own fateful future. But then, a sudden kiss with an unruly merchant brings a vision of life. Could he be Noemi’s key to survival? Or will she be unable to escape her destiny?"," "]},{"title":"Supporting Characters Also Need Some Love","tags":["Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Troubles of Supporting a Female Lead / Supporting Characters Also Need Some Love / The Supporting Role is quite difficult / Being a Supporting Character has its Own Difficulty / 조연도 나름 힘들다","While driven in her life and supported by loving parents, Mihyang Kim has been a sidekick, shadowed by her childhood friend, Shiyeon. When both of them suffer a fatal accident, Mihyang is reborn as Damia, and Shiyeon is reborn as Eileene in a new fantasy world. Surprisingly, their new lives as Nobles and Socialites in this new world mirror their lives back in Korea, and Damia drives herself to find her own path in life, escaping the shadow of her long-time friend. However, with Eileene caught in a web of royal politics and a large conspiracy slowly revealing itself in the kingdom, Damia must find a way to help her friend, and survive this new world herself!"," "]},{"title":"Midnight Cinderella Ikemen Royal Romance ~ The Royal Knight ~","tags":["Fantasy","Romance"],"disc":["Read manga Midnight Cinderella Ikemen Royal Romance ~ The Royal Knight ~","“You are now the princess elect of this kingdom.”","You were just a commoner visiting the palace.\nBut in a twist of fate, you were selected as the kingdom’s princess!\nWhat awaited you was an encounter with the captain of the royal guards.","“I swear to stay by your side and protect you for the rest of my life.”\nA vow that the captain secretly made to you.","Who will you, the princess, choose to be your prince?\nNothing can break this spell—not even the midnight bells."]},{"title":"The Crown Prince’s Secretary: From Red-Light to Royalty","tags":["Drama","Fantasy","Romance"],"disc":["Read The Crown Prince’s Secretary: From Red-Light to Royalty / Koutaishi no Hisho wa Moto Shoufu / 皇太子の秘書は元娼婦","She was only trying to protect her sister… but when the earnest and strict crown prince took a liking to her as a prostitute, she was given a huge leap in a new career?!…"]},{"title":"The Delusional Hunter in Another","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Delusional Hunter in Another","“Otherworldly Misperception Hunter”\nI have a little secret:\nI’m actually from a distant alien planet.\nEven after working myself to the bone without a single day off, no pay, and endless overtime, I had enough.\nSo, to quit my crappy job, I escaped to a far-off planet called ‘Earth.’\nAs a soul, no less!\nBut then…\nI reincarnated into a body that had starved to death?!\nCan Gire, the alien stranded on Earth, successfully adapt without revealing his true identity?"," "]},{"title":"Kim Myeonja the cursed doll","tags":["Comedy","Drama","Fantasy","Horror","Manhwa"],"disc":["Read manhwa Kim Myeonja the cursed doll / Kim Yungja the Cursed Doll / The Cursed Doll Kim Yeongja / The Cursed Doll Kim Yungja / 저주인형 김명자","‘Kim Myung-ja’, a cursed doll born to curse humans. It’s not easy to survive among the successful cursed dolls. Myung-ja wants to be successful like her senior dolls and become the main character in movies and dramas. Today is the first day Myung-ja goes to curse. She has practiced everything she can to succeed in the curse. Do you think she can do it? Kim Myung-ja, doll life! Fighting!"]},{"title":"The villain changes","tags":["Drama","Fantasy","Romance"],"disc":["Read manga The villain changes / 悪女は変化する","Elzanes, the eldest daughter of the Crocus family in the Kingdom of Lobelia, frequents glamorous high society, so people call her a “wicked woman” who flaunts her money and power and has a cold personality. In place of her younger sister Liliel, who works for the peasants in contrast to her, Elzanes heads north alone to marry Lucaruen of the Amaryllis Empire, who calls himself the “Monster of the North”. Lucaruen welcomes Elzanes when she arrives and treats her well, but as they talk about their marriage, they begin to understand each other’s true intentions…"]},{"title":"I Became a Civil Servant in a Magical World","tags":["Comedy","Drama","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa I Became a Civil Servant in a Magical World / 이세계 마법 공무원이 되었다 / Becoming a Mage of the Special Unit in Another World","Monday? Hate it. Tuesday? Hate it. And what I hate the most? Going to work. The civil servant Haeseo-nal feels this way. In his previous life, all he wished for was to be able to use magic as normally as anyone else… But in this life, due to ‘magic’, he’s been living a far noisier life than expected. “Hello, I am Haeseo-nal, a member of the Special Department for Cross-Species Civil Complaints and Resolution.”"]},{"title":"The Witch’s Kiss","tags":["Drama","Fantasy","Romance"],"disc":["Read The Witch’s Kiss / 마녀의 키스","A witch apprentice named Noha, cursed by the Dark Witch, has her powers sealed by a kiss from a boy she met when she was young. In order to break the curse, she comes to the human world to find him.."]},{"title":"My girlfriend is a warrior from another world","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa My girlfriend is a warrior from another world / 내 여자친구는 이세계 용사?!","Jae-yi Lee, who had a crush on his classmate Yun-na Lee, musters up a lot of courage to confess but doesn’t get a response. When he meets Lina again the next day, Lina has changed and looks like a different person…?"]},{"title":"The Emperor, A Thousand Years Younger Than Me, Is Obsessed","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Emperor, A Thousand Years Younger Than Me, Is Obsessed /  천 살 연하 황제가 집착한다 / An Emperor 1000 Years Younger Than Me is Obsessed / Kaisar, Seribu Tahun Lebih Muda Dariku, Terobsesi. / İmparator, Benden Bin Yaş Daha Genç, Takıntılı.","A thousand-year plan was ruined by a beautiful boy raised in the forest.\nIn the end, Ariel abandoned the boy.\n10 years later. That same boy, Cedric, who harbored a grudge for being abandoned, invades the forest.\nAnd Cedric, in the midst of the blazing fire that burns the forest,\n“Let’s get married, Ariel.”\nHe proposed.\nAriel, age-1000+@, occupation-great wizard. (Special note: no magic power)\nI guess… I need to rewrite my life plan?!"]},{"title":"I Was Mistaken for the Villain","tags":["Action","Demon","Demons","Drama","Fantasy","Manhwa","Mature","Monsters","Supernatural"],"disc":["Read manhwa I Was Mistaken for the Villain / Memory in the Maze / 미로 인 메모리","Haechan, who was so weak that he was ignored by everyone, meets a mysterious child named Miro and gains great power. However, at the same time, he discovers that the Sealing Stone, which he believed was protecting everyone, is actually the main culprit behind the world’s downfall. Though he tries to fix things on his own, people who don’t know the truth see him as a villain."]},{"title":"The Villainess Just Wants to Live in Peace!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Just Wants to Live in Peace! / 악녀는 조용히 살고 싶을 뿐인데! / The villainess Just Wants To Live Quietly!","I transmigrated as the villainess of a novel.\nI wanted to get rid of my death flag and live in peace, but I’ve been apparently already whipping and tormenting the final villain.\nI wasn’t the one who has done it, but as I still felt responsible for it, I have been taking care of him, and the villain’s loyalty towards me keeps increasing.\nI just want to enjoy my wealth and honor in peace.\nI don’t know why the story keeps going astray!"]},{"title":"I Became the Contract Daughter of the soon-to-be-ruined Family","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Contract Daughter of the soon-to-be-ruined Family / 곧 망할 가문의 계약직 딸이 되었다","I thought I had regressed from this ragged life, but why has my time-limited life remained the same? I’m ruined… is this how I should live my life…? “This time, I’ll get adopted by a normal family, and live in comfort for the rest of my life!” Step by step, I’m going to take revenge against the one behind my death, and I’ll protect what’s left of my small and precious life! However, did I put in too much effort? “Anisha, you’re perfect.” “I’m going to make this child a future professor.” All I wanted was to survive… “Well, somehow, you’ve passed. I’ll have to adopt this brat.” I ended up with a tycoon I didn’t expect. One whose household will be massacred in a few years! How do I know that? Me too! I didn’t want to! Know that!"]},{"title":"Bizarre restaurant","tags":["Action","Drama","Fantasy","Manhwa","Shounen"],"disc":["Read Bizarre restaurant / Overeating Restaurant / Hero’s Diner /  Extraordinary Restaurant / Gwesik Restaurant / 괴식식당 / 怪食食堂","Gone are the days of stinky tofu, durian, and surströming. Have you ever heard of them? They’re the worst dishes ever! But what if it’s able to help you become stronger?! TERRA’s food, which boasts of the worst taste in all dimensions is brought to earth by the strongest hero, Yoo Seungwoo. Be patient! If you eat and don’t die, even you who are weak will increase in tons of levels and protect the Earth instead of me! “Bizarre Restaurant” will be open even if the world is destroyed!"]}]