[{"title":"I’m Only a Stepmother, But My Daughter is Just So Cute!","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Webtoon","Webtoons"],"disc":["Read manhwa I’m Only a Stepmother, But My Daughter is Just So Cute! / Anakku bahagia aku senang, Aku emak tiri, tapi anakku kiyowo banget!, I’m A Stepmother, But My Daughter Is Just Too Cute! /  계모인데 딸이 너무 귀여워","An alternate retelling of Snow White with a reincarnated Stepmother… I managed to get myself thrown into a story as a stepmother so jealous of her daughter that she tried to kill the girl with a poisoned apple. I’d love it if I could shower my cute and lovely Blanche with all sorts of affection, but– “Hilarious. Since when did you like Blanche so much?” This god-damned husband keeps getting in my way! “I am Blanche’s parent as well. I demand an apology for being so suspicious of me.” “And if I don’t?” “I’ll visit your bedroom tonight, your majesty.” “…..” “I even managed to get some really sexy panties just for you.” With a big smile on my face, I struck him with a critical hit. “I could show it to you right now if you’d like?” The look on his face was truly something to behold. I lifted my chin, and looked down on him victoriously. [hr][i]Note: This is a oneshot promotional webtoon for novel.[/i]\nI’m A Stepmother, But My Daughter Is Just Too Cute!"]},{"title":"The Slave Girl and the Vampire with a Death Wish","tags":["Comedy","Fantasy","Romance"],"disc":["Dorei Shoujo to Shinitagari Kyuuketsuki / The Slave Girl and the Vampire with a Death Wish / 奴隷少女と死にたがり吸血鬼","A slave girl, who was falsely accused of poisoning the guest, escaped into the forest. However, she was attacked by a vampire there. Later on he apologizes to her and suggests granting any her wish. And what she wants is… to become his bride!"," "]},{"title":"Fall in Love or Die","tags":["Adaptation","Drama","Historical","Manhwa","Mature","Romance"],"disc":["Read manhwa Fall in Love or Die / Die or fall in love / 죽거나 혹은 사랑에 빠지거나","In the fair city of Rubern, a string of mysterious murders unfolds. A quiet, unobtrusive Isabella receives an invitation from the killer… A life-threatening wager lasting fifteen days. She must never fall in love, ensnared by any pleasure or illusion."]},{"title":"My Mother Gets Married Again","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Mother Gets Married Again / My Mom Got a Contract Marriage / My Mom Entered a Contract Marriage / 엄마가 계약결혼 했다","Lyrica lived in the slums with her drunken mother.\nAnd then one day…\n“Oh my…so hot…! Hot!”\nMy mother woke up screaming,\n“Liry, you’re alive, but why do you look so small?”\nWhat nonsense are you saying\n“What day is it today?”\nAre you still losing your mind?","“Oh my god, I’m back!”\nMy mom was so freaked out and even said…\n“I have to go to the royal ball and meet His Majesty!”","What nonsense are you talking about? I started to wonder what happened to my mother’s head"]},{"title":"The Villain’s Lament","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villain’s Lament","“She was the heroine sworn to protect the world. He was the villain she was supposed to destroy.” Calcifer Ardor was once the “Great Hero” adored and revered by all. However, his heart of spotless purity was soon tainted with tragic madness. From his fall rose the heroine of the new generation—Asha Beatrix, an S-rank Elementalist skilled with both sword and magic. Little did they know that from a past long-forgotten, lay old flames too unfathomable to comprehend."]},{"title":"Between Jaeyoung and Jaeyoung","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Between Jaeyoung and Jaeyoung / 재영과 재영 사이","Seou’s high school crush, Ha Jaeyoung, has tragically passed away. In a poignant dream, Seou encounters the deceased Jaeyoung and relives their past together, desperately attempting to alter events to prevent his death. However, another Ha Jaeyoung’s demise becomes intricately intertwined, further complicating the present. As Seou navigates this surreal temporal landscape, they race against time to rewrite history and save both Ha Jaeyoungs before the dream’s profound journey concludes."]},{"title":"Memoirs of a Witch","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa Memoirs of a Witch / 어느 마녀의 회고록 / A Witch’s Memoir","Lily, a black witch who was brought to the castle during a witch hunt when she was young and is still used by the king for her power even as an adult. She lives each day enduring both fear and scorn. Then one day, she meets a new court jester. Unlike other jesters, she is disliked for his flattery, but the jester shows favor to the witch. Why does the jester show favor to the witch? Can the witch ever get her free life back?"]},{"title":"The Perfect Male Lead","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Perfect Male Lead","Summary: Having run away from her past, Haeju belatedly enrolled in the theater and film department. She expected a college life full of bright prospects ahead… but she can no longer run away. Torn between a childhood friend and her first love whom she has reunited with, Haeju finds herself unable to figure out her feelings. Her childhood friend, Eunseok, suggests they pretend to date to hide his own feelings and avoid Jay."]},{"title":"Bowblade: (The Descendants of Bowblade)","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa"],"disc":["Read manhwa Bowblade: (The Descendants of Bowblade) / Bowblade Swordsman: Descendants of the Bowblade / Archer Sword God: Descendants of the Archer / Bowblade: The Descendants of Bowblade / 궁귀검신: 궁귀의 후예","Eulji So Moon has aged well and is now a grandfather. He orders his mischievous grandson to go on a joyful trip to Zhongyuan! To save the fallen Namgung family clan and help them spread their wings once more, Eulji Ho’s journey starts now!!"]},{"title":"The Second Male Lead is Actually a Girl","tags":["Adaptation","Crossdressin","Drama","Fantasy","Historical","Isekai","Magic","Manhwa","Reincarnation","Romance"],"disc":["Rosa remembers her past life. She remembers reading about the Helios Empire in a novel before dying suddenly in an accident. When she is reborn into that exact world as Rosa Veronica, she lives day to day and works hard to make ends meet until one day when someone from the Duke of Estella’s estate comes to fetch her. When she arrives and meets her biological father, her life is turned upside down once again as she’s forced to live the life of Rozenta Estella, the sole heir to the Estella estate and the only son of the Duke of Estella. Through the power of magical artifacts, she’s able to live the life of Rozenta, a supporting male character from a novel she once read in a previous life. She decides to embrace this new life as the familiar narrative unfolds before her. Despite knowing the overall story and its characters, she’s surprised that the male and female leads have not become the characters she’s read about. Although Rozenta Estella was just a minor character in the original novel, Rosa learns to navigate the intricacies of his life and family while fostering a budding friendship with Theodore and Vivian. Her happiness doesn’t last very long as all three grow up and enter the roles they’ve been born into.","서브 남주지만, 여자입니다"]},{"title":"I’m Divorced, But I’m a Chaebol","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Divorced, But I’m a Chaebol / I Got Divorced, But I’m a Conglomerate / The Millionaire Divorcee / 이혼당했지만 재벌입니다","Summary:","Even though I was destined to get married in this world overnight, I tried to adapt and live normally, but my trashy husband who thought cheating wasn’t enough, he also asked me for a divorce. I’m already tired of him, so I willingly divorced him and willing to collect alimony to then spend that money… I decided to sign a contract with a jewelry craftsman who was suffering from labor exploitation, and the business started to open one by one. Jewelry, perfume, clothing, cosmetics, distribution… Everything that I touch become a success, which made me a chaebol."]},{"title":"The Tale of the Tiger Girl","tags":["Drama","Fantasy","Historical","Manhwa","Mystery","Romance"],"disc":["Read manhwa The Tale of the Tiger Girl / The Tale of a Tiger / 호랑낭자 뎐","In Joseon’s capital of Hanyang, rumors are spreading of an evil king cursing the kingdom with ghosts. First, there’s the wailing man pulling an empty handcart. Then, a strange corpse appears in a well, turning the water to blood. To investigate, the prince calls his outcast brother, spirit seer Lord Muyoung, who comes down from the mountains with his skittish young disciple Haerang. Can this pair unravel the mystery, or will they too get caught in the web of royal curses and vengeful ghosts?"]},{"title":"I Became A Childhood Friend of A Mid Level Boss","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Monsters","Romance","School Life"],"disc":[]},{"title":"The Villainess Wants to Die Gracefully","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Wants to Die Gracefully / The Vampire’s Plans to Die in Peace / 악역은 곱게 죽고 싶다 on manhwaclan","Wanting to die, he jumped off the bridge and became a vampire who lived forever.\nThe strongest vampire who appears as the villain in the novel.\n‘are you kidding?’\nNo, wait?\nWouldn’t it be easier and quicker to die if you pave a flower path for the vampire hunter Namjoo?\n‘First, let’s start with the ruined Namjoo family.’\nWith overflowing time and money, he raised the family that had to be destroyed in the original work to the peasant family.\nAt this point, will Namjoo grow well?\n“Fried… … Please come out.”\nThen, a 10-year-old male Joo became a reclusive loner.\n‘Why? … ?’\nPlease let me die soon!\n*\nHe became a teacher to the original male lead and a supporter to the original female lead.\nI accidentally turned a dying boy into a family member and saved him, but that wouldn’t be a big deal.\nThen I fell asleep for a while and woke up, and 10 years had passed.\nAt this point, I thought I could go to die soon, so I appeared in front of the original characters.\n“teacher. I don’t care if the teacher is a monster. So please stay by my side again.”\n“I don’t believe in God. The only thing I trust is the supporter unnie who raised me up to this point.”\n… … Why are they here?\n“I made him live as he pleases, he made himself a vampire at his will, and made him tangled up in you,\nAre you going to throw it away now? To what extent are you going to make me miserable?”\nEven the kid from the purebred family has changed.\n“So you too. Everything you want is in my hands.”\nWhat the hell happened in 10 years?"]},{"title":"The Prince Is Convinced That I Addictively Love Him","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua The Prince Is Convinced That I Addictively Love Him / 王爷深信我爱他成瘾","I traveled through time and space and became the spy lurking beside the male protagonist in a novel?! Fortunately, the prince accidentally lost his memory! Next is the highlight moment of my acting skills!! Jing Haoge: You, what did you say?! Zhen Chuyao: I said that we were having sex at that time!! Jing Haoge: ? ? ?"]},{"title":"When The Crazy Emperor Embraces Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa When The Crazy Emperor Embraces Me / 미친 황제가 나를 안을 때","Princess Celeste, living in an abusive situation, saw a glimmer of hope when an opportunity for marriage presented itself. Little did she know, it marked the start of a tragic tale. Terkan, a gentleman with a demeanor contrary to his dark and decadent appearance. Batizo, a wild beast with his prey right in front of him. Caught in the midst is Celeste, torn between the two men. How will the fantasy of jealousy and romance unfold for these three entangled souls…?"]},{"title":"The Esteemed Lady of the Tea Garden","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Supernatural","Webtoons"],"disc":["Read manhwa The Esteemed Lady of the Tea Garden / 홍차 정원의 귀한 아가씨입니다","After being unadopted three times, Camellia is determined to stand on her own and applies for a position at the famous Bloomberry Tea Garden. Though there are unsavory rumors surrounding the owner, Brandon Worthing, the people of his estate treat her surprisingly well, as if she’s a noble lady instead of a mere employee. But regardless of these puzzling circumstances, Camellia flourishes in her new role as a tea maker, moving people’s hearts with her special blends. Little does she know that there’s a reason why Brandon hired her, and that their history goes back much further than she thought…"]},{"title":"Voidman","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Voidman","In a post-apocalyptic world ruled by gods.","To kill the god who took my family, I ventured into death.","“Void, lend me your power. The power to kill a god…!”"]},{"title":"Mountain and Sea Continent","tags":["Action","Adventure","Fantasy"],"disc":["Read Mountain and Sea Continent / Shan Hai Shi / City of Mountain and Sea / 山海师","A programmer reincarnated to the Mountain and Sea Continent, a world full of strange monsters. How will the protagonist survive?"," "]},{"title":"Your Majesty, Please Don’t Kill Me Again","tags":["Drama","Isekai","Romance","Tragedy"],"disc":["Read manga Your Majesty, Please Don’t Kill Me Again /폐하, 또죽이진 말아주세요 / Your Majesty, Please Spare Me This Time / 陛下、今度は殺さないでください / Baginda, Tolong Jangan Bunuh Saya Lagi","Following the emperors unjust massacre of her family and her own miserable death, Laliette Bellua wakes up to find that she is in the body of her 12-year-old self. She immediately sets her sights on a single goal: suck up to Emperor Rupert Edgar Laspe Vellelum and save her family. Laliettes plan is foolproof, except for one tiny detail In her present timeline, the future emperor is still masquerading as a princess named Rapertte! With only a single suitcase and some change in her pocket, she sets out for the capital to become the princesss closest and most beloved attendant. Can Laliette prove her ability to keep a secret? And more importantly, will she be able to win the favor of the cruel and sadistic Rapertte?\nYour Majesty, Please Spare Me This Time"]}]