[{"title":"Secret Marriage","tags":["Adult","Comedy","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Royal family","Smut"],"disc":["Read manhwa Secret Marriage / Matrimonio secreto / สมรสลับ / 밀혼","‘Hwiyeon’ is the daughter of a once powerful family, but now she is only the daughter of a fallen noble. Hwiyeon lives a quiet life, disguising herself as a man to survive. However, her life takes an unexpected turn when she coincidentally encounters ‘Prince Cheongun,’ her former fiancé and the heir to the throne of the prosperous nation of Geumyul."]},{"title":"Adeline’s Twilight","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Adeline’s Twilight / Adeline’s Darkest Night / Adeline’s Deep Night / 아델린의 깊은 밤"]},{"title":"Husband Replacement","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Royal family","Shoujo"],"disc":["Read manhwa Husband Replacement / 남편교체","Asili thought her husband loved her, but her husband Joseph abused her and she died giving birth to a child. Before she could take revenge on him, she opened her eyes and found herself in a pre-marriage phase with him. She felt like she was going to live that hellish life again, so she looked for a replacement husband for her. Asili went straight to visit Duke Esperad Kamedeschi, who was rumored to have been afflicted by a curse after his fiancée died under mysterious circumstances. “Im Asili, i would like to ask Your Majesty to marry me.” “Does what you said mean that you wish to die now?” “Do you think the misfortune that has befallen me is a joke?” Asili knows that he will become emperor, so she tries to win his heart. Moreover, I finally replaced my husband, and my damn ex-husband is still arguing with me. Will Asili be able to take revenge across time and space and succeed in replacing her husband?"]},{"title":"I am possessed by the Sword God","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts"],"disc":["Read manhwa I am possessed by the Sword God / 빙의검신;I am possessed by the Sword God / I Am Reborn As The Sword God","I achieved my cozy life of a seventh-grade civil servant by through a lot of hardships and nights of blacking out, so I was looking forward to the weekends where I could relax and have fun, but that night… Is this Baek Rijin, the main character of the novel ? When I returned to my senses, I discovered I was in the novel I was reading. Did a seventh-grade civil servant like me became the spoiled young master of the great Jaegal family?! A side character, who has received excessive investments and love since he was young, and now going through a stormy period of his life… The spoiled young master of the Jaegal Family, whom the Blood Demon Cult would annihilate ten years later!"," "]},{"title":"Charlotte Has Five Disciples","tags":["Comedy","Fantasy","Romance","Shoujo","Webtoons"],"disc":["Read manga Charlotte Has Five Disciples / Charlotte and Her 5 Disciples / Charlotte Has Five Disciples / Charlotte Y Sus Cinco Discipulos / Charlotte-egeneun Daseot Myeongui Jejaga Itda / Penyihir Agung Charlotte / Syallos-egeneun Daseos Myeong-ui Jejaga Issda / Пять учеников Шарлотты / 夏洛特的五个徒弟 / 샬롯에게는 다섯 명의 제자가 있다\nCharlotte Eleanor is an Archmage that once saved the world. Using her magic to die, she instead, reverses the age of her body of a young child and starts a second life as Aria Lissen. She had a fulfilling life in her first lifetime, except for one tiny regret. In this new life, Aria is determined to find and live for that one thing she never had…LOVE."]},{"title":"In the Cage","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["In the Cage / 인더 케이지"]},{"title":"Ghosting Groom","tags":["Drama","Josei","Manhwa","Romance"],"disc":["Read manhwa The Groom Disappeared / 消失的新郎 / 신랑이 사라졌다","Sarang Jin is one of the most famous actresses in South Korea, and she has it all—talent, good looks, and a loving fiancé… or not! One week before their wedding, her groom-to-be ghosts her. She desperately searches everywhere for Inha, only to discover he’s lied to her throughout their entire relationship. To her dismay, his secret triggers her own personal misfortunes with shamanism. Heartbroken and traumatized by her past, will she be able to accept him for who he is?"]},{"title":"The Emperor’s Replacement","tags":["Drama","Fantasy","Magic","Manhwa","One shot","Romance"],"disc":["Read manhwa The Emperor’s Replacement / Emperor’s Alternate / A Substitute for the Emperor / The Emperor’s Substitute / 황제의 대체자","I hate you to death, but I still can’t let go of you. Even if I send you to fight to your death, you always manage to come back. You are my salvation, and I am your breath, I love you, my one and only fantasy. Recan Tenecvan is the leader of an up-and-coming noble faction, who is considered a rebel due to his overwhelming charisma. Recan, who eventually becomes the country’s first emperor, is an unparalleled genius on the continent. Winter Rotea is betrothed to Recan from a young age, but hides her identity under the alias Leysha, after her household is unjustly accused of rebellion. A genius in magical theory, she must kill the stoic Recan to prove her loyalty."]},{"title":"Cheer Up, Your Highness!","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Royal family","Shoujo","Slice of Life","Webtoons"],"disc":["Read manhwa Cheer Up, Your Highness! / Good Job, Her Highness the Princess / 어화둥둥, 공주마마","There comes a time in every princess’s life where she has to find her prince. But Hayool shuns marriage and wants to remain in the royal palace with her family. This crybaby princess is known throughout the kingdom for her strongheadedness. She’s even earned the nickname of “Eun-Lu,” or silver tears, for her crying fits. It seems that the right prince will never show up to whisk her off her feet. That is until one day, a dashing young man comes into the picture. Sunwoo Juyoung is a mysterious figure who exudes a quiet confidence. He has arrived at the empire with ulterior motives…but slowly but surely, has been captivated by the princess’s charms. However, competition for royal power is heating up and Hayool will be caught right in the middle of everything. Is all fair in love and royalty? Will the crybaby princess find her prince charming or will things become a royal mess…?"]},{"title":"Cafe Midnight","tags":["Adaptation","Drama","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa Cafe Midnight / Late Night Cafe / 深夜カフェ / 深夜咖啡店 / 심야카페","Cafe Midnight isn’t your average cafe. It opens from dusk till dawn, the master never ages, and… it’s a time slip?! There are visitors from different backgrounds and different time periods, all with their own stories to tell. One thing that they have in common? They’ve all somehow found their way to Cafe Midnight, where they can encounter those living in the present, past, and future. No one really knows the purpose of the cafe, but one thing’s for sure– it’s magical."]},{"title":"Beast’s Flower","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Beast’s Flower / The Flower of the Beast / 野兽之花 / 짐승의 꽃"]},{"title":"The Reason for Avoiding Him, the Perfect One","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Reason for Avoiding Him, the Perfect One, Alasan Menghindari Pria Sempurna , 완벽한 그를 피하는 이유 , 完璧な彼を避ける理由 ,Why Are You Avoiding Him? , Reasons for Avoiding the Perfect Guy , Reason For Avoiding The Perfect Man , Maaf kamu terlalu baik buat aku","“This man is the last person I should be involved with! But why is he needlessly handsome and kind?” Yoonji, who entered the world of the novel she was writing, finds that ‘Mari’, the pen name only she knew, has become the name everyone calls her by. Dreaming of a sweet romance while possessing a beautiful lady, she ends up entangled with Enrique, the second prince doomed to ruin! “Have you become interested in me, by any chance?” “Where did it all go wrong?!” A full-fledged otherworld survival romance!"]},{"title":"A Grace Period For a Term","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Grace Period For a Term / A Grace Period For a Period / Grace Period of Period / 마침표의 유예기간"]},{"title":"White Scandal","tags":["Adaptation","Adult","Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa White Scandal / 하얀 스캔들","Once a highly anticipated child actor, Ji Eun-Seol’s life took a sudden nosedive after getting blamed for her brother’s crime. Now living under the name Seol Eun-Seol, she is working as a road manager for a troublesome actor, because she couldn’t let go of her dreams of acting despite of her deep-seated wounds. While working as the manager, she is approached by Dan Yi-Hyeok, the central figure of the past incident. “The scandal involving the grandson and the girl who tried to murder him. In short, a cover-up scandal. I want you to play the opposing role.” “… If I accept this proposal, what will you give me? You clearly promised to be on my side.” “Money. I’ll give you 10 billion won.” Thus, begins the pretend relationship between Eun-Seol and Yi-Hyeok, approaching the buried secrets of the past as time goes on…"]},{"title":"Little Things : Various Alternative Universes","tags":["Romance"],"disc":["Read manga Little Things : Various Alternative Universes"]},{"title":"The witch’s judgement of becoming a flower","tags":["Drama","Fantasy","Manhwa","Psychological","Romance","Thriller","Violence"],"disc":["Read manhwa The witch’s judgement of becoming a flower / 마녀의 심판은 꽃이 된다","Sunhwa, who feels the stench of evil people, meets a scented clove for the first time in her life. But Chenghyang, who she only thought was good, was a witch who turned evil people into flowers… Is there anyone you want to kill?”"]},{"title":"Only Love","tags":["Drama","Fantasy","Romance","School Life"],"disc":["Bully × The first love of many, an interpretation of the deepest love. Reborn as a high school sophomore, it was the best year in Meng Ting’s short life. She wants to live it to the fullest, she wants to dance again, and never mess with the demonic boy who later raises his butcher knife – Jiang Ren. This summer, around the corner of the school building, Meng Ting heard Jiang Ren, the bad boy, laughing wildly: “What kind of girls do I like? Girls like Meng Ting.”","偏偏宠爱 / Piānpiān Chǒng’ài / Stubbornly Doting on You / Destined to Love You"]},{"title":"Back to the Year When My Husband was the Most Handsome Boy in the School","tags":["Drama","Fantasy","Romance","School Life","Shoujo"],"disc":["Read manhua Back to the Year When My Husband was the Most Handsome Boy in the School, Back to the Year When My Husband Was the School Hunk, Chong Hui Laogong Dangxiao Cao Di Na Nian, 重回老公当校草的那年"]},{"title":"Daddy President Is Too Hard To Deal With","tags":["Fantasy","Manhua","Romance","Slice of Life"],"disc":["Read manhua Daddy President Is Too Hard To Deal With","Rumor has it that the president of the Xi group is weird, unpredictable, insidious and mean of doing things but he spoils her to the maximum. Assistant: “Sir, Madam’s hospital has been smashed.” “Where is madam?” “Madam is about to cripple someone .” “Let the doctor go to madam to see if her hand hurts from the beating! Love rivals from all over the world: “Xiao Tian Tian, what’s so great about a cold old man! Come with me and I’ll give you everything. President Xi: “Wife,the babies are calling you home for dinner."]},{"title":"A Whirlwind Campus Affair","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa A Whirlwind Campus Affair / Oh Baram si pelakor / By the Way, in the Wind, / 그렇고 그런 바람에","Rumor has it that Baram Oh had an affair with her married art school professor. It’s been four years since that debacle, and now she’s back at campus to try and enjoy her college life. But she’s not the only thing who’s returned: there’s rumors of a water ghost roaming the halls, and it just might be following her around."]}]