[{"title":"The Villainess Once Said","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Once Said / 어느 날 악녀가 말했다 / One Day the Devil Said","“On this day, six years from now you will die. Della Limiere, because you are the villainess of this novel.” Envious of the opportunities she never had as a girl and eager to learn about new things, Della hears a shocking prophecy from Lissha. She must change her fate and marry a supporting character in order to survive. But why is the emperor threatening this guy and why was he almost assassinated…? Is he really just a supporting character? Then fate takes a turn, and the truth becomes a lie… Will Della survive to the end?"]},{"title":"Emotional Transference","tags":["Drama","Fantasy","Manhwa","Psychological","Romance"],"disc":["Read manhwa Emotional Transference / Transference (Hyang Yu) / 감정전이","Due to childhood trauma, Kong Suah, a freshman majoring in creative writing, has difficulty expressing emotions. She dreams of becoming a novelist, but her dreams, and her relationships are often hindered by those pesky emotions! Then one day, into Suah’s quiet world drops a senior from the physical education department. Wait, what’s wrong with this guy? Why does this big guy keep crying? A growth drama that starts at ground zero, featuring a woman who is emotionally insensitive and a man who is emotionally sensitive!"]},{"title":"The Red Sleeve","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Red Sleeve manhwa, The Red Sleeve Cuff, 옷소매 붉은 끝동","There was a king who was said to be scarier than a goblin.\nAnd there was a court lady who wanted to live a long life.\nStrangely, the two found each other to be unpleasant.\nAnd so they drew closer. Yet, they didn’t get closer.\nWhile they shared one difficult and uncertain step at a time, both kept to their places like a habit.\nHer life was shaken by the king’s sudden feelings for her.\n“Do you really cherish me? If you do, please don’t even greet me in the next life.”\nThis is a sad love story between a king who had to love his country, and a court lady who loved her life, both of whom could never be equals."]},{"title":"Couple Relationship","tags":["Fantasy","Mature","Romance"],"disc":["Read manhwa Couple Relationship","“Let’s have a child.”\n“Do you know how babies are made?”\nThis is how the uneasy marital relationship that devours each other began.","Seung-jae, the grandson of the group and in competition for successor,\nenters into a contract marriage with Yeon-woo, who grew up as the hidden daughter of a chaebol. She was chosen because he thought she was the best partner to obey his words and maintain a superficial marital relationship, but after marriage they began to seep into each other little by little. However, the two people are unable to completely open up to each other, misunderstanding each other, and the conflict deepens. Yeon-woo, who was trying to continue her marriage for Seung-jae, decides to end this marriage for him, and discovers the clues to the terrible incident in the chaebol family hidden behind the two people’s marriage…"]},{"title":"The Young Villainess Sees Through It All","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa The Young Villainess Sees Through It All","Although born into an aristocrat family, Alicia has always faced mistreatment. The main reason was her being an illegitimate child. The only person who showered her affection was her younger sister, Lilian. But she too ended up betraying her which resulted to her untimely death. After waking up, Alicia finds herself back to her seven-year-old self. She notices a ring shining on her finger and she realizes that she’s suddenly able to read people’s inner thoughts. With her “child-like form” and her “mind-reading ability,” she plans to take revenge as a young villainess."]},{"title":"I Met the Male Lead In Prison (2023)","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Met the Male Lead In Prison (2023) / Conocí al protagonista masculino en una celda (2023) / 在监狱捡到忠犬男主 (2023) / 在监狱里驯服了忠犬系男主人公 (2023) / 감방에서 남자주인공을 만났습니다 (2023)","I met the male lead in prison. Okay. I get that I transmigrated into an R-19 tragic romantic novel, but why is he like this? “Bark! Bark! Bark! Grrrrrr…” I can’t believe this guy is held by a curse that makes him act like a beast…And that’s not the end of it, because when he returns to normal for a moment. “I-i-if you aren’t g-going to take responsibility for what you did to me, th-th-then don’t t-touch me!” At any rate, I felt relieved that I probably wouldn’t have any sort of romantic interactions with this guy. A year later… “Th-th-the day I leave this place, please…m-meet up with me!” Well it wouldn’t be a big deal to meet him once. But, then, when I was released from prison… *** “Welcome back. My lovely younger sister.” The day of my release, a man approached me. Turns out, I’m the villain’s sister. “You must have suffered going to prison in my stead. I waited only for you.” …F*ck. My brother’s the male lead’s sworn enemy? *** 3 years later, I met the male lead. He looked totally different than when I last saw him. “It’s been a while, Iana. I’m going to kidnap you now.”"]},{"title":"The Planned First Kiss","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Planned First Kiss / 1st Kiss Was Intentional / Hoodwinked into Her First Kiss / 첫 키스는 계획적으로","When I opened my eyes after a fire, I became a side character in a novel. What am I to do now?Get closer to the heroine? No.Get closer to the male lead? No.I’m going to live a long and simple life!I’ve lived peacefully outside the Emperor’s castle for 3 years. I thought I would be free as long as the novel ended happily as it should.“Who’s th-…”“Servant.”Huh?“I’ll listen to your every command.”“H-Huh?”“If I listen to whatever you say, can we live together?”The servant who came into my easy life.I live a happy life with him. Sometimes he’s a kind servant, and other times, a dear friend…The problem is, I can’t seem to take my eyes off him when he smiles saucily and flirtatiously with those red eyes….Is it because of my feelings?The 30th concubine, Lydia, whose goal is to live a long and simple life and the suspicious servant begin a strange relationship as they start living together."]},{"title":"Aristité was Blessed with a Curse","tags":["Historical","Manhwa"],"disc":["Read manhwa Aristité was Blessed with a Curse","In the Kingdom of Strandeon, one man from each noble family is required to serve in the Order of the Royal Vine, and Aristité is chosen to fulfill this duty for House Theseus. One day, while the order is carrying out a mission, a witch places a curse on Aristité, saying that he’ll lose something important. Everyone in the order thinks that this curse is what transforms Aristité into a woman, but little do they know that Aristité, whose real name is Ariel, was a woman from the start. All the curse did was take away her special medicine that changes her voice. With the help of her friends and cousin, Ariel struggles to protect her secret, but someone in the order seems determined to expose her and land her in trouble…"]},{"title":"Heroes, Demons & Villains","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Heroes, Demons & Villains / Hero x Demon King x Villain / 영웅&마왕&악당","A noble ‘hero’ who punishes evil with the protection of the gods. A powerful demon born with the power of the devil, the last surviving ‘Demon King’. A skilled third-rate ‘villain’ who moves around an evil organization. The villain’s life is now over. I was planning on retiring and spending the rest of my life comfortably, but, the guy who I accidentally picked up was the Demon King. And now, the hero is coming to me to repay a favor, ruining my comfortable retirement life! Ninety-nine demons protecting the villains… May God bless you and die!"," "]},{"title":"The Man Is A Real Dog","tags":["Drama","Fantasy","Romance"],"disc":["Read The Man Is A Real Dog / 这个男人是真的狗","The love story between Song Haohao and the CEO who can transform into a Doberman."]},{"title":"The Strongest Chef in Another World","tags":["Adventure","Fantasy","Shounen","Slice of Life"],"disc":["Read manhwa The Strongest Chef in Another World","Kang Taeyang, a chef who chased his dreams.\nOne day, he lost everything due to a single choice.\nBut an opportunity came to Taeyang, who was spending hopeless days working odd jobs.\n[Aurora is hiring employees.]\nA single line of text changed everything for him!"]},{"title":"I’m the Only One Bullied by the New High School Student","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa I’m the Only One Bullied by the New High School Student","I just thought my life was unlucky, but it turns out that a high school girl has been manipulating my life and making it miserable."]},{"title":"Even Though I Transmigrated as a Villainess, I’d Rather Raise a Cat","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Even Though I Transmigrated as a Villainess, I’d Rather Raise a Cat / I Reincarnated as a Villainess, But Why Did I Become a Cat Butler Instead? / 악역에 빙의했지만, 고양이나 키울래요 / Even Though I Was Possessed as a Villain, I Still Want to Raise a Cat","I transmigrated as Rowaine, the villainess who was executed for abusing a werebeast. In order to escape death, I decided to replace my sister Linier in her arranged marriage. The problem is that Duke Blois, the groom, is a cat werebeast who is known as a bloodthirsty battlefield monster… “My dear, I heard your hobbies include abusing werebeasts like myself.” “I haven’t heard of such a condition stating that women who abused werebeasts could not be Your Grace’s wife, though.” His emerald eyes flashed dangerously at me, I quickly kept speaking before he could say anything. “If my hobby is a problem, then I promise that I will never abuse you, Your Grace.” “Ha– what?” This is the story of a ten-year contractual marriage between a cat lover and a prickly cat werebeast."]},{"title":"How the villainess Alicia saves the country","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How the villainess Alicia saves the country"]},{"title":"Sweet Love in Beast World: I Am the Rain God in Another World","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read Sweet Love in Beast World: I Am the Rain God in Another World, 兽世甜宠：我在异界当雨神,Shou Shi Tian Chong: Wo Zai Yi Jie Dang Yu Shen"," "]},{"title":"Monster Eater","tags":["Action","Adaptation","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Monster Eater / Monster Eater Adventurer","“I’ll get stronger, by eating monsters!” Rude is an E-rank adventurer who possesses only a single skill: Debuff Immunity. Sadly, gathering herbs in miasma-filled dungeons is about the only thing his questionable skill is good for. Being of practically no use in combat, his fellow adventurers ridicule him, calling him a “miasma scavenger.” Rude decides to challenge a new dungeon, determined to clear his nameーuntil disaster strikes, and he’s betrayed by his comrades. Out of items and on the verge of death, he resorts to committing the taboo act of eating monster meat, but…? Thus begins Rude’s adventure of simply eating monsters to gain new skills!"]},{"title":"Breaking News","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Breaking News / Berita Cinta/속보입니다","An ordinary college student, “Lee Ye-Seul”, starts a part-time job at a broadcasting station cafe to meet “Kim Min Jun”, the youngest main news announcer in South Korea. Contrary to her expectations, Min Jun is a very cold person… “Do you know how long I’ve liked you? Why are you being so cold towards me?”"]},{"title":"A Beast Swallowed by a Flower","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Beast Swallowed by a Flower / 꽃이 삼킨 짐승","“A wolf only keeps one female by its side, Lisi.” Iris was called the flower of the Whitlow Duchy, but in reality, she lived a life no better than a weed. The man named Caverant Green, who deliberately approached her to live a comfortable life again, was an extremely hot and beast-like man. Every time she make eye contact with the leader of the beastmen, a dangerous atmosphere blooms between them…"]},{"title":"How to Hide the Emperor’s Child","tags":["Action","Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa How to Hide the Emperor’s Child / Cara menyembunyikan anak kaisar  / 황제의 아이를 숨기는 방법","“You never loved me anyway, right?”\nAstelle’s long-awaited marriage life ended in a day.\nShe worked hard to become Kaizen’s wife since she was ten, but the only thing that was left for her was the stigma of an empress.\nShe was abandoned by the royalty; the man she loved, Kaizen, wanted her to leave.\n“Yes. You’re right. I didn’t love you.”\nAstelle lied for the last time. The man was the reason for her life, but it was also for the sake of the man who was her husband for a day.\nShe thought there would be no contact with him again, but-\n“I think… I might be pregnant?”\n***\nSix years later, Astelle, who reunited with Kaizen, lied again.\n“You… who is that child?”\n“He’s my nephew.”\nTo protect the child."]},{"title":"To Those Who Long for My Destruction","tags":["Manhwa","Romance","Webtoons"],"disc":["Read manhwa To Those Who Long for My Destruction / 원더스 작가님 – 나의 파멸을 바라는 그대들에게","From parents forcibly married, whose only shared passion is mutual disdain, a neglected child is born- Leoni. Yearning for affection as a child, Leoni loses her mother to illness, only for her father to auction her hand in marriage. Enduring three arranged marriages, Leoni faces further hardship when she is falsely accused of a capital offense, seemingly destined for a bitter end. “Those who orchestrated my misery… Every single one of them… shall pay…!” Perhaps by force of will, Leoni finds herself back in childhood, with memories intact—and her ire. Now, she must reclaim her life and seek long-awaited happiness. But first, there are debts of suffering to be paid. And Leoni is coming to collect."]}]