[{"title":"I will temporarily protect the male lead","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I will temporarily protect the male lead / Aku Memelihara Pemeran Utama Pria /I fostered the Male Lead / Babysitting the Male Lead / 남주를 임시보호 중입니다","Fostering the Male Lead I somehow took over the body of a villainess in a novel. Originally, I was supposed to die after coveting the male lead, but instead, I decided to become a rich unemployed woman and enjoy a life full of pleasures. “You said you wanted to raise a puppy, so this brother went to hunt one for you. How’s your brother’s hunting skills?” Until my brother came back after hunting the male lead who had turned into a wolf… * * * Having been forced to look after the male lead, I somehow succeeded in taming him after many twists and turns. Now all that’s left is to look for this mysterious female lead and hand over the leash, then it will be all over. But… “Have you become tired of me ?” “No, not at all.” “Then why do you keep trying to send me to a strange person?” Maybe it’s because he has stayed with me for too long, but it seems he has lost his sociability/social skills and has also developed separation anxiety. “That person is someone very important to Your Highness.” “The only person that is important to me is you.” “Are you sure?” “Yes, because I’ve imprinted,” he whispered and crinkled/curved the corner of his eyes. “On you.” The half-bent, bright yellow eyes were brimming with obsession."]},{"title":"Legend of Star General","tags":["Action","Manhua","Martial Arts"],"disc":["Read Legend of Star General, 星甲魂将传\nSong Yunxiang, the last Star Soul General of the Human Race, brought the system back to the campus era. When he was a teenager, he was blinded by the incomplete soul, because he was weak and could only watch his relatives and friends die in front of him. In this life, he returned with a system rebirth, with 60 years of combat experience and knowledge and technology, and returned to school. From then on, he used to build mechas to fight monsters… The things that have regretted, the people who have missed, this"]},{"title":"The main character hides his strength","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The main character hides his strength / The main character hides his strength / Juin Gongi Himeul Sungim / Main Character Hides His Strength / The Main Character Hides His Power / The Protagonist Hides His Powers / The Protagonists Hidden Strength / 주인공이 힘을 숨김 / The Protagonist’s Hidden Strength","Kim Seong-cheol, the legendary summoner called ‘the enemy of the world’. (Physique Lv. Max) He faced the disaster alone to prevent the coming end of this world, but there was no way to deal with the Demon King, who had turned into a spirit body impervious to physical attacks. He realized that he needed magical power to achieve his goal. Hiding his existence and power, he goes to the ‘Summoning Palace’, the place where he was first summoned to another world, and begins training as a novice wizard…"]},{"title":"Call me the Devil","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Call me the Devil on manhwaclan\n악마라고 불러다오\nA plastic surgeon by day and a devil by night, Hyunshin has the power to seduce anyone with his eyes, but somehow, his irresistible temptation does not work on “Lee Na”, who suddenly appeared one day. Instead, she came to see him with a nonchalant face asking him for chest surgery… Who is this woman?"]},{"title":"Kill The Dragon","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Kill The Dragon / 킬 더 드래곤","“Do everything you can to survive.” Humans were told by their invaders, the ‘Dragons’, that they would be exterminated. Before the world collapsed, the person who will protect the world, a war orphan, Lee Han, awakened as a ‘Psyker’."]},{"title":"Marriage of Convenience to an Obsession","tags":["Demons","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Marriage of Convenience to an Obsession / 계약 남편에게서 집착남의 싹이 보인다","Olga devotes a thousand days in prayer for her husband to sit on the throne, only to be killed at the hands of her cheating husband. The goddess brings her back as her half-sister for a second chance at life, but she still finds herself at the risk of marrying her murderous and adulterous ex-husband once again. Her only hope is to propose a marriage of convenience to the Beast of the Duchy, but a strange turn of events leaves the reluctant duke little choice but to accept the offer. Now, the unlikely newlyweds face struggles on both ends – avenging Olga’s death and figuring out how to share a bed together."]},{"title":"How To Own You","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How To Own You / 너를 소유하는 법 / How to Make You / How to Make You Mine","Mine She have been living with her hands and feet tied tightly for 24 years. If she gets married soon, she’ll become a bird completely trapped in a cage. The day she went to a club for the first time in her life after cheating on a stupid new bodyguard. Ara tries to spend the night with an unknown man in defiance of her father The moment a stranger’s hand tried to grab Ara’s underwear.. «Miss, were you here?» Five years ago, he disappeared without saying anything, and stood at the door as if he had appeared in a dream. The only person in her family that Ara trusted and relied on, Ara’s first love, bodyguard Yoon. ” «The chairman is desperately looking for you.» «Bad guy.. It’s been five years since you appeared.» In order to get him back, he who returned as a different person and as her father’s loyal dog. Ara begins to dig into the secrets that Yoon hides in earnest. Will the two of them be able to fully own each other?"]},{"title":"The Dignity Of Romance","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Dignity Of Romance / A Dignity of Passionate Love / Dignity of Love / Quality of Love / 열애의 품격"]},{"title":"Baby Princess Through the Status Window","tags":["Comedy","Drama","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Baby Princess Through the Status Window / The Status Window to the Soul / A princesa bebê pode ver as janelas de status / Baby Princess Looking at the Status Window / The Baby Princess Can See Status Windows / 看见状态栏的宝贝皇女 / 真実が見える赤ちゃん皇女様 / 상태창 보는 아기 황녀님"]},{"title":"I’ll Give You the Most Rotten One","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa I’ll Give You the Most Rotten One / 가장 썩은 것을 줄게","I’ll Give You the Most Rotten OneAfter 10 years together, my boyfriend cheated on me with another woman.I was devastated and decided to get revenge. I wanted to hurt him as much as he hurt me.So I carefully planned the perfect way to get back at him.I knew it would be the worst thing I could ever do to him, but I didn’t care.I was so angry and hurt that I just wanted to make him feel the same way.Our relationship was already over, but this was the final nail in the coffin.Now, we’re both left wondering if we’ll ever be able to love again.I don’t know if I can forgive him, but I know that I can’t live like this.I need to find a way to move on, even if it means hurting him in the process.I know that what I’m doing is wrong, but I can’t help myself.I’m so angry and hurt that I just want to make him feel the same way.I know that this isn’t the answer, but it’s all I can think of right now.I’m so lost and confused, and I don’t know what to do.I just want to feel loved again.I just want to be happy.Is that too much to ask?"," "]},{"title":"The Worst Villain","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Worst Villain / I Became the Villainess of a Third-Rate Drama / 막장 악녀"]},{"title":"The Things Melvin Left Behind for Them","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Things Melvin Left Behind for Them","“This is a perfunctory marriage we are carrying out for the sake of protecting you and helping your efforts for revenge.” Cheryl, the beloved lady of Neus Castle. One night, her uncle rebels, killing her older brother. She, too, was in danger of being killed. Just as she was about to give up in her last moments, someone comes to save her. “If they want to kill my fiancee, then Neus Castle must be prepared for war.” The Lord of Blaire Castle, Felix, who saves her in the face of a fake engagement. Thus, she begins an unfamiliar married life with the one she had only ever known as her brother’s friend."]},{"title":"Seabird and the Wolf","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Seabird and the Wolf","Chosen by the last remaining Seabird, Lott has been cursed with a target on her back. After the notorious Woohoppiage pirates pillage her village and kidnap her sister, she embarks on a perilous journey to get her back. And she’ll do whatever it takes to make that happen, even if that means joining the Black Ocean crew and pretending to be a man. But she’s not the only one with a secret on this pirate ship…"]},{"title":"How to Hold X’s Leash","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How to Hold X’s Leash / Fais-moi humain ! / How to Hold His Leash X / 의 목줄을 쥐는 법","Not a single day has passed by without Yeonu calling her verbally abusive boss Junhu Kang a “son of a b****”. After being cursed out for the millionth time, Junhu turns into an actual dog. What’s worse is that Yeonu becomes Junhu’s owner, and the only way for him to temporarily turn back into a human is if she touches him. After internally cursing him 317,920 times, Yeonu finally gains the upper hand against her supercilious CEO, who is now an adorable white puppy."]},{"title":"The Mafia Nanny","tags":["Romance"],"disc":["Read comic The Mafia Nanny","Being an Elite Nanny is simple: protect the charge, obey the principle, and don’t get emotionally attached. Easier said than done when Davina’s first client is a dangerously compelling Venetian underboss who’s determined to get under her skin. What he wants from her, she can’t imagine, but Gabriel Angelini drags her back into the glittering world of organized crime she thought she’d left behind forever. She might get answers about her past if she digs deep enough, but can she protect Mikey from his father’s ambitions and keep her heart from getting tangled up in their treacherous web?"]},{"title":"A Master, Who Woke up as a Concubine","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Master, Who Woke up as a Concubine / 고수, 후궁으로 깨어나다"]},{"title":"My Husband Changes Every Night","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Husband Changes Every Night / 밤마다 남편이 바뀐다","“I’ll come to the princess’s bedroom every night.”\nA perishing world\nMy family sold me to the worst tyrant in history.\nBut this man, he’s weird at night.\n“The only one who can heal me is the princess. I need princess.”\nHe unbuttoned. A burning desire was revealed in the flashing light of his eyes.\n‘Do you have to do this every night?’\nAs if to relieve the extremely old thirst, the man endlessly longed for everything about me.\nAnd at the same time, many things surrounding me began to change.\n“I will protect the Empress.”\n“According to God’s will.”\nI was the only savior of the perishing world."]},{"title":"After breaking up, I had relationship with my ex’s uncle-in-law","tags":["Drama","Fantasy","Romance"],"disc":["Read manga After breaking up, I had relationship with my ex’s uncle-in-law / Fēnshǒu Hòu Hé Qiánrèn De Xiǎo Shū HE Le / 分手后和前任的小叔HE了","After experiencing regression, I desperately tried to escape from those scummy men, only to be saved by you. Let’s be together, resisting the destiny we were originally bound for, because we love each other."]},{"title":"I Killed an Academy Player","tags":["Action","Adventure","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa I Killed an Academy Player / I Killed the Player of the Academy / 나는 아카데미 선수를 죽였다","[By the Author that brought you <The Knight King Who Returned with a God>!]\nI killed the player.\nHe was a real son of a bitch…"]},{"title":"Even though I become a side character, I’m being adored by an overprotective duke","tags":["Drama","Fantasy","MANGA","Manga","Romance","Royal family"],"disc":["Read manga Even though I become a side character, I’m being adored by an overprotective duke / モブなのに過保護な公爵に溺愛されています"]}]