[{"title":"Saving My Crown Prince","tags":["Drama","Fantasy","Manhua","Reincarnation","Romance","Royal family","Shoujo"],"disc":["Read manhwa Saving My Crown Prince / 救救我的太子殿下 / save my prince / twist of destiny"]},{"title":"Youngest Princess","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Webtoons"],"disc":["Read Youngest Princess / 막내 황녀님 / The Youngest Princess / The Beloved Little Princess","The archmage who ruled over a magic kingdom. One day, she was reborn as the youngest daughter of the empire! “I’ll just play along and pretend to be a baby. …But don’t you think you guys like me a little too much?” They won’t leave her alone. The youngest princess is tired today as well."," "]},{"title":"The Genius Sales Person: Mind Reader","tags":["Drama","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa The Genius Sales Person: Mind Reader / I Became a Genius Salesman / 天才営業マンへの道 / 천재 영업사원이 되었다","Jihun Min is a diligent and honest medical sales representative who is trying to make a name for himself in a company that is rampant with nepotism. Hence, he is constantly being outshined by his general manager’s nephew, Junseong Choi, who monopolizes sales performance through lobbying and shady tactics. One day, Jihun is blessed with a special ability that could propel him forward in his career. Things are finally going his way and he’s feeling more optimistic than ever, but will Jihun be able to maintain his strong moral compass and not lose sight of what truly matters?"]},{"title":"The Return Of Apocalypses Tyrant","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Return Of Apocalypses Tyrant / 회귀한 아포칼립스의 폭군","25 years after the opening of the Hell Gate, humanity has perished, except for one.\nNamgung, who returned three days before the Hellgate opened after clearing a quest, vows to protect his reunited daughter.\nHe begins to devour the rewards of the 8 martial stars, who are chosen by the Eight Phases, who are akin to gods.\nHaving taken a seat among the Eight martial stars, Namgung clears each of the upcoming festivals (carnivals) with his memories from before the return.\nAnd as he prepares for the things that lie ahead by gathering allies and growing stronger, he starts experiencing events he hasn’t faced even himself…"," "]},{"title":"The Max-Level Player’s 100th Regression","tags":["Action","Adaptation","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Max-Level Player’s 100th Regression / The 100th Regression of the Max-Level Player / 만렙 플레이어의 100번째 회귀"]},{"title":"Transformed Into A Piece Of Land","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Transformed Into A Piece Of Land / 我被变成了一块地"]},{"title":"Lady Baby","tags":["Fantasy","Manhwa","Mystery","One shot","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Lady Baby / Hanımefendi Bebek / La dama bebé / Leidi Beibi / Леди-малышка / 重生为女婴 / 레이디 베이비","Calliope has suffered through nature’s law and many accidents. Her family was murdered and an ongoing war ended her life, but she traveled back in time to when she was born?! While Calliope slowly grows, will she be able to figure out who killed her family and stop them in time?"]},{"title":"Overmortal","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Overmortal / Yinian Xiaoyao / An Idea Is Free and Unfettered / 一念逍遥"]},{"title":"Please Show Up!","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life","Time travel"],"disc":["Read manhwa Please Show Up! / 나타나주세요!","One day, Kim Jiyong, an ordinary student, dreams of Jung Jihye and falls in love with her at first sight. But when he tries to find her… it turns out that the woman committed suicide 2 years ago?! The romantic story of Jiyong who wants to return Jihye’s life, Please Show Up!"]},{"title":"The Duchess with an Empty Soul","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga The Duchess with an Empty Soul / The Soulless Duchess / Binkkeopdegi Gongjakbuin / Istri Palsu Duke / The Duchess With an Empty Soul / The Duchess’ Empty Shell / The Empty Shelled Duchess / The Soulless Duchess / “透明”的公爵夫人 / かりそめの公爵夫人 / 빈껍데기 공작부인","I died miserably, on the day I found out the truth. The truth, that my fiance had a hidden lover and it was my very own cousin. On the second morning, after my 20th birthday, a miracle happened. From that point on, I decided not to believe in love anymore."]},{"title":"The Villainess Is Shy In Receiving Love","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Is Shy In Receiving Love /  The Villainess is Shy to be Loved / The Beloved Bashful Villainess / 악역 소녀는 사랑받기가 부끄러워요 / The Villainess Is Shy In Receiving Affection","My wicked mother brought a girl one day.","She was the Duke’s hidden daughter, Loretta, the heroine of [Duke’s Four Children].","I am Melody, the villainess who was punished by my mother for harassing her.","I don’t want to die like that, so I have to treat her well now.","I fed Loretta, put her to sleep, and played with her.","And then her response was…?","“I hope Melody marries Loretta!”","The endless barrage of affection led me to join her back to the duke and she said, “I’ll stick close to Ms. Melody.”","Have you met someone who is a ‘Fool for Melody’ more than her?","Why am I being loved when I’ve only been kind enough to make myself live peacefully….!"]},{"title":"This is the Law","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa This is the Law / 이것이 법이다","The genius lawyer Noh HyungJin’s justice-executing returner fantasy! Valedictorian of his University, perfect score on the Bar Exam, and even a 95% case win rate. Noh HyungJin was a so-called successful lawyer! While he was fighting against evil, higher powers to make South Korea a just and fair land, he was ruthlessly murdered by National Intelligence Service agents. “He shouldn’t have died…” Noh HyungJin was a man sent by Emperor YeomRa to fix corruption on Earth! However, after ending up in hell without having been able to achieve anything, Emperor YeomRa returns Noh HyungJin back in time… “I should at least give him power so he can protect himself.” What is this ‘power’ given to him by Emperor YeomRa? Will Noh HyungJin be able to change his future as well as the future of South Korea?!"]},{"title":"The Youngest Child of the Family Is Preventing the World From Ending","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance","Royal family","Slice of Life"],"disc":["Read manhwa The Youngest Child of the Family Is Preventing the World From Ending / The Youngest Is Preventing the End of the World / 막내가 세계 멸망을 막는 중이래요","“The stupid youngest one, the one who doesn’t know how to do anything, but causes trouble with her cute face.” Exasperated, I looked in the mirror once again and exclaimed. “Why am I the ‘stupid youngest one’ Diana Cartier!” In the novel 「The Ending Can’t Be the Destruction of the World」, Diana is an evil woman who repeatedly commits evil deeds and is brainwashed by the villain, contributing greatly to the destruction of the world! If something could go wrong for the villainess, it will. But when something went wrong for me, I recalled my past life instead? As an ordinary college student in my past life, I made up my mind when I realized that I had been reincarnated as Diana Cartier, the villainess in the novel. “The world is going to end.” “But I’m not going to let it happen.” Yes, I will prevent the end of the world with my own hands! And save my brothers from the conspiracy at the same time! Wait a minute. What’s that pitch black thing on the floor over there? Wait. That face, where have I seen it before? ‘Is it Linus del Stein!?’ Why are you lying there, Mr. Protagonist of the novel that will destroy this world? Diana and her brothers are trying their best to stop the end of the world! And cute animals and other stuff? Our sweet youngest is preventing the end of the world, get out of the way!"]},{"title":"A Prenuptial Contract","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read Le contrat prénuptial / Prenuptial Agreement / The Pre-Nup / 혼전계약서 / 婚前契約書","Seung-Hee is young, pretty and leads her own company! The only problem is that a past trauma blocks her from getting into a relationship. One day, she learns that she is in the center of a long ago arranged marriage with the handsome and talented Han Mu-Gyeon. She has no choice but to get married, but she will leave nothing to chance and draws up a prenuptial agreement.\nAlternative Name"]},{"title":"The Daughter of the Elemental King","tags":["Adventure","Drama","Fantasy","Mystery","Romance","Supernatural","Webtoons"],"disc":["Read manhwa The Daughter Of The Elemental King / Daughter of the Spirit King, / 정령왕의 딸","Her father is the Water Elemental King, a timeless being with absolute power. Her mother, a half-elf, is a talented wizard as well as an elemental mage. Born out of their overwhelming love for each other, her birth breaks the notion that elemental spirits cannot have descendants! From the author of “Tales of Arin”, an unexpectedly sweet story of joy unfolds! (Summary from Kakao, TL from Mini Mochie)"]},{"title":"The Baby Saint Wants to Destroy the World!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Baby Saint Wants to Destroy the World! / The Baby Saint Wants to Destroy the World!-Baby Saint Wants to Destroy the World! / 아기 성녀님은 세상을 멸망시키고 싶어!"]},{"title":"The Elegant Sea of Savagery","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga The Elegant Sea of Savagery  / 우아한 야만의 바다 / The Elegant Sea of Barbarism\nIrina Nodiac, the eldest daughter of the Marquis, was entrusted to Count Elenoa Schuberg after her father’s business continued to fail. All rights were handed over to Elenoa, whom she has known since childhood. “You belong to me. So don’t go messing around.” “Are you treating me like an object?” However, even though she became a maid, her reputation of a “Crazy Bitch” during Academy days will never change. And now, Irina, who is self-disciplined and confident, stands in front of Elenoa. “I can do more than what meets the eye. I can carry a lot of stuff.” Elenoa, who wants to own her completely, and Irina, who is trying to move forward despite difficult situations. What kind of voyage will they embark on in the future?"]},{"title":"I’m Actually a Cultivation Bigshot","tags":["Action","Manhua","Martial Arts"],"disc":["Read manhua I’m Actually a Cultivation Bigshot , I am a Cultivation BigshotSo I Am the Godfather of Immortal Cultivation, Turns Out I’m a Great Cultivator, Yuán Lái Wǒ Shì Xiū Xiān Dà Lǎo, 原来我是修仙大佬 , Yuan Lai Wo Shi Xiu Xian Da Lao","The Immortal Dao is ethereal, and Immortals are hard to find. Li Nianfan had descended into the cultivation world as a mortal. After learning that he has no hope in cultivation, he only wants to live a peaceful life. However… The dog he adopts becomes a demon king of a generation when it sees his poems and paintings. It manages to suppress an entire world. The tree he plants behind his house becomes a World Tree after listening to his zither music, forming a bridge between heaven and earth. He meets a passerby who is enlightened by him and becomes an immortal sage who leads an entire generation. When he looks back— It turns out that the scholar who had been pestering him for his calligraphy and paintings despite having crappy chess skills, is a chess saint from the Immortal Realm. The beautiful woman who comes to listen to his music every night is the number one saintess of the Immortal Realm…"]},{"title":"North by Northwest","tags":["Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read North by Northwest / NORTH X NORTHWES / NORTH BY NORTHWEST,북북서로 진로를 돌려라","A famous pirate in the southern oceans, “Lil Shades” During her peaceful journey, a shocking news falls upon her. “The admiral is coming.” There were chills on her back despite the hot weather. Lil took her eyes off her hands and looked up at Alain. She’d heard him, but she wanted to check again."," "]},{"title":"Another World Dump Truck","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Another World Dump Truck / 이세계 덤프트럭","One day, ‘Yul’, the president of a “different world dump truck office”, for the first time kills the one who is not his target, ‘Kwon Yoo-jun’. Yul, who entered a romance fantasy novel to rectify his mistake, tries to return Yu-jun, who has become a villain, to the original world, but various events twist and end up trapped in the novel. After being scattered with the office staff, Yul, who does not know the specifics of the novel, tries to find a way to escape, but is in trouble because of Kwon Yoo-Jun, who talks nonsense about living as an aristocratic lady in a new world."]}]