[{"title":"The Mistress Runs Away","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Mistress Runs Away","Ever since that fateful rainy day when she was rescued by the handsome Duke Killian Devonshire, Rowena has lived as his mistress. Though she believes that Killian has grown to love her over the past three years, she wants to repay her debt to him and become his equal so that she can stand proudly by his side. But when Killian begins to behave strangely, her trust in him wavers, only for it to be fully broken the day he introduces another woman to be his future wife. Thus, Rowena decides to make some drastic changes to their relationship. But will it be for better or for worse?"]},{"title":"Lee Seob’s love","tags":["Comedy","Drama","Fantasy","Manhwa","Office Workers","Romance","Slice of Life"],"disc":["Read manhwa Lee Seob’s love / 이섭의 연애 / Lee Seop’s Romance / Yiseob’s Relationship","10 consecutive years ranked 1st in job performance! The top employee following the fastest and youngest promotion path! My motivation for joining, Kang Minkyung, who gave me the experience of being in 2nd place for the first time, while I’ve always been 1st. She, who trampled on my pride, is now the secretary to Executive Director Tae Lee Seob, me. With her exceptional work handling skills, she even tries to take care of my tasks? Stop working and pay attention to me, Ms. Kang Minkyung! The epic office romance between Tae Lee Seob, who doesn’t want to do anything, and Kang Minkyung, who must somehow succeed!”"]},{"title":"Link Click","tags":["Action","Adaptation","Drama","Manhua","Time travel"],"disc":["Read manhwa Link Click / 时光代理人 / Shíguāng Dàilǐ Rén","Sitting in a corner of the city is a seemingly normal shop called ‘Time Photo Studio’. The shop owners, Cheng Xiaoshi and Lu Guang, can dive back in time through photos. One day, an uprising star in the Chinese opera world — Lin Kai — visited the studio and tasked Cheng Xiaoshi and Lu Guang to find a cassette tape from 10 years ago. They only have one photo, and one chance…"]},{"title":"The Mighty Extra: One Girl Changes the World","tags":["Adaptation","Adventure","Drama","Fantasy","Historical","Isekai","Magic","Monsters","Romance"],"disc":["Read manhwa The Mighty Extra: One Girl Changes the World / This Overpowered Extra Will Change Your Life / 脇役だけどチートキャラなんで、人生変えて差し上げます！ / 먼치킨 엑스트라 / 먼치킨 엑스트라가 인생을 바꿔드립니다","It’s easy to overlook the extras in a novel, but when one avid reader wakes up in the body of “extra” extraordinaire Princess Lyla, she’s ready to shed the side character image and step into her mightiest form! Armed with hidden magic more potent than the empire of Belliana has ever seen, Lyla is ditching the palace in favor of a nobler mission–protecting her bias at all costs! Now she must rescue Fian, dreamy descendant of the Kylon Dragon Empire, so he can have his happy ending with the story’s heroine. That is, assuming the heroine is still Princess Helene…"," "]},{"title":"The Billionaire’s Replacement Wife","tags":["Manhwa","Mature","Romance"],"disc":["Read manhwa The Billionaire’s Replacement Wife","River lived in a loveless marriage for years to a handsome billionaire, Noah De Marco. His love died seven years prior and he needed a woman to become a replacement wife, to carry his children and warm his bed at night. River agreed to the agreement, secretly hoping he would someday love her for who she was, and not a placeholder for his deceased first love. But it seemed, even after six years of marriage, he never did. Finally, River must decide whether she could continue the life she had known all this time, or leave behind her husband and his children and start afresh somewhere. Would she do it? Could she do it?"]},{"title":"Brinny And The Empty Seat","tags":["Drama","Fantasy","Manhwa","Mystery","Romance"],"disc":["Read manhwa Brinny And The Empty Seat / 브린니와 빈자리","A story about a possessor in a book who would even commit murder to achieve their goals."]},{"title":"She No Longer Wields Her Sword","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa She No Longer Wields Her Sword / 여기사는 더이상 검을 들지 않았다"]},{"title":"Naughty Pink XX","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Naughty Pink XX / Obscene Pink XX / 음란한 핑크XX","“How can it be so pink?” Eunha stumbled upon the sight of her younger brother’s friend Woo-gyeom, whose crotch was emitting a clear, bright pink hue. Following that, Eunha instinctively couldn’t take her eyes off the thing between Woo-gyeom’s legs… “Are you good-for-nothing, noona?” Eunha was caught peeking at Woo-gyeom, and then he said, “You’re the only one who’s seen my body, right? Wouldn’t it be fair if you showed me yours, too?” The situation took an unexpected turn…"]},{"title":"The Promise Isn’t Mine","tags":["Drama","Fantasy","Manhwa","Mystery","Romance","Royal family","Tragedy"],"disc":["Read manhwa The Promise Isn’t Mine / 약속을 한 건 내가 아니야","“Kill me, as you promised.” When her twin sister Leyla, the Holy Maiden, suddenly disappears one day, the ordinary Elena finds herself having to marry Crown Prince Kyle, a man infamous for his ruthlessness, in her stead. After a dreadful marriage ceremony, Kyle demands that a certain promise be fulfilled, to Elena’s confusion."]},{"title":"Lady Dragon","tags":["Manhwa","Romance"],"disc":["Read manhwa Lady Dragon","A being that appears to be human, but is stronger than them, Shil. These mysterious beings scattered throughout the world, remain dormant unless Simeone bestows them with a name. After that, their only purpose is to protect that person. Julitan, a simple cook in a small fishing village, encounters a Shil and gives her a name that resembles her crimsom eyes. “Please, tell me my name”. She requests. “Kanellian, the contract holder of noble souls, swears to become the servant of Knight Julitan as her master.” However, Julitan soon realizes that his ordinary abilities cannot handle Kanellian’s extraordinary powers. In the end, he embarks on a long journey to find a new contract holder capable of matching her formidable abilities…"," "]},{"title":"Thumbs Up, Level Up","tags":["Action","Adaptation","Adventure","Comedy","Demons","Drama","Fantasy","Magic","Manhwa","Monsters","Romance","Sci-fi","Si-fi","Supernatural"],"disc":["Read manhwa Thumbs Up, Level Up / Leveling up With Likes / Leveling up With Thumbs Up / Thumbs-up Leveling / イイネでレベルアップ / 따봉으로 레벨업","Um Jicheok was just an underappreciated hunter’s assistant until an odd dream and a simple thumbs up triggered his awakening as a hunter and hot GodTube influencer. Jicheok doesn’t earn points by killing monsters though. Instead, he must do good deeds and gain the approval of others. So, when a heroic video of him goes viral and top companies start wooing him with contracts, it seems like the sky’s the limit. But will fame be a more dangerous game than our rising star expected…?"]},{"title":"The Dignity of a Chaebol","tags":["Drama","Fantasy"],"disc":["Read manhwa The Dignity of a Chaebol / 재벌의 품격","Son Joong-gil, the chairman of the Jaekyung Group, a prominent figure in South Korea during the 1990s, closes his eyes and, 30 years later, opens them as his grandson, Son Jung-hoon, in 2022. Compared to 30 years ago, the Jaekyung Group has noticeably declined. Son Joong-gil is determined to restore the group he built back to its former glory."]},{"title":"Demon King Who Lost His Job","tags":["Action","Comedy","Manhua"],"disc":["Read manhua Demon King Who Lost His Job / 失业魔王","He is the king of the demon who has become unemployed because of his impeachment. She was brave hero who was laid of because of a failure of expedition. The bond of destiny binds the two together as they embark on an journey full of unknown adventures."]},{"title":"True Sword","tags":["Action","Adventure","Fantasy"],"disc":["Read True Sword","Dam Sebi, renowned as the greatest strategist and the most powerful master in Murim, is counted as the foremost among the Five Great Heavenly Kings. Despite having stopped the fight between the Murim’s supreme masters, Tak Mu-Gi, the Mad Blood Warrior, and Baek Li-Dan-Mok, the Lord of the Northern Ice Palace, using only simple techniques, he suddenly left Murim five years ago and wandered outside."]},{"title":"Ygret","tags":["Action","Comedy","Fantasy","Manhwa","Reincarnation","School Life","Shounen"],"disc":["Read Manhwa Ygret / Egrette / Egret: The Great Sage / Yigret / 이그레트","Ygret, a great sage that knows how to use all 4 elements, woke up in a body of prince Judas Lubarjan. “now I dont want to give up living with people”"]},{"title":"Deadlines are Raining in the Status Window","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa Deadlines are Raining in the Status Window / 상태창에서 시한부가 빗발친다"]},{"title":"My Fair Maid","tags":["Drama","Fantasy","Historical","Josei","Romance","Shoujo","Webtoons"],"disc":["Read manhwa My Fair Maid / 마이 페어 메이드","Sandy, an adorable maid, whose hobby is cleaning, becomes a fiancé of the young master, Killian, who is a ladies’ man with a snippy attitude. One day, when it was thundering, Sandy was possessed by Alexandra, the prettiest socialite. She becomes a fiancé of Killian, the young master of the highest noble family, who has been mesmerized by Alexandra! However, they are their worst enemies. To go back to her body, she pretends to be Alexandra, hiding her true intentions."]},{"title":"If You Wish for My Despair","tags":["Adaptation","Fantasy","Manhwa","Romance"],"disc":["Read manhwa If You Wish for My Despair / To You Who Desire My Despair / To You Who Wish For My Despair / あなたが私の絶望を願うなら / Anata ga Watashi no Zetsubou wo Negaunara / 나의 절망을 바라는 당신에게","An orphan Anastasia, despite being of noble birth, was unable to afford to eat because of debts left behind by her parents. One day, her uncle, the Earl of Everdeen, proposes that she marry Theodore, a rival duke, in exchange for repayment of her debts, and Anastasia is sent to live with him. However, what awaits her is a life of ridicule, not only from Theodore but also from the maids. She is served with a messed-up dress and rotten food, and eventually, Theodore tells her, “It’s a good thing your parents are dead.” Anastasia is lonely and in despair, but one day she meets a man at a ball, and her destiny is changed forever."]},{"title":"After Transmigrating Into the Book, I Raised the Sickly Side Male Character to Be the Yandere","tags":["Drama","Fantasy","Historical","Manhua","Romance","Time travel","Transmigration"],"disc":["Read manhua After Transmigrating Into the Book, I Raised the Sickly Side Male Character to Be the Yandere / 穿书后，我养的病弱男配成病娇了","Jiang Nian likes the book’s beautiful men to be courted, he has a long way to life, no love, still died in the book! In the chance of accident, Jiang read to wear books as a man’s close maid, facing the poor cubs who have not grown sick, Jiang Jiang read to play her mother’s property, love to the end. But I still got my cubs out… …?"]},{"title":"Fuchou Airen","tags":["Drama","Fantasy","Romance","Yuri"],"disc":["Read manhua Fuchou Airen / Revenge Lover, Vengeful Lover, 复仇爱人, 復仇愛人","Yan Shuangshuang watched her former lover die before her eyes. An angel appeared, giving her a chance to live again. However, after her rebirth, everything went wrong."]}]