[{"title":"Reincarnation Of The Heavenly Demon","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Reincarnation Of The Heavenly Demon, Reincarnation Heavenly Demon , Reborn As The Heavenly Demon, 환생천마","Cheon Ha-jin, the supreme leader of the Iron Blood Alliance, wakes up in the body of “Byukli Dan”- the disgrace of his family!\nHis hobby is gambling, and he has been locked in a dark warehouse for a long time. Once a supreme martial master, Cheon Ha-Jin became the renowned trash overnight.\nLet’s start again to reach a state I could not achieve in ny previous life."]},{"title":"How to Survive As The Devil’s Daughter","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How to Survive As The Devil’s Daughter / How to survive as the devil’s child / 我在死敌家当团宠 / 魔王の子として生き残る方法 / 마왕의 아이로 살아남는 법","The world is doomed. Again. No matter how much I used dragons to try to prevent the end of the world by repeating nearly a thousand recurrences, I could never change the ending. Now, i’m tired. Returning is also boring. How old will I be back this time? Regression, I don’t want to do it again.","“Ugh.” for a moment! What is this voice! What are these small hands like maple leaves!\n“Who abandoned this newborn baby?”","This life has returned to being a baby! And that too, in front of the mansion of Lucas, the man who is destroying the world thousands of times!","What a new baby! A newborn baby who can’t even move her arms or neck properly! No, let’s calm down for a moment and think. This life may be a great opportunity to prevent the end of the world while closely watching Lucas. Watch out for me and be nervous, Lucas. This time I won’t let you destroy this world! I raised my voice and laughed viciously. ahahahaha Ahahahaha!","“Carrrrr.”\n“Oh my goodness. My baby has a cute laugh.”"]},{"title":"The Regressed Son of a Duke is an Assassin","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Regressed Son of a Duke is an Assassin / The Regressed Youngest Son of the Duke is an Assassin / 회귀한 공작가의 막내도련님은 암살자","[By the studio that brought you <Solo Leveling> and <Revenge of the Iron-Blooded Sword Hound> and <Solo Max-Level Newbie, and many more!]]\nCyan Vert, the best assassin of the continent, meets a pitiful death after having been betrayed by his own brother, whom he had trusted all his life. If I were given another chance at life, I would live it differently. I would only trust myself, and achieve all the things I want on my own without serving anyone else but myself. That is how I was given a second chance at life. The Cyan Vert, a shadow who lived for others, is no more. I will now pave a path on my own, for myself!"]},{"title":"The Lost Stiletto Affair","tags":["Comedy","Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa The Lost Stiletto Affair / I’m in Love (INO) / 初体験なので、俺の責任取ってください / 爱情，进行时 / 사랑, 하고 있어","After her ex-boyfriend dumps her to marry the boss’s daughter, Cha Eunseo swears off love and gets a job at a rival company for a fresh start. But her plan goes awry when she has a one-night stand with her new sexy CEO, Lee Wonwoo! Eunseo runs from the hotel, leaving behind a heel that Wonwoo uses to find her. She wants nothing to do with him, but his interest in her only grows. With such a fervent suitor, can Eunseo stay away from love? Or can Wonwoo bring her the happy ending she wanted?"]},{"title":"Food Chain","tags":["Manhwa","Romance"],"disc":["Read manhwa Food Chain  / 天敵の彼は私の契約者 / 먹이사슬 (덤벙이)","I, Go Eun-woo, have lived while hiding my status among humans. I used my abilities to reduce the pain of scarlet fever, the fate of the Tiger tribe, which I have suffered from since I was 18, but was discovered by the Tiger’s natural enemy, Imae.\n“Don’t be so foolish. If you run away, you’ll die by my hands in a month or so.”\nMoreover, this cold and frighteningly handsome Lee Mae,\nI can’t believe I have the same seal as Lee Do-hoon. I bought time by lying, but it’s only a matter of time before I get caught. I have to escape from his grasp somehow… !\n“Please stay in my room with me for the time being.”\nCan I go back to my normal daily life?!"]},{"title":"I’m Being Raised by Villains","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Being Raised by Villains / Raised by villains / 악당들에게 길러지고 / 악당들에게 키워지는 중입니다","I thought I was an illegitimate child… but it turns out that I was a complete stranger?!","A year after transmigrating as an extra, I found out that I was on the verge of being kicked out.","I said I’d rather leave the house on my own.","“Actually, this child is my daughter. Right, daughter?”","Did I catch the attention of the psychopathic duke?","‘I heard that the money he gave after playing with someone was enough to buy an island?’","I got along with him as his daughter because I thought I could get his fortune later on. And a few months later, I would leave his house with a thick bank account.","“Stay by my side until I tell you to leave.”","However, my dad, who regarded me as a toy, came looking for me and held me back.","***","After returning home due to dad’s persuasion, the families and my dad fought to adopt me. My uncles and aunts gathered to protect me, and future psychos began to have strange obsessions over me.","“Happy Birthday, Ayrin. You’re the head as of today.”","On top of that, the duke’s position was my birthday present.","Everything is going just as I expected.\n[Hey, how long are you going to sleep? Grandma told you to take your retainer off!] [Cha Miso, you’re going to die!]","What is that voice?\nWill I be okay like this?"]},{"title":"Black Killer Whale Baby","tags":["Drama","Fantasy","Isekai","kids","Magic","Manhwa","Romance"],"disc":["Read manhwa Black Killer Whale Baby / The Éminence Grise Orca Baby / The Mastermind Orca Baby / 흑막 범고래 아기님","One day, a little kiddo appeared before me. “” Do you happen to know where the academy is? I have to go there! “” You’ve been heading in the wrong direction this whole time. “” !!! “” What are you looking at, old man? She was just like a daughter. “” Do you want one? But I don’t think she knows that I’m her father. ······· You’re probably thinking that, right? If you think so, you’re mistaken, pops! My name is Calypso. a four-time regressor. My life was ruined when I possessed a character of a novel. I even possessed a child! The third episode of my life was an end to extermination! “The male characters who are crazy about female characters!” Yes, somehow I get back on my 22nd birthday no matter what I do. However, I only realized it on my third life, after the Dragon Duke went mad. If the dragon runs wild, the world will be distorted! But can I go back home when all of this is happening? When I came back for my fourth life, I decided to use him. Pops? Guys? he’s just a stepping stone to meet the dragon! “Wait for me, dragon-nim!” [I want to die now, but I’m going crazy with all these repeated returns.] [My family is tied up with the royal family] [Does anyone ever hear about the weak?/ Only the strongest ones are happy]"," "]},{"title":"Hopefully, at Your Mercy","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Hopefully, at Your Mercy / 바라건대, 당신의 자비를","I, Han Ji-an, was living an ordinary life in South Korea. Then one day, I woke up inside the very novel I had been reading! The real problem? This is my second time transmigrating, and I’ve ended up as a completely different character. Worse yet… I’ve become the duchess known as a fool?!?! While I’m still reeling from the shock, the imperial prince of this world, Grand Duke Iskan Anagrock, shows up… “You’re telling me I was your lover? That’s impossible!” “Take me. I will surely become your most prized possession.” As if being stuck as a fool wasn’t bad enough, now I have to deal with this unreadable man… Can I really survive here?"]},{"title":"The Foreign Object was Me","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Time travel"],"disc":["Read manhwa The Foreign Object was Me / 이물질은 나였다"]},{"title":"Absolute Threshold","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa Absolute Threshold / 절대역 [완전판]"]},{"title":"The Heroine Had an Affair with My Fiance","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Heroine Had an Affair with My Fiance / Siella’s Revenge Affair /  ヒロインと私の婚約者が浮気した / 女主和我的未婚夫出轨了 / 當女主角劈腿我的未婚夫 / 여주가 내 약혼자와 바람났다"]},{"title":"Remarried Empress","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Remarried Empress / L’impératrice remariée / La Emperatriz De Volvio A Casar / The Remarried Empress / The Second Marriage / 재혼 황후 / 再婚皇后 / 再婚承認を要求します","Navier was the perfect Empress and a masterful administrator and regent for the empire; however, she and the Emperor were not lovers, and the Emperor wanted a wife, not a colleague. And so, he sought a concubine and placed a secretly ambitious slave girl beside him. That was fine, as she was willing to allow him his concubine of choice… until Navier heard the Emperor promised the slave girl the Empress’ position. After much agonizing, Navier decided to marry the king of the neighboring kingdom.","The popular web novel Remarried Empress is adapted to webtoon!"]},{"title":"Heavenly Demon Tavern","tags":["Action","Adventure","Fantasy"],"disc":["Read Heavenly Demon Tavern / A Thousand-Horse Guest Cup / Thousand Horse Guest Glass / 천마 객잔 / Cheonma Guesthouse","One day, Joo Kang-hyun, a stranger who fell into the world of martial arts, rose to the position of Heavenly Demon after going through countless hardships. However, he always missed his hometown, the 21st-century Republic of Korea. He thought he would return to his hometown once the proper array was activated, but instead, he regressed to the past.","Gosh… The Heavenly Demon, Joo Kang-hyun, went back in time! In order to save the Youngrae Tavern which was on the verge of bankruptcy, he cooked delicious Jajangmyeon and Jjamppong! This tavern was the place where he lived with the three siblings who took care of him when he first entered Murim, Soran, Doran, and Unyoung. Although their business was not going well, they lived happily in their own way. In the future, after he became The Heavenly Demon, he heard news that their lives all ended miserably. He planned to stop their misfortunes himself. How? With Future Vision, Demon Lord Qi and Jajangmyeon!","*Jinbeob : This is a term in the murim world that means ‘formation/array’ which in some cases refers to the formations used by soldiers or groups of people in battle, but in some cases it also refers to formations used to distort space in order to manipulate the opponent’s mind and make the opponent fall into the illusion desired by the attacker, we can also call it a ‘hidden space’"]},{"title":"The Great Mage of the Hero’s Party Reincarnates","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa The Great Mage of the Hero’s Party Reincarnates / 용사파티 대마법사의 환생","The Battle Against an Arch-Nemesis, Resumed After 300 Years\nAt age 13, the genius wizard Rin embarked on a journey with Lista and the hero party to defeat the great evil known as “the Abyss,” which sought to plunge the world into chaos. But as the battle grew more intense, Rin’s body succumbed to the dark poison of the Abyss, putting his life in grave danger.\nWith the words “I’ll come back,” Rin’s soul entered a forced dormancy, only to reawaken 300 years later as a noble boy. Starting his second life in a peaceful world, Rin discovers that on one side of the world, the destined forces of darkness are beginning to stir once more."]},{"title":"Player Who Returned 10,000 Years Later","tags":["Action","Adventure","Comedy","Fantasy","Martial Arts"],"disc":["Read manhwa Player Who Returned 10,000 Years Later","One day, out of the blue, he falls into hell. All he has with him is his desire to live and predatory powers. From the thousandth hell to the nine thousandth, he‘s devoured tens and hundreds of thousands of demons, and even the seven archdukes bowed down to him. “Why do you wish to go back? Your Highness already has everything in hell.“ “Everything, my ass.“ There’s nothing to eat or enjoy here! Hell’s nothing but desolate land full of terrible demons! “I will return.“ After ten thousand long years, he finally returns to Earth."]},{"title":"The Count’s Youngest Son is A Player","tags":["Action","Fantasy"],"disc":["Read manhwa The Count’s Youngest Son is A Player / 백작가 막내아들은 플레이어","Bae DoHyun lost his life because of the major guilds’ evil plan. He then possesed the main character in a game that’s still in its beta service.\nReincarnated as Rich family’s youngest son, Raul.\n“I’ll take it all this time!”\nFrom Rank 1 player to the most powerful NPC, his new story begins."]},{"title":"Grand Duke of the North","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Grand Duke of the North / 북부 대공"]},{"title":"SSS Grade Saint Knight","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua SSS Grade Saint Knight, SSS级超越常理的圣骑士, SSS-Rank Paladin Who Transcends Common Sense","The game descended on reality, monsters run rampant, magical disasters overflow, everyone needs to choose a class and level up to become stronger. Zhou Yi who has been unremarkable until now awakened the S+ rank talent Protection of the Sacred Angel on the day of class awakening, turning his class into the hidden class Sacred Knight! Weapon blessing, angel blessing, honor blessing… With all sorts of buffs, Zhou Yi destroyed the space itself with just his aura. Who was it that said sacred knight is just a mundane class?"]},{"title":"Undercover! Chaebol High School","tags":["Action","Manhwa","Romance","School Life"],"disc":["Read manhwa Undercover! Chaebol High School / 잠입! 재벌고 / Infiltrate! Chaebol","“Da-Kyung”, a member of an elite gang, loses her boss, who was like a father to her. After realizing that all of this was the doing of “Chairman Lee”, there was nothing she wouldn’t do to get revenge. However, it is not easy to approach the person behind the “private group.” Just when she was about to give up, she got her hands on information about Chairman Lee’s son. For her final mission, Da-kyung goes undercover at a chaebol high school…"]},{"title":"The Second Eunuch Regains His Manhood","tags":["Action","Adventure","Fantasy"],"disc":["Read The Second Eunuch Regains His Manhood","The eunuch Lee Cheolsu, a secret power figure who controls the affairs of the empire at will. He possesses absolute power, wealth, and even strong martial arts skills… but what does that mean? If he can’t “do that”!!","Through a reincarnation technique, Cheolsu returns to the time before he became a eunuch. He has one goal in mind: to become an alpha male and enjoy life with the most beautiful women!!","A full-fledged 15+ rated(?) comic martial arts story about Cheolsu, who lives purely for his desires, begins!"]}]