[{"title":"The Moon that Rises in the Day","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Moon that Rises in the Day / 요운당","Anyone who approached Seungjeong, a ‘bitch born by eating her mother’ and a ‘cursed bitch’, was injured or seriously ill, regardless of whether they were humans or animals. Is it really an evil spirit? or not… … The last remaining hope is the herbalist ‘Yowundang’, which is rumored to be haunted by monsters. Would it be possible to lift the curse there?"]},{"title":"Can Love Blossom in a Poisoned Heart?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Can Love Blossom in a Poisoned Heart? / 伯爵令嬢は孤独な王子を守りたい / 심장에 피는 독화","As a young girl, Sasha Corsico was saved from the jaws of a monster by the cold Prince, Paris Vladimiro, who requested a binding promise in return. To survive the injuries she sustained, her family turned to sorcery that saved her life, but unfortunately transformed her into a vampire incapable of facing daylight. A decade later, Paris, cursed with poisonous blood, suffers with his title, as a stream of new brides die at the touch of his lips. He now collects on his promise with Sasha, requesting her to become his wife, as Princess Consort. She obliges, while the very sorcerer who made her what she is, warns her: “Be wary of humans with poisonous blood.” Adjusting to palace life, suffering Paris’s family, Sasha is out of her element, having to hide her physical condition. However, she can’t resist her attraction to Paris, who suffers from the scars of a dark past, but slowly opens up to Sasha. As love and care blossoms, will this couple find a way to overcome all of their troubles?"]},{"title":"I became a top actor just by reading books","tags":["Drama","Fantasy","Manhwa","Reincarnation"],"disc":["I became a top actor just by reading books manhwa,\nDue to his lack of talent, Seong-hyeon gave up acting\nand became a writer. Seong-hyeon is a genius author with a natural talent for screenplays, but he still misses acting. Then one day, he got into a truck accident on set.\n“If I’m born again, I have to act.”\nHe promised and closed his eyes…\nSung-hyun returns 13 years back into the past to when he was 24 years old.And the method acting ability that goes into his scripts became the character itself!"]},{"title":"Run Maelle","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Run Maelle / Run, Meil / 달려라 메일","Maelle, a duke’s daughter, has a dream of the country being ruined. Setting herself on saving the country, she follows the idiot Princess Liela, who has a pretty face but lacks common sense, and participates in the Empress’s Choice event held in the Empire of Helbern. Then, one day, guided by her love for gardens, she meets a man wearing a mask… “Didn’t you know the emperor often visits this garden?” “Hah, is His Majesty so free to do so?!” Garden enthusiast Maelle, idiot princess Liela, and the perfect man of this era, Emperor Roheiden van de Helbern. Will Maelle be able to successfully save the country after battling to be the next Empress?"]},{"title":"The Terminally Ill Young Master of the Baek Clan","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","Reincarnation"],"disc":["Read manhwa The Terminally Ill Young Master of the Baek Clan / 백씨세가 시한부 공자 / Baek Clan’s Terminally Ill Young Master"]},{"title":"Cultivating the supreme dantian","tags":["Action","Adventure","Fantasy","Martial Arts","Mystery"],"disc":["he gets transferred to a new world in the body of waste son of a god, he gets a system that gives him tasks and rewards…\nCultivating the supreme dantian manhua\n开局签到至尊丹田"]},{"title":"The Princess in the Dumpster","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa  The Princess in the Dumpster / Princess in the Rough / 쓰레기장 속 황녀님","Deep sunken cheeks, dirty skin which lost its original color, twig-like wrists, filthy fingernails and a much smaller body for her age. And with neglected hair hanging over half of her face, this small child is actually the forgotten Royal Princess of the Empire. Unable to stifle her hunger any longer, she crawls out of her hiding within a tiny, old, worn-down castle in search of food…\n“I’m hungry,” the small girl who’s wearing nothing but shabby clothes murmured without even realizing, “Can I eat this…?”\nHer small fern-like hand tore a piece of vegetation off of the ground, but she eventually put it down while shaking her head from side to side. The little girl hadn’t had a proper meal for three days…\n“Estrella…” the child recited the name, her words one with the wind. It was a precious name that she had earned only after a long time.\n“I’m sorry I’m late.”\n“…It’s alright,” the little one who replied then slumped onto Elias’ chest."]},{"title":"The Killer’s Interview","tags":["Action","Adventure","Fantasy"],"disc":["The Killer’s Interview / The Murderer’s Interview / 幻像缉凶 / 殺人鬼のインタビュー / 살인마의 인터뷰"]},{"title":"Temple of dragon king","tags":["Action","Cooking","Manhwa","Romance"],"disc":["Lin Qinghan’s grandpa is at stake, all relatives are busy compete for home property, regardless of the stability of the Lin group they exhausted all kinds of despicable means, but in last all framed female president Lin Qinghan. now son-in-law of lin family Zhang Xuan, lord of Dragon King Hall, resolveing everything one by one."]},{"title":"We Got Ourselves Stuck Inside an Adult Fantasy Novel","tags":["Adult","Drama","Fantasy","Isekai","Manhwa","Mature","Romance","Slice of Life","Smut","Transmigration"],"disc":["Read manhwa We Got Ourselves Stuck Inside an Adult Fantasy Novel / 19금 로판에 친구와 빙의될 확률","There’s only so much one can take of her friend squealing over yet another cliché romance fantasy novel. But the biggest cliché of all happens when Jiwon and Yein reincarnate with Sihyeon in the exact story their friend is so obsessed with! Though God has summoned them to this new world to save it from impending doom, the three women have other plans. Jiwon wishes to rebel against the imperial palace, Sihyeon gets romantically tied up with the crown prince, and Yein is busy literally tying up her new submissive boy toy…"]},{"title":"Even If You Don’t Have a Third","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Even If You Don’t Have a Third / 3분의 1이 없어도 / Even Without a Third","“If We’re Still Single at 30, Let’s Get Married!” A naive promise made like a joke with a childhood friend during middle school. Time passes and flows, and it’s the year of turning thirty. Yoon-hwa, who was about to marry her boyfriend whom she had been dating since college, is shocked by his sudden declaration of breaking up. While walking absentmindedly on the street, she is hit by an approaching car, and when she wakes up, she had lost 10 years of her memory, and her childhood friend is acting as her guardian. Guardian? You’re my guardian? “Are we really married?!”"]},{"title":"Fakes Don’t Want To Be Real","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Fakes Don’t Want To Be Real / The Fake Lady of House Silkisia / 假的不希望变成真的 / 呪われた偽物は自由になりたい / 가짜는 진짜가 되기를 바라지 않는다","“My palace was not there from the beginning….” Despite being accused of being a fake princess, she devoted herself to earning her family’s recognition, betrayed by all, Psychke was accused of trying to murder the real princess and was killed. ‘If I were given another life, I would never live like this.’ Was it because of the thought that came to her mind at the last moment? When Psychke opens her eyes, she realizes that she’s back in the past, before the real princess returns. ‘I regret all the time I spent being controlled by you.’ I will live my life again, free from the shackles of fate, and live for myself, not my family."]},{"title":"The Housekeeper in the Dungeon","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Housekeeper in the Dungeon\nThe return of good looks! And cooking skills on top?!","Lee Heena, an ordinary South Korean office worker. Age 25.","Today, another ordinary day completely lost in overtime… is what she thought.","She suddenly awakened.","And then suddenly fell into a dungeon.","“God, Buddha, Allah! Please let me awaken as a fighting-type hunter! If possible, a strong one!!”","From the desperate wish, the system responded.","[Congratulations!]","[You have awakened as a hidden class, ‘Housekeeper’ (D)!]","Although Heena’s skills in Plucking Herbs (C), Exterminating Pests (D), This is the Taste of My Magic Touch (D) are very useful in daily life, can she survive with these skills?!","But, what’s this?","Kang Jinhyeon, South Korea’s No. 1 ranking S-Class hunter, tried his hand at flirting.","“I will leave everything I have to you.”","“Hunter Kang Jinhyeon…”","“Yes. Will you take responsibility for me?”","“Why do you ask me to be your housekeeper in such a weird way?!”","Is the simple and ordinary daily life that Heena dreamt of okay?!","With a talking snail and moving pet plants ♥","The delightful romance fantasy 〈The Housekeeper in the Dungeon〉!"]},{"title":"My Dearest Witch","tags":["Drama","Fantasy","Magic","MANGA","Manga","Romance"],"disc":["Read manhwa My Dearest Witch / Saikyou no Majo to Sono / 最強の魔女とその夫"]},{"title":"A Stepmother’s Märchen","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Stepmother’s Märchen /  A Stepmother’s Fairy Tale / The Fantasie of a Stepmother / 어떤 계모님의 메르헨\nThe iron widow, the spider widow, male hunter, the witch of Neuwanstein castle, the embarrassment of noble ladies……. These were all the words used to describe the Marchioness, Suri Pon Neuwanstein. Despite receiving such criticism from the world, she raised her ‘children’, who were unrelated to her by blood and were old enough to be called her siblings. And finally, on the day of the first son Jeremy’s wedding, she felt that all her hard work had tied all the loose ends together. But she had been terribly mistaken. After hearing the message requesting her to not attend the wedding, she got caught up in an accident and died while leaving the castle. But when she opened her eyes, she woke up on the day of her husband’s funeral, seven years ago. I refuse to suffer any more. I won’t live as I had in the past a second time!"]},{"title":"Marriage Alliance for Revenge","tags":["Adventure","Drama","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Reading manhwa Marriage Alliance for Revenge / 복수를 위한 결혼동맹 / Pernikahan untuk Balas Dendam\nOlivia, the Empress of Rhone Empire, died because of her husband’s scheme, then she had a chance to live again in the body of an unknown woman who lived in a slum. After that, Olivia met her ex-fiance, who was the real heir to the throne, and hid her real identity from him. She made a suggestion to form a marriage alliance for each other’s revenge. Will their revenge succeed without any obstacle? (summary by liliannaclaris, don’t repost without permission) TW // BLOOD"]},{"title":"Selena","tags":["Historical","Romance"],"disc":["Read manhwa Serena / 세레나","You can never be the owner of my serenity. Selena became the sole heir to the Serenity family. To save the precarious family, her grandmother married her to the most hated man in the kingdom. The only thing that can comfort Selena who is collapsing is her lover, Fredrick. On that beautiful and glorious summer day of Serenity, the story of three people intertwined with hot hatred and love"," "]},{"title":"Crazy Princess Renia","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Crazy Princess Renia / Mad princess lenia / 미친 왕녀 레니아","Renia is the princess of the Fontiano Empire. Her happy days were now shattered, after she married Duke Clovis Zenov.\n“I would like to sentence my wife Renia Zenov to death for the murder of Duke Clovis Zenov”\n“I’m innocent, I swear to god I never intended to kill my beloved husband!”\nReality was like hell, nothing changed even if she screamed in pain. Now all that’s left for her is the blessing of death…\nTo forget everything and find a place to rest in the arms of God, she stabbed the knife in the back of her head.\nHowever, God ignored and did not grant her last wish.\nOn her 18th birthday, the happiest day of her life. Blood-stained memories returned.\n“I’ll tear it down and fix it all. Play in their hands, to fix my past. And most of all…don’t marry Clovis”\nShe is forced to act as an innocent person, and marry a man who will face death for her."]},{"title":"Crows Like Shiny Things","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Crows Like Shiny Things / Crows Like Things That Sparkle / 乌鸦喜欢亮晶晶的东西 / 까마귀는 반짝이는 것을 좋아해","The war is over. The one who cut the neck of the Norkans’ leader, who antagonized the great empire for 37 years, was a young woman. Her name is Saharan Illoud, the leader of the 128th Knights’ Division. She was summoned by the emperor and goes to the capital, where, for the first time in her life, she meets a man who catches her eye. Crown Prince Chaisha, who is handsome to the extent that there are sparkles around him. Saharan, who is beautiful and knowledgeable but arrogant and insensitive. The fresh and heart-warming story of their lives."]},{"title":"I Tamed the Crazy Marquis","tags":["Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa I Tamed the Crazy Marquis / Taming the Marquess / 미친 후작을 길들이고 말았다","(MTL) In the dark between the House of Dikes and the Lomanik Imperial Family, the third emperor, Heizen, took advantage of Escal. And the stories hidden in the appearance of Laraloire, who shakes him, were revealed one by one. Two men with the same wounds fall in love with Laraloire, who has the opposite light, and the pouting love attacks of two men who don’t know much about love bring about a big change."]}]