[{"title":"Idol Manager In Another World","tags":["Comedy","Fantasy","Romance"],"disc":["Top-tier idol manager Le Qiu accidentally traveled to another world. To return to her reality as soon as possible and help the farm girl, Ella, save her village, fate led Le Qiu to bring six beautiful girls of different races and personalities together into a girl group.","While she spreads the idol culture, she is also… saving the world.","Idol Agent in Another World\nIdol Manager in Another World\n异世界偶像经纪人"]},{"title":"Genius cool treasure: President’s wife is too powerful","tags":["Drama","Romance","Webtoons"],"disc":["Genius cool treasure: President’s wife is too powerful\nThe story goes that, 5 years ago, in a tent with black lights, a woman drove him in a drunken state, gave birth to twins and lost one.\nFive years later, the woman who secretly filmed him, cured his hidden illness, stole his heart, someone kidnapped his other son to play the missing game.\nFeng Yizhen swore that she must capture the woman’s intense feelings and let her know that she must pay the price."]},{"title":"A Poisonous Lily","tags":["Adventure","Fantasy","Romance","Shoujo","Webtoons"],"disc":["Read manga A Poisonous Lily / A Blooming Lily, A Terrible Lily, Blooming Lily, 지독한 릴리","The Holy Empire of Serife’s saintess, Lily Stella. She was a holy existence that nobody dared to disrespect. But one day, she stopped hearing God’s voice, and the Holy Empire of Serife fell to ruin. Lily Stella, who was thrown into a well by the hands of the enemy, cursed the God of Serife whom she served all her life with all her might. “Serife. If you’re still listening to my voice, give me another opportunity. But if I die like this and return to your arms, I…” “I will tear you to pieces and eat you alive.” When she opened her eyes, wondering what happened, she had become Lily Stella of 17 years ago. She had returned as a 6 year old child… She threw away her past life’s innocent self as the saintess. Deciding to become wicked, and to only live for herself."]},{"title":"Glass Wall","tags":["Drama","Historical","Josei","Romance","Webtoons"],"disc":["Read manhwa Glass Wall / Glass Block / 유리의 벽 / Yooli’eui Byeog / Glass no Kabe / Liuli Zhi Bi / El Muro de Cristal / กำแพงแก้ว / ガラスの壁 / 琉璃之壁","Wealthy and aristocratic. Life began from the moment I met him."]},{"title":"How to Raise a Cross-Dressing Master","tags":["Historical","Manhua","Romance","Yaoi"],"disc":["Read manhua How to Raise a Cross-Dressing Master / 女装大佬养成记 / Nǚ Zhuāng Dà Lǎo Yǎng Chéng Jì / Nv Zhuang Da Lao Yang Cheng Ji / Cultivation of the Crossdresser / Notes of the Cultivation of the Experienced Crossdresser / Record of Raising the Big Shot of Women’s Clothes\n“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nIn the middle of Mt. Fu Yun and on the banks of Lake Egret, there is a school called tao yuan academy, which houses the children of imperial and wealthy families. Su Li’s twin sister, Su Li, who was intelligent and sensitive at an early age, was given an imperial order to study at tao yuan academy. however as the start of school was just around the corner, Su Li (the sister) ran away with a handsome young foreign boy… to avoid the punishments of lying to the emperor, Su Li (the brother) had to dress up as a woman and attend tao yuan academy in place of his sister. Initially, he wanted to keep things low-key, but to his dismay, he had caught the attention of multiple suitors… Hey, we’re all brothers, can’t we settle this peacefully! Stop it! Don’t run away you rascal! Damn it, what do you guys have that I don’t?"]},{"title":"The villianous queen wants to level up","tags":["Drama","Romance"],"disc":["Read manhua The villianous queen wants to level up","Filled with hatred , Mu He Xi got isekaied into the world of the novel; ” My ceo is a demon”. She became an evil villainous character, who has to humiliate the heroine in this novel to upgrade the Black Lotus system. Only then, she will be able to return back to her world. But when she upgraded the Black Lotus system she discovered a new novel world. Plus, she had became an evil character again … Will she ever be able to return back to her world? … And get her revenge?"]},{"title":"My Cunning Childhood Sweetheart","tags":["Manhua","Romance","Slice of Life"],"disc":["The heroine meets her childhood friend, but he seems to be a naive boy, and he is always receiving good guy cards, which seems to be very funny. The heroine thinks it’s time to teach her childhood friend to fall in love but why did it slowly become that she was the one being taught?*Please read on www.manhuasy.comNotes from mangabuddyAll our manhua content is protected under copyrighted law.manhwaclan never gives anyone authorization or permission to publish our content on another website/app. If you’re publishing our content on your website/app, it means that you’re infringing the copyright of our works. Therefore stop stealing n our work or else we will take legal action against you."]},{"title":"My Badass CEO Daddy","tags":["Drama","Liexing","Ping Ping Jun","Romance","Webtoons"],"disc":["Read manga My Badass CEO Daddy on manhwaclan\nFour years ago, she left in despair, heart-broken. Four years later, she came back, with a kid by her side.\nBefore she could settle down, the first thing (or man) she has to deal with is this unreasonable CEO, who cannot be greener when it comes to hitting on a girl…\nThe moment he sees her, his whole linguistic system is reduced to four words—”I. WANT. YOUR. SON!”\nWho the heck will use this type of pickup line?!!"]},{"title":"In Our Sect, I’m The Only One That’s Trash","tags":["Action","Adventure","Comedy","Fantasy","Historical","Romance","Time travel"],"disc":["Read In Our Sect, I’m The Only One That’s Trash / I’m the only slacker in my sect! manhua / 门派只有我一个渣渣","The world’s greatest sect’s sect leader, Mo Shangchuan, failing to survive a robbery, was reincarnated into the body of a thrown-away child. And this child was actually black as heck! Yet, this wasn’t bad enough. Even worse, they were taken by a Nine Schools’ cultivator sect’s most trash Daoist nun—— Yan Qin as her disciple. I, Mo Shangchuan, have never suffered such treatment. As I was regaining my former self’s strength, a mysterious memory rushed into my head. It was actually about a star-crossed love between me and this trash master…"]},{"title":"Just for a Meowment","tags":["Drama","Fantasy","Romance","School Life","Shoujo","Slice of Life","Webtoons"],"disc":["Read manhwa Just for a Meowment / 묘한 인생 / A Strange Life","Orphaned at birth and bullied at work, Myohee has been through countless trials in life. But when she gets scammed by her only friend and ends up bankrupt, Myohee feels as though she’ll never find the silver lining to her cloud. She decides to end her own life by jumping from a building, but mid-air, the grim reaper halts her descent, saying her time isn’t up yet. She’s ordered to live for 100 more days…as a cat! Before she knows it, she’s taken to the home of her handsome, aloof boss, Mr. Cha. It seems like the perfect chance to receive the love and care she never had in life…if only Myohee can remain a cat!"]},{"title":"My Fake Girlfriends are using me as a Shield","tags":["Action","Comedy","School Life"],"disc":["Read manga My Fake Girlfriends are using me as a Shield","One day, I was suddenly confessed by a girl, in order to reject her, I had to find a fake girlfriend. I didn’t expect that my plan to avoid trouble… would lead to an even bigger trouble? The arrogant Archery Department ” Vicious Princess”, the “White Fox” who is good at flirting, the long black straight “Flower of the Highlands”, and… the sickly brother and sister plot! Is my youthful love story also full of problems?"]},{"title":"How To Become A Dark Hero’s Daughter","tags":["Comedy","Drama","Fantasy","Historical","Isekai","Magic","Manhwa","Reincarnation","Romance","Survival","Webtoons"],"disc":["Read manhwa How To Become A Dark Hero’s Daughter / Becoming the Dark Hero’s Daughter\nThe MC transmigrated into a novel and became an extra from the novel. The novel is a murder thriller and the main character is a serial killer.\nHe kills criminals with black magic making him a dark hero (think of him as Dexter or batman with dark magic).\nShe (MC) doesn’t have any death flags since she’s a background extra but she was a homeless girl of all things in such a dangerous novel.\nSomehow our MC saves the male lead and to thank her, he adopts her.\n“Become my daughter.”\nThe richest, most powerful, and handsome duke commands her to be his child.\nThe MC is freaked out since she knows he’s a cold blooded killer. Can she survive such a maniac?\nYet he dotes on her and constantly says ‘my daughter is the cutest’! He wants to get master artists to draw her and gather poets to describe her adorableness.\nThe duke alo has a son. The apple doesn’t fall far from the tree; he also dotes on her.\nIn this way, a beggar became a little princess. She also got used to people getting killed.\nHowever there was still one problem.\nOur MC has turned sixteen and is wondering as a lady, will she have an arranged marriage?\nThe whole house atmosphere quickly turns awkward.\nShe realizes, perhaps they want her to stay here forever?\nCan she escape such a strange house? Everyone is so attached to her!"]},{"title":"Kill Me Next Time","tags":["Action","Comedy","Fantasy","Martial Arts","Romance"],"disc":["Read manga, manhua Kill Me Next Time","Chang Xiaoyun, a policewoman, accidentally traveled to ancient times and traveled to a newborn baby?\nMore than that, this baby is not ordinary. Her father is an invincible general. She was arrange to marriage to the unfavored Emperor Shu Wang, the unfavored fifth son of the emperor.\nBut he wants to get rid of her! …Let’s see how the heroine uses the adult’s mind and the child’s body to survive and become a “pet” of the group!!!!"]},{"title":"Maybe, Good Morning","tags":["Drama","Romance"],"disc":["Read manga Maybe, Good Morning\n아마도, 굿모닝\nWe were thinking of looking for an investment company for the expansion of the business, but what came my, Jin Iyoung’s, way was a proposal for a “contract marriage”. The partner in that contract was Gu Gyoheon, who was rumored to be shallow and dumb. However, it wasn’t that bad of a deal. I thought that we will live as a show window married couple going forward, but this man.. keeps on making moves on me."]},{"title":"Give A Heart To The Emperor","tags":["Fantasy","Historical","Manhwa","Romance"],"disc":["Read manga Give A Heart To The Emperor  / Plant a heart in the emperor / 황제에게 하트를 심어주세요\nYesterday was a very normal day, I couldn’t get myself to sleep, so I decided to read romance novel that I liked.\nIt was a rather sweet story. In it, a female protagonist heals the scars that the male protagonist’s parents left on his heart.\nThe mother of that male protagonist was called Charlion, a character that caused the male protagonist lots of mental and physical trauma as a child.\nThe father of the male protagonist was the Emperor, who massacred his way into power, went on to conquer all the surrounding nations. It was in the fourth kingdom that he conquered, at the royal palace of King Renoa, that he decided to stop his war of conquest.\nThe Emperor fell in love with Charlion at first sight. He took her back with him to the Empire, as spoils of war, and married her.\nIn her eyes, Charlion married the demon who crushed her country and slaughtered her family right before her very eyes.\nShe was forced to become the empress and gave birth to the crown prince, the male protagonist of the novel.\nIn her moments of instability, she abused her child, the male protagonist. And she was left so broken and devastated that she ended up committing suicide.\nSo can someone tell me WHY DID I WAKE UP AS CHARLION, THE ICON OF MISERY….\nNote: [Story actually starts before the events of the mentioned novel, making Charlion and the emperor the main characters]"]},{"title":"Kiss You Every Day","tags":["Adventure","Fantasy","Manhua","Romance","Vampire"],"disc":["Ji Na, the beautiful game anchor, challenges to digging treasure at the bottom of the lake late at night. She didn’t manage to dig treasure but she dug a young and cute vampire. As soon as the young and cute vampire, Li Chen kissed Ji Na, he turned into a handsome man, and his combat power was exploded! He can repel monsters, and also do magic romantic fireworks. If the female lead, Ji Na does not kiss him, he will become a little cute boy and be bullied by others With questions and curiosity, Ji Na and he began a “shameless” cohabitation life. Sure enough, soon the hunter coming looking for them Notes from mangabuddyAll our manhua content is protected under copyrighted law.mangabuddy never gives anyone authorization or permission to publish our content on another website/app. If you’re publishing our content on your website/app, it’s mean that you’re infringing the copyright of our works. Therefore stop stealing our works or else we will take legal action against you."]},{"title":"Love Score Strategy","tags":["Manhua","Romance","Slice of Life"],"disc":["Read the latest Love Score Strategy manga, manhwa Love Score Strategy, manhua Love Score Strategy comics / 戀分攻略","Lost love little poor rebellion goddess, uses the strategy of scumbags as the material for her writing. Because of the misunderstanding, she thought An Cheng Xi is a scumbag, she embarks on the road of chasing after the scumbag. What? This man turned out to be her first love? Now pretend to be a wolf with a big tail and say that he loves himself? When she didn’t believe in true love, she met him who hadn’t changed her original intention, “Humph, you’re over! There will be results for every cause, and your retribution is me!”"," "]},{"title":"The Reason Why Raeliana Ended up at the Duke’s Mansion","tags":["Comedy","Drama","Fantasy","Isekai","Manhwa","Mystery","Romance"],"disc":["Read manhwa The Reason Why Raeliana Ended up at the Duke’s Mansion / Geunyeoga Gongjagjeolo Gaya Haessdeon Sajeong / La razón por la que Raeliana terminó en la masión del duque / The Duke’s Fiancee / 公爵的契约未婚妻 / 그녀가 공작저로 가야 했던 사정 / Comment j’ai survécu au Manoir Wynknight","Poisoned to death by her own betrothed?! Eunha didn’t wake up in a novel’s story just to get killed off again as an unfortunate extra! To change her story she needs a cover… 6 months pretending to be the fake fiancée of the novel’s male protagonist, Duke Noah Wynknight. But will this cold-hearted, angel-faced demon of a man really help her avoid another ill-fated ending?!"]},{"title":"Dealing With the Prince of Misfortune","tags":["Fantasy","Josei","Manhua","Romance"],"disc":["Read Dealing With the Prince of Misfortune","A 21st century, talented Feng Shui expert, reincarnates into a frail body in ancient times. The original good-for-nothing host is not only ugly, but her birth father favors the concubine more than the wife, birth mother was framed with adultery and stripped of her rank, twin brother was poisoned by her second mother, her fiance and concubine-sister hooked up and worked together to bring about her tragic death. After Xiao Lingyun is reincarnated, she uses secret techniques of Feng Shui to get back at those who had previously ridiculed and abused her. From the lowest of low to the highest peak of cultivation, she flies towards the immortal realm."]},{"title":"Plainwalker of the Stigma","tags":["Action","Drama","Fantasy","Shounen"],"disc":["Read manhwa Plainwalker of the Stigma / 낙인의 플레인워커\nTalented Engineering Professor ‘Wi Geonwoo’ was fired from the research center he worked at all his life and was kidnapped by a mystifying light, only to be dropped into a mysterious world. Engineering Professor Wi Geonwoo was approached by an entity that called himself “A God With No Face” and was forcibly given a blue stigma. In this new world, individuals with blue stigmas are hunted, while the ones with red or crimson stigmas are considered the hunters who seek out their prey. Will ‘Wi Geonwoo’ with his blue stigma, be able to survive as one of the hunted? “I will be your strength, so lend me your body.” To make matters worse, ‘Ash Glaive,” a strange slime-like individual appeared. Together with Archmage Ash, and the imagination and monster-like bodies of the engineers, they start the war against the red stigmas."]}]