[{"title":"She’s the Older Sister of the Obsessive Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Taming My Villainous Little Brother / BL 소설 속 집착광공의 친누나입니다 / Ela é a irmã mais velha do protagonista obsessivo / Ela é a irmã mais velha do protagonista yandere em uma novel BL / L’aînée du fou obsessionnel / She’s the Older Sister of the Yandere Male Lead / She’s the Older Sister of the Yandere Male Lead in a BL Novel / She’s the Older Sister of the Obsessive Male Lead / Вона старша сестра одержимого головного героя-маніака / ヤンデレ主人公の姉になりました / 我成了偏执狂男主的亲姐姐 / 집착광공의 친누나입니다","In this life, I was born with a gold spoon in my mouth. I thought my future would be bright.\nAs a matter of fact, I didn’t realize that the place I reincarnated into was a discontinued R-19 tragic BL novel that my friend wrote.\nAnd of all things, I became the older twin sister of Lisandro, the crazy obsessive yandere male lead who horribly, brutally murdered the sickly prisoner Frey at the end of the novel.\nIf I didn’t remember this, I would have just jumped into the sunset, blissfully unaware…\n***\n“Noona.”\nWith a suitcase in one hand, I flinched and looked behind me. The mysteriously beautiful Frey came towards me with a bright smile on his lips.\nIn no time, he towered over me with his tall, lean body.\n“Where are you going?”\n“Um.”\n“Where?”\nDon’t ask.\nI wanted to say this firmly, but I just wore a smile instead. Frey, who kept staring me, tried to grab my suitcase.\nTaken aback, I held onto it tightly. In return, I heard a refreshing, clear laugh.\n“Let me hold it for you.”\n“No, I’m fine.”\n“Why? Oh, I get it. You’re trying to escape. Am I getting in your way?”\nThe hand holding the suitcase flinched. As he looked at me with an eerie smile, he looked exceedingly dangerous the more he stared. There was ice glistening behind his golden irises.\n“You thought I wouldn’t know.”\nHis large hand wrapped around mine and held the suitcase handle tightly.\n“Just to avoid me and that bastard, you’re trying to run away.”\nHis harsh words didn’t match his aloof expression.\n“It’ll spell trouble, Yuni. If you disappear from my sight.”\nThe gentle and feeble, sickly prisoner suddenly became an obsessive yandere himself."]},{"title":"Celeb Lady","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Celeb Lady / Celebrity Lady / 셀럽 레이디","The Ugly Duckling Becomes the Empire’s Top Celebrity! Juliet Karenina, the era’s hottest celebrity, wakes up in the body of noblewoman Louvetria Diorlos in another world. Faced with a clumsy body and a timid personality, Louvetria endures bullying from those around her: Twins who mock and ostracize her. Her unrequited love, Kedric, who scowls at her. Her step-grandmother, Molga, who torments her in secret. But with Juliet’s spirit inside her, Louvetria won’t tolerate it anymore. “I won’t stand for this, no matter who it is. “Louvetria’s bold transformation begins!"]},{"title":"Please Support Revenge","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["“ Your curse, I’ll solve it. In exchange, please accept me as a bloody traction.”","From the information of the original story she learns the reason of her mother’s death. Lobelia realizes her own situation, deprived from her everything and driven her into becoming a villain, decides to take revenge.","She escapes out of the hands of an uncle who wants to control and tries to get back her share.","She went to Duke Ferrado, who is known to be dangerous, and made her suggestion","“I know a better way. I’ve been thinking about a contract relationship. How’s it?”","The man comes up with an unexpected reverse proposal. Lobelia shakes off the money line of her uncle with his support.","In front of her, the heroine of the original story and the daughter of the enemy appears as her rival.","“Sister, why in the world did you change like this?”","Will Lobelia be able to complete her revenge?","She said, “When it’s all over, I still want to be with you.”","And can she have a happy ending with the man she woos?"]},{"title":"Baby Princess’ Survival Diary","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa Baby Princess’ Survival Diary / 赤ちゃん公女様の生存日記 / 아기 공녀님의 생존 일지","Her parents abandoned her when she was one year old, and at the age of three, she gained divine power.","She was entrusted to the temple and the Duke Enotis family, who recognized her divine power, and she dreamed of a hopeful life.","However, in the end, she wasn’t only mistreated but also had all her divine power stripped away, and she was starved to death in an underground prison.","Gog granted her a second chance, and as soon as she realized that she was herself again at the age of three, without looking back, she escaped…","….From Duke Enotis – who took her in her previous life – and the priest in the temple, to Duke Beherveil!"]},{"title":"A Deal With My Fake Husband","tags":["Adaptation","Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa A Deal With My Fake Husband / 잘 키운 계약 남편","Princess Elysia is part of a fallen royal family. When Elysia’s fourth husband died, people started calling Elysia a husband-eating witch, all due to the greedy schemes of her mother and brother hungry for her inheritances. Upon realizing this, Elysia decided to turn back time to take revenge by choosing a husband that would follow her lead. She needed a commoner to play the role of her husband as her puppet… but the man she hired to act as her husband turned out to be someone above and beyond, going beyond her wildest dreams. Elysia then had no choice but to alter her original plan."]},{"title":"I Woke Up As a Notorious Troublemaker!","tags":["Romance"],"disc":["Read manhwa I Woke Up As a Notorious Troublemaker!","The main character, who worked every day like a corporate slave, woke up one day to find herself as “Lady Christina,” a noble lady of another world. According to the memories she inherited from her new body, Christina was an evil woman riddled with red flags! Warned by the prince that this is her last chance to redeem herself, she is even forced to live with the duke’s son to prevent her from causing any more harm. The duke’s son is seeking an excuse to execute her, so Christina resolves to work hard to avoid further tarnishing her reputation. However, it appears there are other reasons why he wants to keep a close watch on her… Immerse yourself in the romantic fantasy between a former villainess, who has committed every conceivable sin, and the vigilant duke who has his eyes on her!"]},{"title":"Kitsch Wedding","tags":["Action","Adaptation","Drama","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Kitsch Wedding / 키치웨딩","“Please marry me.” A 2 billion won contract offered to a private military company’s mercenary. The condition is one year of marriage. “Customer, are you perhaps crazy?” “You’re the only lunatic that’s fine with having a divorce history.” Lee Raehwa, the only daughter of Daesan Construction. In order to break free from her father’s control and complete her painting, Raehwa hires a legal guardian for one year. But the only hope she hired, Gwon Itae, was unpredictable and crazy person The marriage and cohabitation, started as a contractual relationship, take an increasingly strange turn…"]},{"title":"My masculine Puppy","tags":["Comedy","Drama","Manhwa"],"disc":["Read manhwa My masculine Puppy / My Male Dog / 나의 수컷 강아지","” I picked up a puppy, but it turned out it’s not just a puppy.” What if the puppy you picked up off the street turned out to actually be a man, one with an amazing face and physique? Jion accidentally became the savior of one puppy but the next day, the puppy was nowhere to be found, with a tall man lying next to her instead. Then accidentally kissing turns him back into a puppy, and then back into a man. A confusing cohabitation between her and the world’s cutest puppy and at the same time, the world’s sexiest man begins."]},{"title":"Fountain Wish","tags":["Adult","Comedy","Drama","Fantasy","Manhwa","Mature","Romance","Smut","Supernatural"],"disc":["Read manhwa Fountain Wish / 샘의 초대 / Fountain Invite / Saem’s Invitation / Sahara ‘s wish","Sahara, who has never experienced an orgasm even once until her 29th birthday, is disheartened by the harsh reality of admitting her sexual anhedonia. Desperate, she turns to the infamous wishing fountain, rumored to curse those who make a wish. “Even if it’s a curse, just until I die! Grant me mind-blowing sex!” On that night, she receives a feeling she has never experienced before from an unexpected visitor in her room.."]},{"title":"My Sister’s Private Life","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Showbiz","Slice of Life"],"disc":["Read manhwa My Sister’s Private Life / 자매의 사생활","The life of a mysterious woman abruptly changes due to an accident that causes her amnesia. Yet, it doesn’t stop there—why did she suddenly become a murder suspect too?"]},{"title":"The Ten Thousand Races Invasion: Guardian of the Rear","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["The Ten Thousand Races Invasion: Guardian of the Rear,\nInvasion of All Races: All the People Join the War, I Stay Behind, 万族入侵：全民参战，我留守后方","“Invasion of the Ten Thousand Clans, universal super powers, the era beyond time has arrived!\nIn this age, all citizens are drafted to resist the foreign races and defend against external humiliation.\nNan Ziying, at the tender age of adulthood, chooses to stay behind at the recruitment center, serving as logistical support.\nMany soldiers are disappointed, the youth scorn him, and white-haired elders take up arms and leave, leaving him behind with only women, children, and the elderly to guard the rear. Later, Nan Ziying awakens five great abilities and silently prepares.\nIn this era where countless clans reign supreme and the times are filled with tragic heroism,"]},{"title":"I Was Just Having Fun With The Time Limit","tags":["Comedy","Drama","Fantasy","Historical","kids","Manhwa","Romance","Royal family","Superhero","Transmigration"],"disc":["Read manhwa I Was Just Having Fun With The Time Limit / 시한부를 즐겼을 뿐이었는데 /  I Was Just Enjoying The Deadline","In my previous life, I had a limited time, but I reincarnated as someone with limited time again! Although this time too my life is limited, I got a life that lasts for 21 years. Even if I feel constrained, even breathing makes me happy! The family love I feel for the first time, and my mother asking me to grow up healthy. This life is a gift to me."]},{"title":"Our Ball Begins at Moonrise","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Our Ball Begins at Moonrise\nOnce upon a time, Iris’ greatest challenge as a socially inept mage was receiving the occasional client at her workshop. Little did she know that the nasty woman knocking on her door would change that forever. One violent confrontation later, the two women end up switching bodies– and as it turns out, Iris’ new body belongs to the kingdom’s infamous shrew, Queen Rosemary! With her original body damaged and the real Rosemary dead, Iris must continue living as the queen. But that’s easier said than done when the entire royal court hates her, especially her fiery husband the king… who Rosemary was conveniently plotting to dethrone with the help of her many lovers. Needless to say, Iris is woefully unprepared for the deadliest “ball” of her life, and not just because she’s a terrible dancer. All she can do is pray that the moon will guide her through these hopelessly dark times!"]},{"title":"Once Upon a Time in a Zombie Empire","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manga Once Upon a Time in a Zombie Empire","Jaeha Lee, the sole survivor of modern Zombie Apocalypse, has lost her will to carry on with life. However, when she was woken up by a mysterious voice in her head, she has transmigrated as Princess Charlotte of the Olent Empire. Suspecting that there must be a reason behind everything, Jaeha struggles to find the meaning of life in her new world. It is when the peaceful empire is attacked by a horde of reanimated corpses, Jaeha realizes why she was reborn as Princess Charlotte: To fight the undead and survive ’til the end–again!"]},{"title":"Until the Villainess return","tags":["Fantasy","Romance"],"disc":["Read manga Until the Villainess return","Maria, the daughter of a count, has worked hard since she was a child and won her engagement to the beloved crown prince. However, the day before the engagement ceremony, she is attacked by an unknown assailant and loses consciousness. When she wakes up, she finds that her body has been swapped with that of the hated villain Bernadette! Maria, who found out that Bernadette had taken her body, overcomes her despair and vows to take revenge. “I’ll get everything back. I’ll get revenge on Bernadette, and I’ll definitely return to being the crown princess!” This is the start of Maria’s tale of revenge from rock bottom, now that she has become the hated “Bernadette”…"]},{"title":"And so the mermaid became the villainess","tags":["Romance"],"disc":["Read manga And so the mermaid became the villainess","I will definitely change this unreasonable world!” The curious mermaid princess Anmetta came ashore to be by the side of her beloved prince. However… “You will continue to bleed until you die.” Prince Lien and his fiancee Lionie imprison Anmetta in order to use her “mermaid powers.” Days of cruel torture begin. A terrifying witch appears before Anmetta, who is exhausted both physically and mentally, and gives her human legs. The witch then proposes a new deal to Anmetta. “There are three princes in this country.” “Would you please go back in time and become queen? And I want you to get back what is important to me.” In order to avoid tragedy, Anmetta’s new challenge begins…"]},{"title":"The Regretful Villainess Is Happy Because She Got Divorced","tags":["Fantasy","Romance"],"disc":["The Regretful Villainess Is Happy Because She Got Divorced / Regret: The Evil Woman Is Happy Because She Got Divorced /  Regretful Villainess Is Happy to Divorce / 후회물 악녀는 이혼해서 행복합니다"]},{"title":"See you in the future","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa See you in the future / 미래에서 만나요","This is a nightmare. “You two are still on good terms.” Yes, a very realistic and vivid nightmare! Ed-senpai and I, who used to growl at each other every time we met, were a married couple. And we were such lovebirds that it would be sad if we were to say we were the second best in the empire! “The only thing I found out is that I would have ascended to the throne as soon as I graduated, so this place is five years into the future.” “… … Either I’m crazy, or Senior is crazy, or we’re both crazy.” “Also, we’re married, and have been for three whole years.” And the reality of having to unite as Emperor and Empress was right in front of me."]},{"title":"Flowers are flowers, leaves are leaves","tags":["Drama","Fantasy","Historical","Isekai","Romance"],"disc":["Read manhwa Flowers Are Flowers, Leaves Are Leaves / Bloom of Vengeance / 꽃은 꽃으로, 잎은 잎으로","Hong Seol-young, the daughter of a concubine of a chaebol family, stood proudly despite all kinds of persecution, when her parents suddenly died in a car accident and Seol-young also dies under the guise of suicide. Seol-young curses the Hong family until the moment she closes her eyes. Seol-young, who suddenly came to consciousness, opened her eyes and found her surroundings reminiscent to that of a drama set of a historical drama. “And when did my hair get so long?!” To make matters worse, there is even a girl who calls her a “lady”…? In another dimension, Seol-young’s revenge drama begins with ‘Jang Seol-young’ instead of ‘Hong Seol-young’! Bloom of Vengeance"]},{"title":"I’m a Martial Art Villainess but I’m the Strongest!","tags":["Action","Adventure","Drama","Fantasy","Historical","Isekai","Manhwa","Martial Arts","Reincarnation","Romance","Villainess","Webtoons"],"disc":["Read manhwa I’M A Martial Art Villainess, But I’M The Strongest! / Master Villainess the Invincible! / Akulah Antagonis Terkuat di Martial Art! / 무협지 악녀인데 내가 제일 쎄!","Our main character was an unsuccessful romance fantasy novelist when she gets into a hit-and-run then wakes up as the villainess in a best-selling martial arts novel. She uses the information from the novel that she had analyzed in her original life, in order to avoid her death-ending and finding the truth behind what had really happened to her."]}]