[{"title":"Princess Shu","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Princess Shu / Putri shu / Princess shuden / Mintchoco\nValia was born into a fallen noble family as the daughter of a knight and lived a sad life. Then, the opportunity of a second life comes to her.\n‘Should I live like that again?’\nNo, she won’t!\nValia decides to become a temple princess in order to live a happier life without having to worry about money. But then, as a princess, she becomes the wife of Shuden, the most handsome man and highest-ranking noble in the Empire…!\nBut in the future, Shuden falls in love with a new woman from another world. Valia knows this, but she can’t get away from Shuden, who is in love with her!\nValia, Shuden’s princess–what is her fate?\n“You are the only one in my life that I will love. If I break my oath…I will pay for it with my life.”"]},{"title":"Sinister Immortal Path","tags":["Action","Adventure","Fantasy"],"disc":["Read Sinister Immortal Path, Weird Immortal Path, 诡浊仙道","Zhang Yuan ascended to immortality, only to find himself in a bizarre world. Terrifying celestial beings ruled the heavens, while mortals below were mere livestock. The realm was filled with perilous [abnormalities], and the cultivators who survived were barely human. Could this world possibly have a future? Zhang Yuan didn’t care. All he wanted was to ascend again and return to the immortal realm. But… could he truly go back?"]},{"title":"From Duty to Devotion","tags":["Fantasy","Romance"],"disc":["Read manga From Duty to Devotion","From a young age, Ines has been abused by her stepmother and stepsister. Her stepsister once doused her in boiling water, leaving a scar that resulted in Ines being called “ugly” by her abusive new husband. To make matters worse, Ines’ husband begins an affair with her stepsister. That is when Ines is approached by a handsome nobleman known as the “Cold-Blooded Marquess”, who proposes marriage. Desperate to regain what was once lost, Ines takes his hand in marriage…"]},{"title":"I’ll Resign And Have A Fresh Start In This World","tags":["Comedy","Fantasy","Slice of Life"],"disc":["Read manhwa I’ll Resign And Have A Fresh Start In This World / 사표내고 이계에서 힐링합니다 / I’m Going To Relax in This World After Submitting My Resignation","The main character, Lee Soo, lived an ordinary but happy life.\nFive years ago, he suddenly loses his parents, and becomes a devastated man, as he struggles every day.\nWhen he was exhausted from the suffocating daily life, a portal opened in the room. A place he has never been to, a place he doesn’t know what might be.\nA healing life to enjoy in a different world starting as a commoner and turning to feudal lord."," "]},{"title":"Black-Haired Tactical Genius","tags":["Action","Drama","Manhwa"],"disc":["Read manhwa Black-Haired Tactical Genius / Dark Haired Tactical Genius / 검은 머리 전술 천재","K-League Third Division The protagonist, Ma Jung-woo, is a strategic analyst. As he suffered from mounting debt, he inherited his late grandfather’s British football team without notice. He tried to sell the club and start a new life… What? 150 billion won in debt alone? Jungwoo is trying to pay off his debts alone as the club owner’s coach…."]},{"title":"The Emperor’s Dog","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Emperor’s Dog / 황제의 멍멍이","Hari, who died in an unexpected car accident, had come to her senses after being reincarnated into a completely different world. Was she the daughter of the emperor? Hari, who opened her eyes with a throbbing heart, was in shock. I’m a dog? A dog that can talk, too? And it gets worse! I was the hunting dog of a cruel emperor who exterminated his own relatives to ascend to the throne. Now that it’s done, I have to find a way to live. The only thing this little doggy could do with her body was… “I’ll pay you back if you raise me, Your Majesty!” “Alright, I’ll take you.” “That’s a great choice, Your Majesty. You’ll never regret it!” Goodbye to my self-esteem— A dog’s way to utmost power… that’s the route I’ll take! My second life will be as the Emperor’s adviser and potential successor. Until the day of death! (DISCLAIMER: This is a promo chapter.)"]},{"title":"Limitless Ascension: Strength Amid Adversity","tags":["Action","Adventure","Fantasy"],"disc":["Read manga Limitless Ascension: Strength Amid Adversity, 遇强则强，我的修为无上限","With a system that grows stronger against it’s enemies, ye jun ling who almost passed away from old age began his cheating life of cultivating with no upper limits. Divine emperor? Saint? The heavenly principles? Stand aside! Other than that, he also had several disciples. The senior disciple is a demonic sect master, with vicious heart and treacherous mind, but got easily taken care of everytime! The second disciple is a white hair loli, with the number one divine constitution, likes to cook despite being super strong, and serve her master…"]},{"title":"My Lucky Encounter From The Game Turned Into Reality","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa My Lucky Encounter From The Game Turned Into Reality / 게임 속 기연이 현실로 / kkeim sok giyoni hyonsilro / The dream in the game becomes reality"]},{"title":"Demonic Evolution","tags":["Action","Adventure","Fantasy"],"disc":["Read manga Demonic Evolution / Wo, Jinhua, Emo / Demon Evolution / Me, Evolution, and the Demons / The Devil Never Cries / 我，进化，恶魔","On the brink of death, the strongest warrior of humanity, Ang, mysteriously reincarnates sixty years into the future with the strength of the “Strongest Demon” — a dangerous double-edged sword. In order to resolve his regrets and unveil the truth, Ang has no choice but to continuously “evolve” in a bid to escape his past fate. “I won’t let myself be a bottled-up demon! If I want to get out, I must rely on myself!”"]},{"title":"The Nebula’s Civilization","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Nebula’s Civilization / 슬기로운 문명생활","Choi Seong-woon, achieves the top rank in the game “Lost World,” successfully completing all the game’s achievements. However, his joy doesn’t last long when he receives a suspicious email and is summoned to the real “Lost World,” where he embarks on a competition to become a “god.”"]},{"title":"The Eunuch’s Consort Rules the World","tags":["Historical","Manhua","Romance","Webtoons"],"disc":["Read manga The Eunuch’s Consort Rules The World","In her previous life, she was betrayed and died. After transmigrating, her lonely soul fell upon the body of Xi Liangmo who suffered the same fate. She vowed to make those who harmed her pay, one step at a time. Breaking the legs of her insidious sister, forcing her pretentious stepmother to die, betraying her callous father. An unscrupulous husband? Then she’ll just abandon and leave him, remarrying. But why does that villainous eunuch prince insist on marrying her? Although you got the looks of a deity, you’re still a eunuch! They force her to become a eunuch’s wife, then she’ll become the number one heinous tyrant wife!\nBe A Eunuch’s Wife To Control The World"]},{"title":"Regressing with the King’s Power","tags":["Adventure","Fantasy"],"disc":["Read manhwa Regressing with the King’s Power, Return to the Power of the King, 왕의 힘으로 회귀한다","[By the studio that brought you <Solo Leveling> and <Omniscient Reader’s Viewpoint>!]\n“I’ll eat all your skills!”, ‘f*ck this awakening bullshit’, ‘To hell with being a loser.’ Kim Taehyun, whose awakening level remainsThe life of an unawakened, where condescendence, disdain, and harassment are the norm.\nDamned loser…\nDamned life…\nDamned awakening…!\nAnd at the damned moment of death, I encountered “King,” a strange being.","With blindingly bright light, my second life began.\nBut this time, it’s different.\nBecause this time, I’m an Awakened too!","I will devour those who stand in my way, and I will never bow my head down to someone ever again."]},{"title":"I’ll Be The Warrior’s Mother","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’ll Become the Mother of the Hero / I Became the Warrior’s Mother / I Will Become the Hero’s Mother / I’ll Be the Warrior’s Mother / Seducing The Monster Duke / 勇者の母親になります / 立志成為勇士的母親 / 용사의 어머니가 되겠습니다","“Even if you become my wife, I won’t touch you”\n“Is that so? Then it’s okay if I touch you, okay?”\n“…”\n“What?”\n***\nIn about 20 years in the future, this world will. destroyed by the devil. There is only one way to prevent that catastrophe.\nIt was to marry the duke known as the “monster” and give birth to his child. After that, the baby will become a warrior to save this world.\n“Mielle, this marriage, let me take your place.”\nYelena, you are the one who has the ability to see the future. She has decided to marry the monster duke and give birth to the baby to save the world, however…\n“Are we going to stay lazy like that?”\nWhen she tries to get rid of it (?),\nLook at your husband’s defense that’s like an impregnable fortress! It’s beyond imagination!\n“I told you to take off your clothes! Why don’t you take off?! Is it your skin?”\nWill Yelena finally give birth to a warrior to save the world safely?"]},{"title":"Why Are You Obsessed? Even Though You’re Dead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Why Are You Obsessed? Even Though You’re Dead / 죽었는데 왜 집착하세요","On the day of my wedding, my fiancé and my friend betrayed me. After their betrayal, I fell down the stairs and died, and when I opened my eyes, I found myself in the past again. I considered this a blessing from God, as I was given the chance to seek revenge fairly. However, this repetitive process never ends. If I fail to seek revenge, I die because of their betrayal, and if I succeed in seeking revenge, I die in an accident. After several attempts to seek revenge and die many times, I finally found the reason. “Someone was assassinating me every time, and this time I swear to make him pay for every time he killed me.”"]},{"title":"I Am A Daughter Loved By The Devil","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["“Give me the lamb chops! (Give me the lamb chops!)”\nMia who lived under the abuse of her uncle and aunt.\nOne day, in a dream, she sees a future where she falls into the scheme of a foreign uncle and killed her brother, and causes world destruction.\nYou can’t die like this! The future changes with my own hands!\nMia decided to sell her uncle’s evil system to her father.\nI’m determined to charge you for information on child support…\nI opened my mouth with a rather serious expression.\nBoth hands were also proudly open.\n“Shada Shah. Just a thousand gold in the information!” (Cheap cheap. Only a thousand gold for top secret information?)”\nHey, do you want information to stop the world from collapsing?\n“Do you want me to buy you a beautiful tropical island?”\nAs soon as Abel said,\n“I’ll be bored if there’s nothing on the island, so I’m thinking about building an amusement park for my big brother.”\nKaiyan stepped in.\n“I’ll buy you an artifact that calls for mermaids. With it, you’ll be able to play with the mermaid’s songs all night.”\nDad is drinking one more drink!\nI opened my mouth politely like a clever and smart snob devil.\n“Please make the slide with pure gold.”"]},{"title":"The Genius Assassin Who Takes it All","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Genius Assassin Who Takes it All / The Genius Assassin Who Takes it All / 혼자 다 해 먹는 천재 암살자 [무료연재]"]},{"title":"Please Marry Me Again, Husband!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Please Marry Me Again, Husband! / let’s get married one more time / Sayang, mari kita menikah lagi /남편님, 다시 결혼해주세요"]},{"title":"The Obsessive Emperor’s Capable Pharmacist","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Obsessive Emperor’s Capable Pharmacist / 집착 황제의 유능한 약사입니다","“Let’s make a contract.” As soon as I possessed this body, I caught the eye of a handsome emperor and was offered a position as his exclusive pharmacist?! The salary and benefits are top-notch! In that case, let’s earn quickly and make a getaway. Then, I can enjoy a young and rich life! But wait, what? “A lifelong contract?! This is ridiculous!” I can’t become a slave to the palace for life just because I carelessly stamped one seal. So, I resolved to escape from the emperor! “Hailey, try this too.” He serves me sweet desserts, “Hailey, you are a precious person to me.” He tells me I’m special, “Resignation will be difficult. So, you should have been more careful with the contract.” Why is this man suddenly so obsessed with me?! Will I be able to resign safely…?"]},{"title":"Entangled Relationships","tags":["Drama","Romance"],"disc":["Read manhwa Entangled Relationships / 얽혀 버린","Koo Gyo-beom, the only grandson of Chairman Koo Dae-han—who built the Koo Group from the Koo crime syndicate—and the heir to the Koo Group empire, and Hong Cha Yoon, the granddaughter of Shin Ok-chun, a woman working in the kitchen of Hyeonhamwon (the Koo family estate), were as different as heaven and earth. Yet, they harbored good feelings toward each other. “Didn’t your father say that you need to know how to handle people? That’s why I just used you for practice,” said Cha Yoon—until she got caught eavesdropping on a conversation between Gyo-beom and his father. Six years later, the two reunited at Chairman Koo Dae-han’s funeral. From the moment they met again, Gyo-beom persistently began to pursue her. “Begging… I’m begging you right now. Just look at me.” Why is this man acting this way?"]},{"title":"The Fake Maid is Doted On By Her Master","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Fake Maid is Doted On By Her Master / Itsuwari no Maid wa Goshujin-sama ni Dekiaisareru / 偽りのメイドはご主人様に溺愛される","If I were to be reborn, I’d want to be a glamorous noblewoman from a novel! However, Charlotte’s wish is in vain as she is reborn as a maid in a duke’s household. Frustrated with her daily life, she channels her feelings into writing erotic novels under the pen name Amelie Lafayette. One day, Charlotte receives a beautiful dress and wig from Madame Camellia at a bookstore. Dressed elegantly, she begins to enjoy her temporary life as a noblewoman. However, her luck runs out when her master catches her. What would happen if he found out a mere maid was wandering around in such attire? “Charlotte? Why are you dressed like that?” “I think you have the wrong person. My name is Amelie Lafayette!"]}]