[{"title":"The Final Boss Became A Player","tags":["Action","Adventure","Fantasy"],"disc":["Read The Final Boss Became A Player, 最终BOSS，应征成为玩家","A game that just started closed beta testing was hacked by a mysterious AI, turning a relaxing and pleasant adventure world into an inescapable monster pit.\nAffected by the AI, the final boss became sentient and swore to protect its own game and return it to its former glory!"]},{"title":"The Genius Idol’s Strategy to Stardom","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Genius Idol’s Manual to Taking on Showbiz / 천재 아이돌의 연예계 공략법","Once-in-a-millennium handsome trainee, On Ha-je, vows never to set foot in the entertainment industry again after rejecting a sponsor’s offer and losing his debut opportunity. That’s, until he is sucked into an idol training game. Between finding hidden talents and growing as an idol, dealing with a stubborn system, and solving the past of the character he embodies, he finds himself struggling with no money, no home, and no knowledge. But he exclaims, “This is a big deal. It’s fun!” He takes on challenges, pushes forward, and conquers them all. This is the story of the genius idol, On Ha-je, who isn’t just a handsome face, but a multi-talented individual."]},{"title":"Moon-Shadow Sword Emperor","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts"],"disc":["Reading manhwa Moon-Shadow Sword Emperor , 월령검제, Absolute Master of the Senate\n“What a dogshit life… honestly.” Though he had become a disciple of the Heavenly Demon amidst the strife-filled Demonic Sect, Yeon So-Woon gets betrayed by his disciple-brother and comes to meet his end. However… When he woke up, he’s back to the time when he was a kid, before he got dragged into the Demonic Sect?! Loath to repeat his hellish life in the Demonic Sect, Yeon So-Woon begins to plan for his new life. I’ll enact revenge on the Demonic Sect, Become an elder of the Murim Union, And thus, live a prosperous and respected life."]},{"title":"Pool in Love","tags":["Drama","Fantasy","Romance","Shoujo","Time travel"],"disc":["Read manhwa Pool in Love / 풀 인 러브","Song Jinju is a low-level employee who drowned in a pool party organized by her company. She awakens and finds herself in the farthest island from the main island, 12 years in the past. Jinju manages to return to the present, but she can’t forget the island and the man she met."]},{"title":"The Man with Pretty Lips","tags":["Drama","Romance","Shoujo"],"disc":["Read manhwa A Guy With Pretty Lips / 입술이 예쁜 남자\nHan-Bi’s younger brother’s friend who had been her first kiss few years go, appeared to be a fine young man. He still chooses nice words with his pretty lips and started seducing Han-Bi as if he was determined… Whose victory will end with this amazing tension?"]},{"title":"Becoming Immortal by Paying Cash","tags":["Action","Adventure","Fantasy"],"disc":["Becoming Immortal by Paying Cash / Krypton Jin Chengxian / Kè Jīn Chéng Xiān / 商売上手の廃課金者 / 氪金成仙"]},{"title":"Don’t Be Obsessed With A Spirit Like Me!","tags":["Fantasy","Reincarnation","Romance"],"disc":["Read manhwa Don’t Be Obsessed With A Spirit Like Me! / 저 같은 정령에게 집착하지 마세요!","Reincarnated as “Asella”, the Spirit of the Wind, she was just an extra in the novel and the weakest of the Spirits. Asella was so powerless that she was constantly being harassed by her fellow Spirit companions, but she swallowed down her rage in order to survive. As per God’s will, every Spirit is to make a binding oath with their fated knight, but as it turned out, Asella made a pact with none other than the prestigious Commander of the Empire’s troops, “Lasez Siertensia”!! “Lasez? Doesn’t his Spirit die during the first battle?” In order to survive, she’ll have to start by breaking the oath binding her to Lacez. Fortunately, the two of them, not wanting to have anything to do with each other, decide to keep the pact until they are both out of harm’s way. Until then, they agreed on a “temporary alliance”! After many twists and turns, the end of their temporary pact has finally come, and Asella is about to annul the oath at last, but Lasez’s attitude suddenly changes! Out of the blue, he declares that he cannot cancel the oath anymore! On top of that, her second knight, Kairos, that she somehow picked up along the way, pushes out Lasez claiming that he’ll become her first knight. Even the crown prince, who was the original male lead, and Edward, the playboy of the Empire, beg her to take them as her knight. Same goes for Herhuis, a high-ranked Spirit who’s starting to get jealous of all these men surrounding Asella. A myriad of men reaching out to Asella, who used to be a derelict and useless Spirit! For her who was just trying to quietly survive in this novel, her life ended up taking a burdensome turn… “Don’t be obsessed with a spirit like me!”"," "]},{"title":"Becoming the Treasured Pet of Five Big Shots","tags":["Fantasy","Manhua","Manhwa","Romance"],"disc":["Read manhua Becoming the Treasured Pet of Five Big Shots / 我成了五个大佬的掌心宠","Transmigrating into a 1v5 bloody carnage novel as the female lead, Mu Haohao has a meltdown. Something about how everyone has to be in perfect harmony before she can return to the real world, she can’t do it at all! Originally, she chooses to force an escape from the plot, but who knew she actually reincarnated upon opening her eyes?! She then decides to bite the bullet and play the game of harmony, but finds out the five male leads have all reincarnated still holding memories from their previous life…"]},{"title":"I’m a Killer but I’m Thinking of Living as a Princess","tags":["Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa I’m a Killer but I’m Thinking of Living as a Princess / A Monster Hunter Becomes a Princess / I’m a Killer, But I Want to Live As a Princess / 杀手灵魂公主身 / 킬러지만 공주로 살아 볼까 해","Liana, a professional killer, wakes up as a princess in a strange world. Noticing the transmigration, her fiancé says he will let her return to her original world through one contract—but the contents are endlessly strange. Moreover, her friend, Count Arzen, makes her want to stay because of his friendly eyes. However, the hesitation was short-lived and was followed by assassination attempts of those who summoned her. Liana, who is fighting with the help of two men who are unclear whether they are friends or foes, finally found out the secret of the summoning…"]},{"title":"The Villainess is Bothered by the Male Leads Again Today","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Royal family","Villainess"],"disc":["Read manhwa The Villainess is Bothered by the Male Leads Again Today / The Villainess is Annoyed with the Male Characters Even Today / 악녀는 오늘도 남주들이 귀찮습니다","“Now that we have no ill feelings towards each other, let’s live our separate lives well and never see each other again.” It was the start of a possession that began with a typical regretful family drama. After cutting ties with a family that doesn’t get along with each other, I thought a peaceful unemployed life was waiting for me. However… For some reason, men who had no interest in me before the possession started creeping in. “I have something I like.” “What is it?” “It’s you, Lora.” The slave who I brought because I felt sorry for him getting beat up now confessed. “Why doesn’t Laura take care of herself? I’ll take care of her from now on.” The condition of the butler, who is of mixed race, became strange. “Lora, will you marry me?” The Grand Duke, who used to threaten me, proposed. “Haa, this sweet smell… you’re the first one to drive me this crazy.” This crazy man seems even crazier. …I wish they’d all just disappear."]},{"title":"The Psycho Duke and I","tags":["Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Psycho Duke and I / The Psycho Duke & I / Kidnapped by the Crazy Duke / サイコな公爵はダイアナのみを狂愛す / 미친 공작에게 납치당했다"]},{"title":"Universe’s Strongest First Love","tags":["Drama","Fantasy","Magic","Manhwa","Romance","School Life","Sci-fi"],"disc":["Read manhwa Universe’s Strongest First Love / Lovers of the Galaxy / The Greatest First Love in the Universe / 宇宙最强初恋 / 우주 최강의 첫사랑","Six years ago, when Wooju lost her father, she came across a kind-hearted alien in the mountains. Ever since then, she’s been an avid fan of aliens, but she pretends not to believe in their existence out of fear that her classmates will ostracize her. One day, Wooju discovers a school club that meets her interests. She’s excited to finally share her passion for aliens with others, but she has no idea that this will be the beginning of her exciting romance with the student body president Huimun, who has a secret of his own."]},{"title":"The Villainous Princess Saves The Doomed Knights","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Shoujo"],"disc":["Read manhwa The Villainous Princess Saves The Doomed Knights / 악역 황녀님이 망할 기사단을 살림","I transmigrated into a fantasy novel where the male protagonist, in his attempt to save the world, lose his comrades ine by one, leading to eventual destruction. My role is a villainous princess with an excessively innocent mind. I obsess over the male lead, pick fights, and eventually die in a demon attack, thus plunging the reputation of the knight order the male lead belongs to into ruin… ‘Oh, this isn’t a knight order, it’s a rabble!’ I looked around at the disheveled knights with a dumbfounded expression. “Sir, Are you properly contracted? What about overtime pay? Is there any compensation in case of accidents? How about medical support for mental stress and physical injuries?” “Why are you suddenly asking this, Your Highness?” The male lead asked me suspiciously. Well, I once obsessively pursued him, so I understand his wariness. “You should call me ‘Administrator’ instead of ‘Your Highness’.” “No, that’s…” “Kashia Astrid, as of today, you’ve been assigned as the administrative supply officer for the Azure Radiance Knights.” I smiled sweetly at the bewildered male lead. “Also, please rest assured, I’ll no longer obssess over you anymore.” His looks? Obsession? Sweet and bitter romance? What use are those when the world is on the brink of destruction! “If you keep this up, I might accidentally send a letter of complaint to the Emperor about this matter.” Playing the villainess, I even slapped him in the commander’s office. “Hey, do you want us to wash your socks too? Do you lost your hands? Huh?” I even confronted the absurd military culture. “Don’t be discouraged, it’s not your fault.” I comforted the mentally shattered future saviors. “Hurrah for the Administrative Supply Officer!” “You’re our savior!” “Hail, Kashia!” …Why did our knights turn into my fan club? And on top of that… “The Administrator will never leave us. Do you understand?” Why did even the stoic male lead lose his composure?!"]},{"title":"Manager Seo Industrial Accident","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Manager Seo Industrial Accident / 서과장은 산재처리 됐을까","“Why should we care about free-to-play players”","Seo Sa-hyuk, a planner who neglected gameplay and focused only on monetization elements, has now fallen victim to his own greed for making money, working tirelessly through the night until he succumbed to overwork.","In his unfortunate situation, he wakes up once again…","“This place is just like the game I used to create…!!”","The demonic planner who tormented gamers is now experiencing the consequences he sowed, a story of redemption and transformation begins!"]},{"title":"The Player Hides His Past","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Player Hides His Past / 플레이어가 과거를 숨김","The virtual reality game “History of the Archana Continent” became part of reality, and “players” who were synchronized with humans appeared to protect the world. Lee Hoyeol, who was an ordinary salaryman, took over the body of the character he created in middle school, “Grandfell Claudi Arpeus Romeo.” Under normal circumstances, it would have been an absolute failure of a career, but Grandfell, whose occupation is a “demon hunter,” becomes extremely proud in front of demons! The only demon hunter in this world, Grandfell (= Lee Hoyeol) starts to make a move!"]},{"title":"Mr. Qiao, Madam Is Spoiled by You","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Mr. Qiao, Madam Is Spoiled by You / Mr. Jiao, Madame Is Spoiled by You / 峤爷，夫人被你惯坏了","Once reborn, Xia Xiaotian became Leng Yunqi, the only daughter of a wealthy family in the Imperial Capital. Her parents owned a consortium, her grandfather was a legend in the Imperial Capital, and her grandfather was a leader of Shanghai merchants. The cold and cold boss turned into a double-marked monster for her and protected her in the palm of his hand. As the group’s favorite, Leng Yunqi looked calmly at the scumbag who betrayed her in her previous life: Even if you are a “god” in the mall, you are only worthy of being stepped on by me! Let’s see how the heroine is favored by the mysterious boss. , the powerful family"]},{"title":"I Became the Villain’s Wife","tags":["Comedy","Drama","Romance"],"disc":["Read manhua I Became the Villain’s Wife / Subdue My Villain Hubby / 我成了反派大佬的小娇妻","The dainty flower idol Chen Cong Rong unluckily fell into a trap and awoke to a stunning naked man in her bed! Hahaha, is it okay to be with such a beautiful man? Hang on… Are you telling me I’ve switched places with the toxic, evil, and manipulative side character who won’t even survive 20% of the plot?! No, I’m definitely not ready to die!! Watch as I keep on living my ideal life!"," "]},{"title":"Millennial Cultivator","tags":["Action","Adventure","Fantasy"],"disc":["[This person has obviously been cultivating for millions of years.] Since time traveling, the transmigrator Ye Fan has been living in seclusion in Tianwu City with the intent of living a worry-free life, until one day he awakened to his millennia of cultivation. While others feign at advanced cultivation, Ye Fan acts as though he knows nothing of it."]},{"title":"Forcibly Occupy His Highness the Prince","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Forcibly Occupy His Highness the Prince / Seizing the Crown Prince by Force / 强占皇子殿下"]},{"title":"Personal Preference","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Personal Preference / Private Preference / 私的趣向 / 사적취향","Ju Doeun learned from an early age that people are fickle. As a result, she’s focused solely on things that don’t change—for example, her family’s world-famous luxury handbag label IJu. In order to clinch her succession of the company, she agrees to get engaged to a famous designer to bring him on board. However, when she becomes entangled with police detective Gu Seyoung, she finds herself developing real feelings for the first time. Can Doeun learn to let her personal preferences take over?"]}]