[{"title":"Elite Princess’s Chief Guidelines","tags":["Adventure","Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Elite Princess’s Chief Guidelines / 엘리트 공주님의 수석지침서 /Paduan Utama Princess Elit / The Elite Princess’ Lead Guide","An unhappy marriage that began with an imperial invasion. And the news of her brother’s death in battle.\nOn the brink of despair, Princess Isabelle is drawn back to her happy childhood.\nThe past, which she had dismissed as a nightmare, comes back to haunt her,\nshe vows to change the future.\nAs valedictorian of the Kabbalah Academy, you can dream of a new future.\nHow will she fare among her less-than-friendly classmates?"]},{"title":"Close the Petals","tags":["Manhwa","Romance"],"disc":["Read manhwa Close the Petals / Put the Petals Together / 꽃잎을 여미다"]},{"title":"The Way Back to Your Embrace","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read The Way Back to Your Embrace / The Legend of Qinghuan manhua / Qing Huan Preface / Qing Huan Xu /  Begin with Qinghuan / Qīng Huān Xù / The Sequence of Clearness and Pleasure / 恋慕～清歓物語～ / 清欢序","She is the Prime Minister’s legitimate daughter, devoting her life to vengeance. He is the invincible, ruthless Warlord Prince of Blessia, yet committing to loving her for the rest of his life. Between them are not only the difference in status but also the enemy intrigues. Can they change their fates and fulfill the promise they couldn’t have in their previous life?"]},{"title":"GENTLE TYRANT","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa GENTLE TYRANT / The Gentle Tyrant / Budeureoun Poggun / Kaisar tiran yang lembut / Soft Tyrant / Нежный тиран / 優しい暴君 / 残暴皇帝的新娘 / 残酷皇帝的新娘 / 부드러운 폭군","Erika, a girl who lost her mother in the war and was bullied by her aunt.","Political interests lead her to a political engagement with one of the most feared beings in the Empire, the Emperor of the Empire, Kaal Lakin.","The cruel tyrant that everyone fears, Kaal Lakin.","In his harem there are as many princesses as the stars,","All the women who ascended the throne were carried away as corpses.","By the way,","‘Why? Why are you looking at me with such sad and painful eyes? ‘"]},{"title":"I Will Be Next to the Main Character","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Be Next to the Main Character / I Will Just Stick to the Main Character / I Will Stick to the Protagonist / Stuck With the Protagonist / 주인공 옆에 붙어만 있겠습니다","She became possessed by a madman who plans to kill more than 10 of her fiancées alone.\nThey say that there is no medicine for being bitten by a mad dog, and I ‘m trying\nto get a free ride on the main character’s world domination… .\n“You are really weak.”","… Could that be unusually strong?\nWhy do you keep taking me with you, saying it’s useless?\nCan’t I just take the bus comfortably?","“Are my hands too cold?”\n“no.”\n“… … But why do you keep trying to let go?”\n“That, that’s it, just to stroke your head for saying you did a good job!”","I pretended not to be scared and replied confidently, and Sirius laughed as if he was doing something cute.\nAlthough he was young, his handsome face was already dazzling.\nIf he hadn’t been covered in blood, he would’ve been pretty.","“yes? Then go ahead and praise me.”","Don’t pretend to be friendly all of a sudden, you madman.\nElena’s hand trembled and landed on top of her silver hair.​"]},{"title":"I’m a Villainess, Can I Die?","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Tragedy"],"disc":["Read manhwa I’m a Villainess, Can I Die? / The Duchess Has a Deathwish /悪女はまた死を選ぶ / I’m a Evil Women, So Can I Die Now? / Aku Seorang Protagonist, Boleh Aku Mati? / 악녀인데요, 죽어도 될까요?","My sister passed away sick, so I don’t want to live anymore.\nWith that, I chose death, but did I become a villain in a novel?!\nFaced with such a sad ending, I thought I could end this troubled life with my own hands…\nBut why are they still trying to save me?\n“Don’t deprive me of your status, Selina.”\n“Can you still be greedy?”\nMy life is getting better and better, and the day of my death is coming. What do I have to do?"]},{"title":"Overprotective Lady","tags":["Fantasy","Isekai","Manhwa","Reincarnation","Romance","Royal family","Slice of Life"],"disc":["Read manhwa Overprotective Lady / Miss Overprotected /과보호 아가씨","Archduke Rahan El Kanox, who has been criticized for saying, ‘It must be a demon sent by God to wreak havoc on this world. A young woman who grew up beloved in her family due to the wounds of her childhood, one day receives a proposal from the fearsome Archduke Kanox, whom she had only heard of through rumors. Despite his family’s opposition, Isel decides to marry Archduke Kanox for the sake of the family. The person who appeared before her was a kind and wonderful gentleman who helped Isel in danger in the village. Then Isel could not understand the infamy of the many who followed Prince Canox. ‘For a person who is so kind and kind… Why is everyone doing this?’"]},{"title":"You Are My Thousand Stars","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manga You Are My Thousand Stars / 亿万星辰不及你","“One year later, we’ll divorce and have no contact.” Ji Yi agreed to the fake marriage proposal from He Jichen for one reason: she firmly believed that the perfect lover, He Jichen, would never fall in love with her. From playing pretend after the marriage to the real deal, a year later, separation wasn’t even on the table – they couldn’t even part from the bed. Can’t handle the trouble? Why not run away then?"]},{"title":"Ten Years Later, I Married My Nemesis","tags":["Comedy","Harem","Slice of Life"],"disc":["Read manhua Ten Years Later, I Married My Nemesis / Married to My Enemy After 10 Years / 十年后，和死对头结婚了","Ten Years Later I Married My Nemesis manhua, Su Qian and Han Shen have been friends for 18 years but get along like cats and dogs, a childish rivalry between them.Their first year of college is starting, and they thought nothing would change between them, when suddenly Han Shen is struck by lightning. He survives, but something happens to his memories! He now claims to be from 10 years in the future where they are married! A boy claiming to be her husband and a girl inexperienced in love how will their relationship change in the future?"," "]},{"title":"Once Upon a One Night Mistake","tags":["Manhwa","Romance"],"disc":["Read manhwa Once Upon a One Night Mistake"]},{"title":"I Have Become a Crow","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I Have Become a Crow / Of all things, I Became a Crow / The Crow’s Prince / 偏偏变成了乌鸦 / 하필이면 까마귀가 되어버렸다","After dying in an accident, she was reincarnated in an otome game. …As a Crow! I can’t believe that I am a crow! Not an extra character, but a crow! When I was looking for a person around me… The first person who appeared was the Crown Prince.\n“How could you be so lovely, Reinel?” “Cawk Cawk, Cawk! (Take me with you and raise me!)” The Crown Prince, Kamut, gave me a name and treated me with love. I’m just a crow anyway, there’d be no problem if I liked him or if my heart fluttered for him. There was no problem until… “Hello, Reinel?” “What is happening to me all of a sudden?”"]},{"title":"I Have A Crush On A Cold Gangster","tags":["Adventure","Drama","Fantasy","Martial Arts","Romance","Shounen Ai","Supernatural"],"disc":["Read manhua I Have A Crush On A Cold Gangster","The story of a beautiful warrior, strong and violent like an iceberg, and a cute, effeminate, and talkative little princely heir. Chinese Wuxia."]},{"title":"Blood and Butterflies","tags":["Action","Fantasy","Horror","Manhwa"],"disc":["Blood and Butterflies manhwa, 피와 나비\nOne day, a giant monster in the shape of a bug appeared over the world… with only the “Children of the Butterfly” to fight against it."]},{"title":"My dazzling ex-husband","tags":["Comedy","Drama","Romance"],"disc":["Read manhwa My dazzling ex-husband","Korean actress Ha Eunseol. During her prime years, the female actress fell in love at first sight and married her husband, only to get divorced within a year. Korea’s top actress Ha Eunseol’s fame hit rock bottom. However, due to her stubborn tenacity, she succeeded in rising to the top again! And four years later….He reappeared. The hard struggle to not get tempted by her ex-husband! Indeed, will she be able to succeed? My Irresistible Ex"]},{"title":"Divine Circumstances","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Divine Circumstances /  God’s Love Story Love Situation of the Gods / 神仙也会谈恋爱？！/  神様たちの恋愛事情 / 신들의 연애사정","People have red threads that tie them to their destined significant other. Are Ryeong and Taeseong going to be tangled up by their red threads? Are they just enemies that couldn’t stop bickering? Or are they going to be lovers bound by the red threads?"]},{"title":"Ophelia the Oracle Queen","tags":["Adaptation","Drama","Fantasy","Historical","Isekai","Magic","Reincarnation","Romance"],"disc":["Read Ophelia the Oracle Queen / 나는 여왕이다","There’s nothing more frustrating than a novel with endless tragedy and zero triumph. Such is the tale of Ophelia, a powerless princess who is used by those around her only to be cast aside and poisoned to death. So when an ordinary bookworm wakes up in the princess’s body, she knows that she must rise to the throne in order to survive. Being the illegitimate daughter of the king is a setback, but luckily, she also happens to be the daughter of the palace temple’s abbess. Once she pretends that she had a vision of her future self as the queen, the king starts relying on her “oracles” to guide his decisions. But even with her father’s support, Ophelia knows that eliminating her political rivals won’t be an easy task. Will the new heroine be able to scam her way to queendom, and more importantly, a happier ending?"]},{"title":"Meet Me Today","tags":["Josei","Manhwa","Romance"],"disc":["Read manhwa Meet Me Today / 오늘은 나랑 만나"," "]},{"title":"The Boss’s Proposal","tags":["Manhwa","Romance"],"disc":["Read manhwa The Boss’s Proposal / 상사의 청혼"]},{"title":"I Must Be the Empress","tags":["Drama","Fantasy","Isekai","Manhua","Romance"],"disc":["Read manhwa I Must Be the Empress","The infamous murderer, ‘female devil’ Xia Zhi is tied to the full-time empress system. She traverses three thousand small worlds, subdues scumbags, flirts with men and fights for the position of empress! To wash away the sin of murder and resurrect, she prevents all kinds of poisonous women from becoming the empress and ruining their empire…"]},{"title":"Realm of Queen","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Realm of Queen","Drake, a pirate called the black dragon of the sea. While plundering a merchant ship in Spain, he got on board the ship Elizabeth I was on. Unable to satisfy his desires, he pursued gold and silver treasures. When he saw Elizabeth I, he felt his heart beating and he was delighted so they planned to get the Queen of England. Queen Elizabeth I noticed Drake’s abilities. In return for giving the stolen gold to the country, she spared Drake. In anger, Spain uses this as an excuse to declare war on England. The romance story of her single life!"]}]