[{"title":"The Invincible Me Just Wants To Be Ordinary","tags":["Action","Adventure","Fantasy"],"disc":["Read The Invincible Me Just Wants To Be Ordinary / 无敌的我只想当个凡人","After transmigrating to the world of immortal cultivation, Shui Wuyu discovered that he had an invincible ability, but he didn’t expect that once he used it, his lifespan would be consumed. In order to survive, Shui Wuyu decided to become a mortal. However… “I just want to be a mortal!! Why do you all want to mess with me!!!” [Since the author completes a comic alone, it will take a long time to update. Please understand~]"," "]},{"title":"Outrageous! I opened a training class for empresses","tags":["Action","Adult","Drama","Ecchi","Fantasy","Manhua","Mature","Romance"],"disc":["Read manhua Outrageous! I opened a training class for empresses / 离谱!我开了女帝培训班 / Lipu! Wo Zhen Mei Xiang Kai Nvdi Peixun Ban!","Lu Li, An Ordinary Teacher With Amnesia, Managed To Turn His Three Female Students Into A Queen Of Killers, A Queen Of Medicine, And A Queen Of Business?! It Turns Out His True Identity Is An Ancient Immortal Who Lost His Memory And Fell To The Mortal World. Now That He Has Regained Everything, He Decides To Defy Fate With His Disciples And Reclaim His Former Glory!"]},{"title":"I Became A Terminally-ill knight","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa I Became A Terminally-ill knight / A Knight With a Time Limit / 시한부 기사가 되었다"]},{"title":"Doctor Resignation","tags":["Drama","Fantasy","Josei","Manhwa","Reincarnation","Romance","Royal family","Shoujo","Time travel"],"disc":["Read The Doctor Is Out / The Family Doctor Is Gonna Resign Since She Is Already Done With Everything / Doctor Resignation / The Attending Physician Does Her Job and Resigns / 主治医师完事后准备辞职 / 주치의는 할 일 다 하고 사표 씁니다","When the duke, who was in poor condition, suddenly died, the land fell into the hands of the rebels. In a short time, the rebellion was suppressed by the royal family, but…\nThe point is that I, Lise Estelle, will be hanged for treason.\n“It’s not fair!”\nI’m simply the best doctor in the area.\nIf that’s the case, I’ll become the duke’s doctor so there’s no rebellion, and I’ll make the duke’s heir healthy!\n“No one cares about you as much as I do. Therefore, you must definitely listen to me.”\n“Run! You need to strengthen your immunity!”\n“Eat this grass. Don’t say anything more and just eat.”\nUm…But why is he so tall? Did he have a good physique in the first place? Well, anyway, I’m glad he was raised well, so I can resign now…\n“Resignation?”\nHis eyes narrowed and the surroundings began to give off a cold air.\n“Lise, you said you were the only one who cared about me.”\nBefore I knew it, he walked over and sat in front of me. Whispering in my ear as if deliberately seducing me.\n“Let me go? I’m not stupid, Lise.”\nUnlike my previous life, he is now healthy and even his personality has changed."," "]},{"title":"Quick to Wear: The Villain Is Too Spoiled and Too Provocative","tags":["Drama","Fantasy","Romance"],"disc":["Read manhua Quick to Wear: The Villain Is Too Spoiled and Too Provocative / Quick to Wear: The Villain Is Too Spoiled and Too Provocative / Quick Transmigration: The Villain Is Too Pampered and Alluring /  快穿：反派太宠太撩人"]},{"title":"The Cold President’s Little Cutie","tags":["Drama","Fantasy","Romance"],"disc":["Read manhua The Cold President’s Little Cutie / 薄情总裁的专属小奶包 / Bóqíng Zǒngcái De Zhuānshǔ Xiǎo Nǎi Bāo / The Fickle President’s Exclusive Cutie Pie","My mom is the naïve and sweet protagonist in a tragic romance novel. My mom is also the substitute lover who escaped from the overbearing President. And I? Well, I’m the five-year-old genius hacker. Gu Chu, a brilliant hacker, finds herself reborn in a tragic romance novel as a five-year-old cutie. Her mother is the unfortunate heroine, her father is the blind-to-reality President, and they’re surrounded by scheming relatives, a two-faced aunt, and various villainous women. Determined to protect her mother, little Gu Chu stands tall and begins to fight back. What harm could a five-year-old possibly cause? She just wants to protect her mommy and maybe inherit her President daddy’s billions along the way."]},{"title":"Sword God Dragon","tags":["Action","Adventure","Fantasy","Shounen"],"disc":["Read manga Sword God Dragon","To martial artists, he was known as the Sword Calamity or the Sword Monster, but to the common folk, he was a savior. About thirty years ago, Junghyun, the strongest and most fearsome monster in the history of the Wudang Sect, suddenly disappeared without a trace after the Heavenly Demon died.","And after some time had passed, Junghyun, who had maintained his youth, reappeared in the martial world, bringing with him a young girl. This girl was Sojin, the granddaughter of the Heavenly Demon, Junghyun only true rival and friend in life.","Junghyun embarks on a journey to Mount Wudang with Sojin.\n“Will the two be able to complete their journey safely?”"]},{"title":"Want You Like Crazy","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Want You Like Crazy / Madly Desired / Mariage à cœur ouvert / 狂おしいほど求め合う / 미치도록 원하는","General surgery resident Yoon Haesoo has always focused on paying off her father’s debt and becoming a great surgeon. But after CEO Chae Jiseok enters the ER as a VIP patient, her world is completely turned upside down. Not only does he want her to be his only doctor, Jiseok wants to spend every second with her. Haesoo can’t understand why a stranger would be so interested in her, but she also feels strangely attracted to him. Little does she know that this isn’t their first time meeting…"]},{"title":"The Crown Prince’s Maid Makes Tea Very Well","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Crown Prince’s Maid Makes Tea Very Well / 皇太子と侍女の美味しいティータイム / 황태자의 시녀가 차를 너무 잘 끓여","In the bustling royal palace, Erica, reborn into nobility with a passion for tea-brewing from her past life, finds her future steeped in drama. Her exceptional tea-making skills quickly catch the court’s attention. Navigating the tricky politics of tea time, Erica must charm the demanding Crown Prince with her unique blends. Each cup she crafts could bring her closer to her dream of opening a teahouse in the capital or spell disaster. Join Erica in a delightful mix of comedy, romance, and royal intrigue, where every brew has the power to shape her destiny and uncover secrets."]},{"title":"The Emperor’s Sleepless Nights","tags":["Drama","Fantasy","Manhwa","Medical","Revenge","Romance","Royal family"],"disc":["Read manhwa The Emperor’s Sleepless Nights / 황제는 잠 못 이루고","Chloe thought Luke’s revenge was just, as her own father had killed his father. That is why when she is brought back to the past, she decides to accept her tragic fate. But suddenly and unexpectedly, Luke’s most trusted Knight approaches her. “He won’t be able to kill you, so escape as if you’re dead.” She is convinced by Luke and decides to flee with him, thinking there will no longer be any obstacles as long as she fakes her own death, until… “Your life belongs to me.” Chloe and Luke’s paths cross again when they meet as the insomniac emperor and the pharmacist who concocts his sleeping pills. With a completely new identity, Chloe no longer looks the same, yet Luke is instinctively drawn to her. Will Chloe be able to escape death and become happy again?"]},{"title":"Rewrite My Happy Ending","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Rewrite My Happy Ending / 완벽한 엔딩을 위하여","Reincarnated as the heroine of a novel she once read, Veronica seeks revenge against her tyrannical father. Amidst a web of intrigue, she cautiously aligns herself with the enigmatic Prince Lowen and Duke Evan, who happen to be the murder suspects of her previous homicidal death. As Veronica carefully carry out her plan of revenge, she also finds herself drawn to Lowen and Evan, unraveling hidden truths of her past life."]},{"title":"Oh, Lustful King! Please Reject Me!","tags":["Drama","Fantasy","Romance"],"disc":["Read manga Oh, Lustful King! Please Reject Me!","I want to be hated by my love… if it means preventing this unfortunate future! One day, Luise, the 16-year-old daughter of the Marquess, regained memories from her past life. She discovered she had reincarnated as the villainess from a video game she once adored. Remembering she faced only two dismal futures: enduring each day miserably as an unloved queen or facing exile after a broken engagement, she was devastated by the tragic prospects ahead. Determined to take action herself, can she avoid this unfortunate future? Can she successfully make her lover hate her?"]},{"title":"The Maid’s Secret Tea Recipe for the Prince","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Maid’s Secret Tea Recipe for the Prince / 皇太子と侍女の美味しいティータイム / 황태자의 시녀가 차를 너무 잘 끓여","In the bustling royal palace, Erica, reborn into nobility with a passion for tea-brewing from her past life, finds her future steeped in drama. Her exceptional tea-making skills quickly catch the court’s attention. Navigating the tricky politics of tea time, Erica must charm the demanding Crown Prince with her unique blends. Each cup she crafts could bring her closer to her dream of opening a teahouse in the capital or spell disaster. Join Erica in a delightful mix of comedy, romance, and royal intrigue, where every brew has the power to shape her destiny and uncover secrets."]},{"title":"Immortal Emperor’s Revenge: The Rise of Tianxuan Sect","tags":["Action","Adventure","Fantasy"],"disc":["Read Immortal Emperor’s Revenge: The Rise of Tianxuan Sect  / 修真百万年：我的弟子遍布仙界","One million years ago, the Immortal Emperor Su Xuan was killed by the otherworldly demons with the help of the six great immortal ancestors. Reborn in the lower realm, he founded the Tianxuan Sect and vowed to return to the immortal world for revenge. A million years have passed, and his disciples have ascended one after another, becoming dominant figures in the immortal realm. As for him, he has just ascended to the immortal world and is a novice. Su Xuan pretends to be foolish and plays the fool while secretly gathering his disciples and rebuilding the Tianxuan Sect, with the aim of reaching the pinnacle of the immortal realm once again!"," "]},{"title":"The Queen’s Life was At Stake","tags":["Drama","Fantasy","Isekai","Manhua","Romance"],"disc":["Read manhwa The Queen’s Life was At Stake","A young woman awakes in the body of Guinevere, a princess in an obscure book who is to become queen of the Twilight Kingdom. However, the wretched King sentences her to death, which should have put an end to her story. But an unknown man rescues Guinevere and gives her the chance to rewrite the book’s entire plot. This poor little princess won’t take the abuse any longer – Guinevere is determined to take the throne that she deserves! But who is this mysterious “prince charming” who saved her? And could he be the key to Guinevere’s quest to become queen?"]},{"title":"Under the Plum Blossom Tree","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Yaoi(BL)","Yaoi(BL)"],"disc":["Read manhwa Under the Plum Blossom Tree / Dưới Tán Hoa Mơ / Plum Blossom Shade / Shade of Plum Blossom / The Shade of Plum Blossoms / 春告げ草の下で / 매화꽃 그늘 / 매화꽃그늘","As the son of a prestigious political figure in Joseon, Hajin has only ever been interested in studying to become like his father. That is, until he meets Namwoo, a young man who takes on various odd jobs as he struggles to pass his school exams. As they overcome hardships together and learn more about each other’s history, they soon realize that their lives are intertwined in more ways than they thought. Will their relationship bloom, or will it just scatter like the petals of a plum blossom?"]},{"title":"The Handmaiden Hates Childcare","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Handmaiden Hates Childcare / My Maid Doesn’t Like Parenting / 시녀님은 육아가 싫어요","While working part-time at a mart, I suddenly find myself transmigrated into the vicious nanny Eileen in a romance novel?! Determined to prevent a dreadful future where I meet a tragic end at the hands of the twin princes I was caring for, Eileen resolves to nurture the young princes, who are still innocent before their descent into darkness, into kind-hearted adults. Just when everything seems to be going smoothly after finding my true calling in the peaceful life of parenting, the empire’s mad Duke Kashaar appears…!"]},{"title":"Enoch: Shining Tree","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Enoch: Shining Tree / 에녹:빛나는 나무","“Those wearing armor shall never take off their arms, will never die, and will live in pain.”\nWith a witch’s curse, the ‘Cursed Knights’ began to roam the world.\nAnd Enoch, a boy who encounters one, is about to discover what happens to him."]},{"title":"I Regressed to Level Up Instead of Being a Simp","tags":["Action","Fantasy"],"disc":["Read I Regressed to Level Up Instead of Being a Simp","After failing the college entrance examination and being cheated on, Han Li, who achieved nothing after graduation, made a wish to heaven: “I wish… to go back in time…” Thus the Consumer System appeared and Han Li regressed to the age of eighteen! Not enough skills? Upgrade them with points! Looks too ordinary? Fix that mug with some points! The rich classmate who always looked for trouble taught him a lesson, and captured the hearts of the goddesses… With this regression, let’s witness how Han Lie counterattacks and rises to the heavens!"]},{"title":"National School Prince Is A Girl","tags":["Romance","School Life","Shoujo","Supernatural","Webtoons"],"disc":["Read manhua National School Prince Is A Girl / The School Prince is a Girl / 国民校草是女生 / 帝少心头宠：国民校草是女生","Fu Jiu appears to be a normal lad in high school on the surface. But in fact, she (Yes! She!) is the hacker, Z, a villain-terminator in the online world of an alternate world. Having reincarnated into the body of a woman and being forced to disguise herself as a young man, she reigns over the game world, fights for justice, and puts a spell on all the girls around with her innate charm. However, her flirting comes across as gay to the rich Almighty Qin and his inner circle. Over time, the Almighty Qin falls for him… her. Has he turned gay for him… her? Now, that’s confusing!"]}]