[{"title":"Going To Bed With My Hater","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Going To Bed With My Hater / 위험하고 은밀한 그 남자의 집","Heesu, a critic known for her hating comments towards the Korea’s top actor Dohyun was getting herself drunk in a small street vendor near her house after her boyfriend’s ghosting. She runs into Dohyun while she’s totally wasted, and somehow wakes up naked in his bed the next day. To make things worse, she has to co-star with Dohyun in a TV program called “Going To Bed With Your Hater”. While Dohyun is making a move on Heesu more and more aggressively, Heesu can’t help but start to fall in love with him slowly."]},{"title":"It’s Okay if There’s no Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":[]},{"title":"F-Class Destiny Hunter","tags":["Action","Adventure","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa F-Class Destiny Hunter / F급 데스티니 헌터","[By the studio that brought you Solo Leveling, Return of the Disaster-Class Hero and many more!]","F-Class Destiny Hunter is a Manga/Manhwa/Manhua in (English/Raw) language, manhua series, english chapters have been translated and you can read them here. You are reading chapters on www.MangaRolls.net fastest updating comic site. The Summary is","In a world where destiny decides the ability one awakens, Seo Gangrim is born with the worst destiny.\nHe awakened as a hunter, but he was the very bottom of the bottom.\nOne day, he is ambushed…","[Power ‘Destiny Stealing’ is being activated. You have obtained the power ‘Regression’.]","He lost all his teammates to an assassin, but right before dying, he regressed to his past.","Right then, Seo Gangrim made the decision never to leave his life to destiny again."]},{"title":"Kiss Goblin","tags":["Romance"],"disc":["Read manga Kiss Goblin","To Oh Yeonah, money means everything. Her top priority is money, and her only interest is managing that money.\nHer life seems to go perfectly well until she loses her entire asset to her boyfriend who turns out to be a conman.\nDuring the process, she crosses paths with the goblin, Bansuk, and, being completely broke,\nshe signs a contract with the Goblin Queen to live in their house and receive wages in exchange for maintaining the secrecy and helping Bansuk complete his mission.\nThe mission is to kiss ten humans that the Queen chooses and obtain ten human emotions to ultimately become human.\nWill Oh Yeonah be able to help Bansuk successfully accomplish his mission?"," "]},{"title":"The Huntress and The Mad Scientist","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Huntress and The Mad Scientist /  헌터와 매드 사이언티스트"]},{"title":"I Reincarnated As The Crazed Heir","tags":["Action","Manhwa","Martial Arts"],"disc":["Read I Reincarnated As The Crazed Heir / Reincarnated as an Unruly Heir / Vice-Lord’s Rebirth / 망나니 소교주로 환생했다\nYang Jagak, who was assassinated through poison during the political wars of the Murim. While he thought he was dead, he realized he was in the body of another person. He found out that he is in the Demon Cult, the art he knows is the Heavenly Demon God Arts, and the owner of the body was the crazed heir who lusted after women. Why did it need to be the Demon Cult, and why did it need to be this person?"]},{"title":"Fiery Enemies","tags":["Comedy","Drama","Manhwa","Romance"],"disc":["Read manhwa Fiery Enemies / The Hottest Enemy / 뜨거운 웬수","On her deathbed, a beloved grandma leaves behind a terrifying last wish: for her granddaughter to reunite with the horrible, no-good ex-husband that didn’t last even one year! Garyung instead vows to live alone forever, even if that means giving up her entire inheritance. But when a disastrous fire threatens to rob Garyung of her hard-earned fashion empire, she is forced to come to terms with the money, and the man, at stake. Where there is hate, is there also… love?"]},{"title":"The Sultan’s Love","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Sultan’s Love / La flor del Sultán / Sultan no Hana / Sultan’s Flower / Sultan’s Love / Sultans Love / The Sultan’s Love / スルターンの華 / 苏丹之花 / 蘇丹之花 / 술탄의 꽃","[Mature Audiences Only] For eleven years, Sayeh has resided in the sultan’s harem, staying out of sight and doing her best to avoid attracting any attention. All that changes when one night, she happens across the sultan’s path and is called to his bedchamber… But just when all seems lost for Sayeh, news of a sudden revolt by the ninth prince, Kainer, rocks the palace. Under Kainer’s rule, all the other women are set free from the harem, and Sayeh hopes that her freedom may finally be within reach as well. Instead, the newly crowned sultan pays her a personal visit, expressing feelings for Sayeh that she never could’ve imagined. But does Kainer’s love offer her salvation or ruin…?"]},{"title":"White Moon He Made a Move On Me","tags":["Manhua","Romance"],"disc":["Read manga White Moon He Made a Move On Me","Glamorous and arrogant angry young woman VS elegant and haughty handsome man. Jiang Yaoyao has been secretly in love with Bo Jinlan for years, hiding it carefully, until one day she wakes up in a hotel and sees him sleeping next to her… Then she suddenly becomes Bo Jinlan’s fiancé. No one in the Jiang family dared to bully him anymore, and the boss in Beijing respected him wherever he went, a group of juniors called him brother-in-law, and Mr. Bo suddenly became addicted to him!"]},{"title":"Stigma Effect","tags":["Drama","Fantasy","Josei","Manhwa","Mature","Romance","Smut"],"disc":["Read 스티그마 이펙트 / Stigma Effect / Efek Stigma","“Warning: Mature content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”‘If I can be with Raphlet-nim, it’s fine to face any danger.’ From a young age, if I dream, I can have a dream predicting that a monster will come, but people were busy avoiding Yuriel like that. Then, she was attacked by a monster and was almost in danger, and Raphlet, who passed by, rescued her and took her to care for her. Yuriel, who thought he had been saved by Raphlet, decided to do everything for his future master. Raphlet Mogris, ruler of Yuriel and the world. However, Raphlet leaves Yuriel and becomes a warrior, heading to the kingdom of heaven where it is said to be full of demons. She waited for his master, but he did not return, and she heard that she was injured. ‘I can’t wait like this without doing anything. I have no choice but to go to the emperor myself!’ Yuriel is heading to the Yellow Sea to meet Raphlet…!"]},{"title":"I Thought It Was a Fantasy Romance, but It’s a Horror Story","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural","Webtoons"],"disc":["Read manhwa I Thought It Was a Fantasy Romance, but It’s a Horror Story / I Thought It Was a Romance Fantasy, but It’s a Horror Story / I Thought It Was a Ropan, But It’s A Ghost Story / 以为是罗曼史，结果是怪谈 / 로판인 줄 알았는데 괴담이다 / 로판인줄 알았는데 괴담이다 / The Rules of Rose Ivy Manor","One day, when I opened my eyes, I had become Rosé, the second daughter of a wealthy family. What do you mean I’m a lady of leisure born with a golden spoon in my mouth? I won’t let this chance of a lifetime slip through my fingers. I’m going to loaf around and enjoy good food.","“I’ll do my best as a fiancé, Rosé,” said a rich man with world-class good looks.","At this point, it was impossible to deny it. This is a Korean fantasy romance. I must have become a character in a romance fantasy!","***","This is the story of a girl who transmigrated into what she thought was a romance fantasy book, but…","It’s actually a horror story!"]},{"title":"To You, Who Keep the Star","tags":["Romance","Slice of Life"],"disc":["Read manhwa To You, Who Keep the Star / To You, Who Kept the Star / To You Who Swallowed the Star / 별을 삼킨 너에게","The reason why we shine even in the dark reality is that we have different stars. Our growth that shines like a star, and romance"]},{"title":"Crowning My Feral Prince","tags":["Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa Crowning My Feral Prince / 내 개를 황위에 올리는 방법","Some people start off their possession stories on an epic journey of discovery and growth–but not the newly awakened Trixie Giuseppe. She’s not even five minutes into her novel but is already married to the biggest creep ever and disowned by her parents. Wishing to free herself from the shackles placed by her awful husband, Trixie takes a job as a servant at a remote estate. But she discovers too late that the “young master” she has to serve is the empire’s foolish prince, Leone Atarta. The novel’s author must’ve misspelled the word “feral” as Leone turns out to be much more of a beast than a simple beauty. And thus begins Trixie’s tale of trying to tame her new “dog” and make him the shining crown prince he’s meant to be."]},{"title":"Bad Deeds of the Terminally Ill Empress","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Bad Deeds of the Terminally Ill Empress / 시한부 황후의 나쁜 짓","It was an arranged marriage, but it was her first love. I loved him not because he was the Emperor, but because it was you. In a wheelchair, Stella dedicated herself to the empire and her husband. However, what came back was a cruel death. The goddess Eunsaji returned Stella, who died paralyzed, and chose her childhood friend in this life as well. Looking at her husband, Stella impulsively took a gladiatorial slave."]},{"title":"The Warlord’s Game Strategy","tags":["Adult","Drama","Fantasy","Manhua","Mature","Romance"],"disc":["Read manhua The Warlord’s Game Strategy / 攻略暴君游戏"]},{"title":"While I’m Back in Time, I’ll Get My Revenge","tags":["Adaptation","Drama","Magic","Mature","Psychological","Romance","Royal family"],"disc":["Read manhwa While I’m Back in Time, I’ll Get My Revenge / Now That I’m Back, I’ll Get My Revenge / 회귀한 김에 복수하겠습니다","Most people would consider getting a second chance at life a blessing, but Arnell Radfell is furious when she wakes up to find herself back in the past. Terrified of having to suffer through the horrors of her past life twice, she attempts to end her life again but is rescued by Sir Herbert Schladin, the very man who gave her the courage to end her life the first time. However, when Arnell finds out that she can use the power of mana, she has a change of heart. They say revenge is sweet, and now, Arnell is determined to make everyone who made her suffer in her past life pay."," "]},{"title":"Struck by an Obscene Curse","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Struck by an Obscene Curse / I was caught by an obscene curse / 음란한 저주에 걸려버렸다 / Saya terkena kutukan cabul","“Put it inside me.” “Are you sure, Princess?” “Yes, I am. Put it inside me. Do it with me.” Abel, the third princess of the Kingdom of Ernst, grew up sheltered like a flower in a greenhouse. During her otherwise ordinary days, she suddenly became cursed. The curse of desire bestowed upon the three sisters. Cecil, the eldest sister, ate voraciously, and Charlotte, the second sister, slept as if she were dead. And I… began to feel an overwhelming sexual desire. Knights, wizards, priests; I did not discriminate in my liaisons. Sometimes with one, sometimes with two, or even… How many times will I do it today? Can I manage to sleep? My heart trembles, and I cannot tell if it’s from fear or excitement."]},{"title":"The most poweful characters in the world are crazy about me","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manga The most poweful characters in the world are crazy about me / The Strongest Characters in the World are Obsessed With Me /세계관 최강자들이 내게 집착한다\nShe was born as the sister of the greatest future villain!\nThe family will be destroyed, and I will be a big trouble.\nSo unconditionally, I have to run away from this family ASAP!\n“I want to dance with Dahlia. What’s wrong?”\n“I’m sorry, but my brother is shy.”\n“Dahlia said I liked it best!”\nBut that was not enough to attract my brother too much.\nAll the strongest people in this world are obsessed with me!\nThis story is recommended for those who want a strong male lead; a princely man, a sweet heroine, a pure and daring possessive heroine, a feminine scent, old fashioned for men and good for killing time.\nThe most poweful characters in the world are crazy about me/The Strongest Characters in the World are Obsessed With Me/작가님,김코끼리 작가님"]},{"title":"Sweet Dream","tags":["Manhwa","Mature","Romance"],"disc":["Read manhwa Sweet Dream / Dulce Sueño / 스윗 드림 / 스윗드림 ~꿈속의 달콤한 덫~","[Mature Audiences Only] Jaehee has a terrible history with dating in the office, so she intentionally remains single to focus on her work. But things get complicated when she starts having risqué dreams about her boss, Mr. Seo, and nothing she does can quell the intoxicating fantasies. While trying to balance work and these impure thoughts, Jaehee happens upon a mysterious old woman that swears a cheap-looking bracelet will protect her from the incubus haunting her dreams. But if what she says is true, then is Mr. Seo really a lustful incubus? It would explain why Jaehee can’t control her physical urges around him. Are these symptoms a reflection of her inner desires or is she simply under her boss’s spell?"]},{"title":"Don’t Cry","tags":["Drama","Manhua","Romance","Slice of Life"],"disc":["Read manga Don’t Cry\nOutsiders only know about the eldest daughter Tang LuoQian. Who is beautiful and will soon make a marriage contract with Luo Zhan, the young master of Luo Family. Very few people know that the Tang family also has a younger daughter Tang Ran who was blind. On her 16th birthday, she was gifted a robot to accompany her. Tang Ran who was alone in the side house, wanting to see her robot. There stands Luo Zhan…"]}]