[{"title":"Onsaemiro","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Onsaemiro / 온새미로","To prepare for her audition to cast in the upcoming historical drama, “Muyoung Tower,” would-be actress Haeri visits the Buyeo National Museum, where she finds the “gilt bronze incense burner,” an old Baekje artifact. Thanks to her, Onsaemiro, the son of a god who had been lying dormant in the incense burner, awakens, and the cycle of fate starts to move once again…"]},{"title":"The Princess of Blue Roses","tags":["Fantasy","Isekai","Romance","Shoujo"],"disc":["The Princess of Blue Roses manga, Ao Bara no Hime , 青薔薇の姫\nOn the day of her execution, Vyaria wakes up to find time has reversed itself, making her seven years old again. Thinking of the events of her future, she is truly traumatized. Her first marriage to King Cain had been a cold and unhappy one. Each time she made an attempt to get closer to him, she had been faced with rejection, and the sudden appearance of a girl from another dimension had only increased Cain’s hostility towards Vyaria. Behind her back, everyone had called her the “Princess of Blue Roses,” after the flower that symbolizes unattainable wishes.\nKnowing she would eventually be sentenced to death by her own husband, Vyaria is terrified when she is once again united with the young Cain. Is everything going to repeat itself? Is there really nothing she could do to change the future?\nAs scared as she is, Vyaria vows to fight against her cruel fate in this second chance at life…!"]},{"title":"Aurora’s Sanctuary for Lost Things","tags":["Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read manhwa Aurora’s Sanctuary for Lost Things / 목성의 오로라","Aurora has always had a habit of picking up random things off the streets since she was young. A chicken, a horse, and now… a person? When Aurora finds Jovian passed out and injured in the forest, she brings her in and takes care of her like family. However, despite Aurora’s kindness, Jovian keeps her at arm’s length. It’s obvious that Jovian is hiding a secret, but Aurora is willing to wait until she opens up. But when the village sheriff comes looking for Jovian, it’s a matter of time until Aurora finds out that Jovian might not be the person she thought her to be…"]},{"title":"Taming the Absolute Tyrant","tags":["Romance","Slice of Life"],"disc":["Read manhwa Taming My Boss / Taming the Absolute Tyrant / 절대갑 길들이기 / Menaklukan Seorang Tiran / Menaklukan Jeoldaegap\nKang Eun-Hyun, CEO of “Red Fit”, he is considered the new generation leader in the domestic game industry.\nhe has a good-looking face and perfect physique: when he opened his mouth, his steely words struck the listeners! but he was missing one thing…\nCho Eun is Eunhyun’s secretary. With a calm and patient personality, she tactfully accepted the president’s harsh words.\nAfter work, she continues her normal (?) life by telling her co-workers and company friends about Eunhyun.\nHowever, Eunhyun’s harsh words became worse and worse. At the moment she thought she had to make a decision whether to stay with Eunhyun or not, but something unexpected happened!\nThis is a story about love plan, personality remodeling of Cho Eun, a versatile secretary who tamed Eun-Hyeon, Jeoldaegap!"]},{"title":"The Great Ruler","tags":["Action","Adventure","Manhua","Martial Arts","Shounen"],"disc":["The Great Thousand World. It is a place where numerous planes intersect, a place where many clans live and a place where a group of lords assemble. The Heavenly Sovereigns appear one by one from the Lower Planes and they will all display a legend that others would desire as they pursue the road of being a ruler in this boundless world. In the Endless Fire Territory that the Flame Emperor controls, thousands of fire blazes through the heavens. Inside the Martial Realm, the power of the Martial Ancestor frightens the heaven and the earth. At the West Heaven Temple, the might of the Emperor of a Hundred Battles is absolute. In the Northern Desolate Hill, a place filled with thousands of graves, the Immortal Owner rules the world. A boy from the Northern Spiritual Realm comes out, riding on a Nine Netherworld Bird, as he charges into the brilliant and diverse world. Just who can rule over their destiny of their path on becoming a Great Ruler? In the Great Thousand World, many strive to become a Great Ruler."]},{"title":"When A Saint Who Lost Her Virginitiy Touches Love","tags":["Fantasy","Josei","Romance"],"disc":["Read manga When A Saint Who Lost Her Virginitiy Touches Love / 純潔を失った聖女が愛に触れたら","Leria, a girl around 12 years old awakened the power of a saint whom duty is to protect the country. When she got her power, from a poor viscount house, she turns up to a royal palace. To save people, she prays wholeheartedly everyday, and receives prince Evan, the second prince’s marriage proposal and spends her days happily. However, on a certain day the second holy maid’s power awaken and angel turns up in palace. Since it’s unusual that the power of two people awakes in the same generation, they promised to help each other. However one night, something happened. After praying, Leria got kidnapped by someone, and lost her purity. As a result, she doesn’t have the qualification of being a holy maiden anymore. The second prince’s broke off his engagement with her, and then she finds out that this was a plot between him and the other angel. She becomes the servant of those two people in love and is treated miserably until she meets someone…"," "]},{"title":"The Devious New Employee","tags":["Drama","Romance"],"disc":["Nam Jieun is your run-of-the-mill employee at the small cosmetics company Rendezvous. At the farewell party for the manager that she had a crush on, she got super drunk to work up the courage to confess. “Miss Nam, I’m going to cut to the chase. Are you in love with me?” “The thing is… your lips… are really attractive!” The person she confessed to… “Are you taking your frustration out on me?” …turned out not to be her crush, Kang Minjae, but her company’s CEO, Tarantula Masung – aka Ma Sungjoon, the #1 person she avoids due to his personality, which is the complete opposite of his outstanding appearance?!"]},{"title":"Her Private Bodyguard","tags":["Action","Ecchi","Fantasy","Romance"],"disc":["Read manga Her Private Bodyguard / 女总裁的贴身高手\nOnce the ace of the mysterious gang “Dragon Spirit”, he was named the “God of Death” who terrorized even the darkest forces. Now he is retired and trying to lead an ordinary life, only to find himself entangled with an array of beauties: a goddess-like wife, a violent policewoman, an innocent secretary, a cool mafia…to make the matters worse, every woman comes with trouble in abundance…"]},{"title":"Grand Duke, I Can’t Do It Because It’s Too Cold in The North","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Grand Duke, I Can’t Do It Because It’s Too Cold in The North / Grand Duke, Saya Tidak Bisa Melakukannya Karena Terlalu Dingin Di Utara / 북부 대공 부인, 추워서 못 하겠습니다"]},{"title":"Now I Will Take The Emperor’s Heart","tags":["Comedy","Drama","Fantasy","Isekai","Magic","Manhwa","Romance","Survival"],"disc":["Read new manhua Now I Will Take The Emperor’s Heart / 지금부터 황제의 마음을 빼앗겠습니다","Ra Hyun, who suddenly died because of arrhythmia, begs God to return to life. Finally, she gets to come back but as Daphne from Fiant Empire. In order to return to her original world, she has a mission to accomplish in which she has to fully conquer the emperor’s heart. Will she be able to gain the emperor’s heart and return to her original life?"]},{"title":"30 Day Fiancée","tags":["Drama","Fantasy","Historical","Josei","Manhwa","Romance","Shoujo"],"disc":["Read manhwa 30 Day Fiancée / 30일의 약혼녀 / Fiancée for 30 Days / The Fiancée on the 30th\nA woman who went beyond the dimension to not die, Han In-seo. Duke Belesquez, a man who needs a stand-in to avoid unpleasant marriage. Romance between the two, entangled by necessity and contract, but destined to love."]},{"title":"Did Yuanbao Make Money Today?","tags":["Drama","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["元宝今天赚钱了吗？\n(From Solstice Translations) Ou Yuanbao is the eldest Miss of the extremely wealthy Ou family who is always giving her grandfather a headache. She deliberately gained notoriety to avoid marriage. One day, her grandfather unexpectedly brought home an illegitimate son and forced her to choose between competing for inheritance and marriage!"]},{"title":"Suddenly Became A Princess One Day","tags":["Comedy","Drama","Fantasy","Magic","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Suddenly Became A Princess One Day, One Day I Became a Princess, who made me a princess , Who Made Me A Princess , 某天成为公主, 어느 날 공주가 되어버렸다 :\nThe beautiful Athanasia was killed at the hands of her own biological father, Claude de Alger Obelia, the cold-blooded emperor! It’s just a silly bedtime story… until one woman wakes up to suddenly find she’s become that unfortunate princess! She needs a plan to survive her doomed fate, and time is running out. Will she go with Plan A, live as quietly as possible without being noticed by the infamous emperor? Plan B, collect enough money to escape the palace? Or will she be stuck with Plan C, sweet-talking her way into her father’s good graces?!"]},{"title":"Son-in-Law Does Cheap Cultivation","tags":["Action","Adventure","Comedy","ecchi 2","Fantasy","Harem","Manhua","Martial Arts"],"disc":["Son-in-Law Does Cheap Cultivation\nLong ago, Chien Han underwent “forced cultivation” because of the domineering empress. He cut off part of his soul to escap\ne from the tiger’s den! After that he is reborn in a new body. In this life, he will study military affairs and master spiritual practices."]},{"title":"So That’s How, The Saintess Became The Devil Of Revenge","tags":["Drama","Fantasy","Historical","Isekai","Mystery","Tragedy"],"disc":["Read manhwa So That’s How, The Saintess Became The Devil Of Revenge / 그렇게 성녀는 복수의 마왕이 된다","After overthrowing the devil, the Saintess and her colleagues were executed for treason. Reborn again, she decides to take revenge. Deciding to eliminate the kingdom, the warrior, and all those who betrayed her!"]},{"title":"Since I became a decoration queen, I decided to go to work secretly- I’m not lonely sleeping alone because there is a rabbit!~","tags":["Comedy","Fantasy","Romance","Shoujo"],"disc":["Since I became a decoration queen I decided to go to work secretly- I’m not lonely sleeping alone because there is a rabbit!~Okazari Ouhi ni Nattanode, Kossori Hataraki ni deru koto ni Shimashita ~Usagi ga Iru node Hitorine mo Sabishiku Arimasen!~ / お飾り王妃になったので、こっそり働きに出ることにしました ～うさぎがいるので独り寝も寂しくありません！\nBecause I’m a decoration wife anyway … I’m a waitress during the day, and I dote on a fluffy rabbit during the night!\nLoisline, she is married to Sieghard, the King of Rubeira for half a year and, without being touched during that time, she ended up becoming a “decoration queen”.\nIt’s not surprising because Sieghard is cursed and he can’t spend the night together!\nNot knowing that, Renee, who reopened by doting the rabbit that came to her bed every night, after a strange coincidence she ended up working as a waitress in a downtown restaurant?!\nSince I became a decoration queen, I decided to go to work secretly- I’m not lonely sleeping alone because there is a rabbit! ~\nRead more https://manhwaclan.com/manga/since-i-became-a-decoration-queen-i-decided-to-go-to-work-secretly-im-not-lonely-sleeping-alone-because-there-is-a-rabbit/"]},{"title":"This Is An Obvious Fraudulent Marriage","tags":["Drama","Manhwa","Romance","Webtoons"],"disc":["Reading This Is An Obvious Fraudulent Marriage / I Was Tricked into this Fake Marriage /Igeon Myeongbaekan Sagigyeolhonida / Aku dan Pernikahan Palsu / これはまぎれもない結婚詐欺ですっ！ / 骗婚也要得到你 / 이건 명백한 사기결혼이다","The country Sophen had been destroyed by the Empire. The sole daughter of a count family, Leylin Efran, had to find a husband to be able to inherit her family. So she wouldn’t have to suffer through loveless marriage, Leylin decided to find a husband to have a one-year contract marriage with. In the middle of her quest, a young and dashing man appeared before her. Leylin was convinced this is the right man for her, but is he truly the answer to Leylin’s perilous situation?"]},{"title":"Leave Me Alone – I Want to Enjoy Cheat Life with My Familiar","tags":["Fantasy","Isekai","Monster","Reincarnation","Shoujo"],"disc":["Leave Me Alone – I Want to Enjoy Cheat Life with My Familiar manga, Please leave me alone – I want to enjoy cheat life with my subordinates! , ほっといて下さい / ほっといて下さい　―従魔とチートライフ楽しみたい！―\nMizuki, an office lady, wakes up in an unfamiliar forest, in the form of a little girl somehow. She seems to have been reincarnated in a different world, and Mizuki is at a loss, but for some reason, she gets more and more strong allies -or rather, more followers- such as the legendary monster Fenrir, a talented A-rank adventurer, and the others. “I just want to live a leisurely life, but why am I surrounded by overprotective adults!?”"]},{"title":"My Lady, Please Become My Heroine!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Lady, Please Become My Heroine! / Milady, Please Become My Heroine!","After dying from overwork in her previous life, Beth finds herself in the world of a novel she was reading. While she’s reborn as an unimportant side-character, she ends up working for the house of the novel’s villain, the strict Lady Claire. There, she witnesses first-hand the abuse and negligence a young Claire goes through, and decides to stop her from becoming a main character!"]},{"title":"Ai wo Kataru nara Hisoyaka ni","tags":["Comedy","MAfia","Romance","Slice of Life"],"disc":["Talk About Love Secretly, Ai wo Kataru nara Hisoyaka ni manga, 愛を語るなら密やかに\nThe cold-hearted mafia and the maid who works for him -but for some reason, their relationship is a bit strange. In truth, he’s actually a gentleman (Romeo) who is infatuated with his maid! Be it an expensive gift or the perfect date, he makes full use of everything he has to express his love… Is he aware of their social standings? A flashy, fun, and slightly dangerous romantic comedy."]}]