[{"title":"I Control the Prince’s Heart After a Rotten Exhibition","tags":["Comedy","Drama","Fantasy","Game","Historical","Romance","Shoujo","Time travel","Villainess"],"disc":["Read 摆烂后我掌控王爷芳心 / I Control the Prince’s Heart After a Rotten Exhibition / The King’s Heart is Mine (official)","When the foolish but cute glutton Hua Manman transmigrated into a novel becoming a villainess, she was supposed to refuse the king’s hand in marriage to wash away his misfortune and then enter the Imperial Palace to become one of the Emperor’s concubines. She didn’t expect the king to read minds, and he even took her in as his concubine?!"," "]},{"title":"The Moon Child","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Moon Child / Hang Ah, the Moon’s Child / Dal’eui Ai, Hang’a / Hang Ah, Si Anak Bulan / 달의 아이, 항아"]},{"title":"The Garden of Red Flowers","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Si-fi"],"disc":["Read manhwa The Garden of Red Flowers / Bulgeun Kkochui Jeongwon / 붉은 꽃의 정원"," "," "]},{"title":"Love In Babylon","tags":["Action","Adventure","Drama","Historical","Romance","Tragedy"],"disc":["Read Manga Love in Babylon / 巴比伦王妃 / The princess of Babylon","The night landed in ancient Times Wendy was taken back to the palace by the king of Babylon… However, I am only a passing woman!I don’t want to spend an extra second with this tyrant of history!I just want to go home! Then Wendy began to fight back in this mysterious country of Babylon and the rumored tyrant…"]},{"title":"A Twist of Fate: A Wizard’s Fairy Tale","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa A Twist of Fate: A Wizard’s Fairy Tale / 마법사를 위한 동화 / 魔法使いのための童話 / Mahoutsukai no Tame no Douwa / จอมเวทปาฏิหาริย์กับนิทานแห่งมนตรา / Fairytale for Wizards\nA young girl was neglected by her parents due to the belief that twins were bad luck to the point that she wasn’t given a name. After losing her family and a few years of her memory, she was living an unfortunate life as a slave to a count’s family. Then one day, a beautiful wizard who was called the strongest wizard in the world appeared before her eyes. The truth about her hidden past gradually comes to light. Their meeting will drastically change the fate of the world!"]},{"title":"Belle and the Beast’s Labour Contract","tags":["Action","Adventure","Comedy","Crossdressin","Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Time travel","Webtoons"],"disc":["Read manga Belle and the Beast’s Labour Contract / 벨과 야수의 근로계약 / Belle and the Beast’s Labor Contract on manhwaclan\nOne night, Belle got acquainted with the Busang Leader (Busang also means injury/injured). Her father, who was trying to stage a comeback, was someone even owned the Beast a debt! But the conditions the Beast gave them were kind of strange?! “If you are unable to pay off your debt, please find my spouse.” Will both Belle and the Beast be able to pay of their debts and find their spouse respectively according to the terms of the contract? This is a strange yet special romance between two people!"]},{"title":"Lullaby","tags":["Drama","Romance","Shoujo","Slice of Life","Supernatural"],"disc":["Read manhwa Lullaby","Seohwa finally gets hired at the best mattress company in the country, but its CEO, Cheolsu Gam, turns out to be a sleep demon who hasn’t been able to sleep for 600 years! Upon meeting, he suspects that she’s his human partner – the only person who can make him fall asleep and allow him to return to the demon world. It’s strictly business, but there’s undeniable chemistry between the two of them. Will he be able to go back to the demon world, or will her sudden inability to sleep thwart their destiny?"]},{"title":"Did the Goddess Survive Today?","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Did the Goddess Survive Today?\nShénnǚ Jīntiān Huó Xiàláile Ma\n神女今天活下来了吗"]},{"title":"Plunder My Soul And Heart","tags":["Comedy","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhwa Plunder My Soul And Heart / ヤバい！アンチと入れ替わっちゃった！ / 糟糕！我和黑粉互换了 / Oh No! I’ve Swapped Bodies with an Anti-Fan"]},{"title":"My Jelly Friend","tags":["Comedy","Fantasy","Slice of Life"],"disc":["Read My Jelly Friend / Nián Hú Hú De Nǐ / The Slimy You / 黏糊糊的你","In a strange twist of fate, Jing Qiu, a teenager living on an alternate Earth full of magical creatures, picked up a sticky slime. To his surprise, the little slime could transform into an adorable little boy, and also possessed an unbelievable identity!"]},{"title":"Dominating The World By Stopping Time","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Read manhwa Dominating The World By Stopping Time / Time Stop Domination /  即将被世界抹杀的我，用时停支配世界！","Lu Xi transmigrates to a novel, there he finds out that the world is trying to destroy him [Obliteration Countdown: 2 hours, 57 minutes, 0 seconds. 】 His ability is so powerful the world wants him gone. Luckily he finds his ability, sadly no teleportation, but for others, it still feels like lightning speed. Later on, legends say “Lu Xi has faced a hundred thousand enemy troops alone, and in the next second everyone was lying on the ground as if they had been hit hard!” How strong can he get before his time runs out?"]},{"title":"My Cute Beast !","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Cute Beast ! / 귀여운 야수님!","Description : As the saying goes – never judge a book by its cover. Da-im is a lovely elementary school teacher, as well as a savage who can rip anyone apart with the fiercest comebacks. On-gyum is a florist with a heart of gold, who often gets misunderstood because of his intimidating looks. But as incompatible as they seem, their shared love of cats starts pulling the unlikely pair closer together… Here comes an upbeat romantic comedy between a sassy bunny and a sweet beast!"]},{"title":"The Killer Boss is raising a Fox","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa The Killer Boss is raising a Fox / Hitman Big Shot Is Online to Raise Fox / 杀手大佬在线养狐","Yun LiuShuang is the last descendant of the Fox tribe, fate led her to meet Mo Sheng, a unfeeling/heartless and lonely man who’s also fighting with his own destiny. Initially they were at odds at each other, but an unseen force is keeping them together. The story originally revolve around the life of a beautiful reporter and a domineering president, but things in their life aren’t actually simple as they believe it is, because their life seems to be cursed to face problems caused by the presence of a celestial group, sorcerers, and of the fox tribe. Where will this situation bring Yun Liushuang and Mo Sheng’s love for each other?"]},{"title":"The Looks of Love: the heart has its reasons","tags":["Drama","Romance"],"disc":["Read manhwa The Looks of Love: the heart has its reasons / 爱情的样子：心之所向 / What Love Looks Like: Heart Wants What It Wants","Chi Cheng is an arrogant genius actor. Wanting to become the best male actor, he entered a theater to improve his acting. Unfortunately, in there, he met his most hateful rival, Lu Yang who attended the same university as him. And even worse, she saw him breaking up with his girlfriend, but misery loves company. As she was going home, she saw her fiancé being all cozy with a colleague…","Both of their relationships have a wound that’s slowly breaking open, the breakup day is probably right around the corner……"]},{"title":"I Ran Away and Got Married","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Ran Away and Got Married / 도망쳤더니 결혼을 하게 됐습니다","“You’re mine.”","When Raphia met her demise after having been used and thrown away by her benefactor, Yuri, she went back nine years in the past.","‘I’m not going to relive that hell!’","Running away from her benefactor, she went to Kasein Soleia, Yuri’s archnemesis, and signed a new sponsorship contract with him.","“I shall kill every single person you despise, Milord.”\n“The necessary role happens to be open, and you might just be the right person for it.”","Young Duke. This is a sponsorship contract, right?\nBut why . . . why are we getting married?","* * *","“Throughout the time I won’t be by your side . . . I will think of nothing but your small, cute head.”","That low voice sent shivers down her spine.","“I can’t believe you’re leaving. I’ll just . . .”","Kasein looked at her sharply as if he was daring her to continue making up excuses.","“You have to answer well, brat. Depending on what you say, all the wagon and shoe craftsmen of the Empire might lose their livelihood.”","Despite his harsh words, Kasein’s touch was gentle.\nHe couldn’t take his eyes off of Raphia, who strangely grew more beautiful by the day."]},{"title":"This 3-Year-Old Is a Villainess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa This 3-Year-Old Is a Villainess / 이 3세는 악역입니다","Summary This 3-Year-Old Is a Villainess:","‘Just why do I have to possess someone who’s already possessed…?!’","I became the female lead, who is already possessed, of the novel <I Possessed the Villain’s Granddaughter>. But the truth is, she’s actually the villainess who will torment the real heroine.","What do you mean I’ve become the villainess who will suffer terribly for harassing the heroine? I can’t believe it! My fate was sealed to become trash before I knew it! I can’t live like this!","‘Please save me!’","But a lot of things are already going wrong even before the heroine makes her appearance.","‘Dirty-blooded, right? You said she was trembling to have something to eat. Just like a beggar.’\n‘…’","‘They’re all dead.’","Elliotte is a 3-year-old possessed villainess who will go through a lot of suffering. So, using my knowledge of the original story, I will try my best to find a way to live.","‘Huh?’","Why is my grandfather, the villainous Duke, treating me so well? Why did my Dad, who’s been away for so long due to my Grandpa’s hatred for him, suddenly come back? And why are my brothers bothering me so much?","Moreover.","‘What is this.’","*Elliotte made the whole world heartbroken ㅠㅠㅠㅠㅠ\n*Ah ㅠㅠㅠ I’m sorry for pretending not to know that you were possessed and cursing you\n* I’m sorry ㅠㅠㅠ So that’s the reason why it happened\nㄴ I acknowledge that I am trash ㅠㅠ\n*Isn’t this apocalyptic?\nㄴ really lol\n*A bait is spread out on the floor. The cookies have poison, right?\n*Richmond.. Mother-in-law is waiting.. Come over to this dimension.\nㄴ Get in line, teacher","I stare at the holographic pop-up window in front of me.","‘I think this is the comment section of the Coconut Page.’","What on earth is going on?"]},{"title":"A Beastly Scandal","tags":[],"disc":["Read manhwa A Beastly Scandal / 짐승같은 스캔들"]},{"title":"Father, I Won’t Do Anything","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Father, I Won’t Do Anything / 아빠, 저는 아무것도 하지 않을게요","Summary:","[Just as your birth did not inspire me, so your death won’t mean anything to me.]Jaina reincarnated as a supporting character who was born as mixed blood of human-dragon and died miserably after being neglected. She is branded as an unclean entity and was abandoned by the dragons.And the first time she met her father, the lord of the tower, Diamide, he just looked at her coldly, as though he didn’t feel any sense of intimacy to his daughter as described in the original.”Is that the one you called my daughter?”Jaina flinched as he approached and lowered her sight.”Blue eyes… but that’s not a proof that she’s my daughter. You could have brought me a child born with another human.”And so he went back leaving her alone and Jaina was living in the shabby warehouse of the tower.Rather than making vain efforts to get into the eyes of his father, the lord of the tower, she decided to have a small luxury that she had never experienced even in her previous life before her death.”You don’t have to think of me as your daughter. I won’t call you father either.””…””Tower’s lord?”So is the father, who should’ve been indifferent, starting to get obsessed? Father, can you just leave me alone?"]},{"title":"A Toast For Your Eyes","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Toast For Your Eyes / 당신의 눈동자에 건배를","Scarlett, who has lost her lover six times to her friend, had always believed and forgiven her friend’s words that are pitiful yet beautiful.","“It was for you, Scarlett. Haven’t you always said that any man who can get taken away easily isn’t yours?”","But as soon as the veil falls off, Scarlett finally decides to take revenge on her friend.\nAnd soon, in front of her friend , she kisses her friend’s fiancé deeply.","“I’m the one who is sorry for not seeing your evil intentions, but you shouldn’t have thought that I’d stay a idiot forever.”","All of these are revenge from me.\nQuiet and promiscuous."]},{"title":"I Just Want To Walk On The Flower Road","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Just Want To Walk On The Flower Road / 꽃길만 걷고 싶어","Summary:","In Hercion Academy’s Magic Department, which trains the best wizards on the continent, lives Luciel, who is called the “iron-blooded assistant” and is recognized for her ability. What she’s hoping for is to become a professor and live a normal flowery life!!! But three men appear in front of her. Prince Lassen, a scheming prince with a cold heart. Ethan, the swordmaster who has a straight chivalrous spirit like the sunshine. Taylor, the most popular and cute genius in magic. It’s hard to achieve the dream of an ordinary life, but because of them, Luciel’s plan is becoming more difficult. Can she really love someone?"]}]