[{"title":"The Heavenly Demon Will Give You a Massage","tags":["Action","Adventure","Comedy","Drama","Fantasy"],"disc":["Read manhwa The Heavenly Demon Will Give You a Massage / 천마님 안마하신다","Heaven-bound Heavenly Demon, once known as Kang Taehan, Returns to his original life after 60 years! “Ah, in such a blessed era, to be in this shape!” “Your body is screaming to be saved, haven’t you heard?” The project to physically and mentally rejuvenate everyone, The journey of the Heavenly Demon Kang Taehan begins!! Weary office workers tired from alcohol and overtime, Athletes whose bodies are ruined and performance declined, Heads of families crushed by the weight of life, Modern people who have accumulated fat to withstand life’s burdens. All you modern people who are weary of their life, come and get a massage!"]},{"title":"The Silent Sacrifice Princess And The Black Dragons Marriage","tags":["Drama","Fantasy","Romance"],"disc":["Read manga The Silent Sacrifice Princess And The Black Dragons Marriage","Ayame, born into a family of priestesses blessed by the Black Dragon God, possesses a unique ability to heal people through her voice. However, after the death of her parents, she is taken in by her uncle’s family who mistreat her, leading to the loss of her voice. Her cousin Mari even takes over Ayame’s rightful position as priestess, and Ayame is eventually offered as a sacrifice to the Black Dragon.","“Why must I be killed like this?! Someone, please help me!”","Her desperate plea brought forth the Black Dragon from the sky. He descends and transforms into a handsome young man, gently takes Ayame’s hand, and flies away with her.","Thus begins Ayame’s new life as the bride of Saku, the Black Dragon, living in his mansion situated between the celestial and human worlds. However, Ayame’s cousin Mari, envious of her new status as the beautiful bride of the Black Dragon schemes to steal him away…","A Japanese-style Cinderella story of a gentle-hearted girl who lost her voice and a proud yet compassionate Black Dragon."]},{"title":"The False Saintess Embraced by Her First Love, the Count","tags":["Fantasy","Romance"],"disc":["Read manga The False Saintess Embraced by Her First Love, the Count","Maria, a doctor with the power to dispel miasma, step in as a replacement for the saintess and prepares to marry Count Elvan. In the past, Elvan had saved Maria, but when they reunite, he has transformed into a cold, unfeeling man.\nDespite Elvan’s rejection, Marja persists, striving to fulfill the saintess’s role despite her limitations. Her resilience and dedication slowly warm Elvan’s frozen heart, and he begins to feel drawn to her.\nThis is the story of a false saintess who melts the count’s icy heart and ultimately becomes a true saintess."]},{"title":"Ryun’s Companion","tags":["Fantasy","Historical","Mature","Romance"],"disc":["Read manhwa Ryun’s Companion / 륜의 반려 / Permaisuri Ryun","A novice hunter named Solro lives with her elderly father deep in the mountains, and because the weather changes according to her mood, one day she decided to hunt at night instead of her father, but she accidentally shot an arrow at someone..\n“Dad, will I be okay? “I think I killed someone.”\nRyun, Prince Onryong, went hunting with his servants but fell into the Empress’s scheme and wandered the hunting grounds alone. Suddenly he saw an arrow shoot towards him and hit him. He tried to use his remaining energy to whoever approached him, but failed.\n“Why did you let me live? What the hell are you planning, what’s your goal in keeping me alive?”\nHowever, it turns out that the archer is a girl disguised as foreve,\nBecause of her crime and because of her father’s intervention with a dagger to protect her, the Crown Prince decided to take her with him to the palace as a booty.\nA land of dragons hidden in the clouds, Solro is the dragon who can control the sky and Crown Prince Ryun keeps her by his side.\nStories of myths and monsters have long been rumored, so can the love between the two be preserved and this desire be allowed to develop forever?"]},{"title":"Cassnier’s Secret Memoirs","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Cassnier’s Secret Memoirs / 캐스니어 비망록","After the war between Lamrock and Dublin ended, an era of peace began—though it wasn’t the most peaceful kind. In the remote village of Casnier in Lamrock, lived Layla, a simple country girl, and her hard-of-hearing father, Bendo. One day, the quiet village stirred with the arrival of unfamiliar soldiers."]},{"title":"Max Talent Player","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Max Talent Player / Player with Maxed-Out Talent / Player with Max Talent Stats / 재능만렙 플레이어","My mother and older sister: stricken by poverty and disease.\nMyself? No talent, no money, no backing.\nI was merely an aspiring civil servant who went to bed reminiscing on the past 10 years. But one night, when I woke up, I found that I had returned to a morning before it all happened. I had regressed 10 years into the past.\nAnd…\nEveryone in this bus is going to die in a matter of minutes.\n‘…Can I survive this?’"]},{"title":"Survive as the Adopted Daughter of a Genius Duke","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Survive as the Adopted Daughter of a Genius Duke / 천재 공작가의 양녀로 살아남기","In my past life, I was praising my professor as a graduate student; in my present life, I’m praising my younger brother as an older sister. To survive in the Duke’s household where I was adopted, I absolutely have to get on the good side of Kilian, the male lead of the novel. Fortunately, it’s still a long way before the original novel’s events unfold! Reina strives to survive by diligently flattering, running errands for, and offering snacks to the young male lead Kilian, who will eventually eliminate her in the future. “Sister, you have to marry me too.”\nWhat…? Did I win his favor too well by using my past life’s skills to the fullest? This little chubby kid is proposing. I tried to dismiss it as a child’s prank, “You’ve never been my sister. If anything, you’re a woman to me.” Suddenly, a deep voice echoed. When did he grow up so much? Unaware of the passage of time, Reina, who only thinks about escaping, and the obsessive male lead Kilian, who only cares about his sister, engage in a game of cat and mouse in their romance."]},{"title":"The Gangster Baby of the Duke’s Family","tags":["Comedy","Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa The Gangster Baby of the Duke’s Family / 조무래기 공작가의 깡패 아기님 / The Gangster Daughter of the Henchman Duke’s Family","My name is Leonora Hachania.","I’m the daughter of a minor extra villain, but I have a great desire for power. I can’t leave the Hachanias as insignificant as the original!","“Cloudy to the left!”\n“Do it!”","“Cloudy to the right!”\n“Just Do it!”","Showing off my sunglasses made with ink, I raised my voice.\n“Enoch, don’t cry!”","The third child, who made weak eye contact with me, was surprised and sniffed his runny nose.\n“Wahh, I won’t cry!”","I succeeded.","“Was it supposed to be this week? It’s like tr*sh.”\n“Gasp! Save-save me!”\n“Brother, why don’t you kill him quickly because it looks like it would be a better thing for him.”","My older brothers who used to be extras became the world’s greatest villains who can even blow the male lead away! The clumsy villain dad was a challenge though.","“Lini, what else are you planning to do…”\n“Hoho, never mind. You’re planning something mean like my daughter. That’s good.”","He was converted to a duel personality villain.","Haha! Good. I must use the original information to make my family significant and raise my wealth!","I tried to escape the time-limit body by enjoying the life of a real villain.\n“I know the princess is a kind person, so wishing only for you to be kind to me would be greedy.”","I think the human weapon that was revived for the family is a little broken.\n“But if there’s no subject to be kind to…”","The bright red flame from his hand burned the world map.\n“Shouldn’t you be kind to yourself?”"]},{"title":"The Words of The Beloved Sun","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Words of The Beloved Sun / 사랑하는 태양의 말로","One shall become a king, and the other shall become a sacrifice for the king. On the day Crown Princes Tae Chan-ryang and Tae Ho-wol were born, a prophecy descended from the heavens. Who will be the one to survive?"]},{"title":"Find the Crown","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Find the Crown / 왕관을 찾아줘","For hundreds of years, the reaper ‘Ari,’ who guided souls to the afterlife, felt lonely because she had no head and no one recognized her. Then, a human named ‘Woocheol,’ who could see Ari’s head, appeared and offered to help her find it. Will Ari be able to find her head and ease her loneliness? This is a romance drama about Ari and Woocheol, who travel between the afterlife and the living world. Tags: #Romance #TragicHeroine #CharmingHero #HighIntensityRomance"," "]},{"title":"I Became The Childhood Friend of the Obsessive Second Male Lead","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became The Childhood Friend of the Obsessive Second Male Lead / 집착 서브 남주의 소꿉친구가 되었습니다","Rieta, staying with a military ducal family, decided to help Noel, the second male lead, by coaching him on winning the female lead’s heart. After years of guidance, Rieta was confident Noel would succeed. However, in a surprising twist, Noel complimented Rieta instead, misapplying her advice. Flustered, Rieta realized her friend had taken her words to heart, but not in the way she intended."]},{"title":"I Captured The Tyrant’s Heart","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Captured The Tyrant’s Heart / I Grabbed The Tyrant’s Heart / I Hold The Heart Of A Tyrant / 폭군의 심장을 쥐었다"]},{"title":"I Need to Raise My Sister Properly","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Need To Raise My Sister Properly / An Older Sister Should Raise Her Little Sister Properly / The Older Sister Should Raise Her Younger Sister / Perlu didik adek biar gak sesad / 언니는 여동생을 바르게 키워야 합니다","When I regained consciousness after a car accident, I became the stepsister of the villainess in “My Beloved Santa.” Having already possessed this body, I decided to pave a path of flowers to prevent the villainess from becoming a dark person. I worked hard with all my heart and all my strength… Somehow, I got entangled with the Duke of Lexerville, who was famous for being a bloodthirsty madman. “Didn’t I warn you back then that I wouldn’t let you go if you did something stupid?” When he saw me with another man, he interrogated me as if he had caught a cheating girlfriend. Read at kaiscans.com to support us! i asked “Do you like me by any chance?” , he replied, “Stop talking nonsense.” if so, why is he acting like this?"]},{"title":"For The Princess Who Will Disappear","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa For The Princess Who Will Disappear"]},{"title":"Love Class","tags":["Adaptation","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Love Class / 열애 수업"]},{"title":"The New Employee Chairman Kang","tags":["Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The New Employee Chairman Kang / Chairman Kang: The Newcomer / 신입사원 강 회장","I am Kang Yong-ho, the chairman of one of South Korea’s top 10 conglomerates, Choi Sung Group. After declaring my retirement, in the blissful moment, I was hit on the head by a New Employee falling from the sky. But where did my body go, and have I become the new employee?!"]},{"title":"Reincarnated In a Cursed Game","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Reincarnated In a Cursed Game, The Knight’s Revival Through a Cursed Game, Resurrected Knight Trapped in a Cursed Game, 망겜으로 기사회생","I found myself trapped in the game I created. However, in order to escape, I need to unlock a hidden ending that even I am not aware of…"," "]},{"title":"I Picked A Hammer To Save The World","tags":["Action","Adventure","Fantasy"],"disc":["Read I Picked A Hammer To Save The World / The Hammer / 더 해머","After defeating the commander of the seventh Corps of the Demon King’s Army, ‘Tiny’ was about to die. However, in a desperate situation where the destruction of mankind can not be prevented, the last surviving comrade, ‘Sword Emperor’, uses the power of an heirloom to send Tiny back in the past. Tiny, who has returned from being the strongest knight on the continent to an orphan in the slums, gains new powers that he did not possess in his previous life. Can Tiny, in this life, prevent the extinction of mankind?"]},{"title":"The Heroine Wants Me As Her Sister-in-Law","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Heroine Wants Me As Her Sister-in-Law / Frozen Wolf, Fire Dragon / The Female Lead Turn Me Into Her New Siste / The Heroine Has Her Eyes On Me As Her Brother’s Wife / 여주인공이 나를 새언니로 점찍었다","This is the world of an R-19 novel based on Little Red Riding Hood, this time with a princess who eats the Wolf. The problem is, that wolf is my younger brother. I hid deep in the forest so that Red Riding Hood wouldn’t find us. The goal is to escape to the human world safely!","And then one day. I found a child collapsed in the snow-covered forest. You can’t just pass by a sick child. I brought her home thinking I could treat her– of all people, she was the female lead, and said, “I don’t remember anything.”","To make matters worse, she lost her memory in an accident!","“I like you the best in the world!”","I was afraid of death, but couldn’t drive the sick child away coldly, so I took good care of her. Don’t forget your gratitude, even if you get your memory back later. But this kid–","“What’s your ideal type?”","“I like tall, broad-shouldered men.”","“A handsome man? How handsome?”","I think you have a lot of questions about me. It’s my fault that your eyes shine when I talk about my ideal type, right?"]},{"title":"Bride of the White Dragon","tags":["Romance"],"disc":["Read manhwa Bride of the White Dragon / 백룡의 신부","A casual remark has me on the path to becoming an actual bride?! A secluded dragon pond, avoided by all but known to house the dragon-in-waiting, Gangcheol. While the villagers steer clear in unease, for Iju, it’s the one place of true peace. “If it came to it, I’d rather be Gangcheol’s bride.” She muttered this thought in exhaustion, fed up with her family’s harsh treatment, thinking nothing of it. Yet, at that moment, a man appeared before her, exuding an aura as intense as the pond’s mystical light. “Then, how about becoming my real bride?”"]}]