[{"title":"You Awakened while I Was Dead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa You Awakened while I Was Dead / I Woke Up To Find Myself Dead / You Awakened while I Was Dead / The Guide’s Fatal Failure / 제가 죽었다고 각성하시다니요 / You Think I’m Dead?","I possessed an extra who died as soon as the original work started.\nI was the hero’s incompetent guide.\nOnly until I die, will the hero meet his new guide, the heroine.","To safely stray from the original work,\nI pretended to be dead after consuming a toxic flower that throws you into a coma, but-","“My guide isn’t breathing anymore.”\n……?\n“Who the hell can stop me?”\nThe hero awakened and went berserk?","You awakened after thinking I died?\nYou can’t possibly awaken like this….!","***","“You’re leaving me?”","Bliss scoffed at Shana’s resignation letter.","“Is this a new joke?”","“No. You don’t need a guide anymore so I…….”","“Shana.”","Bliss called her in a soft but determined voice.","“You can make fun of me, you can deceive me like a fool, or you can play with me as much as you want.\nSo don’t even joke about trying to leave me.”\nBliss whispered to Shana with a beautiful smile that looked like a painting.","“I just can’t let that slide.”"]},{"title":"From Maid to Queen","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga From Maid to Queen","Eureinia, who has become the king’s lover, wants to play and eat for the rest of her life,\nbut ends up having her head cut off at the guillotine.\nBut what is this? When she opens her eyes again, she returns to the past, and she vows that her life will never be the same this time as before.\nWhile she is trying to avoid the king, she starts to get involved with the workaholic prime minister, Oscar, who is a commoner…\n“I like you, Eurenia.”\n“No, wait! Isn’t this What?”\n“I will give you all my heart. No, neither body nor position nor fame nor wealth.\nIs that all right, Eurenia?”\nFrom maid to queen, Uraynia’s life-changing romance!"]},{"title":"Pouring Money Into the Underdog Mercenaries","tags":["Adventure","Drama","Fantasy","Historical"],"disc":["Read manhwa  Pouring Money Into the Underdog Mercenaries / 밑 빠진 용병대에 돈 붓기","Lee Ji-hyun, was lost in a snowstorm and rescued. But it was not Korea, no matter how you look at it! The most elite military group, the Nio Mercenaries, led by the strongest warrior Valdemar, saved Ji-hyun?! Ji-hyun decides to sell them her abilities to survive. “Don’t you need one management mentor?” Indeed, Ji-hyun can find a way to save the Nio mercenaries and return home safely?"]},{"title":"I Seduced The Deceitful Duke","tags":["Comedy","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manga I Seduced The Deceitful Duke / I Seduced the Cheating Duke / 사기 친 공작님을 유혹해버렸다","I am a capable guild member. My mission is to disrupt Duke Berry Winter’s wedding…\n“This marriage can’t happen…because I’m carrying the blood of a duke”\nThe wedding ceremony began to stir under my words. If the situation continues like this, the wedding ceremony will be over soon, so should we withdraw early?\nI was about to run out of the wedding venue. But Duke Berry Winter approached me again and said.\n“Honey, why are you so late?”\nHoney? Is he calling me honey?\n“It’s almost time for me to actually get married.”\n“…?”\n“If that’s the case, our children will be disadvantaged.”\nWait. Is this the first time we’ve met?"]},{"title":"My Classmate Disappeared","tags":["Drama","Fantasy","Manhua","Romance","School Life","Shoujo"],"disc":["Read manhua My Classmate Disappeared / My Roommate Disappeared / Wo De Tong Zhuo Xiao Shi Le / 我的同桌消失了","Shi Meng, a young girl who never dreams, starts her school life in a battle of wits and courage with a mystery teenager who devours her dreams. The domineering Lu Beichen keeps approaching Shi Meng, which makes all the girls in the school envious. Is he trying to protect her or harm her?"]},{"title":"The Precious Sister of The Villainous Grand Duke","tags":["Adventure","Comedy","Drama","Fantasy","Historical","Manhwa","One shot","Romance"],"disc":["Read manhwa/manga/manhua The Precious Sister of The Villainous Grand Duke / 악당 대공님의 귀하디귀한 여동생 / The Precious Sister of Villainous Grand Duke / Villain Duke‘s Precious One / Adik Kesayangan Grand Duke yang Jahat"]},{"title":"Records of the Demonic Path’s Return","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Records of the Demonic Path’s Return / 마도협객","The main character Myeong-woon has escaped to a faraway sanctuary to avoid the Heavenly Demon Dod Cult’s fight for power. However, as he did not coincide with the Throne’s Will, he was unable to avoid strife. To make Myeong-un stir a fight within his family, the Heavenly Demon God Cult’s Leader, Myeonggak, visited him. Myeong-woon dies during his attempt to escape him. But right before he died, a voice spoke to him in his hazying consciousness. ‘…Do you regret it? Would you like to fight another time?” Myeong-woon believes he died after this voice away but he opens his eyes and…"]},{"title":"My Brother’s Friend","tags":["Comedy","Romance","Shoujo"],"disc":["Read manhwa My Brother’s Friend / Anitomo / Ani Tomo / ani-tomo / My Brother’s Friend (AKAGAWARA Modomu) / Друг моего брата / صديق أخي / 兄友 / 오빠 친구","Nanase, a polite, a little old-fashioned girl, got a boyfriend for the first time. He, a pure and kind guy, is a good friend of her brother. However, both of them have no idea what they should do next… For Nanase, holding hand would be too embarrassing, and ‘date’ is something mature people would do."]},{"title":"Please Pretend to Cultivate For a While","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Please Pretend to Cultivate For a While / 你假装修炼一下吧，球球了\nReborn 99 times, Ye Fan was betrayed and killed by the system for various reasons each time. This lifetime, he just wants to live a happy life and let cultivation go to hell! With tears in its eyes, the system helps Ye Fan check in. The top-grade spiritual pet almost ended up on Ye Fan’s dinner table, and the top-grade cultivation techniques were used as table legs by Ye Fan.\nSystem: Host, can’t you just pretend to cultivate for a while?"]},{"title":"My Wife Is The Destined Villainess","tags":["Action","Drama","Fantasy","Historical"],"disc":["Read My Wife Is The Destined Villainess / My Wife Is the Villain of Destiny / My Wife’s Fate Is to Be the Villainess / Wo De Niangzi Shi Tianming Fanpai / 我的娘子是天命反派","Just entered the novel world and unexpectedly became a cannon fodder supporting character named Mo Lang, who also married the villain boss as his wife? As a cannon fodder, he not only has to whiten his villainous wife to prevent her from turning black, but also has to seize the air luck of the son of destiny. Mo Lang smiled slightly, although he had no cultivation, the system gave him endless props and rare treasures to be able to stand at the top of this continent. The so-called son of destiny is nothing but an ant in his hands! But wait, why does the villain wife by his side look strange?"]},{"title":"To Another World On My Own!","tags":["Action","Adventure","Fantasy","Manhwa","Reincarnation","Super power"],"disc":["Read manga To Another World On My Own! / 自力で異世界へ！","Tarou Satu, a young man who longed for an otherworldly adventure since a child and devoted his youth to finding it, finally goes to another world on his own. However, things did not go well for him, as his previous life’s memories were about to be erased by God. Despite that, he almost dies during his reincarnation process, which allows him to fulfil the condition for a special ability and luckily, keep his old memories. From there, the now reincarnated Tauro Satu, grows up by using his brains and efforts while gradually developing his mysterious skill, Garbled Text, which everyone thought to be completely useless."]},{"title":"I’m a Villainess, but I’m Good at Cooking","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m a Villainess, but I’m Good at Cooking / 악녀인데 요리를 너무 잘해","She became the villain in the novel. a villain got kicked out of the house after committing various evil deeds! She has no choice but to become a street general in order to make a living.. Suddenly, she is kidnapped by the prince of the empire and the black magic. “The reason I have Young-ae is because I want you to be my cook.” No, where is the Scout doing this? After many twists and turns, I became the emperor’s exclusive cook and went on a smooth but not interesting career path… “I never thought it would taste like this. Please make me a disciple!” Even a genius alchemist, you are the only dish I recognize. buy it So never stop cooking. got it? “At first, even the rival cook who was timid, even the mysterious pet fox, who was only docile to me but fierce to others, all fell for my food. And, above all, you are under my protection. So I am not afraid of anything. Don’t do it.” Kylo Ross O’Bern, who was obviously in the dark, why does he care so much about me?"]},{"title":"Lv2 kara Cheat datta Moto Yuusha Kouho no Mattari Isekai Life","tags":["Comedy","Drama","Isekai","Magic","Romance","Supernatural"],"disc":["Lv2 kara Cheat datta Moto Yuusha Kouho no Mattari Isekai Life, Chillin Different World Life of the Ex-Brave Canditate was Cheat from Lv2:\nBanaza, who got summoned to the magic kingdom of Cryroad as a Hero candidate, due to having only the abilities of only a regular citizen, got treated as a disqualified Hero. He, who originally was supposed to be returned to his original world, due to the magic kingdom’s mistake, became unable to return to his original world, inevitably has to live in this world. That kind of person, the moment he became Lv2, acquired all skills and magics, and transcended into a super cheat with all ability points broken through the limit! Even so, he, who does things in his own pace with an easygoing smile, takes Lys(Lees) of the Demon race as his wife, and fully enjoys newly-married life. He changed his name to Furio and leads even more laid-back life, but to such Furio household, on top of a pet saber and 4 freeloader female knights, even a Majin and Ex-Demon Lord join in, however even in this state, which couldn’t be more chaotic, enjoyment of a laid-back life continues."]},{"title":"Rewritten Love Story","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life","Shoujo","Time travel"],"disc":["Read manhwa Rewritten Love Story / 다시쓰는 연애사\n‘Lee Jeya’ who gets into an accident with his ex-girlfriend from college, ‘Han Seori.’ When he wakes up, he finds himself 10 years in the past and his and Seori’s bodies are switched! Jeya wants to rewrite their failed love story along with Seori during this time. “Jeya, you want to go out with me again? Then try seducing me.” But will Jeya be able to seduce Seori when he is in Seori’s body himself?!"]},{"title":"100-Year-Old Top Chef","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa 100-Year-Old Top Chef / 100년 묵은 탑셰프 / Koki Terbaik Berusia 100 Tahun","The world’s greatest chef. First, second, third… and sixth life. The combined time I’ve spent on cooking is over 100 years.“I can’t do this anymore.” There is only one way to stop this endless reincarnation and regression. This time, I will definitely succeed."," "]},{"title":"Lion Heart","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Lion Heart / Lion Heart (Choi Soo-hyun) / ライオンハート (Choi Soo Hyun) / 라이언 하트 (최수현)","As the ace heart surgeon of Seomoon Jaeil Hospital, Dr. Yoon Haejun always puts her patients first. To give them even better care, she hopes to open a heart transplant center on the premises. But when one of her patients goes AWOL and saddles the hospital with his bills, the whole project is put in jeopardy. Her only hope? Become the fake girlfriend of the wealthy hospital chairman Seo Yihan! But as Dr. Yoon will soon learn, melting his frigid heart may be more difficult than operating on one!"]},{"title":"The Empress Lipstick","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Empress Lipstick\nLee Jae-in, an ordinary high school student who dreams of becoming a makeup artist.\nI accidentally picked up a lipstick and got sucked into the mirror by the lipstick.\nWhen I opened my eyes, I was no longer Jae-in Lee, a high school student with a normal face.\nEverything has turned into perfect, sublime beauty, Princess Jane Richard D’Auterische of Loemendel.\nFurthermore, I’m married to the Crown Prince…!\nRelying on lipstick, it is the only key to return to the present life and find a way to live for yourself,\nJaein didn’t come back, only his face came back!\nWith the mysterious lipstick in hand and the makeup skills accumulated over the years, I am going through the hardships and adversities of the emperor’s life…\nShows how makeup really holds its strengths and hides its weaknesses!"]},{"title":"Éminence Grise Female Lead Is Trying to Make Me Her Stepmom","tags":["Harem","Isekai","Josei","Manhwa","Romance","Shoujo","Webtoon","Yaoi"],"disc":["Read Éminence Grise Female Lead Is Trying to Make Me Her Stepmom /The Villain is Trying to Make Me a Stepmom / 흑막여주가 날 새엄마로 만들려고 해 / GOBY / GOLDBABY","I have transported as civilian 1 into the “tragic novel” I wrote with my friends for fun. Since he declares revolution in order to change his daughter’s unhappy future. If I leave it like this then many lives are in danger. “I will protect the female lead!” That’s how I started to live with the daughter stupid duke. But the small female lead is a bit strange for some reason.\nThe female lead is the stepdaughter of the mother who married the male lead, so since childhood, the male lead doesn’t like the female lead. He has a younger sister named Nhuo Hy, she loves her brother very much, so she always acts weak to win his affection."]},{"title":"The Villainess Is Me","tags":["Drama","Fantasy","Isekai","Manhua","Romance"],"disc":["Read manhua The Villainess Is Me / 据说我是反派大小姐 / Jùshuō Wǒ Shì Fǎnpài Dà Xiǎojiě / They Said I Am the Villain’s Eldest Daughter / Apparently, I’m the Villainess?","I stayed up too late, died from overwork and was reincarnated as the villain eldest lady in my comics."," "]},{"title":"Taming The Consort","tags":["Fantasy","Historical","Romance"],"disc":["Read manhua Taming The Consort / Notes of Taming the Imperial Concubine / 驯妃记","Xu Chaomu was born in a peaceful and prosperous age as an aristocrat, beloved by the Emperor and spoiled by the Empress Dowager… In short, she had plenty of reasons to be smirking. “Ah… This is the life!” Then, an imperial decree was issued, naming the Protector-Princess the new Crown Princess.Xu Chaomu was taken aback. “So… Who’s the Crown Prince?”The Crown Princess had been selected before the Crown Prince. Did the Emperor want her to choose a husband?Xu Chaomu’s response? “The country is filled with handsome, eligible bachelors, and the Imperial Princes are outstanding too. Who am I supposed to choose? Uncle! Don’t run away!”"," "]}]