[{"title":"12 O’Clock Marionette","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa 12 O’Clock Marionette / 12시의 마리오네트","“Disciplining the villain and saving the world.” The villain who will lead to the world’s destruction, “Cruelo.” I have been tasked with disciplining him. But I have failed repeatedly! Now, there is only about a year left until the world is destroyed… In the third attempt, I took on the form of “Siora Velvet” to replace Cruelo’s fiancée! I will succeed this time for sure, even if it means I stop being a puppet for the god of demise, “Pebula”!. I will certainly discipline this villain!!!"]},{"title":"A Poem of The Empire and A Thousand Piles of Snow","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read A Poem of The Empire and A Thousand Piles of Snow / Rhapsody Of The Upper Country: A Thousand Pile of Snow / 上国赋之千堆雪 / Desperate Love manhua","Let me serve you! Xuan Qiancao might be gifted, but she faces constant ridicule and humiliation for being the daughter of a traitor. One day she is helped by Chen Tongxue, the most outstanding figure in the Imperial Academy. She falls in love with him from that moment on and works hard to become his servant."]},{"title":"My Hubby’s Stalker","tags":["Comedy","Drama","Fantasy","Josei","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa My Hubby’s Stalker / My Husband’s Stalker / 내 남편의 스토커","The owner of an online fashion store, Jin Yoon’s the total package. She’s got beauty, brains, money, and even fame. But due having her heart broken in the past, she no longer believes in love. But one day, she meets Suho and her heart melts. They soon get married, but Yoonjin realizes her marriage wasn’t all it was cut out to be."]},{"title":"Oh, My Beloved Concubine","tags":["Fantasy","Historical","Romance"],"disc":["Read Oh my beloved consort / 哦 我的宠妃大人\nDora, a girl from the modern century, accidentally transmigrates to ancient times and inhabits the body of the Second Lady of the Prime Minister’s manor. Pushed around and often brought to her knees, the Second Lady falls in love with a complete jerk before dying in the hands of a malicious villain. However, from now on, she will no longer be a foolish, meek little girl! She will make all of her enemies pay… Very, very dearly!"]},{"title":"General, Leave Me Alone!","tags":["Fantasy","Historical","Romance"],"disc":["Read manhwa General, Leave Me Alone! / General, This Concubine Does Not Bear the Grace / General, This Concubine Is Not Favored / Jiāngjūn, Běn Fēi Bù Chéng Chǒng / 将军，本妃不承宠","Qin Muxue met the Great General in the turbulance of dynasty alternation. This aloof general seemed to be interested in her, for he brought her and her younger sister back and treated her ad his fiancee. Qin Muxue didn’t know that they had met… long time ago…"," "]},{"title":"My Disciples Are Godlike","tags":["Action","Adventure","Comedy","Fantasy","Martial Arts"],"disc":["Read manhua My Disciples Are Godlike","a game tester, time travelled with maximized martial arts! Yet, the life of sword master/immortal cultivator couldn’t arise any interest of him. He planned to enjoy a nice life in the new world. But, what made him headache was that a group of beautiful disciples came to advise him to cultivate every day!"]},{"title":"Even Though I’m the Villainess, I’ll Become the Heroine!","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Isekai","Music","Psychological","Reincarnation","Romance","Supernatural","Survival","Villainess"],"disc":["Read manhwa Even Though I’m the Villainess, I’ll Become the Heroine! / 악녀지만 여주인공이 되겠습니다","I wasn’t able to overcome the harassment and took my life, but I was reincarnated with the perpetrator? The perpetrator is the heroine, Florre, and I am the villainess, Dahlia, who’s going to die horribly. “They said you are a villain with neither blood nor tears, but unlike the rumors, you often shed tears.” “Your Highness must believe all the nonsense the idiots are talking about, huh?” Grand Duke of Cervian, the half brother of the Male lead and who will be punished for treason afterwards. He approached me. I can’t lose the man who will be my greatest ally. “Your Highness, would you marry me?” “Now…… what did you say?” “And take revenge together.” A similar situation, a fixed ending. The heroine is not the only one who knows the ending of the novel. I took a long and arduous path of revenge."]},{"title":"One hit teacher master baek","tags":["Action","Manhwa"],"disc":["Read manhwa One hit teacher master baek","Star Instructor, Master Baek 일타강사 백사부,One hit teacher master baek: He learnt the strongest martial arts only to be killed and be reincarnated as a rural village officer as Master Baek, The One Hit Teacher!"]},{"title":"Don’t Touch Me, Your Highness!","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa Don’t Touch Me, Your Highness!","She’s my sister, but she killed me. I cannot figure it out, even now I got my chance to reborn, thanks to the heaven. I cannot live with hatred and puzzles this time, so I have to revenge! I have to climb to the top upon the blood and bones of her, of all the people who framed me, hurt me! And he will be my weapons and maybe… love…"]},{"title":"What Should I Do With All My Money?!","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua What Should I Do With All My Money?! / Help, I Can’t Spend All This Money! Tiền Tiêu Không Hết Phải Làm Sao? / What Should I Do If I Can’t Spend Enough Money? / Wo Qian Hua Bu Wanliao Zenme Ban? / Wǒ Qián Huā Bu Wánliǎo Zěnme Bàn? / 我钱花不完了怎么办 我钱花不完了怎么办？","What should I do with my endless riches and vast wealth? Spend it all in style until the family fortune is all gone, of course! But what’s this? The more I go through with my plan, the more wealth I seem to have! I wouldn’t have been reduced to this if it weren’t for that stupid Eighth Prince! And now I have to spend all this money to save my own skin! What? The loyal pup that has been by my side all this time was actually that stupid Eighth Prince?!"]},{"title":"My Rich Husband Spoils Me Rotten","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua My Rich Husband Spoils Me Rotten /  Guide for the Two-faced President to Pamper His Wife My Warm Husband President’s / Guide to Dote on His Wife / Shuang Mian Zongcai Chong Qi Zhinan Shuāng miàn zǒngcái chǒng qī zhǐnán / The Double-Sided President’s Wife’s / Guide The Two-faced / President’s Wife’s Guide / 双面总裁宠妻指南","Nicolette Sage, whose fiancé has been stolen from her by her stepsister, is at the lowest point of her life when she meets Benjamin Jacek. He is tall, has long legs, and is handsome as hell. And the best part, he spoils her shamelessly. Turns out, this man of mystery is the richest person in the world."]},{"title":"My Husband’s Scandal","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Husband’s Scandal / ลวงรักคุณสามี / 丈夫的愛人 / 夫のスキャンダル / 我丈夫的绯闻 / 내 남편의 스캔들"]},{"title":"My Second Life as a Jerk Magnet","tags":["Fantasy","Romance","Webtoons"],"disc":["Read manga My Second Life as a Jerk Magnet"]},{"title":"Princess of the Animals","tags":["Drama","Fantasy","Full Color","Manhwa","Shoujo","Webtoons"],"disc":["Read manhwa Princess of the Animals / 동물들의 공주님","I’ll be a voice for the animals! Though Elise is forced to live in isolation, she doesn’t feel alone thanks to her ability to communicate with animals. That is until she’s sent off to marry the ruler of what’s known as the Land of the Barbarians! What adventures, and dangers, await Elise in this strange, new world?"]},{"title":"The Fairy Princess Has Decided to Take Revenge","tags":["Magic","Romance","Webtoons"],"disc":["Read manhwa The Fairy Princess Has Decided to Take Revenge / 妖精姫が復讐を決めたわけ\nDue to her strong magical powers, Maria, the daughter of a duke who grew up coldly oppressed by her family, believed that she could be happy with her kind fiancée. However, when he witnessed his fiancée cheating on him, his magical powers went out of control, and he was executed for attempted assassination of the royal family. Maria’s soul, which has been tattered by betrayal and repeated torture, is reborn as Mariabelle, a member of the neighboring country’s royal family. “I hope you will be happy in your next life. Mariabell will grow up with the love of the fairies and her family. Mariabell was happy and content with her peaceful days, but one day, the fairies disappeared. It is said that it is related to Mariabel’s previous life. There was a reason why the little fairy chose the soul of Maria, who was hurt by her betrayal, and reborn as a member of the royal family of the neighboring country…"]},{"title":"Two-Faced Teacher’s Night Class","tags":["Romance","School Life","Webtoons"],"disc":["Read manhua Two-Faced Teacher’s Night Class / Dangerous Tutor at Night manhua / 双面老师的夜间补习","Mini Mi who had run into huge amount of debt got a job in a bar, and found a great secret — the gentle teacher at school would become the cool poker-face boss in bar! Damn! Would Mini Mi be killed by the scheming teacher?"," "]},{"title":"Love Blossoms in Hwawol Valley","tags":["Fantasy","Historical","Romance"],"disc":["Read manhwa Love Blossoms in Hwawol Valley / 어서오세요, 화월당입니다","Sewol’s search for a miraculous medicinal plant to save her sick sister Dewol brings her all the way to Hwawol Tang, a flower shop run by Woonwu. Little does she suspect that Woonwu is actually a divine god, the dandy son of the Jade Emperor. Woonwu has been kicked out of the heavens by his father for his misdeeds and is living in exile in Hanyang. As punishment, he cannot set one foot outside Hanyang; however, he is able to cross borders with the help of Hwawol. Together, they search for perpetual snow ginseng, fighting ghouls along the way. Will they find the miraculous herb in time to save Dewol’s life and regain the Jade Emperor’s favor?"]},{"title":"My Superstar Uncle","tags":["Comedy","Fantasy","Manhwa","Music","Romance"],"disc":["Read manhua My Superstar Uncle / 我的叔叔是超级巨星 / 우리 삼촌은 월드스타","Sometimes it is not necessarily a pie that falls from the sky, it may also be a “dream”. The protagonist, who was reaching the lowest point of his life, frotuitously received an Artificial Intelligence robot that claims to assist people in realising their dreams. Can the protagonist change his fate successfully? &"]},{"title":"Retaliation of an Unwanted Bride","tags":["Manhua","Romance"],"disc":["Read manhwa Retaliation of an Unwanted Bride / Chongsheng Tuihun Qi Chóngshēng Tuìhūn Qī Pleasure of Love Rebirth of a Divorced Wife Rebirth Begins With Refusal of Marriage manhua 重生退婚妻","After being strangled to death, Lin Yaxi wakes up to find herself back to five years ago – just an hour before the car accident which would change her fate. Bearing a grudge against her evil sister and scumbag fiancé, she swears to never let history repeat itself. However, her fiancé’s brother, Chen Yi – a two-faced man, seems to be paying extra attention to her…"]},{"title":"2023 These Days A Special Love","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa 2023 These Days A Special Love / 2023 요즘연애 특","“Being “Something” through SNS, Taking relationships lightly, treating an ex-partner as a friend” Is this how relationships work these Days? Haha, Really? Hahaha. During these spring days full of love… I’ll once again please myself just with my webtoons ^^"]}]