[{"title":"1RM’s Gigant Rider","tags":["Action","Fantasy"],"disc":["Read manhwa 1RM’s Gigant Rider / 1RM의 기간트 라이더","Reincarnated with memories of the 21st-century Earth, Kang Geohan becomes an unnamed commoner in the continent of magic and steel, Laniacea. In order to escape the life of a virtually enslaved commoner, he must wield the “Stone of Demonhood” to become a Period Rider. “Shoulders back! Squeeze those buttocks! Breathe deeply below the belly!” Using the knowledge from his previous life as a trainer, he accumulates magical power like exercising, climbing the ladder of the strict social hierarchy. Experience the explosive growth akin to a steam locomotive and witness the intense battlefield where steel clashes in the webtoon comeback of “1RM’s Period Rider.”"]},{"title":"Get a Male Lead for Every Book","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Get a Male Lead for Every Book"]},{"title":"It’s Up to Us to Fight the Tyrant","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa It’s Up to Us to Fight the Tyrant"]},{"title":"Neyra’s Dragon","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Neyra’s Dragon / 네이라의 용 / 竜神様は何度でも回帰王妃を追いかける"]},{"title":"This Marriage Is So Sweet","tags":["Drama","Romance"],"disc":["Read manhua This Marriage Is So Sweet / 暖婚甜入骨 / Nuan Hun Tian Ru Gu","In a family alliance, Yan Shiqi got married to Qin Baiyu, the conservative fourth Master of the Qin family. Yan Shiqi originally thought that she would become a victim of a business marriage, but she didn’t expect… After the marriage, the conservative Fourth Master changed his reserved attitude and started showing affection and openly pampered his wife from time to time?!"]},{"title":"Please Divorce Me","tags":["Manhwa","Romance"],"disc":["Read manhwa Please Divorce Me / 이혼해 주세요"," "]},{"title":"Sudden Unintended Romance","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Sudden Unintended Romance / 급발진 로맨스","Ever wanted to hear someone’s thoughts? Second year high school student Yoo Jin is a girl who’s firm about her ideal type. One textbook example of her particular taste of cool-type handsome guys happen to be the president of their class, Shin Hyunsol. When a small accident enables her to hear his thoughts, Jin discovers that the inside of Hyunsol’s mind is the total opposite of what she thought it would be!"]},{"title":"My Eunha","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Eunha / ソラのしずく / ソラの雫 / 나의 은하","A devastating accident lands Eunha Seo in the hospital. Mysteriously, she wakes up 12 years younger in her 22-year-old body. Life has given Eunha a second chance, but this is not the life she remembers. Memories blur with reality as she navigates the unfamiliar friendships and romances of this parallel time. Like a surreal game of “what if?,” Eunha is torn between the excitement of a new past and a longing for the life and love she once had. Will Eunha ever find solace? Only time will tell."]},{"title":"Please Spread Flowers Across the Narrow Wooden Bridge","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance","Shoujo"],"disc":["Read manhwa 외나무다리에 꽃을 뿌려주세요 / Please Sprinkle Flowers on the Single Wooden Bridge / Twincognito Romance","“The man I fell in love with at first sight is my twin sister’s enemy?” I went to work at my twin sister’s company in her stead and met the man of my dreams. But, what? This person is my sister’s mortal enemy? My ideal man that I met on the narrow wooden bridge. Will there be a flowery path ahead of me?"]},{"title":"I Want You to be Happy","tags":["Fantasy","Historical","Manhwa","One shot","Romance"],"disc":["Read manhwa I Want You to be Happy / 네가 행복했으면 좋겠어","It was a miserable day. She lived a life where she could not die. Rat, who lived in the slums, was in danger of being sold to a perverted nobleman. “P-Please save me…!” Her first attempt at rebellion was easily thwarted, and she wondered if she would die like this. “You’re safe now.” She is saved by a man she meets for the first time. And a fantasy-like life is given to her. She gets to know her parents, who she thought never existed, and reclaims her real name, Irina. Among the kind-hearted people of the Winfried family, Irina heals her wounds and grows little by little. “Miss Irina, make sure you’re happy here.” The man who saved her, Duke Logan Winfried. Irina falls in love with him as if it were already set in place. But why? Why do I feel empty somewhere even though our hearts are connected? Why do you look so distressed? “You said you wanted me to be happy.” So do I. I want you to be happy too."]},{"title":"Silver Demon King","tags":["Action","Fantasy","Manhwa","Slice of Life"],"disc":["Read Silver Demon King / Silver Devil King","South Korean high school 3 Ha Yuan-an who ruined the water test by a marking mistake. In front of him, a beautiful foreigner, or a demon, appears and offers to return the time. Instead, they say to be the devil’s band… . Can Yuan, who suddenly lives the life of the Demon King, can return safely? “Shall I just live my own way? I’m real until the real thing comes back!”\nSilver Devil King"]},{"title":"Master Huo Fails To Pursue His Wife","tags":["Drama","Manhua","Romance"],"disc":["Read manhua Master Huo Fails To Pursue His Wife, Huò Shǎo Zhuī Qī Yòu Fānchēle Master Huo Chased His Wife Derailingly, Mr Huo Is Pursuing His Wife, 霍少追妻又翻车了","One day, she woke up, and it was 4 years later. Not only did she become the contractual wife of the cold-faced tyrant Huo Yicheng, but she was also the human ATM for her stepmother and stepsister. Such injustice! After Shen Yunxi dealt with the other woman, she found out it was him who lied to her the most.."]},{"title":"Sarasah","tags":["Comedy","Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read Sarasa (RYU Riang) / 穿越时空再爱你 / c / 사라사(컬러판)","Jihae’s spent two and a half years pining for Seunghyoo, and her final act to get him to notice her results in a tumble down the stairs to her death. Turns out it isn’t quite her time to die yet, but after her humiliating rejection, why would she want to go back? She cuts a deal with Lady Gameunjang in heaven and is sent back to one of her past lives, where all her love troubles began. Jihae is now Lady Ari of the ancient kingdom of Silla, where she now has three men to contend with."," "]},{"title":"The Dilettante","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Dilettante / 딜레탕트"]},{"title":"Falling for Danger","tags":["Manhwa","Romance"],"disc":["Read manhwa Falling for Danger"]},{"title":"Check In to My Heart","tags":["Drama","Office Workers","Romance","Shoujo"],"disc":["Read Will It Get Better or Will It Be Love? / 좋아질까 사랑일까","My boss wasn’t supposed to fall for me! Ajin, the newest intern at the ritzy HU Hotel, seems to have it all: looks, intelligence, and money. But when Seolmin, the CEO, discovers that she’s living in the basement of his hotel, Ajin desperately makes a deal with him to avoid getting kicked out. But this deal might change her life forever!"," "]},{"title":"Helmut: The Forsaken Child","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Helmut: The Forsaken Child / Helmut (Honyo) /  헬무트","[By the studio that brought you ] Helmut was a child who had been abandoned in the Magic Beast Forest at birth. Raised by Magic Beasts, the first human that he met was the Sword Saint Darien. Little did Helmut know that the chance encounter would soon shake the foundation of his fate… “Grow stronger If you want to get out of here.” The boy who’d lived like a beast was thrown into the human world! He possessed overwhelming swordsmanship, outstanding looks and sharp intelligence, but there was one thing he lacked: humanity. I am no longer prey. I am now a predator!"]},{"title":"The Demon Emperor Hopes for a Hero","tags":["Action","Adaptation","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Demon Emperor Hopes for a Hero / The Demon Emperor Desires a Hero / The Demon Emperor Wishes for a Warrior / 마황은 용사를 바란다","Betrayed and faced with death by the one he trusted, the Demon Emperor meets his end. Having always longed for death, he welcomes his final moments with a sense of peace. However, 66 years later, he awakens in an unfamiliar body. To his surprise, this body is referred to as a ‘hero’? The Demon Emperor never meant to exist for the sake of peace! Eventually, he embarks on a journey once again, not to seek happiness, but to embrace death…"]},{"title":"My Second Husband","tags":["Drama","Josei","Romance","Slice of Life"],"disc":["Read manhwa My Second Husband","Eunha Lee is a smart, successful lawyer who has life figured out…that is, until she loses both her parents in a tragic accident and divorces her husband, Taeyang, a famous actor, who she discovers has been cheating on her. Things take a turn for the surreal after Eunha slips on a staircase only to wake up in her past. She is now 22 years old and back in law school. Determined to make better choices in this second life, Eunha swears off romance only to realize her male best friend, Sungwoo, has been in love with her this whole time!"]},{"title":"Purely in Love","tags":["Drama","Fantasy","Josei","Manhwa","Mature","Romance"],"disc":["Read manhwa Purely in Love / 순종적 순애 / Purebred Love / Obedient Love","Since childhood, Yeonha has fervently pursued his dream woman, Soo-yi, undeterred by her repeated rejections due to their age difference. For Yeonha, Soo-yi has always been his one and only. However, a harsh reality check arrives when he learns of Soo-yi’s marriage while serving in the military. Years later, following Soo-yi’s divorce, Yeonha’s unwavering love for her remains unchanged and he sets out to make his beloved noona aware of how deep his feelings truly are. As time passes, Soo-yi finds herself slowly but surely consumed by the fiery passion of Yeonha’s love."]}]