[{"title":"Noah’s Tube","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Noah’s Tube / 노아의 튜브","The lonely boy “Noh Joo-yeon,” whose only joy was watching YouTube, accidentally saves a person at a fire scene and receives the “Oparts’ Choice,” gaining the superpower to download abilities from YouTube videos directly into his brain and use them freely! However, his joy is short-lived… A group called “Neo-Connecting” emerges, aiming to implant chips in people’s brains to control humanity. Their target: the Oparts in the boy’s brain! If the Oparts fall into their hands, humanity faces an existential crisis… To prevent the end of the world and to survive, the boy must become a hero. Will he accept or reject his fate? A surreal SF action-fantasy hero tale that transcends YouTube algorithms! Your likes can save the world!"]},{"title":"The Cup Of Vengeance Is In Your Hands","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Cup Of Vengeance Is In Your Hands / 복수의 잔은 당신의 손에","Judith, the princess of Tien, became the crown princess of the Kingdom of Lotair in exchange for money. Sick and timid, she goes through a few difficult years. Her husband, the 1st prince, goes crazy due to his stepmother’s constant harassment, and Judith, who has been falsely accused, is imprisoned in a tower. After her tragic death, she returns to the way she was before becoming a crown princess. She vows revenge on those who ruined her life."]},{"title":"World’s Greatest Senior Disciple","tags":["Action","Manhwa","Martial Arts"],"disc":["Read manhwa World’s Greatest Senior Disciple / 천하제일 대사형 / The best metabolic type\nA senior disciple from a countryside martial academy returns as the world’s best! Dragged into a brutal political war, senior disciple ‘Hyeok Musang’ didn’t return after the bloody war ended. No one knew whether he was still alive for 5 years. Upon barely returning to his hometown, he found his Dragon Tiger Martial Academy being persecuted and destroyed by a third-rate gang. He thought he could live peacefully with his fellow members after winning the war but seeing the miserable state of his master and fellow disciples, he was filled with anger and guilt. With the return of the senior disciple, everyone thought things would get better but only for a moment. Things were still happening in his hometown of Yangzhou County. Was the war really over? The head disciple raises his sword against the dangers threatening his Dragon Tiger Martial Academy."]},{"title":"I Want to Live Life Effortlessly","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read Manhwa I Want to Live Life Effortlessly, I Want to Live Life on Easy Mode, 인생 날로 먹고 싶습니다","At the prime age of 27, I fell for a professor’s sweet talk, ended up working as an assistant, and died of overwork. Then, I reincarnated.","I thought God might have reincarnated me out of pity, but this time, I’m the only villainess in a novel? To escape my fate, at 15, I boarded a carriage headed for a convent.","…And got swept up by a tornado from a clear sky and died again.\nNow, I’ve possessed the body of an assistant who got scammed into a job.\nWhat the hell…?","Since I’m alive again, I might as well live properly this time.\nBut the moment I made up my mind, a war broke out.","“Kiel, come here quickly! I have a brilliant plan to escape safely!”\n“Is that true, Professor Romellen?”\n“Of course! Don’t you trust me?”\n“No.”\n“……”","They say even bad relationships are still relationships.\nI believed in the ‘brilliant escape plan’ of my corrupt employer…","“Let’s hope for the 1% chance of a successful escape. As of today, our lifetime contract is over! Congratulations!!”","I got backstabbed.\nI shouldn’t have trusted a professor obsessed with experiments.\nHis invention, with a 99% failure rate, exploded.","‘Please… just stop already…’","But my desperate wish was in vain, as I opened my eyes once again.\nDuring my absence, some unknown soul had caused chaos in my second life.\nNow, I’m in the body of Serena Lavernia, the only villainess in this world, aged 26.","Damn it!\nThis is too much.","[Congratulations, the World Tree has chosen you.]\n“I’m not joining any religion.”","And to top it all off, now there’s even a rabbit trying to rip me off.","[In exchange, I’ll grant you any wish!]\n‘…Can I bring those damn professors here and make them my slaves?’","…Well, what does it matter if I get ripped off a little?\nI won’t join a religion, but I will get my revenge.\nI’ve worked hard; let me enjoy life for once!"]},{"title":"Named Player Elais: The Emperor’s Lady","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Named Player Elais: The Emperor’s Lady / 네임드 엘라이스: 황제의 그녀","Why even try to win the emperor’s heart if you’re just one of 48 concubines? That’s the mindset of Elais, who spends all her days in the imperial palace shut inside her room playing a VR game. In fact, she’s never met the emperor before, nor does she ever plan to. And she has even less reason to focus on him when she encounters a cute newbie in the game. If she can’t have herself a real-life boyfriend, might as well have a virtual one, right? But wait, why does this newbie have the same name as the emperor…?"]},{"title":"My Brother’s Boss Crossed The Line","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa My Brother’s Boss Crossed The Line / 선 넘는 오빠 상사","Don’t cross the line just because you have a one-night stand with someone you didn’t agree with but instead spent the night with someone you didn’t understand. That one night stand object is brother’s boss seo do-hyun! I must work for a better company than my brother, but I was encouraged by my friends to take on the challenge of a one-night stand! What a bolt from the blue. But “one night stand object” seo daoxian feeling good. He’s good-looking, capable, great at night, and honestly doesn’t hate to cross the line. Somehow, one day, knowing the age of autumn, dao xian left after saying goodbye… !!!!!!!!!"]},{"title":"Return of the Banished Archmage","tags":["Action","Adventure","Fantasy"],"disc":["Read Return of the Banished Archmage / Tsuihou sareta Dai Madoushi no Kikan / 追放された大魔導士の帰還","“I will have my revenge, no matter what.”\nThree thousand years ago, in an ancient Kingdom of Magic, Asuma, an archmage of unrivaled skill, saved the world from otherworldly invaders and became a savior. Yet, fearing his power, the king banished and ultimately killed him. However, Asuma’s soul returned to modern times.\nIn the Magic Academy, simply known as the “Academy,” where modern magic combined with science is the standard, Asuma is reborn as a student named Shiobana Asuma. He vows revenge against the descendants of those who drove him to his death all those years ago. Combining his mastery of ancient magic with modern, science-based magic, he develops unprecedented hybrid magic…\n“For mere students aspiring to be mages in this era to challenge me—you’re ten thousand years too early.”\n…and thus begins his tale of his revenge."]},{"title":"The Young Master of Namgung Is an Impersonal Person","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Young Master of Namgung Is an Impersonal Person / 남궁세가 비인격","“I won’t let you live again.” Facing the monumental task of unifying the martial arts world, the head of the Namgung family, ‘Namgung Hyun-ho,’ watches in horror as his beloved ‘dog’ annihilates his entire clan. In the moment he feels his neck being severed, he suddenly finds himself back seven years to when he first met that ‘dog.’ But things are unfolding differently this time around On top of that, the ‘dog,’ ‘Baek-gyeon,’ returns completely wrecked, making his vow of revenge seem meaningless. Was it really you who killed me back then? Truths gradually cast shadows on everything that has been concealed. The past shifts little by little. A bizarre intertwining of the slain Hyun-ho and the slayer Baek-gyeon unfolds in a thrilling tale of revenge and action."]},{"title":"Saving the Doomed Idols With My Touch","tags":["Drama","Manhwa","Showbiz"],"disc":["Read manhwa Saving the Doomed Idols With My Touch / Save a Failed Idol’s Life / 손맛으로 구제하는 망돌 인생","I can save even the most doomed restaurant with my touch!Im Hyeonseong, a famous chef who has even shown up in a TV show as the CEO of a food industry.He built his wealth and fame from the ground up, but meets an unjust death because of his stepmother and step-sibling.At that moment, a system window appeared in front of him.They will give him a chance to take his revenge if he succeeds in making ‘Climax’, the doomed idol group, successful by controlling Cheon Ise’s body.Will I be able to save the doom restau– I mean the doom idols with my touch? We will now begin the special quest, ‘Idol, Cheon Ise’!"]},{"title":"My Female Apprentices Are All Big Shots From the Future","tags":["Action","Adventure","Fantasy","Harem","Historical","Manhua"],"disc":["Read manhua My Female Apprentices Are All Big Shots From the Future / My Female Apprentices Are All Big Shots From the Future / 我的女徒弟们都是未来诸天大佬\nThe long river of history is facing collapse, the strongest Taoist priest returned to one hundred thousand years ago with a whole body of cultivation base? Ding~ Your system task has arrived, and the task of conquering the female apprentice is up to you!"]},{"title":"Poison Catastrophe","tags":["Action","Fantasy"],"disc":["Read Poison Catastrophe","Xing Yuan, a genius magical device inventor, lives peacefully in a small you desert town on the border, but suddenly he encounters a sudden change,…"]},{"title":"Merry Marbling","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Merry Marbling / 메리 마블링","",""]},{"title":"Selection of Queens in Joseon Dynasty","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Selection of Queens in Joseon Dynasty","Yun, the most eligible bachelor in Joseon, was ordered by the king to investigate five noble young women who had not submitted their names for the royal selection process. To find a suitable queen among them, he made a deal with Seo-gyeong, the most skilled apa (a woman who sells goods to the royal court), and they began their journey to find a queen, disguised as a married couple…"]},{"title":"Give Me the Pacifier","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Please Give Me The Pacifier / Gimme That Pacifier / 쪽쪽이를 주세요 /  请给我奶嘴吧\nBetrayed by my most trusted companion, I was banished.\nI closed my eyes and vowed revenge. But why did I become the son of a Duke of the Heiron Empire (with conflict with Cillophia?)\nThe problem is…\n“Abuu!”\n“Ah, that is annoying. Continue to bite your pacifier. ”\nMy eyes widen when I reflexively suck on the pacifier.\n“What did I just do?”\nWill my brain get watery and watery from pacifiers?\nEven without the pacifier, I was a complete baby with a flower head.\nThis is the biggest stain in Sorceress Hella’s life.\n“Since it’s turned out like this, I’ll just steal some top secrets and come back.”\nI get attention!\nToday, Celina was also desperately crawling between the pillars.\n“That… Whose child is that? Who is taking care of such a child? ”\nAn angry roar resounded behind her but that was none of Celina’s business."]},{"title":"I became the Despised Granddaughter of the Powerful Martial Arts Family","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I became the Despised Granddaughter of the Powerful Martial Arts Family / I became the despised granddaughter of Murim Clan / I Became the Despised Granddaughter of the Powerful Murim Family / 무림세가 천대받는 손녀딸이 되었다","The main character possessed in the world of martial arts. She possesses Baek Ri-yeon, the foolish and nuisance daughter of Baek Ri-eui-gang, a true teacher who leads the male lead to the path of a hero. After being killed unexpectedly, when I open my eyes, I return to being a child who can undo everything. “Can I be loved this time?” In this life, with the conviction that she will become a mother’s daughter, not Minpet’s daughter, she begins a life of being respected by everyone from the granddaughter of the Baekris family. The obstacle family appears in front of Yeon who wants to walk only on a flowery path, and Pae-Hyeok Baek, the patriarch and grandfather of the patriarch, who even trembles even in the mountains and rivers with his gaze. “Do you think you’re worth it!” “Yes!” There was no time to hide his embarrassment at the spirit of his granddaughter, “If there is even a weak hope, how can I give up as a father?” “…It’s like a wall window.” He is a grandfather who secretly opens his heart after being hit by a handsome son and daughter who are determined to be hated to save their daughter who is incapable of military service… I thought it was worth living at this point, but the male lead candidates’ obsession suddenly started? Let’s only walk on the real flower path now!"]},{"title":"Finding Camellia","tags":["Drama","Fantasy","Gender Bender","Historical","Manhwa","Romance","Tragedy","Webtoons"],"disc":["Read manga Finding Camellia / 참아주세요, 대공 / Please Be Patient, Grand Duke\nHer life was nothing but lies.\nCamellia was just 12 when she was taken away from her mother in the slums and forced to live as the son of an aristocratic family. But under the layers of secrets and lies, she never forgets. She continues to struggle to be her true self again, to reclaim the life of Camellia."]},{"title":"For Those of You For Whom Regret Is a Luxury","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa For Those of You For Whom Regret Is a Luxury / 후회조차 사치인 당신들에게"]},{"title":"I Plan To Become The Master Of A Stolen Family","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Plan To Become The Master Of A Stolen Family / The Secret of House Francesca / Mencoba menjadi pemilik keluarga yang dicuri / أخطط لأصبح سيدة العائلة المسروقة / 奪われた家門の当主になろうと思います,成为被夺走家族的主人 / 빼앗긴 가문의 주인이 되려 합니다"," "]},{"title":"The Dolled Up Villainess","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa The Dolled Up Villainess / 愛されし稀代の悪女","The alluring femme fatale, Dolores Deleon cajoles the sorcerer, Ethan, into creating a forbidden crystal ball for her, using it to further enhance her fame. As she enjoys her newfound success, Ethan faces arrest for misusing magic for personal gain, but Dolores heartlessly turns down Ethan’s pleas for help. Realizing her deceit, Ethan seeks revenge by casting a curse upon Dolores, transforming her into a doll during the day. Abandoned as a doll in the streets, Dolores is found by a compassionate dollmaker named Libby, who takes her into his workshop. Now the second chapter of her life begins, where she strangely finds herself entangled with men from her past…"]},{"title":"I Used to be a Boss","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I Used to be a Boss / 보스였음 / I Was The Final Boss","Baphomet, the boss of the [Tower of Abyss], waits for a strong hunter who is able to fight on equal grounds against him. When he had grown bored of the repetitive battles, he began to gain interest in the world of humanity due to the trophies he had obtained from the dead hunters. At the same time, he became further entranced by the existence of humans when the strong hunter he had always wished for appeared before him. Ultimately, Baphomet tries to become a human himself…"]}]