[{"title":"Savage Castle","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Savage Castle  / 새비지 캐슬","Due to his uncle’s conspiracy, the king leaves the throne and hides in a desolate land. The story unfolds with the king and a pitiful yet beautiful noble lady, who has made him her slave, entangled in obsession and affection."]},{"title":"Spirit Sacrifice: The Path to Godhood","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua Spirit Sacrifice: The Path to Godhood, 全民神祇：我献祭亿万生灵成神, Everyone is a King: I Sacrifice Countless Lives To Become A King","Han Wuhun traveled to a divine civilization where everyone can become a god, and gained the ability to sacrifice life. Although at first the family members were just seemingly useless locusts, with their numerical advantage and excellent ability, Han Wu began his cheating journey. From the beginning, he successfully resisted the bullying of the school bully, to resisting the partial teacher, and gradually gained He gained the recognition of his friends around him, then conquered a large number of civilizations, rescued his parents trapped in the Sea of Chaos Stars, and eventually became a powerful God King."]},{"title":"Brilliant Galaxy","tags":["Action","Drama","Fantasy","Manhua","Reincarnation","Time travel","Tragedy"],"disc":["Read manhua Brilliant Galaxy / 最闪亮的星河","After the divorce settlement, she was in dire straits with no money, no house, and no looks! To counterattack, Xia Xinghe became a top-notch hacker, gaining vast wealth without much effort!"]},{"title":"Hero Eden","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Hero Eden / ヒーローイーデン /  히어로 이든"]},{"title":"The Presepe Outside the Cage","tags":["Fantasy","Romance"],"disc":["Read manhwa The Presepe Outside the Cage","After countless regressions, Persepe finally conquers all five male protagonists in a harrowing reverse harem game. Just when she thinks she’s free, a message appears: “Secret Mode unlocked! Find the true male lead to escape.” Hope reignites—she only needs to woo the real protagonist to return to her original world. But there’s one problem: “So… who’s the real male lead?” With no clear answers and hidden challenges, Persepe must navigate shifting alliances, cryptic clues, and her own growing feelings. Can she uncover the truth and finally break free? Or will she remain trapped in the game forever?"]},{"title":"The Novel’s Extra (Remake)","tags":["Action","Adventure","Fantasy","Isekai","Manhwa","Romance"],"disc":["The Novel’s Extra (Remake) manhwa, 소설 속 엑스트라 , Extra in the Novel\nWaking up, Kim Hajin finds himself in a familiar world but an unfamiliar body.\nA world he created himself and a story he wrote, yet never finished.\nHe had become his novel’s extra, a filler character with no importance to the story.\nThe only clue to escaping is to stay close to the main storyline.\nHowever, he soon finds out the world isn’t exactly identical to his creation."]},{"title":"The Genius Tamer of the Academy","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Genius Tamer of the Academy","The life of an intern veterinarian who was always working overtime. As usual, I fell asleep while complaining about my situation… “System window…?","What is this…” [Synchronizes the story to Han Si-ha’s perspective] I possessed Han Si-ha, the villainous extra in a novel I usually enjoyed reading. ‘Why Han Si-ha of all people!","Not only is her magic talent useless, but she’s killed by the main characters in the beginning of the novel!’ I have to find a way to survive! In order to live peacefully without facing or getting involved with the main characters, graduating from the academy is essential. This is such a difficult mission for Han Si-ha, who has 0 magic talent and 0 sociality… If it’s taming, it’s related to my previous job… Should I give it a try?","“That… reptile. Trust me.” [You tamed a red dragon] Is this possible…? Maybe I’m a taming genius? Alright, let’s just get to graduation without any problems! But…”Han Si-ha, let’s be on the same team as me.”","“Han Si-ha! Don’t you want to go to the alchemy competition with me?”","“Han Si-ha… I have something to tell you… It’s important.” The main characters who killed me in the original work are showing interest in me?!","Will I… be able to graduate safely?"]},{"title":"The Heavenly Demon Can’t Live a Normal Life","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Heavenly Demon Can’t Live a Normal Life / The Reincarnation of the Dark Master / Descended from Divinity /천마는 평범하게 살 수 없다\n‘Heavenly Demon’ Baek Joong-Hyuk opens his eyes as the eldest son of the Dimitry family.\nKnown as the fool of the Dimitry family, pushed over by the second son. The world’s opinion is irrelevant.\n‘Heavenly Demon’, no, Roman Dimitry, cannot live a normal life.\nOP ‘Heavenly Demon’ fantasy!"]},{"title":"Don’t Tame the Tomboy","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Don’t Tame the Tomboy / 말괄량이를 길들이지 마세요","**A Fierce Encounter Between the Villainess and the Tyrant: The Sweet Pursuit of a Ruthless Romance** **“How dare someone like you even dream of courting me? I’d rather stay single for life than settle for someone like you!”** Katia, the notorious villainess of the southern territories, declares a life of singlehood! Suitors are turned away at her door, one after another. But her father, the duke, takes drastic action to change her mind. Facing the threat of an unwanted marriage, Katia tries to escape… **“I’m busy, so don’t annoy me. Move along, will you?”** **“Were you talking to me just now?”** **“Well, who else here would I be talking to?”** The man she meets? None other than Basil, the grand duke and a tyrant rumored to be mad. Escaping one madman, she finds herself tangled with an even crazier one! **“The moment you dismissed me, I felt as if my heart stopped.”** **“Then maybe you should see a doctor?”** **“Only someone like you could possibly handle someone as insane as I am.”** **“Are you looking for a wife or… a caretaker?”** **“With you, I think I could have both.”** Everywhere she turns, it’s madmen all around. Is this really her only choice? **“If I ask for a divorce, you’d probably kill me, wouldn’t you?”** **“And what exactly would I gain from that?”** **“I don’t know… a sense of conquest?”** **“Actually, I’d rather you conquered me.”** **“Are you sure I’m fit to be the duchess?”** **“I love you just as you are. Does that answer your question?”** **“Don’t try to tame a spirited woman. She’s beautiful just as she is.”** A tyrant completely captivated by the charms of a wicked woman—a crazy, relentless romance unfolds…"]},{"title":"The Villainess’s Wise Retirement Plan","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess’s Wise Retirement Plan","I reincarnated into *The Demon Lord’s Lover*, my favorite game. And not just anywhere—I’m the villainess who torments the heroine, only to meet a tragic end! On top of that, I’m cursed with a terminal condition: my life force drains each time I use magic, thanks to this human mana stone?! What kind of life is this…? No problem. I’ll just avoid using magic, protect my mana (a.k.a. my life force), save up a stash, and escape to a warm, peaceful land in the south with my sister… That was the plan, until— “Take this, Lilian. Your very own doll.” My father threw the male lead, the same one destined to become the future psychotic, possessive emperor, at my feet."]},{"title":"S-Class Self-Employed Person","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa S-Class Self-Employed Person","After seven long years in a fantasy world, I finally returned to the real world. Just when I thought I could enjoy some peace and quiet in normal life… Thanks to an Esper, my home vanished in an instant, leaving me with no choice but to scrape together what little money I had and start my own business. “Amazing! The highest-ranked S-class Guide has appeared!” “Huh…? Me?” I was just planning to live quietly as a café owner, but somehow, I ended up becoming an S-class Guide…?!"]},{"title":"Please Be Gentle, My Bossy Uncle!","tags":["Drama","Romance","Webtoons"],"disc":["The killer queen has got a chance to live her life again, but two things scare her… One is when master Jue flirts with her. He is so hot that she has no idea how to turn him down! The other is master Jue’s huge cannon. The moment she gets close, the fuse is blown. “Little uncle, we are both decent people. Please don’t flirt with me!” But Wei Hanjue simply twitches his lips and says: “Guess thats not how I define myself.”","Crazy Uncle, Please Don’t Tease Me!"]},{"title":"Bitten by the Dog I Abandoned","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Bitten by the Dog I Abandoned / 내가 버린 개에게 물렸을 때","Evelyn Winter is the daughter of the House of Winter. She cruelly chases away the dog that only followed her, Gillas Black.“Didn’t you say you loved me?” “Love? Did you believe that word? You don’t know your place, you idiot.”“You will regret this moment.” Evelyn has no regrets, she marries Rowen, Delilah’s heir and has a daughter, Sherry. But their happiness is short-lived when Rowen dies in a train accident and she is left a widow. To make matters worse, his family’s financial situation deteriorates. And the boy I used to pet is missing. The dog I abandoned came back as a war hero."," "]},{"title":"The Monster Lady and the Holy Knight","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["The Monster Lady and the Holy Knight / The Monster Lady and the Paladin / 괴물 아가씨와 성기사","“I wish you would love me, to the point of losing yourself.” At the age of twenty, Veronica lost everything. Her hometown, her friends, her family, and even her future as a human. Her crimson eyes, fused with the monster inside her, reveal only horrifying visions… But Leon Berg, a man who was once a holy knight, makes her an offer. “Even if you have to crawl through hellfire, tell me if you want to live.” “I believe only you can put an end to this disaster.” The only thing that can save a woman turned into a monster is a kiss imbued with the breath of the gods. As she receives the kiss from a man who could never love her, Veronica thinks: I wish… you would love me."]},{"title":"Adopted by a Murderous Duke Family","tags":["Fantasy","Historical","Romance"],"disc":["Read Adopted by a Murderous Duke Family","After ten years of being exploited by Duke Gerwehr for her healing powers, Agnes meets her death in a dungeon. When she wakes up, she finds herself in her uncle’s house before she was sold to Duke Gerwehr in the slave market. Desperate for her past life not to repeat itself, she lets Duke Rodwick adopt her and starts her new life with a new name, Tuariche Rodwick. Will she be able to keep her healing powers secret in this notorious family of assassins and find true happiness and love in her new life?"]},{"title":"The Indomitable Martial King","tags":["Action","Adventure","Fantasy"],"disc":["Read The Indomitable Martial King","[By the studio that brought you <Solo Leveling> and <Revenge of the Iron-Blooded Sword Hound, and many more! and Same Author that brought you <Survival Story of a Sword King in a Fantasy World>\nA world where humans sell and buy otherworldly species as slaves. The great mage Rifenhardt is treated like the Demon King for helping the otherworldly species. A party of heroes arrive to bring down the Demon King! Rifenhardt succeeds in greatly injuring the heroes, but he faces death at the hands of the MARTIAL KING??? Tesslon… “Time and Space Regression Spell.” However, he miraculously manages to cast this last-resort spell and regresses to the past. But… “I became the MARTIAL KING??? Tesslon, one of the heroes who tried to kill me and the strongest on the continent?!” Now begins Rifenhardt’s adventures as both a great mage and the physically strongest man to change the world!"]},{"title":"Pretty Woman","tags":["Drama","Romance"],"disc":["Read Pretty Woman / 尤物 / The Stunner (Official)"]},{"title":"Medical Top Surgeon","tags":["Action","Adventure","Fantasy"],"disc":["Read Medical Top Surgeon","“The success of the surgery depends entirely on Sungil Seoul Hospital itself.”","Eugene Won, the top specialist in surgical operations, receives a secret request for surgery from Sung Woo-je, the chairman of South Korea’s largest conglomerate, Sungil Group.","At last, the long-awaited chance for revenge!","Can Eugene Won use his scalpel to not only surpass Sungil Seoul Hospital but also take control of the entire Sungil Group?","A battle thought impossible by everyone is about to begin."]},{"title":"Become a Witch in a World Full of Ghost Stories","tags":["Drama","Fantasy","Manhua","Romance","Supernatural"],"disc":["Read manhwa Become a Witch in a World Full of Ghost Stories / Become a Witch in a World Full of Ghost Stories / Zài Chōngmǎn Guàitán De Shìjiè Lǐ Chéngwéi Mónǚ / 在充满怪谈的世界里成为魔女"]},{"title":"The Baseball Team’s Newbie are Too Good","tags":["Action","Adventure","Fantasy"],"disc":["Read The Baseball Team’s Newbie are Too Good\n“If a fastball comes, I hit it no matter what.”\nDespite possessing the incredible ability to read his opponent’s thoughts, Kim Ji-seop ended his career as an average pitcher.\nBut now, a second chance has come his way.\nThe second chapter of Kim Ji-seop’s baseball journey begins, this time as the top talent in the club’s front office!"]}]