[{"title":"My Boyfriend is a God","tags":["Fantasy","Magic","Romance","Shoujo"],"disc":["Read manhwa My Boyfriend is a God","Love is divine. Miso Lee lives an uneventful life. Then one day, a man drops down from the heavens before her and claims to be a god. He also insists that Miso has a ring one he had given to his lover centuries ago. Is he telling the truth? And if he is, does that mean Miso is the reincarnation of his old lover? mangabuddy is a website dedicated to fans of anime, , , , video games, and cosplay. Where you may find all of your anime-related memes, recommendations, reviews, manga recommendations, character fanfiction, favorite quotations, and simply those ordinary anime things that you enjoy, particularly memes.You can , online for free at mangabuddy. Chapters are updated hourly with high-quality graphics and a full English translation. Find free translations of your favorite , and . The latest updated content on mangabuddy is now available."]},{"title":"Daisy: How to Become the Duke’s Fiancée","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Daisy: How to Become the Duke’s Fiancée /데이지 – 공작의 혼약자가 되는 법 / デイジー～公爵の婚約者になる方法～ / เดซี่ ขอเป็นคู่หมั้นให้ท่านดยุก / 与侯爵的50亿契约 / Daisy : Cara Menjadi Tunangan Duke","Get married to the Marquess for 3 years and receive 5 billion coins vs. endure physical labor with no pay for 60 years. Which choice will Daisy make? A marriage of convenience develops between Daisy, who is a baron’s daughter, and the Marquess. The conditions of the contract are simple. No affection or love allowed, must work together as one, and guaranteed divorce 3 years later. Most importantly, do not do anything that can make the other fall in love. After pathetically drowning to death, Daisy goes back in time and now with her second life, she has one simple wish: to achieve happiness. Will she be able to fulfill it by Killian’s side?"]},{"title":"I Will Be the Main Character in That Prison","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Be the Main Character in That Prison / 그 감금물 주인공 내가 하겠다","‘In the afterlife, I hope to be reborn as a rich man’s dog.’ Yujin is orphaned and unable to find a regular job. While thinking about being a rich man’s dog, she is hit by a truck and enters the game Golden Cage! She finds herself possessing a little gray-haired extra who is killed by the prince at the beginning of the game. Not wanting to live a life struggle, she decides to take the place of the game’s heroine and become the prince’s pet dog… “Woof, woof, woof!” By barking like a dog, she succeeds in attracting the prince’s attention and gets a job as his ‘dog’! Eugene earns the title of “puppy-sama” and is given a cushy puppy life… but the problem is, the crazed emperor, who was obsessed with whether the “dog” would run away in the original, is not so obsessed! “What’s wrong, my dear Yujin?” Instead, he just looks at her with warm eyes… Awww, maybe I should have pretended to run away. Yujin’s struggle to enjoy a cozy and comfortable life as a dog!"]},{"title":"Dear Fairy, Please Contract With Me","tags":["Fantasy","Magic","One shot","Romance","Shoujo"],"disc":["Read manhwa Dear Fairy, Please Contract With Me / 요정님, 계약해 주세요\nHello. Am I perhaps your first fairy? ** Deep down in a basement, I met a lonely child. I wanted to see the smiling face of that child. So I decided to come into being as a flower fairy. “I promise you. I’ll leave this place with you!” You’re a seed stuck in the ground. In the name of the flower fairies, I’ll be sure to make you bloom. “Yes. Let’s work hard. Let’s leave together… Let’s get each other out of this place.” This fairy is going to have to do a lot in order to escape with the cute boy! We prepared for a long time. Then an unexpected opportunity came, but… We finally made it out back into the world. That entire world wanted my human who had now blossomed. “You’re too amazing for me to keep.” My first human. My precious planet. My lovely flower. Leoren, fairy Shurensha’s origin. For the sake of Leo, I want to let go of him, just a teensy bit, but, “Ren, you are the best in the whole world. I am only Shurensha’s Leoren.” Leo only cared about me. “Shurensha, please contract with me.” Forever."]},{"title":"A Morning Kiss at Tiffany’s","tags":["Drama","Romance","Shoujo"],"disc":["Read A Morning Kiss at Tiffany’s / 티파니에서 모닝 키스를 / Morning Kiss at Tiffany’s / Tipanieso Moning Kiseureul","The building was taken away by her first love. Yu Hari, the owner of the “Tiffany” building in Cheongdam. Eunho, her first love who came back after 5 years, pushed the transferring registration paper in front of her. “Ah, the name of this building has changed since yesterday to Cha.Eun.Ho.” Thus, Hari went from being a building owner to a homeless person overnight. “From now on you’re not my first love, you’re my first loser.” She hated him so much that she wanted to pour out all the curses in the world and strike him with lightning, but she needed to sort out her bare necessities first. That’s how Hari got employed for the first time in her life as a resident helper for Eunho, the “first-loser.” Her new job was difficult day in and day out, as she used to spend 99.9% of her life eating and messing around. She was also angry at Eunho, who was openly rude to her, but it was more bearable than she thought. No, sometimes it was fun. And…You know what they say, old habits die hard, she fell back into the habit of having feelings for Eunho… “The second clause in the contract is that the employee does nothing to seduce their fellow employee.” Will Hari be able to regain both the Tiffany building and Eunho? (CyberLife)"]},{"title":"The Godly Son-in-Law of the Nation","tags":["Action","Drama"],"disc":["The Godly Son-in-Law of the Nation, Godly Son-in-Law of Zhen Country, The Underdog Strikes Back, The Wolf in Sheep’s Clothing (iCiyuan), Zhen Guo Shen Xu, Zhèn Guó Shén Xù, 無能と呼ばれた夫の真の姿, 镇国神婿","Chu Chen, Young Master of the First Family in Huaxia, the heir of the number one mysterious sect in the world, accidentally sealed his own dual souls and five spirits on the journey down the mountain after completing his training. For five years, he played the fool and became the son-in-law who adopted his wife’s name. After awakening, Chu Chen, the unparalleled son-in-law of his generation, drank the strongest liquor, fought the fiercest dogs, and every day staged a counterattack in life!Menu [Hide]"," "]},{"title":"The Bromance Book Club","tags":["Adaptation","Drama","Romance"],"disc":["Read manhwa The Bromance Book Club"]},{"title":"Fatal Marriage","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Fatal Marriage / 致命的な結婚 / 치명적인 결혼 / Chimei-teki Marriage","The highly popular Korean novel is finally getting a long-awaited comic adaptation! Yuri, a serious and ordinary college student, suddenly finds herself noticed by the heir of a major conglomerate and begins living a life where she is referred to as “Madam”…?! At first, Yuri is afraid of his cold demeanor, but gradually she begins to see various sides of him…? Yuri’s exciting and new daily life is about to unfold now!"]},{"title":"The dying princess laughs in revenge","tags":["Action","Fantasy","Romance","Shoujo"],"disc":["Read The dying princess laughs in revenge / 死にがえり皇女は復讐に笑う","Lisa Fortan is the second princess of an empire whose supernatural power/ability is considered a proof of nobility. She grew up being looked down upon as an “incompetent princess” because she didn’t have any supernatural powers, and although she was troubled by the label and the handicap of being the only one in her family to have any supernatural powers, she was forced to do the official duties that were forced upon her by her siblings who did whatever they wanted. She was doing her best. One day, Lisa’s mansion is suddenly engulfed in flames. Due to her work performance, her brothers and sisters were jealous of Lisa’s rise to fame despite her incompetence, and plotted to assassinate her. However, before she knew it, she had relapsed a year before her assassination. Returning to her past, Lisa decides to take revenge on her brother and sister who discarded her, and asks her estranged childhood friend, the knight Theodore Leuven, to help her. The incompetent princess, who was exploited until her death, begins to exact revenge on the supernatural beings who have fallen under her power."]},{"title":"The Prosecutor Doesn’t Know The Law","tags":["Fantasy","Manhwa","Mystery","Supernatural"],"disc":["Read manhwa The Prosecutor Doesn’t Know The Law / Prosecutor Who Doesn’t Know the Law / The Law Ignorant Prosecutor / 검사가 법을 모름","Im Taesan, the second in command of the Waryong Association, possessed the body of prosecutor Kang Bareun, who is in a coma due to a traffic accident. Upon waking up, Taesan discovers that there are suspicious circumstances surrounding his death. He starts to unravel the conspiracy hidden behind his death using his connections and combat skills from his previous life, along with the intelligence and wealth from his current life."]},{"title":"I Tamed the Male Lead Who Tried to Kill Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Tamed the Male Lead Who Tried to Kill Me / Aku Menjinakkan Pemeran Utama Pria yang Akan Membunuhku / 나를 죽일 남주를 길들여버렸다"]},{"title":"An Inescapable Love","tags":["Drama","Historical","Romance","Shoujo","Smut"],"disc":["Read manhwa An Inescapable Love / 거부할 수 없는 운명","For Princess Seollan, life as twins and the shadow of a sick crown prince was a suffocating prison. So when the king ordered her to marry Jihwan of the Choi House, she knew it was her only chance to escape the palace and its shackles.\nUnfortunately, poor Jihwan was cursed by a vengeful white fox with a dangerous thirst for royal blood, and died for their marriage. But in the end, the two were powerless to stop the wedding. So Seollan is determined to find a cure for her new husband – but the truth they discover may be more cruel than the curse itself. Will their beginning love bloom in the snow, despite the harsh winds of fate that lie ahead?"]},{"title":"I’m a Villain, but I Saved the Heroine","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m a Villain, but I Saved the Heroine / 악녀인데 여주를 구해버렸다 / I’m a Villainess, but I Saved the Female Lead / 悪女なのにヒロインを救ってしまった","Possessing the evil woman, she lived hard.\nAs a result of doing her best not to interfere with the female lead and her male lead, she says, the female lead was successfully engaged to her male lead.\n…But one day, the female lead came to visit me?\n“Please help me and His Highness the Crown Prince break off our engagement!”\nHey, I think you misunderstood the role, but I’m a villainess and you’re a heroine.\n*\n“Still, can’t we sign a pair contract, even on paper? My teacher begged me to sign a pair contract.”\n“It’s not possible.”\n“They said that pairs were defined as people of similar skill level. If you’re on the same level as me, that means you’re just such a knight.”\nI like him but I also have to admit it. Considering the magic from before, it was clear that I was just such a wizard. Avonne just loved me. It was easy to admit that.\n“So, what is there to call each other with mere people like that? You said you can just sign a contract and never see it again?”\nPoor knight. Originally, there is a possibility of development when you know yourself. It hurts now, but I can’t help it. Since you’re handsome, it’ll be okay if you’re a little short of a knight.\nI looked at Kyle, who was staring blankly at me.\n“What the hell are you talking about?”\nKyle opened her mouth again. His expression twisted as if trying to peek into my thoughts.\n“Are they just people like that?”"]},{"title":"Dungeons & Artifacts","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Dungeons & Artifacts / Dungeon Devouring Artifact / 던전 씹어먹는 아티팩트","“The moment I get a hold of those artifacts, it’ll be the end for you!” The start of vengeance for a wrongfully killed dungeon explorer and his artifacts! Dungeons attract the human mind, strengthens it selves with the dead and uses bait and artifacts to lure more victims. The one who was killed by a ruse in a dungeon, Stetch Atelier. Beyond the threshold of death, he was given a second chance! He begins his long journey to get his revenge."]},{"title":"Meet My Wife, Who’s Also My Fan","tags":["Comedy","Drama","Fantasy","Manhua","Romance"],"disc":["Read manga Meet My Wife, Who’s Also My Fan / Crossing Into a Disgusting Female Star /  Get To Know About Wife Fan / 老婆粉了解一下","As a wife fan of the popular idol Huo Xi, Qiao Qiao’s most hated person is Sheng Qiao, an actress who gets involved with Huo Xi for hype.","Besides taking camera to join some activities, her major daily task is to diss this white lotus sincerely.","What she didn’t expect is that she would become Sheng Qiao after she hit her head one day.","During the shooting process of her first love drama with Huo Xi, the first scene was NG’d 27 times.","Huo Xi: Sheng Qiao, can you do it or not? If you can’t , you can be replaced!","Qiao Qiao: Husband, don’t be angry, I can do it!","Huo Xi: ? ? ?"]},{"title":"Beware of the Great Beauty","tags":["Drama","Fantasy","Manhwa","Romance","School Life","Shoujo","Supernatural"],"disc":["Read manhwa Beware of the Great Beauty / 존잘주의"]},{"title":"Cashmonger of Mangem","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Cashmonger of Mangem / Cashman of a Ruined Game / A Maga De Dinheiro Efetiva / 망겜의 현금술사","I fell into a ruined game as a full-leveled main character with S-class equipment, and an inventory filled with miscellaneous items. To save this game–no, this world–I have to stop the final boss who will destroy everything. Let’s go to the Imperial Academy of Magic! With my young, rich, and pretty charm, I’ll roast him, boil him, and lead him to the right path!"]},{"title":"Melody of the Deadwood","tags":["Adventure","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Melody of the Deadwood / Raga of Withered Branches / 뮤제 작가님, 인접 작가님","“Living isn’t fun anymore.” So I decided to die. But before I could leave, in the last moments of my life… “Should we make life fun for you?” The Vina people appeared in front of me. They asked me to live. They told me if I died, they’ll die as well. Do they want to live for eternity? “We’ll make you happy. So, don’t die yet.” “If you pledge to be one of us, you can have all the money you’ll ever need for the rest of your life.” “Love, just talk to us. What do you need?” “You can tell us everything you desire."]},{"title":"I Don’t Love You Anymore","tags":["Drama","Manhwa","Romance","Tragedy"],"disc":["Read manga I Don’t Love You Anymore\nTo Nivea, the world is like an eternal winter.\nHer parents and maids have given her cold shoulders since she was a child. When she fell in the snow, no one noticed her even for a glance.\nIt’s been a really scary winter.\nWhile living day to day like a doll on a display shelf, Nivea got engaged as part of a prenatal agreement between her father and her father-in-law. Her fiance is a Wishash. Duke Valor Wishash.\nAs in the prelude to all tragedies, it all begins with a damn love.\n“Love has its moments. You missed it all, and now I don’t love you anymore. “\nNiveia told her fiancé, who hadn’t seen each other in a decade.\nShe then left the Empire for a neighboring country, where she was welcomed with open arms.\nShe doesn’t expect anything there and simply intends to live a quiet life. The Emperor’s attitude towards her was extremely friendly.\n“I want you to be happy. You can wish for anything and I’ll do it. I want to give you a place where you don’t have to constantly be wary of other people.”\nAfter meeting Arendt, Nivea’s winter begins to become… spring, the snow begins to melt."]},{"title":"Hello, I’m the Gardener!","tags":["Fantasy","Isekai","Manhwa","Reincarnation","Shoujo"],"disc":["Read manhwa Hello, I’m the Gardener! , Welcome to Sylvia’s Garden , Sirabie’s Garden , 안녕하세요, 정원사입니다","Lee Ji-hyeon, an ordinary high school student who was met with a sudden death on the day of the end of college admission exams.\nBut suddenly, she became a gardener that can communicate with plants?\nAfter her death, she was born into ‘Elleb’ a fantasy world, with the new name Silvia, and her own special ability.\nSilvia nurtured and improved her ability and became a gardener recognized by the system. She was living an ordinary (?) life until…"]}]