[{"title":"The Taming of the Shrew","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance"],"disc":["Read manhwa The Taming of the Shrew / Floisey / 말괄량이 길들이기","A young female artist unexpectedly meets her muse upon arriving in Paris!"]},{"title":"Ingrid, the White Deer","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Ingrid, the White Deer / 흰 사슴 잉그리드 / White Deer Ingrid! / Ingrid, El Ciervo Blanco! / Ingrid, the White Deer / White Deer! / 白鹿少女英嘉莉德 / 白鹿英格丽德","The beautiful daughter of the Farnese family is caught up in a whirlwind romance with a notorious royal playboy — it’s the scandal of the century! When the title of “Elvynee Deer” is awarded to the pure and lovely Ingrid Farnese, all of high society expects her to marry into foreign royalty. Cursed in love with a history of broken engagements, Ingrid is determined to stay put at home in Valentine Kingdom. To take control of her own future she’ll make the king’s illegitimate son, libertine and womanizer Regan Espencer, propose to her. But the problem is, Regan is the only man in the country who doesn’t want her hand in marriage! Will Ingrid survive being tossed into the throes of debauchery and reach her happy ending?"]},{"title":"After the Frozen Heart Melts","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa After the Frozen Heart Melts / 凍りついた心が溶けたら / 얼어붙은 심장이 녹고 나면","“To quell the magic threatening the world, Hestia was sacrificed as an offering. Reincarnating as Cecilia, a nobleman’s illegitimate child, with memories from her past life.”","The life she had lived without her own will had long since ended.","Whatever she had been in her past life, now she was living as her enemy’s sister’s maid. This was Cecilia’s life as the nobleman’s illegitimate child.","However…\nOut of nowhere, the man her sister intended to marry, Duke Kilian Janssen, suddenly declared that he would marry Cecilia.","Moreover, his voice seemed to overlap with a voice she had heard a long time ago.","“I’m so angry because of you that I can’t stand it.”","“…If you want to refuse, go ahead. I will definitely marry you.”","A man who approached her using the same tactics as in her past life. His persistent demands and obsession kept bringing back memories of her past life.","Can Cecilia heal the wounds of her past and find her true life and love?"]},{"title":"Her Tale of Shim Chong","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Yuri(GL)"],"disc":["Read manhwa Her Tale of Shim Chong / Her Shim Cheong / Her Shim-Cheong / Her ShimCheong / 她的沈清 / 她的沈清：丞相夫人與她的秘戀 / 彼女の沈清 / 桃花洞の沈清 / 그녀의 심청 / Ihre Geschichte von Shim Chong","Two women destined to suffer in a man’s world. One, a beggar caring for her blind father. The other, a wife to be sold off to the chancellor. Both wish for a quick and painless death to ease their suffering, but a chance encounter may just provide another option. As romantic feelings for each other swell, the two begin to rebel against the customs that conspire against them."]},{"title":"A sure win","tags":["Romance"],"disc":["Read manhwa A sure win / First to Win! / 선빵필승!","Faced with yet another failed crush, I stumble upon a campus advertisement: “Get 5 million won as a couple support grant when you match on the app!” Participating in a blind date app trial could mean winning a prize for finding love?! “Get the prize and find love too!” That’s the pitch for the matchmaking app, “Sunbread Victory,” promising tangled love triangles and cash rewards."]},{"title":"The Tyrant’s Comfort Doll","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Time travel","Webtoons"],"disc":["Read manga The Tyrant’s Comfort Doll / 폭군의 애착인형 / The Tyrant’s Beloved Doll\nLegend has it that a man with black hair and red eyes will bring destruction to the royal family of Den Helder.\nBecause he was born with these traits, Rayton was shunned by the palace, he was considered a “cursed one”.\nWhen the vengeful prince staged a bloody coup years later, the helpless youngest princess, Setz, was also killed by his sword.\nLittle did Setz know that she was about to wake up in her body five years ago. And it came true, she has a new chance, it’s her chance to side with Rayton’s good side and turn her fate around.\nBreaking the prince’s cold exterior is a big challenge, but once she proceeds, there seems to be no way back!\nAs Rayton becomes more and more attached to her, Setz is drawn deeper into the dark conspiracies going on around the palace.\nHas the princess really escaped death, or is she in more danger than ever?"]},{"title":"The Sickly Tyrant With An Innocent Facade","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Isekai","Reincarnation","Romance","Time travel"],"disc":["Read The Sickly Tyrant With An Innocent Facade / Bìng Jiāo Bào Jūn Gǎi Ná Lǜchá Jùběn / The Sickly Loveable Tyrant Changed to Take the Green Tea Script / Yandere Tyrant Transforms to Take the Green Tea Script / 病娇暴君改拿绿茶剧本","Fu Xin, a powerful president of her company in the modern age, finds that she had travelled to the past and transmigrated into the body of the village girl Fu Qibao along with her Merit System. Now, not only did she have to suffer the consequences of the original host’s cruelty to other people, but she had also earned herself a betrothed. No one had foreseen this exceptional teen who the original host had brutally beaten up to one day become a merciless tyrant of an emperor that ruled the world. He was going to kill everyone who hurt him before… Hold on, why does this sickly tyrant have two sets of personalities? Wait, is he acting innocent in front of Fu Qibao to gain her affections?!"]},{"title":"I’m Not That Kind of Talent","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I’m Not That Kind of Talent  / 저 그런 인재 아닙니다","I’m not that kind of person. I, Dion Hart, am a sickly person who vomits blood whenever I’m stressed. However, at the same time, I’m Count Hart, who has somehow been misunderstood and thought of as a strong person, and thereby feared by everyone."]},{"title":"The contract marriage has come to an end","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The contract marriage has come to an end / 계약 결혼이 끝났다 / The Contract Marriage Is Over","The contract marriage, which began as a deception, has come to an end. I sought freedom from the household, while he needed the support of my family’s background to establish himself. After three years, we successfully concluded the contract marriage. With a stamp on the divorce papers, we could finally embrace the lives we each desired. “Now, how about preparing for the divorce?” “What? What are you talking about?” “Let’s start preparing for the divorce.” “So, what exactly is divorce?” Wait, what’s happening all of a sudden? The affectionate contract husband of three years seems to have disappeared, leaving only the indifferent Duke. “We promised, let’s stamp the divorce papers right away!”"]},{"title":"The Maid With A Dictator On A Leash","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Maid With A Dictator On A Leash / 하녀는 폭군의 목줄을 쥐고 있다","After the royal dictator decided to accept a bet of not forgetting the name of a certain maid for one month, said maid “Liana Theodore” was overwhelmed due to the sudden attention she was receiving from the dictator whom also she had a crush on. She knew that having that kind of feelings as a maid towards a member of the royal family was something inconceivable, so she was determined to forget about it. However, after a magical event gave this maid the chance to make her forbidden desire true…. How is she going to deal with her new storyline? And what about her previous crush being devoted to her now? What kind of situations will this cause and how they relationship is going to develop?"]},{"title":"Silly Little Abella","tags":["Adaptation","Drama","Fantasy","Historical","Isekai","Reincarnation","Romance"],"disc":["Read manga Silly Little Abella / Idiot Abella / 백치 아벨라","Seokyung Kang is the most in-demand math teacher in the most prestigious town in the country. One day, she is driven over by a truck and wakes up as Abella, a gorgeous but intellectually challenged daughter of the Archduke. Before she could even get a hold of what’s going on, she has to marry the “monster,” a hunchback imperial prince who has burns all over his body! But the so-called “monster” turns out to be a hunk and a pretty boy! Now, Abella has to figure out what’s her mysterious husband’s mind while battling a group of mean imperial in-laws. Can Abella use her role as the “fool of the court” to her advantage to turn her married life around? Watch out, this fool is coming for you!"," "]},{"title":"Bride of the Snake King","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read Bride of the Snake King / She Wang De Jiao Qi / Shé Wáng De Jiāo Qī / The Snake King’s Pampered Wife / 蛇王的娇妻 / 蛇王的嬌妻","Thrown back into a world full of fear and darkness… Is it truly alright that I am now falling for a thousand year old snake demon?"]},{"title":"Make him cry","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Make him cry / 울게 하소서 / Make Me Cry","Joohan is a devout deacon with a fiery personality, actively volunteering at an orphanage. Songmi, intrigued by Joohan and attending the church out of curiosity, discovers that he, who appeared more abstinent than others, is unexpectedly getting turned on while whipping himself…"]},{"title":"Not a Lady Anymore","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Not a Lady Anymore / 이제 아가씨가 아니야","“All I want is a ‘future that doesn’t die,’ that’s all.” Adela, the daughter of the Laver family, a famous family of magic, has lived obediently, giving her all to be loved by her family. But one day, when she hits her head due to a maid pushing her, memories of her past life return, and she realizes that she was destined to be killed in the end. When Adela learns about the future, she no longer pursues her goal of being loved by her family, even to the point of abandoning herself. If she is going to live an unhappy life where she will not be rewarded, she would rather live as she pleases, leave her family now, and live in peace as a commoner. She made up her mind to do so, but…"]},{"title":"It’s Not Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa It’s Not Love","Soo-yeon wants to marry her boyfriend of six years, Kyung-heon, but everyone around her is against the idea because he is selfish and self-centered. “Why do you want to marry me?” she asks, hoping to convince him of her heart, but he gives her a surprising answer. “My father is retiring soon, and I need to return the money I gave him.” What! That’s why you want to marry me! Soo-yeon’s confusion is short-lived when she becomes intensely involved with Do-kyung, the next head of the company…"]},{"title":"Daytime Girl, Nighttime Boy","tags":["Drama","Romance"],"disc":["Read manhwa Daytime Girl, Nighttime Boy","We are conjoined twins, so we have a unique condition that makes us a girl during the day and a boy at night. The only person who knows this fact about us is our family and friend, Kim Soohwan, as we have transferred schools six times because of it. However, is there one more person who knows our true identity?"]},{"title":"Everything was a Mistake","tags":["Fantasy","Historical","Isekai","Manhwa","Romance"],"disc":["Read manhwa It Was All a Mistake / Everything Was a Mistake / Everything Was a Misunderstanding / 모든 게 착각이었다","Roa Valrose reincarnated as villainess in the book. In order to avoid the fate of being burned at the stake, she approaches the hero, Nocton Edgar. It hurts every time she gets closer to him. Nevertheless, for her survival, she does everything he wants her to do. “Come again, Valrose.” The mysterious Nocton unexpectedly sought her out every day. Then one day, her friend for 10 years says something unknown to her. “Actually, I have a dream. The Duke of Edgar is a terrible villain!” He is not the hero, but the villain? As soon as she realized that she had misinterpreted the role, she decided to get away from Nocton. “Let’s not meet anymore.” But the villain’s reaction was strange. “Don’t go. You’ve always been special to me.” She was suspicious of his sudden change of attitude. Will she able to get rid of Nocton safely?"," "]},{"title":"Awakened Thief Steals the World","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Awakened Thief Steals the World","In a rural orphanage, Cloud. of the Himmel Kingdom, There’s an earnest boy named Leon who often takes care of the younger kids. though their world is in midst of a war, Cloud is in a rural area, far from the battlefield. However, one day, leon discovered a familiar face amongst the soldiers that past by him. It was strikingly similar to the robber who broke into his house and killed his mother 6 years ago. “I’m pretty sure that the culprit wasn’t caught…”. Fueled by his desire to know the truth of that case, he went back to his old house. However, he fainted after coming in contact with the magic circle in the hidden room. When he woke up. He recalled memories of his missing father and awakened to a single ability. That was the ability to Steal. Leon’s father was the greatest thief of the century and he left a magic circle for leon to inherit his ability and knowledge. Leon decided to enter the army with his skill to learn the truth."]},{"title":"The Duke of Darkness Proposes a Contract Marriage","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Duke of Darkness Proposes a Contract Marriage","The daughter of a viscount, Eris Fraser. She fell into her stepmother’s scheme, lost her engagement to her brother, and ended up forcibly marrying a troublesome man. Nevertheless, she took solace in her beloved child and tried to make the best of her life. But due to her careless husband, she even lost her son. “Please return my child!” In despair, after praying day and night for a hundred days, Eris succeeds in returning to the moment when her engagement was taken away. “Is there someone you love?” “No.” “Then wouldn’t it be uncomfortable for me to appear as your fake lover in people’s gossip?” “No!” “Then it’s settled. Call me Theo.” Did she receive a contract marriage proposal from the ominous duke filled with ominous rumors?"]},{"title":"The Tainted Half","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga The Tainted Half / 반쪽","Two brothers. One concubine. Seolha’s face was disfigured by her mother, who sought to deny the emperor his prize: the most beautiful concubine in the world. Now forced to endure a lifetime of abuse, Seolha can only pin her hopes on Muon, the emperor’s twin brother. But is he really someone she can trust?\nThe Tainted Half is a story tagged R18, please consider before reading this series."]}]