[{"title":"I Am The Shadow Reverend","tags":["Action"],"disc":["Read I Am The Shadow Reverend / 天生毒奶，我诅咒了全世界！","Traveling through a parallel world, the game merges with the real world, where ferocious beasts are rampant, alien races are raging, and there are a large number of dungeons and secret realms in the wild. Humans can awaken into various professions and work hard to kill monsters and upgrade.","On the day of his profession awakening, Lin Luo awakened the priest profession, which is the most popular but has no damage ability. Just when he was struggling, he discovered that his skills had mutated! The blood recovery technique mutates into the bleeding technique? Blessing mutates into curse? But I am really a healing priest!"]},{"title":"Girl with a Knife","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Girl with a Knife / Knife girl / 칼가는 소녀","Two young girls, Love and Eunjo, dream of revenge for the world with swords in their heart."]},{"title":"The Beginning of the Primordial Era: Taking the River Styx as My daughter","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua The Beginning of the Primordial Era: Taking the River Styx as My daughter / 洪荒之开局收冥河做干闺女","A modern man named Yang Li is transported back in time to the primordial world. Thinking he’s just an ordinary person, he accidentally insults a multitude of deities and saints. Through a series of unforeseen events, he manages to conquer…"]},{"title":"Dear My Rude Darling With Multiple Personality","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Dear My Rude Darling With Multiple Personality / To My Rude Multi Personality Man / 무례한 나의 다중인격자에게","The beautiful port city of La Spezia. After leaving an orphanage and serving as a nurse on the battlefield for three years, Monica is hired as a tutor by the wealthy Mallett family. On her first day in a strange city, Monica encounters a familiar face.","“I’m sorry, but I don’t have that name.”","I think it’s Sol, a soldier who took great care of her on the battlefield, but the man replies that he doesn’t know her.","This wasn’t the man she knew, but if she meet him again, he will be the man she know. It’s a pleasure. Garcia, a violent bully.","“I should have treated you as if you were serving a precious princess.”","Enrique, an arrogant noble to the core as a son of a noble family. The only thing like that is a picture-like appearance and a scar around his right eye.","“Sir, are you triplets?”","Is he a person with multiple personalities or a liar? Will Monica be able to live safely in La Spezia?"]},{"title":"Dreaming Freedom","tags":["Drama","Fantasy","Manhua","Manhwa","Mature","Psychological","Romance","School Life","Supernatural"],"disc":["Read manhwa Free in Dreams / From Dreams to Freedom / Freedom through Dreams / Freedom in Dreams / 꿈에서 자유로","Jeongmin is a loner in high school being bullied by the Queen Bee, Juhyeon. The two were friends in elementary school before their friendship ended because of Juhyeon’s demand that Jeongmin should only be friends with her. Juhyeon uses this “betrayal” to fuel the classmates’ insults and isolate Jeongmin in misery. Jeongmin has only one way to escape, through lucid dreams. One day, a mysterious man enters her dreams and offers to help her get revenge on Juhyeon…"]},{"title":"Warrior Grandpa and Grandmaster daughter","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Warrior Grandpa and Grandmaster daughter / Warrior Grandpa and Grandmaster daughter / 할배무사와 지존 손녀"," "]},{"title":"Revenge Of the Bloom Flower","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Revenge Of the Bloom Flower","The scripture that brought a bloodstorm to Jianghu was the “Wisdom of the Secret Master,” a legendary book that is said to hold the power to seize all the world’s authority and wealth. Because of it, Woonseon lost all his loved ones overnight.\nNow, he casts aside his bright and pure past and embarks on a desperate journey for revenge. The flower will wither in ten days. Nothing in this world will be eternal, whether it’s wealth, power, or love."]},{"title":"Ghost Hunter","tags":["Action","Adventure","Fantasy"],"disc":["Read Ghost Hunter"]},{"title":"A Modern Man Who Got Transmigrated Into the Murim World","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa A Modern Man Who Got Transmigrated Into the Murim World / 무림에 떨어진 현대인"]},{"title":"Marronnier Farm Near By The Imperial Palace","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marronnier Farm Near By The Imperial Palace / Marronnier Farm Next to the Imperial Palace / 宮殿の隣のマロニエ農場 / 皇宮裡的馬洛尼埃農場 / 황제궁 옆 마로니에 농장\nThe land that my grandfather invested in the old days won the new palace site!​\nGrandfather, who is looking for a “salvation” with a “salvation”, sends his granddaughter Hazel, who is a dream of farming, to the Imperial Palace.\n“You could never be kicked out and hold on.\n“The young emperor who wanted a magnificent imperial palace that was worthy of great achievements will be the new neighbor of the day.\n“What’s that smell?”\n“I smell the manure, Your Majesty.\n“The story of a small farm in the middle of a garden\nMaronier Farm by the Imperial Palace next to the vulcanized palace to conquer the social circles of the empire."]},{"title":"Global Freeze: I Created An Apocalypse Shelter","tags":["Action","Adventure","Fantasy"],"disc":["Read Global Freeze: I Created An Apocalypse Shelter , 全球冰封：我打造了末日安全屋 ; Global Frozen: I Build a Doomsday Safehouse ; The world is frozen, I built a doomsday safe house ; I created a bunker in a frozen wor","Global Freeze: I Created A Apocalypse Shelter, where the world is plunged into an icy age, and 95% of humanity is wiped out! In his previous life, our hero Zhang Yi was tragically killed by the very people he helped, thanks to his kind heart.But fear not, for Zhang Yi has been reborn and now possesses the awesome power – space manipulation! He’s gone completely bonkers hoarding supplies for the icy apocalypse and is ready to rule the frozen wasteland! He vows to unleash a hundred times the pain on those who harmed him in the past!"]},{"title":"Lonely Emperor Chases His Sister-in-Law","tags":["Historical","Romance"],"disc":["Read Lonely Emperor Chases His Sister-in-Law / Gu Wang Gua Nu / Gū Wáng Guǎ Nǚ / Lonely King and Widowed Woman / 孤王寡女 / Lonely King and Widow","Mo Jui is a talented and beautiful descendant of the Mo family. She accidentally broke into another world and ran into a beautiful man, Xiao Shijun, who was ascetic, cold and powerful, but then she heard him call her “sister-in-law” and he asked her to come with him. His eldest brother, Chong Xi, is seriously ill? The talented and beautiful woman immediately escaped from that marriage, but was caught three times by the younger brother, fighting each other with constant passion! Accidentally, the two of them fall deeply in love, like a cloud and rain, they were connected in life and in death… How should they face this forbidden feeling?"]},{"title":"I Became The Duke’s Male Servant","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became The Duke’s Male Servant / 공작가의 남장 하인이 되었다"]},{"title":"Devious Son Of Heaven","tags":["Action","Fantasy","Historical"],"disc":["Devious Son Of Heaven, Shi Zun: Zhege Chong Shi Nitu Cai Bushi Sheng Zi, Master: This Disciple Rebelling Against His Master Isn’t the Son of God, Master: This Villainous Disciple Is Not The Holy Child, 师尊：这个冲师逆徒才不是圣子","A hundred years ago, Chu Xiu transmigrated from Earth to Cang Qiong Continent, and received the Destined Villain System. After killing countless holy sons and daughters, he was surrounded by the older generation, and self destructed, possessing Tai Su Sacred Ground Yun Xia Mountain’s senior disciple. This time, he decided to lay low and develop strength. Let’s start small, what about becoming a saint admired by thousands?"]},{"title":"Steel Covenant","tags":["Action","Adventure","Fantasy"],"disc":["Read Steel Covenant / 钢铁契约","“Qiao An of the Honours Class in the Combat Armour Academy, you have failed the mech compatibility test and have been demoted to the logistics class of the outer academy.”\nThree hundred years after the apocalypse, the human world lay shattered. A young man, Qiao An, burdened by immense debt, unexpectedly discovers that he has already bonded with not just one, but multiple sets of top-tier Combat Armours.","“Black or white—what’s your choice?”\n“I’ll take them both!”","With the strongest combat armours in hand, making money will become easier than ever.","“Saving the world? Nah, that’s none of my business.”\n“What? Did you say all my debts will be forgiven? Wait, hold on—!”"]},{"title":"Until the Soul of the Fallen Queen Knows Love","tags":["Drama","Fantasy","Romance"],"disc":["Read Until the Soul of the Fallen Queen Knows Love","Liaris has been mistreated as an ‘incompetent’ person by everyone, including her family, all her life. But one day, she awakened her psychic powers, along with the memory of her previous life as a queen. “If people were to find out about this power, they’ll use me as they did in my previous life, and I’ll have an unhappy future again.” Thinking this, Liaris decided to hide her ability and live quietly as a helpless daughter. But when Edward, the sixth prince, learns of her secret, he asks her to become his fiancee. Once more, Liaris is taken to the stage of the throne succession that will shake the country. A romance fantasy about a strong daughter who wants to live quietly in a peaceful world, and a lonely prince who wants to change the discriminatory world brought about by his unusual powers."]},{"title":"The Deposed Empress’ Scandal","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa The Deposed Empress’ Scandal / 폐후의 스캔들 / Deposed Empress’s Scandal","Lucentia was forced into a marriage with the emperor only to be accused of treason and beheaded. However, a precognitive dream saved her from death, allowing her to flee to the enemy empire. There, she reinvented herself as Rose Von Isaac, a wealthy and influential merchant. But destiny had more in store for her. She is the only one who can save the legendary swordsman, Duke of Aytan, whose secret could change everything. She proposed a deal for him to be her guardian, but he demanded she be his lover instead."]},{"title":"Kingmaker Goddess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Kingmaker Goddess / 킹메이커 여신님","Just before becoming a deity in the celestial realm, the goddess ‘Siren’ is deceived by Arwen, whom she believed to be a friend, losing all her ‘Human Play Points’ necessary to enter the celestial world. The fastest way to regain these points is to successfully complete the most challenging human experiences. To achieve this, she is reborn as the daughter of ‘Targa,’ the illegitimate son of the Caronin Empire, and works hard to make him emperor.","“Wait for me, Dad! I will definitely make you an emperor!”"]},{"title":"For the Musical Genius","tags":["Adaptation","Drama","Fantasy","Manhwa","School Life","Time travel"],"disc":["Read manhwa For the Musical Genius / For the Music Genius / 음악천재를 위하여","Kang Hyeon, who was ashamed of his poor family, cut off ties with those around him and studied desperately to achieve success, but eventually he realized that his ideals were wrong. To make matters worse, Hyeon, who has cancer, gets run over while trying to save someone who fell on the subway tracks, and returns to the past while listening to the melody of a symphony. Hyeon, who was determined not to live the same life as before, realizes that he has tremendous musical talent… ."]},{"title":"Worst Generation","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Worst Generation / 최악의 세대","Today’s kids have no manners. It’s you who raised them that way. Jung Buldo, the legendary fist, tries to start a new life after being released from prison. However, those close to Buldo are being harassed by the new generation of MZ gangsters.Tae Eunseok, who has been watching this, tries to use Buldo for his own revenge…"," "]}]