[{"title":"The White Lotus’s Character Cannot Be Collapsed","tags":["Drama","Fantasy","Manhua","Romance","Shoujo"],"disc":["Read manhua The White Lotus’s Character Cannot Be Collapsed","A girl that has dated many men accidentally reincarnated as a lady from a marquis family. After her father died, she inherited his peerage and owns a castle with mesmerizing wealth. She also got a duke as her fiancé. But just when she thought that she had reached the peak of her life, she realised that everything is not as simple as it seems. All the treasures and money were stolen by her family and her fiancé that’s in charge of the robbery case will soon investigate into her."]},{"title":"Counterattack of a scheming princess","tags":["Historical","Romance"],"disc":["Read manhwa Counterattack of a scheming princess / Two-Faced Prince: Abandoned Wife Is Difficult to Deal With / 腹黑王爷：惹不起的下堂妻","After the first class killer mistakenly died, she traversed, and became a concubine to an important general, what happened to Chu Ziqiao’s aunt and sister-in-law? She couldn’t figure out how this worked, so she acted like she didn’t know and changed the universe to receive what she deserved!"," "]},{"title":"Virtual World: Close Combat Mage","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Virtual World: Close Combat Mage,\nDue to a mistake on his student’s part, a super Martial Artist received the wrong class in an online game and has become a mage. He, who was used to curbing violence with violence and using strength to subdue strength, could only make the best out of this mistake. Taking on a new lease in life, he became a violent close combat mage. When strength and magic came perfectly together, a new gaming path had been opened by him!"]},{"title":"God of War, Crazy Princess","tags":["Fantasy","Psychological","Romance"],"disc":["God of War Mad Concubine: The Path to Obtaining the world / God of War, Crazy Princess Hot Comics / Princess Agent Reborn Princess Agent Reborn manhua / 战神狂妃：凤倾天下","Sheng Qianyu, a gifted special force soldier, experienced a time-travel. She didn’t expect to wake up as a noble lady in the Prime Minister’s mansion! She should have been married to Prince Yu if she wasn’t betrayed by her fiance and sister. The wedding night was stained with blood, and her whole family was slaughtered. In the name of Lord Yu’s third daughter, she went to the palace to find out the truth behind the slaughter. With her wisdom, Sheng Qianyu not only solved many crises, but also won the Sixth Prince’s love. She was a good sharpshooter, now she becomes the Goddess of War…"]},{"title":"101 Ways to Win Her Heart","tags":["Adaptation","Comedy","Drama","Josei","Manhwa","Office Workers","Romance","Slice of Life","Webtoons"],"disc":["Read manhwa 101 Ways to Win Her Heart / 101 Ways to Flirt With Her / 그녀를 꼬시는 101가지 방법","Minyoung – having graduated from an all-girls middle school, high school, and college and now working as a lingerie designer – knows zero-to-nothing about men and subsequently has never dated anyone. When the CEO of her company suggests setting her up on a blind date, she has no other choice but to say yes. She goes on the date only to be faced with an off-putting yet handsome guy, who ignores her for the majority of the time but then has the audacity to suggest seeing each other. Flabbergasted, she decides to leave and to never see him again… little did she know, she would meet him the next day as the photographer on her project at work. On the other hand, Donghwa remembers meeting Minyoung ten years ago and can’t help but smile at her spunk and confidence. Despite her rather lukewarm reaction, he’s determined to play to win her heart. Let the games begin!"]},{"title":"CEO QUAN, YOU WIFE IS GETTING AWAY!","tags":["Romance","Webtoons"],"disc":["Read manhua CEO QUAN, YOU WIFE IS GETTING AWAY! / The Runaway Wife / The Contract Wife Do Not Run Away / 权少，你老婆要跑了 / 대표님, 사모님이 도망가요"]},{"title":"All-Attribute Martial Arts","tags":["Action","Adventure","Fantasy","Isekai","Martial Arts"],"disc":["In his previous life, Wang Teng had offended dignitaries and caused his own family to be ruined. Even if he had no desire to resist, he was driven to extinction. After his death, Wang Teng was reborn into the world of martial arts with resentment and gained a golden finger that could pick up attributes. In my last life, I was a loser all my life, in this life, I will change my fate against the heavens!"]},{"title":"Farewell My Demon","tags":["Drama","Josei","Romance"],"disc":["Read manhwa Farewell My Demon / 굿바이 악마","Moon Dami’ll do anything to escape the clutches of Mr. Sohn, the evil CEO who’s out to get her guts—literally. Her rare blood type makes her an invaluable resource to the old man, but when his obsession with her results in a family tragedy, Dami needs to find a way to step up her survival game. She seeks help from an unlikely source: the handsome but haughty Kang Taesung, owner of Taekyung Financial. Impressed by her bravery, Mr. Kang agrees to protect Dami’s body from Mr. Sohn’s schemes…but who will protect Dami from Mr. Kang? Caught up in the wild wars of the rich and powerful, will Dami be able to change the demons of her past into the blessings of her future?"]},{"title":"Your Face Looks Like A Peach Blossom","tags":["Adventure","Comedy","Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Your Face Looks Like A Peach Blossom / 君面似桃花","A desire for love, A temperamental flirtation! A woman dressed as a male general captures the beautiful prince of the enemy? As the saying goes, a man can be killed but not humiliated, but she did the opposite! She has taken the beautiful prince into her harem to “humiliate” him! The ” impotent” general disguised as a man dislikes the cold and dark-hearted male prince! They met each other and it was a shameful scene, really shameful!"]},{"title":"As You Wish, Prince","tags":["Comedy","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa As You Wish, Prince / What Do You Want to Be, Prince / Ambisi Sang Pangeran / Nasıl İsterseniz, Prensim / Prince, What Do You Want to Be? / 황자, 네 무엇이 되고 싶으냐?","“If you wrote me, then you can give me the throne!“ Yoonsoo is the successful author of a popular fantasy series. Just as she’s about to start work on a new series, Imperial Prince Einzen Kyte, the worst villain she created has kidnapped her into the world of her own story?! Based on the hit novel."]},{"title":"Guardian Of The Lord","tags":["Fantasy","Manhua","Romance"],"disc":["Read manga Guardian Of The Lord","Ji Ling Er is in a state of panic because she can see monsters. She was desperate to survive, but she met a man with infinite life but he just like is a walking monk who is bent on death. Only he can protect her and help her to drive away from the monsters. A soul contract, involving the bond of past lives and present lives. “Ling Er, guarding you is my belief to live."]},{"title":"Dad Asked Me to Choose One of Ten Goddesses to Marry","tags":["Drama","Ecchi","Harem","Shounen"],"disc":["Read manhua Dad Asked Me to Choose One of Ten Goddesses to Marry / 老爸让我从十个女神中选一个结婚","Dad asked me to choose one of ten goddesses to marry: As the leader of the “Dead Night” team with the most outstanding record in China’s Secret Army – “Dead Doctor” Feng Lin was asked by his father to choose one of the ten goddesses who had already engaged in marriage. Feng Lin, who had no intention of doing so, had to come one by one to break off the marriage. During the process, Liu Nian, the traitor of “Dead Night”, appeared. In order to get revenge…"]},{"title":"Capital’s most crazy doctor","tags":["Action","Drama","Romance","Webtoons"],"disc":["Capital’s Most Crazy Son in law / 都市最狂医少 / Capital’s Most Crazy Doctor","A story about a guy named Chun Xing Le whose an inheritor of the Chen medic family. Because he is the the youngest of the twins, he has to take the blame of his twin brother who could not save his patient. In these three years , he had to resist all the names and negative comments that were pointed at him. Now that the three years are over, he can finally appeal for justice form his family and show off in front of his fiancée."," "]},{"title":"Bright Stars: Pick A Boss To Be A Husband","tags":["Drama","Romance"],"disc":["Read Bright Stars: Pick A Boss To Be A Husband","“‘I was killed by my own fiancé and sister in my previous life. Now, I’m making a strong comeback in this one. Not only do I want revenge, I also want to cause havoc in the entertainment industry. I want to become an A-list producer. Who cares about that scumbag? I want to have all the pretty boys and handsome men.’ Some CEO got closer and asked, “Huh? I’m not enough for you?” People think she’s cold and heartless, no one understands her and loves her. But when she saves someone in the heavy rain, her heart starts to melt for him.”"]},{"title":"Breakup Loading 99%","tags":["Liexing","Ping Ping Jun","Romance"],"disc":["Read manhwa Breakup Loading 99% / Broken Up Breakup Loading 99%/  One More Chance For Love /  分手进度99% / 한번 더 해! 한번 더 해!  / One More Time","Six years ago, Ye Lingxi fled from the world of Sheng Nanheng without a word. Six years after, they meet again. Ye Lingxi insists that they have broken up, while Sheng Nanheng refuses to let her go. “We haven’t officially broken up yet!” What is Ye’s secret buried six years ago? Could they solve their misunderstandings and get back together?\nBreakup Loading 99%… The 1% remained stands for I love you."]},{"title":"A Hundred Ways To Abuse A Slag","tags":["Action","Adventure","Fantasy","Romance"],"disc":["The strongest goddess of the whole universe is here! Every scumbag of each world must be prepared to get my lessons, okay~?","Dear scumbags and third mistresses, I’m the best at abusing and slapping your faces green! I will use violence to curb violence!","No flowery bribes nor will be able to stop me!","And you, will you be my next host?! I will grant your wishes!","虐渣的一百种方式\nOne Hundred Ways to Abuse Scum"]},{"title":"Admiral’s Monster Wife","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Admiral’s Monster Wife / The Admiral’s Monstrous Wife / Istri Monster Laksamana / La monstrueuse épouse de l’amiral / Жена адмирала – монстр / زوجة الأدميرال الوحش / 提督の怪物妻 / 제독의 괴물아내\nLydia Planang is called a monster because of her scales.\nShe was treated like a minor and forced to marry by order of the emperor. Her fiancé is a wild and fierce sailor.\nHe is the admiral of Chilia, who is rumored to be very sadistic.\nBut when he first met her, he was incredibly nice to her…?\n“My husband just grabbed his wife’s hand and he was already screaming.”\nLydia learns little by little about Chilia’s secret in the admiral’s intense love.\nDragons, giant octopuses, sea snakes, fairies and mermaids…\nA destined love after marriage on the splendid ocean!\n***\n“I know a plant that can help my husband increase his stamina.”\nAlexander leaned over and whispered in her ear.\n“If you weren’t satisfied last night, I’ll try to find it.”\n“…Oh no!”\nLast night!\nLydia literally blushed as she recalled her secrets that she couldn’t tell anyone."]},{"title":"The Reason I Keep Avoiding My Childhood Friend","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa 그 영애가 소꿉친구를 피하는 이유 / The Reason She Is Avoiding Her Childhood Friend / The Reason I Keep Avoiding My Childhood Friend / The Reason Why That Young Lady Avoids Her Childhood Friend / 그 영애가 소꿉친구를 피하는 이유","Arendine is a reincarnator who died miserably in her past life.","“I’ll live a full life this time around!” I vowed. However, an eight-year-old Grand Duke won’t stop disturbing my peaceful life.","Unable to deal with that jerk any longer, I was forced to take drastic measures by slapping him. At first, he was absolutely livid, ordering me to be whipped. But after that whole incident blew over, his reaction was… A little strange.","“I’ll let you hit me from now on. You can hit me as much as you want.”","Why is he blushing and talking nonsense?","I seem to have awakened his secret taste! Gotta get rid of this guy ASAP!"]},{"title":"I Stole The Male Lead’s First Night","tags":["Comedy","Fantasy","Romance","Webtoons"],"disc":["Read manhwa I Stole The Male Lead’s First Night / I Took the Male Lead‘s First Time / The First Night With the Duke / 我奪走了公爵的初夜 / 我拿走了公爵的第一次 / 남주의 첫날밤을 가져버렸다","Due to a mistake one night, I became the target of the most obsessive man and a villainess! After possessing Ripley, a baron’s daughter and an extra in a novel, I became the female lead. Since this is the case, I will try to enjoy the riches and luxuries of a nobleman that I couldn’t experience in my past life. I can remember up to drinking alone in a corner at a party… but I woke up the next day in the male lead’s bed! Ripley became the target of the villainess after the male lead’s remarks that she should be responsible for spending their first night together. Knowing the fate of the female lead, Ripley tries to get rid of the male lead by causing trouble, not washing, and all sorts of things. Nevertheless, the male lead’s unwavering single-minded heart begins to shake."]},{"title":"It’s Been A While Since the Original Novel was Completed","tags":["Drama","Fantasy","Harem","Isekai","Manhwa","Romance","Shoujo"],"disc":["Read manga It’s Been A While Since the Original Novel was Completed / 원작은 완결난 지 한참 됐습니다만\nThe relationships with the ‘original novel’ that I didn’t want to get entangled with came to me on its own?\nElena Taylor, the villain of the ‘original novel’, recalled who she was through some kind of accident. To let the love of the main characters come true, she runs from the eccentric duke.\nThe [Love Counseling Center], which was established using her memories from her previous life,\nWith the use of the memories from her past life, she established [Love Counseling Center], so she thought that all she had left to do now was to enjoy her life, but….\n“Help my son get married.”\nThe second male lead’s mother commissioned me with a large sum of money.\n“We’ve been neglecting ourselves lately!”\nThe female lead came to consult with tears flowing down her cheeks.\nMore importantly, why is the second male lead’s condition very strange?\n“You’ve taught me a lot of things. So, teach me love, too.”\nThe original novel, no, our story is just beginning?"]}]