[{"title":"I Don’t Want to Work!","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa I Don’t Want to Work! / 일하기 싫어!","Born as a genius among geniuses in herbal medicine, I’ve undergone countless reincarnations, all at the request of the gods! I can’t stop until I create the perfect divine elixir… This is a scam, isn’t it? In the end, in this current life, I declared a strike. I won’t do it! No, I won’t work!!! That’s what I thought, but then… “I’m counting on you.” “Me? Are you serious?!” Surprisingly, my strained family relationships seem to be improving. “Thank you so much!” I’m receiving expressions of gratitude from all over. And to top it off… “A long-lost disciple comes to see you.” My very first disciple and even the last one appeared. Why didn’t that guy die?"]},{"title":"Mythical Errand","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Mythical Errand / I Choose You / Unusual Call of God / วุ่นรัก (ว่าที่) ท่านเทพ / 天降神差 / 남다른 神부름","When college student Hera Kang agrees to carry out her professor’s errand, she has no idea that her professor is actually a centuries-old deity. And the errand in question? Hera must choose between a shapeshifting fox and snake, deciding which one of them will receive the amulet in her possession to become a god."]},{"title":"The Man Who Can’t Sing","tags":["Manhwa","Romance"],"disc":["Read manhwa The Man Who Can’t Sing / 노래 못 하는 남자","Choi Woo-rim is a lyricist who, despite her talent, struggles to make a living from his craft. To make ends meet, she holds a day job as an office worker and only pursues her passion for songwriting at night.","One day, Woo-rim unexpectedly crosses paths with ki Yu-sung – the celebrity whose music had inspired Woo-rim to become a lyricist in the first place. However, the real Ki Yu-sung turns out to be starkly different from the image Woo-rim had built up in her mind"]},{"title":"The Unwelcome Guests of House Fildette","tags":["Drama","Historical","Mystery","Romance"],"disc":["Read manhwa 백작가의 불청객들 / The Count’s Intruders / The Count’s Intruders , 백작가의 불청객들 , The Count’s Unwelcome Guests , The Count’s Uninvited Guests","Hayden Grummond Fildette, the only son of Count and Countess Fildette, was the perfect heir and lovable anchor who kept his family together. But the peaceful days come to an end when an unwelcome guest from his father’s past surfaces, threatening Hayden’s position with a possible half-brother and tipping over his parents’ precarious relationship. Will he and his family be able to withstand the storm of uncomfortable truths and misunderstandings, or sink in the raging conflicts?"]},{"title":"I Changed the Villain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Changed the Villain / 악역을 교화시켜 버렸다","“I’ve never seen a woman with hair as red as blood as lady.”","Blood dripped down as if waiting and soaked the floor. Belial held out the blood-stained sword. But Rose couldn’t care less about it because,","“What do you think? Isn’t it as beautiful as lady’s hair?”","Belial Le Serenity.","Because the man that I’ve been looking for such a long time, immediately took an interest in me as soon as he saw me.","I possesed a supporting role in a romance novel. In addition, I would be killed by a villain sub-male before the female lead appears.","By the way,","The very Belial who did not let go of the heroine until the moment of his death,","“You are as quiet as a flower in the field, as dazzling as the sun in the sky, as graceful as a deer playing in the mountains.”","I’m talking about this.","I thought I’d live a rough life and get killed. But it seems that this villain has no intention of killing me."]},{"title":"Isnelda","tags":["Action","Drama","Fantasy","Historical","Korean","Manhwa","Romance","Shoujo"],"disc":["Read manga “Isnelda” / 이스닐다\nIt is not easy to become rich.\nAfter suddenly becoming an orphan, Isnelda was sent to live with her estranged relatives. Until she matures and can claim her inheritance.\nupon becoming an adult, a benefactor returned to Isnelda’s life.\na world of riches, greed, lust and… magic?\nWhat could happen?"]},{"title":"Thank You for Your Betrayal","tags":["Romance"],"disc":["Read manga Thank You for Your Betrayal / Terimakasih Atas Pengkhianatanmu / あなたの裏切りに感謝します / 당신의 배신에 감사 드립니다","“In the house of Count Lakers, it seems that you possess the most exceptional superpower. Perhaps that is the reason why you must die…” The confession she had heard from her husband at the moment of her death was shocking. Irina, who miraculously returned from death, decides to find a way to escape from her family’s clutches and steal a night with Duke Ian Lancaster…"]},{"title":"Office Romance Frontline","tags":["Comedy","Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa Office Romance Frontline / Office Romance Front / 사내 연애 전선","From an unfaithful boyfriend to a woman who comes to see me and behaves shamelessly. Everything was in a mess. But when a crap car leaves, a Mercedes will come? I was literally crushed by this man. A dazzling face, a sculpted body, wealth, and abilities. There… A perfect person that only I know! “No, get a grip! That person is your boss!” I tried to get a grip, but when I came to my senses… I was already hooked. “President….” “Go-Eun, do you want to call me by my name?” Maybe this love could have a different ending?!"]},{"title":"I Upgrade by Rewarding Apprentices","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Read I Upgrade by Rewarding Apprentices / Wǒ Kào Dǎ Shǎng Túdì Shēngjí / 我靠打赏徒弟升级","I Upgrade by Rewarding Apprentices – The master is driving the crane west, what should I do if the enemy comes to the door? ! Awaken the apprenticeship rebate system, the more you give to your apprentice, the more you get back to your master! Hahaha, good disciples, hurry up, as a teacher, you never hide your secrets!"]},{"title":"Doctor Elise: The Royal Lady With The Lamp","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Doctor Elise: Reina del bisturi; Dokter Elise; Nǚwáng de Shǒushùdāo; Queen with a Scalpel; 女王 的 手术刀; 女王的手术刀; 외과 의사 엘리제; 외과의사 엘리제; The Royal Lady with the Lamp; Doctor Elise: The Royal Lady with the Lamp","In the first life she was a terrible queen, who brought trouble to her country, and eventually, her own king burned her at the stake. In the second life, she became a talented surgeon, redeeming herself for her past, saving people. But because of a plane crash, the talented surgeon Song Zhi Hyun returns to her former life! This time, she decides to change everything, becoming a doctor."]},{"title":"Pink Blossoms Mirror Your Beauty","tags":["Drama","Fantasy","Historical","Reincarnation","Romance","Royal family","Villainess"],"disc":["Read manhua Pink Blossoms Mirror Your Beauty / The Peach Blossoms Emulate Your Beauty / Pink Blossoms Mirror Your Beauty / 桃花照玉案","Chu Muyang, reborn into a brand new life and refuses to return back to her previous life. Left hand does the avenging, right takes revenge. The motto or her life is, in addition to screwing money, just screw money. The saint was fooled by her, later leaving them trampled on, and face beaten badly all by Chu. But just as Chu Pingyang was making a book load of money, A sudden handsome man enters her world"]},{"title":"Extraordinary Attorney Woo","tags":["Drama","Josei","Romance"],"disc":["Read manhwa Extraordinary Attorney Woo / Avvocata Woo / Nữ luật sư kỳ lạ Woo Young Woo / 이상한 변호사 우영우","The adaptation to the live drama hit! Woo Young-woo is a rookie attorney on the autism spectrum at one of Korea’s most prestigious law firms, Hanbada. Using her encyclopedic memory and creative thought process, she can find unconventional solutions to the toughest cases — but can she succeed while facing discrimination and stigma?"]},{"title":"Please, Let Me Return Home","tags":["Drama","Fantasy","Gender Bender","Ghosts","Historical","Isekai","Manhwa","Mature","Medical","Mystery","Philosophical","Romance","Shoujo","Survival","Thriller","Webtoons"],"disc":["Read manhwa Please, Let Me Return Home / Take Me Back Home / 집으로 돌려 보내주세요 / Please Take Me Home / Please Take Me Back / Please Let Me Return Home / Tolong Kirim Aku Balik Ke Rumah","Summary:","The protagonist, who loves romance novels, possessed a character in the world of the novel as soon as she received a confession from her crush, Yejun. In the novel, she possessed a fallen aristocrat named Beatrice. Rather than having a sweet relationship, she was threatened with her life. Daniel, the suspicious fiance who tries to take her life every now and then, and Ellin, the cursed imperial knight that protects her from him. There were strange feelings surrounding the two. “I want to return home!” Will I be able to return safely without dying…?"]},{"title":"I’m Here to Destroy","tags":["Comedy","Drama","Fantasy","Manhwa","Psychological","Romance"],"disc":["Read manhwa I’m Here to Destroy / I have come to destroy / 파괴하러 왔습니다"]},{"title":"When the Villainess Loves","tags":["Drama","Fantasy","Isekai","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa When the Villainess Loves / 악녀가 사랑할 때 / When The Villainess Loves / When The Villainess Falls In Loves","I’ve transmigrated into the body of a princess, living on borrowed time. It’s okay, though, we can cure this illness! My goal is to lead a life where I can do whatever I want! First, I decided to rave over all of my favorite characters in the novel! But, because I am a villainess, people around me tend to be wary… “You will die soon, and yet… how can you laugh like that?” Well, it’s ‘cus I’m super hot."]},{"title":"Cat in the Chrysalis","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Cat in the Chrysalis / Cat in the Pupa / 번데기 속 고양이"]},{"title":"I Am The Dengle","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I Am The Dengle / 亡灵天使","Fang Wanjie took a risk and entered the “door” in order to save money for his girlfriend’s medical expenses. Unexpectedly, the high reward was a trap from the beginning. He was teased, humiliated, and beaten by his companions. He struggled to support himself, but was hunted down by tens of thousands of monsters. , gnaw. On the verge of death, he awakened his talent to save the day. When he was about to leave the ‘door’ to take revenge, he discovered that the key to the ‘door’ had been destroyed and he was trapped in the ‘door’ full of monsters. He wants to live! He wants to fight! He wants to become stronger! Even if he turns into a dead spirit, he will make life worse than death for these bastards!"]},{"title":"The Essence Of A Perfect Marriage","tags":["Drama","Fantasy","Isekai","Manhwa","Office Workers","Reincarnation","Romance","Time travel"],"disc":["Read manhwa The Essence Of A Perfect Marriage / The Perfect Way To Get Married / Perfect Marriage / 완벽한 결혼의 정석","My husband is in love with my younger sister. And of all things, I found out about it on my birthday, which is also the day I died. But… I somehow traveled back to one year ago?\nThe day I came back from the dead, I decided. This time, I have a year to seduce my younger sister’s man and marry him. Until then, I’ll get my revenge.\nBut this guy… Why is he so perfect? He’s a second generation conglomerate heir, and during this contractual relationship, his eyes… his lips… I keep getting mesmerized.\n‘What should I do…?’"]},{"title":"The Runaway Lead Lives Next Door","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Runaway Lead Lives Next Door"]},{"title":"Survival Story of a Sword King in a Fantasy World","tags":["Action","Adventure","Comedy","Fantasy","Isekai","Magical","Martial Arts","Tragedy","Webtoons"],"disc":["Otherworldly Sword King’s Survival Records / The Survival Record of the Sword King in Another World; 이계 검왕 생존기; The Survival Story of the Sword King in Another World; Latna Saga: Survival of a Sword King","Ryu Han-Bin was a normal person who just had been discharged from his mandatory military service, when he was transported to another world. Left to fend for himself, he was given the goal of surviving and growing stronger in a desolate world riddled with monsters. The problem is the ‘Guideline’ that was supposed to be his guiding system to survive is filled with errors."]}]