[{"title":"Untouchable Lady","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Shoujo","Time travel"],"disc":["Reading manhwa Solitary Lady/ Dama Inaccesible / Dama Intocable / Untouchable Lady / 不可接近的女士 / 접근 불가 레이디","“Please, Hilise. Please die in place of Gabrielle.”\nMy always dignified brother begged me for the first time.\nHe wants me to die for our stepsister, whom we don’t even share a drop of blood with.\n“For the first and last time, I ask you this.”\nI’ve always been miserable, and there is no exception this time.\nThe seventh time that I was betrayed and killed, I was completely free of lingering feelings.\n“I’m glad that you’re a scumbag until the end.”\nI won’t be swayed by love anymore. It’s my turn to abandon them first."]},{"title":"After One Night","tags":["Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read manhua After One Night, Yi Ye Chen Hun, One Night Profound Marriage, 一夜沉婚"]},{"title":"The Circumstances of Babo Ondal","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa The Circumstances of Babo Ondal / [Traditional Erotic Fairy Tales] Ondal the Fool’s Situations / [전래야한동화] 바보온달의 사정 / The Circumstances of Babo Ondal / 바보온달의 사정","Princess Pyeonggang, who did not want to marry the son of an aristocrat of the Goh clan, went to visit Ondal, who was famous for being a fool, citing a previous promise. However, Ondal, who was thought to be an idiot, was much better than expected, even had a good body and was handsome, and there were interesting circumstances that would stimulate Pyeonggang’s curiosity… This is part of the [Traditional Erotic Fairy Tales] anthology."]},{"title":"My Chubby Princess","tags":["Comedy","Fantasy","Historical","Liexing","Ping Ping Jun","Romance"],"disc":["Read manhua My Chubby Princess / 兽黑狂妃","English- The 21st Century genius Doctor and Assassin, Suddenly transmigrated into the Third Miss of Duke Residence, but became the infamous ugly and fat cripple? Unbeknownst to all, when her cold eyes open, ten thousands beats submit to her. She steps upon the evil woman and bastard man. She transform into a top ranked summoner and fight everyone in her way whether they are god or devil! As she has fun dealing with the bastards and losing weight, She didn’t know that she messed with a two-faced imperial uncle: “Imperial wife is as pretty as a fairy, you guys must keep watch of her closely. All those who comes up to her must be killed!” “Save me! Can I request to return this type of handsome but blinded and clingy husband?"]},{"title":"The Odd One Next Door","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Odd One Next Door / Your Neighbor’s Preference / Your Neighbor’s Taste / 奇怪的邻居 / 隣人の趣向 / 네 이웃의 취향"]},{"title":"Miss Scum Slayer Reborn","tags":["Liexing","Ping Ping Jun","Romance"],"disc":["Read manga Miss Scum Slayer Reborn / Reborn Queen’s Revenge / Rebirth of the Scum Queen / 重生之虐渣女王","Another badass FL revenge on scums and bitches! She even slept with a president for she wants to get pregnant! But the president is not someone can be fooled around! What will he do when he catches our FL? Would he give her a good “punishment”?\nYun Weinuan was cheated and killed by her boyfriend and best friend in her last life. As every story goes, she got another life and sweared to revenge those who wronged her. But her baby in the last life won’t come back anymore. So she comes up with an idea, that is, to find a handsome man, sleep with him, and get pregnant. She clearly didn’t expected that this man will be so furious after she runs away…"]},{"title":"After the Insomnia Was Cured, the Tyrant Became Obsessive","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa After the Insomnia Was Cured, the Tyrant Became Obsessive / 불면증을 치료했더니 폭군이 집착합니다"," "]},{"title":"Sleeping on the Job","tags":["Romance"],"disc":["Read manhwa Sleeping on the Job"]},{"title":"Marriage Or Death","tags":["Adaptation","Crime","Drama","Fantasy","Manhua","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marriage Or Death / Marriage Instead Of Death / Before Death Do Us Part / Marriage Instead of Death / Marrying Rather Than Dying / 生存之婚 / 죽음 대신 결혼"]},{"title":"I Don’t Want to Be Loved","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Don’t Want to Be Loved","Rihannan Alessin, a queen rotting in prison.","Despaired and without hope, she drank poison and died. But… unbeknownst to her, the deity gave her a second chance at life. She was twelve again. And this time, she would live life differently.","Six years later, she chooses to become Arundell’s queen…","“If you’re asking me to step down from the marriage proposal, I can’t.”","“Marry me and let us divorce after a year.”","And this time, the time limit of their marriage would last a year.","A husband she knew who was different than before… she tried not to love him again, but each time, her heart kept shaking."]},{"title":"The Palace Beast","tags":["Fantasy","Historical","Manhwa"],"disc":["Read manhwa The Palace Beast / Beast of the Palace / 궁궐의 맹수","The princess knew she had extraordinary abilities, but knowing that she would never become a queen, the princess wanted to live the rest of her life quietly with her maid.","However, the conspiracy of the state covets the country, and the prince, who feels that the princess is a threat, touches the princess’s maid and the maid disappears.","The moment he touches the lady-in-waiting who truly cares for her among those who have lived in the palace all their lives and only told lies for their own benefit,","The extraordinary serpent begins to stretch to become a dragon that jumps over the Imoogi himself to protect her people.","“The current princess will unify the three kingdoms.”","In a country built with God’s consideration and dragon’s favor, human greed and ability stained by the dragon’s curse, and a scheduled war that began with prophecy.","Can the prophecy be completed and the princess become empress?"]},{"title":"The Devil’s Kiss","tags":["Manhwa","Romance","Supernatural","Webtoons"],"disc":["Read manhwa The Devil’s Kiss / If You Want to Live, Then Kiss Me / You Want to Live? Then Kiss Me / 살고 싶어? 그럼 키스해","On the brink of death, Eunji is approached by a handsome devil named Joshua, who promises her a second shot at life with a kiss to seal the deal. When Eunji wakes up to her “second” life, nothing seems different until Dojin, the human manifestation of Joshua, shows up at her school and starts following her everywhere she goes, turning heads and causing drama. Their honeymoon period is cut short when yet another devil, Sora, comes to ruin their fun. Can Joshua save his first love from the forces of Earth and hell?"]},{"title":"No.1 Idol Heavenly Group of the Imperial City","tags":["Comedy","Historical","Romance"],"disc":["Read Huáng Chéng Dì Yī Ǒuxiàng Tiān Tuán / No.1 Idol Heavenly Group of the Imperial City / The Best Idol Heavenly Group in the Imperial City / 皇城第一偶像天团","The former female official Pei Jiuge, the governor of Dongchang Mo Qi, the Third Princess, Prince Xiao and an Imperial Physician. These five people were just extras in the colourful cast of members in the imperial city. They don’t like the conspiracy and the intrigue of court politics even though the undercurrents are surging…"]},{"title":"Melt Me With Your Voice","tags":["Manhwa","Romance"],"disc":["Read manhwa Melt Me in Your Voice / 네 목소리로 나를 녹여줘","Jang Minju is a rookie anchor on the fast track to success, but not everyone believes in her. During an interview, ace PD Han Wook coldly states she’s not what they’re looking for. Minju thinks it’s unlikely she’ll run into the smug PD again, but suddenly, he’s popping up everywhere and pressing her to work with him! At the same time, Kim Sinwoo, a senior colleague, starts to show interest in her too. As these two men orbit around Minju, one question emerges – how do they know her so well?"]},{"title":"Sigeup Yeonae","tags":["Adaptation","Comedy","Drama","Manhwa","Romance","School Life"],"disc":["Read manga Sigeup Yeonae / Hourly Love / 시급 연애","‘Date me for 20,000 won an hour.’ Cha Do Hyun is a poor college student. One day, he got a ridiculous offer from Lee Sana, a younger student at the university. Should he accept the offer from this girl, who was looking for a good place to bury a body on campus? Everything about it is suspicious, but having just been fired from his part-time job, the offer is too sweet for Cha Do hyun to turn down! “You are totally worth the money” “Keep that thought to yourself!” A woman with nothing but money, a man with everything but money, and their suspicious dating service."," "]},{"title":"Till The End Of The Moon","tags":["Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Till The End Of The Moon / Black Moonlight Holds the BE Script / 黑月光拿稳BE剧本（长月无烬）/ 黑月光拿稳be剧本","A doomed romance across hundreds of years. Tantai Jin had never sobbed in his entire life. No one had ever witnessed his frail state, even if his eye was gouged out and his meridian veins were cut. That was the day that everyone will remember for the rest of their lives. With blood and tears streaming down his cheeks like beads, he pleaded for mercy."," "]},{"title":"The Archduke’s Pet","tags":["Fantasy","Josei","Mature","Romance","Royal family"],"disc":["Read 대공님의 애완 수인 / The Grand Duke’s Pet / The Archduchess’s Loyal Shapeshifter / The Archduke’s Pet","“Warning: Mature content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","Grand duke Rosalind Idris Apeluden, the current emperor’s only brother-in-law. He received a beautiful slave slave as a gift from his close friend. Unable to release the wounded prisoner, Rosalind gave him the name Fenrir and nursed him by his side. Fenrir, who begins to open up to Rosalind after a while, begins to make her his only companion in life…"," "]},{"title":"Can’t you just be a student?","tags":["Action","Adventure","Demons","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa Can’t you just be a student? / 학생만 하면 안 될까요?","Go Pung-rim, a boy who wants to live as an ordinary student. He is living a more tiring life than anyone else, exorcising the ‘karma’ that is born by eating emotions… No, it’s done! Can’t I just, please, just be a normal… student?"]},{"title":"Pupillary Master","tags":["Drama","Fantasy","Historical","MANGA","Manhua","Manhwa","Romance","Supernatural","Webtoon","Webtoons"],"disc":["Read manhua Pupillary Master / Extreme pupil teacher: Miss Peerless / Supreme Ocular Master: The Peerless Heiress / Supreme Pupillary Master: Peerless Eldest Miss / Zhizun Tong Shushi: Jue Shi Da Xiaojie / 至尊瞳术师：绝世大小姐","In the 24th century, the first person in the power world, Luo Qingtong, magically crossed to the real world of another world. Since then, she has opened the way to the revenge of the deposed woman in the lower country. Fighting the villains and slag"]},{"title":"Seoul Exorcism Department","tags":["Action","Drama","Fantasy","Shounen","Supernatural"],"disc":["Read manhwa Seoul Exorcism Department / Seoul City Exorcism Seoul City Exorcism / Department Seoul Metropolitan Government / Department of Exorcism / 서울시 퇴마과","Private Gwanghyuk, who saved the life of a senior soldier with his psychic abilities, is summoned by the city of Seoul and transferred to the “Exorcism Department”."]}]