[{"title":"Youngest On The Top","tags":["Fantasy","Manhwa","One shot","Reincarnation","Romance","Shoujo"],"disc":["Read manhwa Youngest On The Top / 막내온탑\nArphemia, my greatest God in the universe, give me the power to’ “Let me go through it all!” Before returning, Saelica became a holy power supplier and died. On the other hand, Amaelia, the saintess of Parmanas, is loved by the whole world. People don’t know the fact that the magic was actually Salica’s power. ”This time I will not die unjustly”. The enemy is on my side, first of all, I’ll go to the temple and train my mind and body by Arphemia’s side.” That’s how Salica’s temple life began. And in addition, they searched for an ancient forgotten treasure, and said, “Lord priest, we succeeded.” He educates the children his age, the future of the temple. “Come, I want to be summoned by you.” But the situation became strange. “I will be on your side.” “The thing Sae likes the most is me.” “I said honey bread is the best.” Where are the priests and children? A child of my age who doubts and is hostile towards me?” “I will take her with me.” “No, she will come with me.” The battle between the Grand Duke North and Admiral South would hit me very hard. “I am not that girl!” Even- Getting involved with a dangerous man “You like toying with me? Then play longer.” Who I want to beat are Parmanas and Amelia! Will Salica succeed?"]},{"title":"l Adopted the Male lead","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa l Adopted the Male lead","I rescued the hero from a fantasy novel and his sister, who were abused by their uncle, and helped him grew up as an Archmage to save the world.","“Can I call you Mom?”","Just once. I thought in the warmth of the children who called me a mother.\nWhatever comes down to me, I’ll protect these children.","…","I met a man who was completely different from the nobility I had seen so far in the Southern Thors, where I had escaped safely and settled down.\nHe respects people regardless of their status and thinks of others before himself. And, having dreams that he will never achieve.","“Someday, Thors will be strong and rich enough that no one has to worry about their livelihood and their lives. No mistakes until that day comes.”","I thought that would be enough if I and my children could live happily ever after.\nBut why? I wanted to reach out to the high sky that this man was looking at.","“Your Highness.”\nEven if it’s only a few years.\n“I’ll help you.”"]},{"title":"Vicarious Lover","tags":["Drama","Josei","Romance","School Life","Slice of Life"],"disc":["Read manhwa Vicarious Lover / Substitute Boyfriend / Stand-in Partner / 작품명대리애인","“There is someone who makes my heart race. I will date her for three months. So you, too.. should date another man for three months.” To get revenge on her fiancé… No, to make him love her again, Hwang Hae Geum planned to look for a substitute boyfriend. That person is Kang Si Hoon, her brother’s friend who is five years younger than her. He’s the definition of the perfect man with perfect attitude that makes her heart flustered. It feels like he blows a fresh breeze of spring air into her heart. Will she fall for Si Hoon eventually?"]},{"title":"The 10th Class Lout of the Knight Family","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The 10th Class Lout of the Knight Family / 기사가문 망나니는 10클래스 / 10 classes of knights / Class 10 of the Knights Clan\nThe human world is on the verge of destruction after the attack of the Demon King, ‘Erodin’. After the fight against the Demon King, the Gold Dragon ‘Exigar’ is reincarnated as a human ‘Kain Logdel’, who is a lout that knows nothing about magic. While trying to escape from his sword-crazed family’s duties to stay at the training camp by hiding his sword skills, Kain is on the verge of being exiled because of the unexpected message from his Family Head… Amidst all of this, the Demon King, with her new appearance, is also looking forward to reuniting with him?!"]},{"title":"Tyrant’s Tears","tags":["Adventure","Drama","Fantasy","Historical","Romance"],"disc":["Read manga Tyrant’s Tears / 尤寒","A mysterious bottle of perfume, a great change to the past. A mute woman, cursed from birth, enters a dreamland through a bottle of perfume in order to obtain a tyrant’s tears to save both of their souls. A cruel tyrant, is it possible for a mere mute drudge to obtain his tears?"]},{"title":"Nine-Yang Emperor","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts"],"disc":["Nine-Yang Emperor, Life Burns for Vengeance, Emperor of Nine Suns\nLu Xuan, the mad ruler of the Five Emperors and One Madman, was killed by his best friend, the Scorched Sun Emperor, in a sneak attack after exhausting his efforts to kill the world’s number one expert, the Vaulted Demon Emperor. Three hundred years after his rebirth, things have changed, but the hatred has not disappeared. Let’s see how Lu Xuan, who has lived a new life, will rise again, stir up the clouds and dominate the world!"]},{"title":"Miss Zhong’s Golden Life","tags":["Romance","School Life","Slice of Life"],"disc":["Read manga Miss Zhong’s Golden Life","He is a rebellious young master who views wealth as something worthless. She is a materialistic gold digger that wealth views as something worthless. He is an overseas graduate, dominant and blunt person. She is a white-collar social butterfly, smart and savvy. At a dance party . A glass of wine has been added with aphrodisiacs A one-night stand by accident .. Their gears of destiny are beginning to turn"]},{"title":"Strange Love Story","tags":["Fantasy","Josei","Romance","Tragedy"],"disc":["怪奇爱情故事 / Guaiqi Aiqing Gushi / Weird Love Story","A piece of fantasy love story in a field of light from magic land. Each story tell the story of the parallel time and space of Ba Jiu and Li Shi whom are destined to meet. The strange love story between normal person and strange person, how will their story end …"]},{"title":"His Apple","tags":["Fantasy","Isekai","Romance"],"disc":["Read manga His Apple","Linling, an ordinary high school girl, is actually the daughter of the Scarlet-Haired Witch — an existence akin to a max-level top player! However, she’s being hounded by a handsome and frivolous miscreant prince from another world for an unpaid debt. Thus begins the countdown for an emotional game with debt on the line…"]},{"title":"First Love Operation","tags":["Comedy","Drama","Romance","Shoujo"],"disc":["Read manhwa First Love Operation / First Love Manipulation Team / First Love Operator / 첫사랑 조작단","Yeonwoo and Jisoo is a childhood friends and despite knowing that both of them are aware of their feelings for each other, instead of able to express it through words, it becomes a misunderstanding and conflicts. Although they both go to the same kindergarten till college, they still don’t have the right time to confess towards each other. As the time goes by, the obstacles that those two have keeps increasing. Whether it’s Yeonwoo’s confession nor Jisoo’s confession, neither of them succeeded at it and instead, it seems like the failures have slowly keep them apart… When will they be able to convey their feelings?"]},{"title":"Father, I’m Definitely Not the Villainess Side Character","tags":["Action","Adventure","Comedy","Drama","Fantasy","Full Color","Manhua","Romance","Webtoons"],"disc":["Read manhwa Father, I’m Definitely Not the Villainess Side Character /  父亲大人，我才不是恶毒女配 / Fùqīn Dàrén, Wǒ Cái Bùshì Èdú Nǚ Pèi I reincarnated!","The good news is I’m still alive! The bad news is that I am a devil incarnate and everyone wants to murder me. If my father was not strong-willed enough, I might have been killed right at birth. My sick and petite uncle vomits blood at any time and his life is in danger, my hero father does whatever he want with the heavens, the Earth and the emperor, my goddess twin sister is cute but ignorant of the world, and there is an adorable little prince who protects me… So, how is it that everyone loves me so much, but I am set as the villainess side character of this story?!"]},{"title":"9000 Years Old Empress","tags":["Comedy","Fantasy","Historical","Isekai","Romance"],"disc":["Read 9000 Years Old Empress / To be immortal for 9,000 years old / Nine Millennia Old Empress / 凰妃九千岁","The invincible commander of the Ye Jiajun was killed by a traitor and died in the battlefield. The Heaven is merciful; I was reborn, but I did not expect to be a eunuch!? Then, I almost got killed by the crippled prince on the spot!? Can someone tell me why does this prince hug me whenever he can? And even want to kiss me!?? One is a servant who gets thrown away, and the other is a prince who gets treated coldly, being looked down by everyone. After their fateful meeting, they begin working together to purge corruption and bring prosperity to their imperial reign. Based on a novel."," "]},{"title":"A Thousand Year Engagment","tags":["Demons","Fantasy","Romance"],"disc":["Read manhwa A Thousand Year Engagment","A thousand-year engagement between a human and a demon may sound like a fairy tale, but it’s Alex’s living nightmare! Abducted and taken to a strange land, Alex learns she must marry the demon Prince Orias to bring peace to both of their worlds. There’s just one problem: she and the prince can’t stand one another! Will this stubborn human and prideful demon be able to work together to end the engagement once and for all? Or will their quest to avoid the altar lead to love?"]},{"title":"Ms. Nobody’s Romantic Survival Game","tags":["Drama","Manhua","Romance","Webtoons"],"disc":["Ms nobodys romantic survival game manhua","After the onset of a serious illness in high school, she lost her beauty, boyfriend, and friends.\nTo escape the sadness, she buried her head in writing and earned her fame online. Now she had a chance to meet her idol—an adonis of a writer—however,\n“Should I go?…let me check my image in the mirro—YIIIIIKES!”\nThe next moment she opened her eyes, she was thrown back to high school, right before the illness took everything from her…"," "]},{"title":"Lengxie Hades’s apex pet","tags":["Fantasy","Historical","Romance"],"disc":["Read manga Lengxie Hades’s apex pet","Tony teacher Kwai Xi accidentally crossed to become the princess of the underworld. She wanted to go home and was eager to find someone to give her husband to replace herself, while the black-bellied husband was thinking about how to really catch her. The Lord’s long way to chase his wife has just begun."]},{"title":"Log in to Love City","tags":["Fantasy","Game","Josei","Romance"],"disc":["Read manhwa 로그인 러브시티 / Log in Love City\nCan you find love in a virtual world? Narae doesn’t really believe in love. BBQ restaurant owner by day and romance novelist by night, she’s too busy with work to pursue a relationship. When she gets a strange text that offers her the chance to find true love, she accepts it as a joke – until she actually ends up in a game. Will she be able to escape.. and find true love along the way?"]},{"title":"Lair & Love Game","tags":["Romance"],"disc":["Read manga Lair & Love Game / Mr. Intrigue’s Love Game\nAfter being heartbroken, she unexpectedly gets married. Her husband, who claims he’s a small assistant, is actually the big Boss of the Empire Group. What is he hiding behind the lies? And, what are his secrets?"]},{"title":"I’ll Do That Marriage","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance","Supernatural","Webtoons"],"disc":["Read manhwa I’ll Do That Marriage / That Marriage, I’ll Do It! / 그 결혼 제가 할게요 / I’ll Marry Him!\nRayanne McEllion, the girl who wanted to avoid a bad end, willingly went to the insomniac emperor in place of her sister, Raylin.\nShe is tasked to help the sleepless emperor, who was cursed by a witch, by using her ability to induce sleep whenever she touches another person’s body with her lips.\nCan Rayanne survive being with the emperor, ‘Kael Rue Kaldorf?’"]},{"title":"Villainous Princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Villainous Princess on manhwaclan\nOne day I transmigrated into the body of Violet, the villainess character of the novel “For Shannon.” Violet had a beautiful face, wealth, and was even a princess! She was a woman who had almost everything. Her life was ruined when she chased after the one thing she didn’t have – love. Now that I’m her, I can change her fate because I don’t need love! … But why have the characters of the novel started to change ever since I decided that?"]},{"title":"My Fox Demon Cub is also well-behaved Today","tags":["Comedy","Manhua","Romance"],"disc":[]}]