[{"title":"Flowers Rot and You Remain","tags":["Drama","Fantasy","Historical","Josei","Manhwa","Romance"],"disc":["Read manhwa Flowers Rot and You Remain / Flowers May Wither but You Remain /꽃은 썩고 너는 남는다","That woman was used as a tool to break off her engagement. After they use her she will be thrown away…","Helen Godwin, a hired family tutor for the Somerset family. Helen only wanted to focus on the education of her student, Henry, but Henry’s older brother, Raymond Somerset started to express interest in her.\nAlong with Raymond’s beauty, complicated relationships with women also followed. At first, Helen tried to stay away from him, but she slowly started to fall for his kindness without knowing what’s hidden behind his beautiful face."]},{"title":"May you reach a sacred place","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa May you reach a sacred place"]},{"title":"The Sacred Life of a Webtoon Artist","tags":["Comedy","Drama","Josei","Manhwa","Mature","Office Workers","Romance","Webtoons"],"disc":["Read manhwa The Sacred Life of a Webtoon Artist / Sacred Writer’s Life / Holy writer’s life / Writer Sung’s Life / 神聖成人漫畫家生活 / 网漫作家要翻红 / 성스러운 작가생활","Hayoon, a once popular adult webtoon writer, has fallen dramatically between a rock and a hard place. With the help of her new stern and efficient Producer, Nam Johoo, and her ex-boyfriend and writer, Choi Minjun, will she succeed? A wacky romantic comedy that’s both exciting and funny"]},{"title":"Leveling My Husband to the Max","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Read manga/manhwa/manhua Leveling My Husband to the Max / 남편을 만렙으로 키우려합니다 / I’m Trying to Raise My Husband to Full Level / 夫をレベルMAXに育てようと思います / 完美老公養成計劃 / Memaksimalkan Level Pak Suami","Because of her indifferent husband, Amber died alone. She regressed to the first night of her marriage…! In order to prevent a repeat of my past life, I’m trying to revive the impoverished duke and have a neat divorce with my husband… “Please treat me however you want, wife.” I’m flustered by my husband’s 180 degree change!"]},{"title":"Winter Wolf","tags":["Adaptation","Drama","Fantasy","Josei","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Winter Wolf / Lobo de Invierno / 윈터 울프","A man and a woman are by themselves in a mansion on an isolated snowfield. Lyshteia, an aristocratic young lady who lost her entire family in the revolution goes into exile on her own. She meets Terren, a broker who lives in an isolated mansion on a snowfield, in hopes of escaping to a foreign country. However, Lyshteia and Terren are forced to spend time by just the two of them as heavy snow starts falling and traps them in. Terren keeps Lyshteia safe in dangerous situations: her hearing strange sounds every night, and burglars trespassing in the mansion. As Lyshteia lowers her guard, she becomes more and more dependent on Terren. The two ends up getting even their bodies entangled. Lyshteia is attracted to Terren, but she’s concerned about who he really is as he secretive and does not reveal much about himself. Then one day, the situation changes in an instant when a new guest comes to the mansion…"]},{"title":"The Tyrant’s Only Perfumer","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Reincarnation","Romance","Villainess","Webtoons"],"disc":["Read manhwa/manga/manhua The Tyrant’s Only Perfumer / 폭군의 유일한 조향사가 되었습니다 / 暴君のたった一人の調香師 / 成为他唯一的调香师 / มื่อฉันกลายเป็นนักปรุงน้ำหอมเพียงผู้เดียวของทรราช / L’unique parfumeuse du tyran / El perfume del tirano","A crazy dog that goes on a rampage and kills if he doesn’t smell a certain scent regularly.","I possessed Ariel, the perfumer of Duke Cedric. The problem was that Ariel, the villainess, loved this crazy dog so much, she committed all kinds of obsessions and misdeeds.","“Duke, let’s break up.”","“What?”","“Anyway, it was a contractual relationship that started by my forcing, right?”","So I broke up with the Male lead to survive somehow.","“Wait, wait…”","“Don’t worry about the perfume. And I’ll let you go without you becoming a crazy dog.”","“Crazy… Dog?”","Oh, my mistake. The nickname I used to call the Male Lead just popped out.","I thought I was doing well, but…","“Now, you’re coming here?”","I looked in front of my shop with dim eyes.","To be exact, on the stairs leading to the store.","Male lead, why are you sitting pathetically on the stairs of someone else’s store?","Was it not a crazy dog, but a puppy that was rained on?"]},{"title":"The Cute Little Saintess","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa The Cute Little Saintess / Lady Crumb Saintess / Slum Saintes / 부스러기 성녀님","A girl was left in a slum without parents but she found her own family. As always, she was hungry but happy to play around with her friend but a mark of holiness suddenly show up. Now the five-year-old girl is expected to carry a god’s will and save the world by killing an evil beast."," "]},{"title":"Extras Don’t Want to be Overly Obsessed","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Extra Doesn’t Want to Be Overly Obsessed / Extra Doesn’t Want Too Much Obsession / La extra rechaza la obsesión excesiva / The Extra Refuses Excessive Obsession / 엑스트라는 과도한 집착을 사절합니다","I thought I was just a nameless commoner woman.\nUntil the villainous duke, who is known for killing every town he sets foot in, comes to light and is after a young single girl.\n“Duke Cedric is halfway through the Empire. I heard he is coming to the area this month. “Why is the bloody duke looking for his youngest sister who disappeared five years ago? “Pink hair and yellow eyes.” Her description is the same as mine. I think my life has changed. destroyed.\nI then became known as the youngest child of a villainous duke who was planning to kidnap and imprison the heroine. Then I will live like a stream of water that flows quietly and will run away. Because I don’t want to get caught up in the crazy political drama in this damn novel.\nBut… why is everything so weird?\n“Our Amelle, you don’t look very happy. Do you want me to buy an island and build a mansion for you? “My first brother, who kills people in ordinary days, is so impatient to give me something.\n“Our baby, can you throw that thing away and live with your brother. I think I don’t like being a better wizard than I thought. Right? “The second child, who left home ten years ago to become a sorcerer without hesitation, returned once more and kept himself attached to me.\n“Don’t look at other people, Amelia.” Even the world’s worst villain, who halved the continent’s population in the original story, cares about me.\n“I’m sorry, gentlemen, but I’m taking the Maiden with me today.”\nNo, even the heroine, whom I should kidnap, is kidnapping me? All these people must be crazy. I’m just a woman. Can you please leave me?"]},{"title":"Coming Out Of Seclusion After A Hundred Thousand Years","tags":["Action","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Coming Out Of Seclusion After A Hundred Thousand Years","One hundred thousand years ago, the old ancestor of the Forgotten Immortal Sect Chen Xuan who was once known as a peerless existence in the world, retires himself from the limelight, little did anyone know that the reason behind this was that he could no longer breakthrough due to the malfunction of his system. One day, a female disciple of the clan’s Lineage prays for His help, which causes the system to successfully reboot… As long as he cultivates his descendants, he can continue to get stronger and can continue to rule the world For Ages! A Supreme Emperor, who has been in seclusion for 100,000 years, has come out with a brand new System at his disposal…"]},{"title":"Heeran Love Song","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Heeran Love Song / Twilight Poem","A hidden love story of a ghost princess who never loved anyone. General Jahyeon of Heeran Nation marries Soru, a ‘princess who sees ghosts’ by the king’s order. Jahyeon is cold to Soru, but he has the power to ward off ghosts, hence Soru wants to stay by his side. Soru is willing to sacrifice everything for Jahyeon, who is her only safe haven. Jahyeon is getting more and more concerned about Soru, but…"]},{"title":"My Mysterious Nighttime Visitor","tags":["Historical","Isekai","Manhwa","Reincarnation","Shoujo"],"disc":["My Mysterious Nighttime Visitor manhwa, 흑막은 매일 밤 나를 찾아온다\nRuby never expected to get transported into the world of a novel… least of all a spicy boys’ love novel! When such a thing happens, what’s a girl to do? Make the most of it by becoming a successful businesswoman running a luxury inn, of course! The money and power is one thing, but the chance to see and interact with her favorite hunky guys from the story is an added bonus. There’s only one problem, and that’s the mysterious, scheming villain. What was once just some brooding eye-candy is now a very real threat to Ruby’s life. Will Ruby be able to out-maneuver this scheming visitor, or is this story doomed to end in tragedy?"]},{"title":"Si Bel Homme List","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Si Bel Homme List / Bachelor List / Sibel Homelist / 天菜图鉴 / 美男图鉴 / 시벨롬 리스트","Ideum’s world turns upside down when her boyfriend of five years gets engaged to another woman, and even has the audacity to send her a wedding invitation! Shocked and humiliated, Ideum vows to get her revenge by showing up to the wedding with a hot new man on her arm. As a matchmaker at a marriage agency, she already knows many eligible bachelors, and can’t help but gush over her new client’s profile. Tall, handsome, and rich, Dr. Dohun Yang is just the man she’s looking for. But little does Ideum know that she’s in for a surprise… in more ways than one."]},{"title":"Who Led My Villain Astray?","tags":["Demons","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Who Led My Villain Astray? / 谁养歪了我的反派男主 / Shéi Yǎng Wāile Wǒ De Fǎnpài Nán Zhǔ","She is the strongest master of the sect, but because she is a woman, she cannot succeed as the head. Seeing that the idiot master brother Hu Weiwei made up her mind to go to the forbidden area to find a natural rebel, and train her to be a capable apprentice to succeed the head. To order the sect”, but after waking up again after a retreat, I found that the well-behaved and sensible disciple actually imprisoned me?"]},{"title":"In-house stalking is prohibited","tags":["Office Workers","Romance"],"disc":["Read 사내 스토킹을 금지합니다 / Dilarang menguntit di rumah / No Snooping, Please / Office Stalking Is Prohibited / 社内ストーキングを禁止します / 사내 스토킹을 금지합니다","Tracking in our company is strictly prohibited.\nSA Company CEO Park Si-an, he’s 188cm tall, looks like a celebrity!\nEstimated wealth: billion won!\n3rd generation real tycoon!\nHe’s been suffering from cruel stalking lately! The likely culprit is Ye Da-min, an employee of the support team of the same company. With her big, rabbit-like eyes, seemingly at the bottom of the food chain, is she really the stalker of Xi’an?\nTheir relationship is full of doubts, misunderstandings and flaws! The secret stalker hunt begins"]},{"title":"Since When You Were The Villain?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read mănha Since When You Were The Villain? / 대체 언제부터 흑막이셨어요","She was possessed by a book without knowing what novel it was. Then, one day, her fiance appeared. ‘Killian’ was a perfect Northern Duke with black hair, red eyes, and a handsome face. It was a contract marriage. ‘I can see that person is the male protagonist even if I rolled backwards…’So, Sophia believed without a doubt. She thought he would be the male protagonist. But…“Ah, I got caught.”The smell of blood came on the tip of her nose. Killian’s eyes narrowed. Then she realized the fact that he was a villain.And a cold hand caressed her cheek.“There won’t be a breakup, Sophie.”Raising the corners of his lips slightly, he whispered softly. ‘I think this is also a cliché… I hate that cliché!’"]},{"title":"The Change of Season","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Office Workers","Romance","Smut"],"disc":["Read manhwa The Change of Season / 환절기","To have Gyu-young, a woman who keeps appearing in his dreams, Yong-geon sets a trap. ” If you don’t mind, you can use me ”. Yong-geon whispered to Gyu-young who is heartbroken by her friend and cheating fiance , to use him to get revenge. Gyu-young is shaken by Yoon Geon’s sweet proposal and the relationship deepens."]},{"title":"How can a time-limited evil gain her vengeance?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How can a time-limited evil gain her vengeance? / The Villainess’s Road to Revenge / 시한부 악녀가 복수하는 방법 / 余命わずかな悪女が復讐する方法 / 倒计时恶女的复仇计划","I just wanted to be loved.\nAfter awakening the power of an alchemist, he constantly made gold for his family on the verge of bankruptcy.\nEven though I know it’s a life-saver.\nBut when she died of attempted murder, no one was with her.\nWearing the dress bought with her life, the younger sister shed false tears in the Crown Prince’s arms.\nThe third awakening accomplished by being pecked by a bird’s beak.\nMilvia got her hands on the time.\nReturning to the past, she has only one year left to live.\nI will take revenge in it.\nSo I spent the night with a man called a mad knight. A man who had only been given the baron title now.\nThe only price for giving her unimaginable wealth is to keep her by her side and pretend to love her.\nI will give you everything my family originally had.\nJust don’t let me fall apart while I get my revenge.\n…… But why does a proposal come from a peasant family that is said to dominate the dark district?","“Do not be discouraged, for you are worthy of your own praise.”\nHe gently strokes his cheek with the back of his hand. It was the firm hand characteristic of the one holding the sword.\nThe moment when he suddenly felt that he was a ‘man’.\nMilvia’s face heated up to the point that it felt like it was too much.\n“I hate hypocrisy very much.”\nDeius pressed his thumb to her lower lip and rubbed it in a strange way.\nMilvia froze, unable to breathe, and was bound by his gaze.\n“Don’t pretend to be good, pretend not to give up. The truth is, I want to live if I can live by killing others.”\nHis words became a dagger and pierced his heart.\nKnowing that her breath was trembling, Deius did not stop talking.\n“Tell me you want to kill me, Milvia.”\n“……”\n“If you say that, even if I kill the saint, I will save you.”\nHis whispering smile was terribly seductive.","…… To the point where I really want to live."]},{"title":"The Heavenly Emperor of Darkness","tags":["Action","Adventure","Fantasy","Historical","Manhwa"],"disc":["Read manhwa The Heavenly Emperor of Darkness / 暗天帝 / 암천제 / The Celestial Emperor of Darkness"]},{"title":"There’s No Friendship Between the Grand Duke and the Marquis","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa There’s No Friendship Between the Grand Duke and the Marquis / 대공과 후작 사이에 친구가 어디 있어 / 대공과 후작 사이에 친구가 어디 있어?\nOne peaceful day, her first ordeal comes before her. Instead of the other twin Ordo , who was sick, she must attend the meeting with the a prince of her age. “I don’t want to go! Why do I have to pretend to be Ordo?” “Hey, Ovette. I’ll buy you the telescope you said you wanted to have last time.” “Mom, I will become Ordo more perfectly than anyone else.” Ovette entered the imperial palace with everything ready. And there, she gets involved with a strange person who is not even the prince. I’m not going to see you again anyway, so I applied the medicine properly… “You are the only son of Archduke Rehovem, how did you become friends with someone like that again?” I beg your pardon… … ? For some reason, I have a feeling that I’m going to be terribly entangled with Rehovem. “I wish you all the best in the future, the future of Alphonse.” No, wait! Where is the friendship between the Archduke and the Marquis?"]},{"title":"Back to You","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural","Time travel"],"disc":["Read manhwa Back to You / 아는 여자애 / Just a Girl He Knows","What if an unexpected accident suddenly transported you back to ten years ago? For Hayoung, suddenly traveling back in time to high school means the opportunity to save the life of Jaehyun, the one person she’s always loved… Will she be able to change both of their fates?"]}]