[{"title":"The Beastly Count After Dark","tags":["Adaptation","Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa The Beastly Count After Dark / The Night With the Count / At Night, the Count… / 伯爵大人夜未眠 / 밤만 되면 백작님이","Violetta, striving to support her sister after losing their parents, encounters Theobald, an enigmatic aristocrat who irrevocably alters her life. Taking on the role as Theobald’s maid, Violetta navigates treacherous waters filled with political intrigue and forbidden desires. As Violetta and Theobald’s relationship deepens amidst a backdrop of betrayal and manipulation, Violetta grapples with her conflicting loyalties and the moral ambiguity of her role as both confidante and pawn in a dangerous game."]},{"title":"Time Traveler","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life","Supernatural","Time travel"],"disc":["Read manhwa Time Traveler / 타임 트래블러","Yoon Minho may seem like your average, slightly clumsy kindergarten teacher, but she harbors a remarkable secret: the ability to travel through time. When the National Museum commissions her for another thrilling time-travel mission, she finds herself unexpectedly crossing paths with the enigmatic and aloof Park Ewan. Ewan seeks her help in locating a priceless historical artifact, and despite their less-than-ideal first encounter, they embark on a captivating journey that blurs the lines between history and romance. Join them on this exhilarating rollercoaster ride through time and love!"]},{"title":"I Need Someone to Stop My Older Brothers","tags":["Comedy","Drama","Fantasy","Historical","Magic","Manhwa","Romance"],"disc":["Read manhwa I Need Someone to Stop My Older Brothers / Someone Please Stop My Older Brothers / 누가 우리 오빠들 좀 말려 주세요"]},{"title":"Weapon Maker","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Weapon Maker / Weapon Creator / 웨폰 크리에이터","Shin Joonseoh is a D-rank support who was always treated as nothing more than a laborer because of his lack of mana, despite having awakened a rare “Creation” ability. Luckily enough, he was recruited by a new guild called the Dawon Guild who needed his ability, and set out on his first dungeon raid as a support. However, due to unexpected monsters, Shin Joonseoh found himself in life-threatening danger. Just as he was about to accept death, he received an unknown ability. “Succession” of memories. The past life in which he was unable to stop the end of the world. He had inherited his memories and experience. Now, Shin Joonseoh‘s adventures to save the world using his past life‘s memories begins."]},{"title":"Ancient God’s Chosen Warriors","tags":["Action","Adventure","Manhua"],"disc":["Read manhua Ancient God’s Chosen Warriors / 古代神のゲーム / 古神游戏","Lin Hao, a seemingly high school student who keeps his actual age a secret, was abducted by an enigmatic ancient god along with another five thousand humans. From that day forward, they embarked on a journey as the ancient god’s warriors, traversing through new and extraordinary worlds with the missions of survival, exploration, and relentless self-improvement. As the protagonist, Lin Hao possesses unique talents such as the “Invigorated Man”, “Kept Man”, and “Game Player”. Join him on his journey as he overcomes daunting challenges and witness how he harnesses these powerful talents to become the ultimate warrior of the ancient god."]},{"title":"Tempting My Salvation","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Tempting My Salvation / Don’t Save Me / 私を救わないでください / 나를 구원하지 마세요","Lavielle’s life turned upside down when she lost her entire family. With nowhere to go, when a kind marquess offered to take her in, she was more than grateful…until she learned it came at a price. Forced to endure nightly torment, Lavielle begs for someone—anyone—to save her. Her prayers are answered when Lucien appears, claiming to be the Marquess’s son… But is he truly who he says he is? Can he really be trusted? And, most of all, can Lavielle finally tempt her salvation?"]},{"title":"The Villainess’s Nursery [Official]","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance","Shoujo","Webtoons"],"disc":["Read The Villainess’s Nursery [Official] / EVIL GIRL’S DAYCARE / Evil Girl’s Kindergarten / 악녀의 어린이집","Yerin who died trying to save her student is reincarnated into Fiora a villainess from a story she is familiar with. In the original story, Fiora secretly torments the children of Duke Baridas the man she is engaged to, but later gets exposed and ends up being dumped and executed. Her ultimate goal is a clean breakup that will land her some alimony so she can open a daycare center in this universe. But can she live this life as a character that veers off the set fate and most importantly don’t end up dead?"]},{"title":"Seal The Deal","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Seal The Deal / Contract Wife / Mariage à durée déterminée / 계약직 아내"]},{"title":"Drug Devourer","tags":["Action","Adventure","Fantasy","Manhwa","Shounen"],"disc":["Read manhwa Drug Devourer, 약빨이 신선함 is a Manga/Manhwa/Manhua in (English/Raw) language, Action series, english chapters have been translated and you can read them here. You are reading chapters on manhwaclan fastest updating comic site. The Summary is:","One day, a gate suddenly opened in the heavens, bringing with it the invasion of monsters and the intervention of monks in the human world. 『Miracle Drug “Coffee” Administration』 『Medicinal Contents: Caffeine and Sugar』 ☞ Provides energy ☞ Stimulates the central nervous system ☞ Maximizes senses and reflexes The whole world appeared to slow down, and Hanyul’s medications began to show their true effects."]},{"title":"1st year Max Level Manager","tags":["Action","Adventure","Comedy","Manhwa"],"disc":["Read manhwa 1st year Max Level Manager / 1년차 만렙 매니저 / Legendary Manager Returns To New Employee / 今天也在摆平娱乐圈 / 伝説のマネジャー新入社員に戻る","1st year Max Level Manager, Jeong Yun Ho, who was the vice president of top entertainment and the top actress Ju Yeong In’s husband. He’s a success man, but he always feeling empty inside. Would his life have changed if he made a different choice? Ten years ago, he lost his precious smile. And now, as the last word, a mobile phone rang. ” what the hell? i’m going to die?!?” But wait, it’s wierd. He’s going back to his first year of life! The life of ” first year max leveld manager” is just beginning."]},{"title":"Anyone Can Become a Villainess","tags":["Drama","Fantasy","Historical","Isekai","Romance"],"disc":["Read manga Anyone Can Become a Villainess / Behold the True Villainess / Anyone Can Be an Evil Lady / Anyone Can Become a Villainess / Not Just Anybody Can Become a Villainess / Not Just Anyone Can Become a Villainess / 악녀는 아무나 하나\nShe sacrificed herself.\nEven though she gave her life as a goddess for the kingdom… A sad ending.\n“It doesn’t make any sense for you to die. Don’t sacrifice.”\n“After all, everything I did to save the kingdom was for nothing, so is it a bad thing for me to save my own life?”\nShe pursed her lips and smiled.\n“Then I’ll be happy to be a villain.”\nHow to become a villain?!"]},{"title":"Carnephelia’s Curse is Never Ending","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Carnephelia’s Curse is Never Ending / 저주는 끝나지 않았다"]},{"title":"Will You Marry Me Under Contract, Your Highness?","tags":["Fantasy","Romance"],"disc":["Read Will You Marry Me Under Contract, Your Highness?","Jenesia, a brilliant sorcerer, was murdered after witnessing an affair between her fiance and her best friend. With her final breath, Jenesia managed to use her magical powers to turn back time. Reliving her past, will Jenesia finally be able to find happiness?"]},{"title":"The Regressed Demon Lord is Kind","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Regressed Demon Lord is Kind / The Returning Devil Lives a Good Life / 회귀한 마왕은 착하게 산다","“Demon King Zeke Mohr, become someone who does good in your next life!” The hero shouted to the Demon King of Power, Zeke, as the Demon King met his demise. When he opened his eyes again, he found himself back as Zeke Steelwill, before he became the demon king. He had no desire to become the successor or the Demon King in this life. Then what? Yeah! Maybe I’ll do “good” like that hero said! But how do you do that? The former Demon King of Power was unfamiliar with the concept of “kindness.”"]},{"title":"The Seductive Wife","tags":["Drama","Mature","Romance"],"disc":["Read manhwa The Seductive Wife, Femme irrésistible My Erotic Wife Raunchy Wife Sexy Wife (Yoon Soda) 欲求不満の妻 色氣美人妻 야한 아내","Some marry for love, and some marry for convenience. In Ijae’s case, she marries Yuheon, the son of a business tycoon, to save her family after her father ends up in deep debt. Even though their marriage is contractual, Ijae feels an intense attraction for the cold and calculating Yuheon. Every night in her dreams, she imagines what it would be like to make love with him… until one day, the two end up actually sharing a passionate night together. But will their physical chemistry be enough to build a genuine connection? Or will Ijae remain a pawn in Yuheon’s game?"]},{"title":"The Heavenly Demon Wants a Quiet Life","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Heavenly Demon Wants a Quiet Life","[By the Studio that brought you {The Return of the Crazy Demon}! and {Absolute Regression}! and many more!}\n“In my next life, I wish to walk a completely different path…”","The Heavenly Demon, whose life revolved around fear and reverence, gained a crucial clue to mastering the Soul-Augmentation Art at the moment of his death:","The “Soul-Augmentation Art” wasn’t just about consuming the souls of others.","The Heavenly Demon then awakened in the body of Byeok Taesan, a frail young noble who could die at any moment…","To survive, he must make his way to the courtesan house!","The Heavenly Demon, now transformed into the “Night King,” begins his ambitious journey of survival."]},{"title":"Becoming a Wicked Witch With a Paladin’s First Night","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Becoming a Wicked Witch With a Paladin’s First Night / 성기사의 첫날밤을 가진 악녀가 되었다 / 聖騎士の初夜を奪った悪女","I was hit by a truck and transported to the world of a novel I had read. Unfortunately, I was possessed by Elenia Alfin, the evil woman from the novel, and the story begins with me sleeping in the same bed as the most loyal holy knight, Sir Rolento, if you know what I mean…\nI remembered from the novel, “If a holy knight has a relationship with a woman, he is stripped of his status as a holy knight,” so I decided to try to avoid it and pretend that nothing had happened between the two of us.\nThen, Rolento said something shocking: “Please, take responsibility for stealing my virginity.”"]},{"title":"Hell Love Story","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa Hell Love Story, Hell Romance Story, Office Romance from Hell, 地獄に転職しました, 지옥연애환담","Dumped by her boyfriend and fired from her job, Jineon, her family’s breadwinner, has no time to cry over the spilled milk. She must find another job and fast. Enter The Hell, a mysterious company with great pay, excellent work-life balance, and an easy commute! What more could she ask for? Or so she thought. Little did she know, she had walked into hell—literally. How will she navigate the harrowing journey in the hellscape of her new job with King Yeomra, her stunning new boss, further complicating everything? Could love blossom in this pit of hell?"]},{"title":"Bad Ending Maker","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Bad Ending Maker / 배드 엔딩 메이커","Mincheol is a game developer who spent most of his youth years creating a virtual reality game where after 5 years he was suddenly fired for opposing the Idea of the corporatives of implementing a In-Game Payment System to the game he devoted to. “that’s how my life as the development director of the game ended, but since is a game that I created myself, I’ll….be the one who ends it as well, in order to do that, I’ll enter the game to become the final boss and destroy the game from the inside with my own hands” “I’ll show them what a truly Bad Ending is”."]},{"title":"Don’t Grab the Broken Branch","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Don’t Grab the Broken Branch / 부러진 가지를 잡지 마세요","When my father’s strategy, which caused a rebellion in the neighboring country to try to make his son-in-law king, failed, Deadache loses her fiancée and at the same time avoids the crisis that befell her family, leading to an arranged marriage with the emperor’s favorite knight. As the duke’s daughter, even if she said that marrying a knight was an insult, her opponent was the problem. The Emperor’s favorite knight, Lucius Elliot was her former lover who had to break up with her father’s opposition six years ago. Lucius, her passionate and affectionate lover, was revealed to be her illegitimate child by a duke’s tactic, and she lost her title and territory. He broke up with Deadrache, being misunderstood, and was driven to the battlefield. Six years later, the two people face each other with the situation reversed amidst the sediments of the past. Deadache’s heart is broken by Lucius’ actions, whether it is revenge or regret…."]}]