[{"title":"If You Wish For a Married Couple’s Duties","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa if you wish for a married couple’s duties / If You Want Marital Duties / 부부의 의무를 원하신다면","“I will marry you, but I have no intention to share a bed with you.” The charismatic princess of Bashar meets the sharpest sword of the empire! The life of the two newlyweds united for alliance is a battle in itself. The tingling thriller of a romance between two brave and beautiful individuals who have never loved unfolds!"]},{"title":"Master Wants Me Dead","tags":["Action","Adventure","Drama","Fantasy","Romance"],"disc":["Read manga Master Wants Me Dead / Master Unexpectedly Wants to Kill Me / Shīfu Jìngrán Xiǎng Dāo Wǒ / 师父竟然想刀我","Super luck newbie disciple X Sly superb doormat master. Watch to see how the scheming flower “Sasa is quite lucky” game on in the world of 《Fate》! – Sasa: “Master~ Let’s go to the next instance dungeon to get some new items! – One Fold: “Dammit, when will I be able to get rid of this idiotic disciple?!”"]},{"title":"The Villainous Warrior","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read The Villainous Warrior, The Villain Is Unparalleled, Villainously Peerless, 惡役無雙, 악역무쌍, The Villain Is Unparalleled","When I woke up, I became the villain of a martial arts novel!\nBut the body I possessed happened to be the extra character of a disastrous villain ?\n[ Hyuk Ryeon-woon / The fourth son of Demonic Sect. Leader / A scoundrel, a playboy, has weak combat techniques and a nasty temper]\nHyuk Ryeon-woon, the insignificant villain of the demon sect’s young master who died with a single slash by the main character in the novel!\nHe has no choice but to become stronger in order to survive from the main character.\n“Damn it. Main character or whatsoever. I will destroy all of it!”\nThe chilling survival story of martial arts of the good-for-nothing villain who will do whatever it takes to stay alive!"," "]},{"title":"The Marquis and the Iron Wall Lady","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa The Marquis and the Iron Wall Lady / Can A Lady Stay Pure? / 결벽 후작과 철벽 레이디","Alpheus, Marquis of Rodian, perfect man with brilliant brain and handsome face. But rumour said he has mysterious disease and always using gloves. Edith has work as the marquis treasurer for years. But why now she has to pretend as fake fiancée for the marquis just because marquis want to refuse marriage proposals that offered to him? What exactly is the man’s heart that is strangely sincere in a relationship that begins with a contract? The more he pretended to be a fiancée, the more confused Edith started… The combination of cold-blooded men with dyslexia and iron wall defence women, no one can be vigilant! The beginning of a romance at work that begins with a contract!"]},{"title":"Dear Crown Prince, in this life I will protect you!","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Dear Crown Prince, in this life I will protect you!"]},{"title":"The Counterattack of the Villain","tags":["Fantasy","Isekai","Reincarnation","Romance","Villainess"],"disc":["Read The Counterattack of the Villain / Counterattack of the Baroness / Counterattack of Villainous Duchess / Counterattack of Villainous Noble Girl / Fǎn Pài Nǚ Jué De Nì Xí / Villainous Dame’s Counterattacks / 反派女爵的逆袭","As a loyal fan of “The Duchess of Duchess”, Zhu Xue traveled to the book when she was accidentally drunk and traveled to the childhood of this vicious female character. This time, she not only wanted to “change evil and return to righteousness”, she also wanted to cherish her brothers; reject the young duke; stay away from the crown prince and avoid all of them from chasing her, but she did not expect that the life experience of her and her brothers actually hides the great secret… …"]},{"title":"Debut or Die","tags":["Adaptation","Comedy","Fantasy","Manhwa"],"disc":["Read manhwa Debut or Die / If I Fail to Debut, I’ll Get a Killer Disease / 데뷔 못 하면 죽는 병 걸림","A 4th year student who was preparing for the Civil Service examination, suddenly he found himself in an unfamiliar body 3 years ago. As well as a status window displaying a threat in front of his eyes! [Outbreak!] [Status Abnormality: ‘Debut or Death’ Occurs!] A diary about the transformation of the main character, who was suddenly challenged to be an idol even though he has never been in the industry before due to sudden threat of death. ※Speciality: He used to take and sell idol’s data.\nIf I Fail to Debut, I’ll Get a Killer Disease / 데뷔 못 하면 죽는 병 걸림"]},{"title":"Ice Flower Knight","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Ice Flower Knight / Knight of the Frozen Flower / The Frost Flower Knight / 얼음꽃 기사","Yulia who possesses excellent swordmanship is used and killed by the man she loved. She was just living an ugly face because of the curse… As she nears death, she witnesses the curse being lifted and returns to the past.","“Now, I promise to live only for myself.”"," "]},{"title":"Hey Boss, I Am Your New Wife","tags":["Comedy","Psychological","Romance","Shoujo"],"disc":["Read Big Boss Only Remembers Me After He Lost His Memory / Boss Only Remembers Me After He Gets Amnesia / Boss Only Remembers Me After He Has Amnesia","Dillon, a captain at Eastern Airline and heir to the Alba Consortium Group, was involved in a collision and was inflicted with amnesia. He only remembered Wendy, who, in her desperation to rescue him, died in the process. She was abandoned by a mean family. Later, she was inexplicably revived but suffered from a compulsion to die if Dillon did so. To save herself, Wendy became attached to Dillon! Debutantes cried and wailed: “Dillon wasn’t fool, but how could he have been taken in by that harlot?” At the same time, a thought come from dark is approaching: “Why don’t I take her back to my place and show her the same kindness?”"]},{"title":"This Time I’ll Change My Husband","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa This Time I’ll Change My Husband / This Time I Will Change the Male Lead / 이번엔 남주를 바꾸겠습니다","“I have found someone I love. So please break off your engagement, young lady. “Huh? Your real name is …..” One day I was obsessed with a poor novel “River of Forgetting” and lived quietly as a duke’s daughter. I discovered that my fiancé was an ordinary person who was a main character. According to the original work, his love interest is a female protagonist and a saint, and I was engaged to a male lead…. A supporting character is destined to be assassinated without the knowledge of any mouse or bird, right? That night, I learned two shocking truths and confessed them to a man who was drunkenly passing by. I thought he looked like my favorite black character in this novel, the crown prince of Hyperion, Saul Lucius… . “Do you want to get engaged? Marriage or dating? An affair is fine…..” “Whatever.” This was Hyperion’s man. As a result, an engagement with a crown prince went smoothly… . But my fiancé who dumped me has become obsessed with me. Does anyone know why he’s like this…? Or rather, I’m engaged to a crown prince? Is that too much for a supporting role? Well, it seems like the real lead of this novel is different!"]},{"title":"Becoming the Unwanted Mistress of a Noble Family","tags":["Fantasy","Manhua","Romance"],"disc":["Read manhua Becoming the Unwanted Mistress of a Noble Family / Becoming His Unwanted Wife / Gāo Mén Zhǔ Mǔ Chuān Chéng Háomén Nǚ Pèi / The Matriarch of Noble Family Transmigrated to Be the Aristocratic Supporting Female / 高门主母穿成豪门女配"]},{"title":"Colored With Time","tags":["Adaptation","Drama","Fantasy","Josei","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Colored With Time / Time to Be Dyed / Time to Be Stained / Time to Dye / あなた色に染まるまで / 물드는 시간","Oh Eunsoo and Min Jaeha are madly in love, but Jaeha’s best friend, Ji Geonwook, is appalled that the two are even together. After putting up with Geonwook’s rude behavior, Eunsoo tells Jaeha that she wants nothing to do with his pal. But after an unexpected accident takes Jaeha’s life, the one to bring her up from the dark depths of despair is none other than Geonwook. Eunsoo thought that she had nothing but hatred for him, but could he be the one to make her see the world in color again?"]},{"title":"There Were Times When I Wished You Were Dead","tags":["Drama","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manga There Were Times When I Wished You Were Dead\nThe Emperor of Croisen hated Empress Yvonne. Enough that he’d wish for her to disappear three times a day.\nI don’t like the face of someone who looks just like the Duke of Delois, my enemy, but no matter how much I insulted her, her indifferent and aloof character stayed the same, which made me feel even more terrible.\nI didn’t care whether or not she disappears or dies. I was fine with anything as long as I didn’t see her face.\nThe wish came true.\nWhen he no longer wished for it to happen."]},{"title":"Tiger Cub","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Slice of Life","Smut"],"disc":["Read manhwa Tiger Cub / Baby Tiger / 호랑이 새끼","Kim Daye has become a successful actress in her own right. One day, she is invited to a party by a famous director. At the party, she is confronted by a tall, muscular man. “Noona, it’s me.” “What?” “It’s me.” He introduces himself as Ji Taeho, the neighbor who used to live next door. But she can’t seem to remember him, it’s as if he’s been wiped clean from her memory. Daye promises to get in touch with Tae-ho, but then inevitably forgets. “Noona, why haven’t you contacted me?” A few days later, the embarrassment strikes again. Daye apologizes and agrees to have dinner with Tae-ho. Expensive sogopchang! They get drunk, brag about their small successes, and she somehow ends up inviting Tae-ho inside her house…? ‘That’s crazy. The ball is there for you to hit it, if you won’t then you can’t call yourself a hitter.”"]},{"title":"The Red Nights at the Duke’s Castle","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa 공작저의 붉은 밤 / The Red Nights at the Duke’s Castle","When Sorel Idris turns around to find a stranger in her home, she isn’t that surprised at first. After all, her father warned her this would happen. But when she detects the faint scent of blood in the air, she can’t keep her rabbit ears from popping out in shock. Her father failed to mention that her soon-to-be husband, Duke James Calier, was a vampire centuries older than her! On top of that, she discovers she’s the heiress to a considerable fortune. Sorel slowly adjusts to her newlywed life while attending the university of her dreams."]},{"title":"Academy’s Undercover Professor","tags":["Action","Adventure","Fantasy","Manhwa","Mystery"],"disc":["Read manhwa Academy’s Undercover Professor, 아카데미에 위장취업당했다 , I Got a Fake Job at the Academy","I wasn’t reborn with talent or ability, but at least my knowledge from earth allowed me to stay one step ahead in this other world.\nMagic exists here, and new progress was rapidly being made in science while magic stagnated in the name of tradition. Using my earthly knowledge and not bound by the traditional thinking, I was able to do things other wizards couldn’t even imagine.\nStill, inadvertently becoming an undercover professor for a mysterious secret society at the renowned Sören academy was never in my to-do list!"]},{"title":"Love For Hire","tags":["Romance"],"disc":["Read manhwa Love For Hire / 아저씨, 내 기분 왜 이래요?"]},{"title":"See You Offline","tags":["Manhwa","Romance"],"disc":["Read manhwa See You Offline / 오프에서 만나요"]},{"title":"Lovers Beyond Dimension","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lovers Beyond Dimension / 차원 너머의 연인 / 跨次元恋人","Yuan lived a poor but fulfilling life until she was transported to a different world to become a saint. “My slave, you’re late.” “What? Why would I want to assist this grumpy, ill-mannered dragon? And why would I want to be his partner?” The dragon, however, gradually changed its nature. “I will always be by your side. You are my precious saint.” “This is wrong! This is so wrong! And why do you keep making my heart pound!”"]},{"title":"Everyone Regressed Except Me","tags":["Action","Adaptation","Fantasy","Manhwa"],"disc":["Read manhwa Everyone Regressed Except Me / 나만 빼고 다 회귀했다","Lee Hwayoon, one of the few players who entered the final dungeon, finds himself among the players who regressed back to the past with their memories intact. [System Error!] [Searching for Special Skill…] [Special Skill search completed.] [Please check the status window.] [(Butterfly Effect Lv. 1) To the only one who did not regress, bonus points will be awarded for actions of yours that change the future.]"]}]