[{"title":"The Imperious Young Lord","tags":["Action","Adventure","Drama","Isekai","Sci-fi","Shounen"],"disc":["Read manhwa The Imperious Young Lord / Overbearing Tyrant / Acımasız Soylu / パワハラする領主様 / 飞扬跋扈的领主大人 / 갑질하는 영주님"]},{"title":"Fff-Class Trashero","tags":["Action","Adventure","Cooking","Drama","Fantasy","Isekai","Magic","Manhwa","Reincarnation"],"disc":["Read manhwa Fff-Class Trashero\nProtagonist Kin Han Soo killed the demon king after 10 years of being summoned in the fantasy world. Now it’s time to be sent back to earth. What’s this? The fantasy worlds god appears along with his report card. Because he removed all the obstacles that prevented him killing the demon king, his personality score came out as F. The regression that follows is that he has to return to the start and begin again. Can Kang Han Soo end this endless returns?"]},{"title":"I Can See Your Stats!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Can See Your Stats! / 너의 스탯이 보여!","",""]},{"title":"Drug-Eating Genius Mage","tags":["Action","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa Drug-Eating Genius Mage","Having reached his talent limit on magic, the protagonist was sent to the gaming world as punishment — to a huge city named Valkan. In order to survive, he builds relationships with other people and investigates the secret behind the “closed world”, striving to prevent the end of the world."," "]},{"title":"Who Needs Love?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Who Needs Love? / 마녀는 사랑하지 않아도 괜찮아요 / It’s Okay Not to Love a Witch","",""]},{"title":"Prince Cultivation Project","tags":["Liexing","Manhua","Ping Ping Jun","Romance"],"disc":["Read Prince Cultivation Project / The Troubles of Raising a Crown Prince / The Prince in Game is Hard to Raise / Foster a Prince / 악녀는 사실 킹메이커입니다 / 重生游戏：这个皇子不好养","Hill travelled into a game she was playing and was bound with the character of the fourth daughter of the Duke, Hill Augustine! Her ultimate mission was to help Shawnee Augustine, the third son of the Duke, as well as the unknown prince of the Atlantis Empire, to ascend the throne. Shawnee’s only 14 years old now, silent and resilient. And he’s prone to bullies because of illegitimate birth. How should Hill cultivate this little prince?\nMangaToon got authorization from SNAP to publish this content, the content is the author’s own point of view, and does not represent the stand of MangaToon."]},{"title":"Destined to be Empress","tags":["Fantasy","Historical","Manhua","Romance"],"disc":[]},{"title":"The Marquess’s Daughter Plays the Perfect Pawn","tags":["Action","Comic","Fantasy","Historical","Korean"],"disc":["Read Koushaku Reijou wa Tegoma wo Enjiru / 侯爵令嬢は手駒を演じる\nThe daughter of a marquess, Julianna is known as the “perfect lady” by society. However, she has a secret. She’s only enjoying acting like the perfect lady! Her true self is hidden under an invisible mask. One day, she is summoned by Prince Edward, the “perfect prince” who is actually a black-hearted schemer! At the royal palace, he gives her a fiendish order. “Become my pawn. You don’t have the right to say no!”"]},{"title":"The Princess of Vengeance","tags":["Drama","Fantasy","Historical","Romance","Webtoons"],"disc":["Read manhua The Princess of Vengeance","She was the king’s daughter, yet treachery took her whole family’s lives. With the help of a legendary artifact, she was granted a new life. She decided to hide her astounding beauty in disguise and concealed her real power, only to seek her vengeance!"]},{"title":"Rebirth Meeting: For You and My Exclusive Lovers","tags":["Drama","Manhua","Romance"],"disc":["Read manhua Rebirth Meeting: For You and My Exclusive Lovers / Rebirth: Giving You My Exclusive Affection / Resurrection Reunion: The Exclusive Love / Reunion: A Love Only for You / 腿残帝少的追 / 転生令嬢～もう一度御曹司に奪われたい / 重生相逢：給你我的獨家寵溺 / 重生相逢：给你我的独家宠溺 / 이번 생은 악녀로 살겠습니다 / Adore Me Exclusively / Dandote todo mi cariño / Kelahiran Kembali: Memberikanmu Kasih Sayang Ekslusifku / Meeting For You and My Exclusive Lovers / Ni Gei Wo De Du Jia Chong Ni / Rebirth and Fateful Debt","Rebirth and return to the age of seventeen, Yun Wants to swear not to be bullied again. She beats a scumbag to a high-profile marriage, but is forced to accept a man with leg problems. Yun Was laughed at. , Was ridiculed. But a man held her in his palm, others humiliated her and returned it ten times, and others deceived her and returned a hundred times. One day, Yun thought about it and was shocked: “Can you walk?” The man looked innocent: “I never said that I can’t walk.”"]},{"title":"Second Life on the Red Carpet","tags":["Action","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Slice of Life","Time travel"],"disc":["Read manhwa Second Life on the Red Carpet / Kehidupan Kedua di Karpet Merah / 2회차는 레드카펫으로","Bedisth, who transmigrated into the novel ‘Twilight Princess’, finally reached the end of the novel. After it was completed, she wonders how her life would be in the future, and when she opened her eyes the next morning, she returned back to the day when she first transmigrated, together with Princess Rossenne! Confused, Bedisth tries to make a regret-free ending upon hearing Rossenne’s words that it was her second chance!"]},{"title":"I’ve Reincarnated into a Handmaiden!","tags":["Comedy","Fantasy","Isekai","Reincarnation","Romance","Shoujo"],"disc":["Read I’ve Reincarnated into a Handmaiden! / I Was Reincarnated, and Now I’m a Maid! / Tenseishimashite, Genzai wa Jijo Degozaimasu. / 転生しまして、現在は侍女でございます。 / 转生女仆~我养成的公主可不能变成恶役女配~\nYuria has been reincarnated into her beloved otome game as a background character…the only thing is…she’s been transported to the events that take place before the storyline of the game! Working as a handmaiden for the beloved princess, she works tirelessly to change the events of the game, and create a new storyline…one where the princess doesn’t become the villain. Using the knowledge of her past life and the magic she learns in the game, she guides the princess on a noble and righteous path, one that twists and turns, and is full of magic, romance, tea, sweets, and even the conflicts of royal kingdoms! A fantasy-filled adventure about a handmaiden who finds her calling in the least expected of places is about to begin!"]},{"title":"The Evil Knight","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Evil Knight / 악한 기사","Born as the eldest daughter, she was raised and educated only to become Queen. Even though she had excellent fencing skills, she was not allowed to wield a sword. Nevertheless, she was happy. As Queen of the Kingdom of Mont, she was able to stay with her beloved King. But her happiness did not last long. The king betrayed her and condemned her. When she opened her eyes again, she found herself on the witch hunting ground outside the castle! People are calling her a witch and are trying to kill her. What is even going on?"]},{"title":"Dragon’s Savior","tags":["Drama","Fantasy","Romance"],"disc":["“Napolly,” an ordinary high school girl in modern times, was tired of a boring school life. ‘The world is gone?!’ The news is full of breaking news that the mysterious destruction continues, but the main culprit is seen in the eyes of the surviving Polly. White and brilliant silver scales, purple eyes with sadness and madness. ‘The giant dragon I saw in the game!’ In front of Polly, who can see the transparent dragon, the twin sister of Transparent Dragon, “Idae ah,” appears, and the dragon’s name is “Israel.” Napolly, who was forced to take part in the power of Ideiya by half force to calm Israel, who was dumped by a wicked woman, headed to the second world of the past. Can Polly be friends with Israel, who is trying to destroy the world, and calm it down?\nThe savior of the dragon , 드래곤의 구원자"]},{"title":"Look a Picture","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Look a Picture / 루커피쳐","Jisoo, who dreamed of becoming a fairy tale illustrator since she was young, dropped out to achieve her dream and went to her grandmother’s house, where she meets Dowon. Dowon, who was worried about not having a dream, is interested in Jisoo who is trying hard to achieve her dream. “The farther you try to catch, the farther away you feel. When will the day you reach your dream come?”"]},{"title":"Secret Love","tags":["Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhwa Secret Love / My first crush / 暗恋","Secret Love summary is updating. Come visit MangaNato.com sometime to read the latest chapter of Secret Love. If you have any question about this manga, Please don’t hesitate to contact us or translate team. Hope you enjoy it."]},{"title":"She is coming, please get down!","tags":["Action","Comedy","Drama","Psychological","Romance"],"disc":["Read Bow to Your Queen manhua / Here Comes The Queen / She Is Coming, Please Get Down! / She’s Coming, Get Down Please! / Tā Lái Le, Qǐng Pā Xià / 她来了，请趴下","The 18-year-old actress fell into the sea, when she returned her personality completely changed. Before she was soft, easy to bully, suddenly now she is a ruthless killer that everyone hears scared . From poor acting to talented actress, rich men everywhere are wholeheartedly respectful to her … Tacit rules? How much money is your company worth? Famous actress? I just had a little fun, not being careful won the prize. Trash? I understand the most is this, do not be too weak, then I am not satisfied. Returning in the name of the god of death, I will take revenge"," "]},{"title":"Matchmaking Baby Princess","tags":["Fantasy","Romance"],"disc":["Read manhwa Matchmaking Baby Princess / Matchmaker Baby Princess / 중매쟁이 아가황녀님/ The matchmaking baby princess\nI woke up as the orphaned princess Eryl in a novel! My lovely aunt Lucinda, who suffers from raising me alone, is as kind as an angel. Though it doesn’t appear so in the eyes of my uncle, tyrant Emperor Tessa Illuminas. “Aunt, only trust in me! I’ll make you walk on a flower path!” Eryl enters the imperial palace only for her aunt. But this uncle doesn’t seem like the tyrant in the novel at all? Rather, it just seems like there’s a lack of affection? “I can’t help it! Eryl will make everyone happy!” Nowadays, children play matchmaking as a hobby, right? I’ll try it out."]},{"title":"My Lifetime Husband Refuses to Divorce Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Lifetime Husband Refuses to Divorce Me / My Lifetime Husband Refuses to Divorce Me / Until Death Do Us Part / 시한부 남편이 이혼을 거부한다","She married a sickly boy who died before becoming an adult by arrangement.\nThe boy who became her husband had a ferocious personality that was well-suited to the nickname of the devil.\nEven so, after getting married, he comforted her, healed her from sickness and death, and solved family problems.\nSo many years of marriage passed.","It was hard, but she thinks it was a pretty good marriage.\nThis life was about to be over and she was going to get a divorce for my bright future husband…","“Are you saying those words now to make me turn my back on you?”","What. Why is this reaction?","“Hey, Pavel. this is a bit… Isn’t it too close?”","So get away! But… no, why are we closer. At this rate, our lips will touch each other!","“Isn’t this what couples usually do?","Confused, I tried to push him away, but Pavel grabbed my waist tightly and said.","“Don’t even think about running away. This is the life you saved, so take responsibility, until death.”"]},{"title":"My Husband is an Antisocial Count","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Husband is an Antisocial Count / Kekkon Aite ga Komyu Sawa Hakushakuda Nante Kiitemasen! / 結婚相手がコミュ障伯爵だなんて聞いてません！ / Suami saya nolep","Chloe thinks she’s an outcast because she does not get along with her stepmother or her fiance, Emile. One night, she goes to a masquerade ball, where she witnesses her stepsister Beatrice and her fiance Emile kissing each other! Heartbroken, she is biting back her tears when a mysterious man with a mask appears, hands her a handkerchief, and leaves. Chloe is confused, but this strange encounter is soon forgotten because she is forced to call off her engagement with Emile so that he can marry Beatrice. That is when Chloe receives a marriage proposal from a man known as “The Devil of Blysche”…!"]}]