[{"title":"The Baby Prisoner in the Winter Castle","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Baby Prisoner in the Winter Castle / 겨울성의 아기 죄수님","On the day when the country is defeated and all members of the royal family are executed, the illegitimate daughter of the beaten royal family unexpectedly becomes the last member of the royal family.","“You cannot put a person to death under the age of eighteen.”","Nine-year-old Clarisse was saved thanks to the law of Saffers, a victorious country that said that minors would not be executed.","“My older brother said he would kill me before I was twelve. But to be able to live to be eighteen, I am very happy.”","And Maximilian, who raised young Clarisse safely until she was 18 and had to be put to death.","“Do not forget. That the day that child turns eighteen, you must bring that head to me.”","The two of them head to the deserted land, the cold northern winter castle.","A grace period of 10 years given to Clarisse.","What will be C larisse’s fate?"]},{"title":"Hard Carry Support","tags":["Action","Adventure","Fantasy","Shoujo"],"disc":["Read manhwa Hard Carry Support / 하드캐리 서포터","The forgotten tr*sh game “Asra” has SeoHyun at the top of the leaderboard.","He has now arrived to capture Asrian, a hugely popular VRMMORP game that adopted Asra’s setting!","Yet what he mistakenly believed to be a concealed damage-dealing class wasn’t…","[Congratulations! You’ve chosen the “Support” hidden class!]","“Huh…?”","A unique type of support!","a stronghold that pulls victims by the neck while fighting!"," "]},{"title":"Love on Campus","tags":["College life","Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Love on Campus / ラブ・イン・キャンパス / 러브 인 캠퍼스","Minyoo Seo has accepted her fate as the school outcast. During her first year of college, a creeper latched onto her, making it impossible for her to make friends or date. Just when Minyoo thought she was going to have a dull college life, she met Woobin Seon, one of the hottest guys on campus. Woobin is kind, funny, and seems to have feelings for Minyoo. However, falling for one of the most popular guys on campus has its downfall, and Minyoo is about to find out how complicated love can be…"]},{"title":"The Youngest Daughter of the Villainous Duke","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Youngest Daughter of the Villainous Duke / The Little Lady Behind the Villain / She Is the Youngest Daughter of the Villainous Duke / The Real Youngest Daughter of the Villainous Duke / Истинная младшая дочь герцога-злодея / 反派家族的掌权小女儿 / 過保護な悪党公爵家で奮闘中です! / 악당 공작가의 실세 막내딸입니다","When I was a high school student, I was so fascinated by the novel that I stopped writing.\nAnd then now I have the body of a supporting character instead of the main character. It was a 7-year-old orphan girl with no name…\nHaving to suffer the abuse of others, until I got really tired and ran away from that place. But I was captured and sold as a slave.\nI thought my life was over…But the person who saved me was the novel’s most prominent villain, Henriette.\nHe treats the emperor like a puppet. A person who has a reputation for being extremely cruel in the original and has a hobby of cutting the throat of aristocrats.\n…Is that my biological father?\nBut other than that terrible reputation, living with him wasn’t bad either.\n“Okay, my baby”\n“You can do whatever you want. If you want something, everyone in the family will do what you want.”\nWait…I didn’t write a novel like that in the first place?","악당 공작가의 실세 막내딸입니다"]},{"title":"The Secret Game of Nobles","tags":["Fantasy","Romance"],"disc":["Read The Secret Game of Nobles / 贵族的隐秘游戏","She accidentally broke into the abandoned castle and saw the legendary vampire dinner, and the prince of the vampire clan treated her as an erotic plaything. If you don’t obey, you will die. She accidentally broke into the vampire territory and was determined to wipe it out, but in the game again and again, the prince of the vampire clan actually fell in love with her…"]},{"title":"Lillian of Turin","tags":["Drama","Fantasy","Isekai","Manhwa","Monster","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Lillian of Turin / A Match Made in Mana / Leylin of Turin / Lilian of Turin / Lily of Turin / Turin’s Lillian / Lillien of Turin / 튜린의 릴리엔","Our mc doesn’t want to be the main reason of the trauma to the male protagonist of the novel, and so, she decided to have a good sibling relationship with her brother and fulfilled her duties to her husband. And now, she needs to take “responsibility” on “taming”."]},{"title":"The Goal is to be Self-made","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Goal is to be Self-made / Self-Made Lady / My Goal Is to Achieve Success on My Own / The Goal Is to Become Self-Sufficient / 目标是白手起家 / 目標はひとり立ちすることです / 목표는 자수성가입니다","“Your Grace the Duke, please marry me.”","When I woke up, I was in a game world.","But the problem is that I became a supporting character that was to be sacrificed to break the hard mode.","There is only one way out of this situation.","Marry the Eastern Grand Duke Sedrick Etzel, avoid a predetermined death, quickly earn a lot of money and become self-made!","[!] Crafting Skills (Legendary level/Hidden level)\n[!] Under the influence of your skills, great ideas are rushing into your head!\n[!] Let’s start crafting !\nFortunately, the hidden level skills exist only for me,","“It’s my job, but thank you for caring so much.”","“It’s my job, too. You said it yourself, an Etzel never forgets to reciprocate. So you should always reach out to me.”\nI have a more cooperative contract husband than I thought. Exceeding the goal seems to be completely possible!","Here comes the player, lay down the money path!"]},{"title":"The tutorial tower of the advanced player","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The tutorial tower of the advanced player / The Advanced Player of the Tutorial Tower / 튜토리얼 탑의 고인물","A hunter trapped in the tutorial tower due to a curse.\nLeaving the tower after 12 years!"]},{"title":"Tales of the Stellar Unknown","tags":["Action","Adventure","Fantasy"],"disc":["Read Tales of the Stellar Unknown / 奇星箓","Qi Xing, your average high schooler, stumbles across a mysterious seven-star disc.\nBut this ain’t no ordinary frisbee. Suddenly, the disc drags him into the “Disc World”— a mind-blowing realm where his crazy adventure kicks off.","Through a twist of fate, Qi Xing becomes a cultivator, a master of countless Daoist techniques.","As he unlocks the secrets of the Seven Star Disc, a hidden power within him— the Primordial Celestial Qi—begins to awaken.\nBut with every revelation, he gets sucked deeper into a conspiracy surrounding the legendary “Path of Immortality” through which he uncovers the truth about achieving immortality in the World within the Disc…"]},{"title":"An Unexpected Engagement","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa An Unexpected Engagement / An unexpected proposal / 뜻밖의 청혼","Alicia, Neustein’s princess, meets her fate the moment she raises her sword and encounters the wolf of the north, Cabelenus. “I just know when to give up.” But Cabelenus didn’t let her go, the woman who had given up a long time ago. The two of them fall uncontrollably into each other in their united fate…"]},{"title":"The Baby Isn’t Yours","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Baby Isn’T Yours / It’s Not Your Child / 这不是你的孩子 / 너의 아이가 아니야","Kalia is a war hero and commander that put an end to the past war. But one day, she finds out that she’s… pregnant?! Of all people, the father of the baby is Simon Terroan, her best friend and archmage, whom she spent a single passionate night with. Believing that Simon doesn’t want the baby, Kalia hides the truth of her pregnancy, then retires from her job and disappears while Simon is away in order to have her baby. But the truth is that Simon has loved Kalia, more than anyone else. And so, the frantic search for her begins. Note: This is a Promotional Webtoon for the novel!"]},{"title":"My Bosss’s Perfect Wedding","tags":["Adaptation","Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa My Bosss’s Perfect Wedding / Menikah Saja Sendiri / Perfect Wedding / 완전무결한 웨딩","“A wedding without a bride?” Taesung Group’s president, Mujin Tae, is a workaholic with no interest in women. But one day, he’s suddenly been given an ultimatum by his father, the chairman of the company. He must find a bride to walk down the isle with five months later. The one who’s been put in charge of finding a bride for Mujin is none other than his secretary, Suyeon Cheon, who’s had a secret crush on him for nine years. But when her father, CEO of Gaon, gets into a car accident and falls into a coma, everything changes. Suyeon quits her job and finds herself trying to appease Gaon’s stockholders about the disappearance of her older brother, who she believes should take over. But her fate changes when her “god-like” ex-boss shows up at the meeting and recommends her as the acting CEO. Suyeon accepts and decides to learn all she can from “the best,” Mujin, to save Gaon. Will her relationship with Mujin be different now that she’s a CEO herself? What if she was the bride that Mujin needed in order to make his father happy?"]},{"title":"Pet the Little Princess","tags":["Fantasy","Historical","Isekai","Manhua","Romance"],"disc":["Read manhua Pet the Little Princess / 爆宠小萌妃","This is a story about a female lead who transforms into a child after losing her virginity. On top of that, she continues to switch between an adult and a kid.\nAnd with a crown prince who also has a dual personality, there are equal parts love and bite to this tale."]},{"title":"Chronicles Of The Jungle Sovereign","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua Chronicles Of The Jungle Sovereign / 我，丛林主宰","Lin Tian, ​​a genius game designer, was ordered to be executed because he knew too much of the company secrets.\nAt a critical moment, he was betrayed by his lover Luo Yue and was killed in the jungle.\nWhen he woke up, he found he became a low-level monster in the jungle.\nIn order to avenge the past, he the male protagonist started on his path as a Monster in The Jungle."]},{"title":"How We Love","tags":["Romance"],"disc":["Read manhwa I Stan You / Love Way / How We Love / The Way We Love / 追逐光的爱恋 / 우리가 사랑하는 방법","Due to an incident at the subway station, Kang Ha-da falls for Storm stan and Moa-biased Yuri, who misinterprets Ha-da as a fellow Moa stan. Ha-da misses out on the chance to talk to her during their subway station encounter and fully expects to never see her again, but by coincidence (or fate), the two of them share more connections than they realize. Ha-da soon finds out that the reason Yuri treated him the way she did was because she confused Ha-da for a Moa stan, so what does he do to get closer to her? Become a true Moa stan himself! This is the story of a boy who jumped into the world of idols to understand that girl’s heart!"]},{"title":"My Sister Who Regressed Wants My Fiance","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Sister Who Regressed Wants My Fiance / 회귀한 언니가 내 약혼자를 탐낸다 / My Regressed Sister Covets My Fiance","I got engaged on behalf of my sister.\nIt was an order from her father, who favored only her older sister. So she ran for a week and entered the public domain.\n“Oh, are you coming now? Nereis.”\nMy older sister arrived first and greeted me.\nShe said, “I changed my mind. So you give in.”\nSuddenly, her older sister covets the position of wife of the Ghost Duke.\n“I like you.”\nRegardless, there is even a peacock that only approaches me.\nThe incomprehensible situation did not end here.\nLooking at my sister’s diary that I found by chance, it seems that her sister has regressed.\nAnd that older sister, who has returned, covets my fiancé."]},{"title":"The One Who Will Bury Me: The Witch Does Not Desire a Happy Marriage","tags":["Drama","Fantasy","Romance"],"disc":["Read The One Who Will Bury Me: The Witch Does Not Desire a Happy Marriage","“──Ah, I want to be killed by this person…”\nBorn into a family that raises saints, Silvia one day realizes she possesses witch-like powers.\nShe has been praying to the goddess to at least not hurt those around her, but her talents as a saint have yet to blossom, and she spends her days feeling belittled by her family and servants in comparison to her brilliant younger sister.\nAmidst all this, she is suddenly ordered by her father to enter into a politically motivated marriage with a renowned holy knight known as the ‘Witch Slayer’──"]},{"title":"Why Would a Villainess Have Virtues?","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manga Why Would a Villainess Have Virtues? / Where Is Justice For the Villainess? / Where the Villain’s Loyalty Lies / Justice for the Villainess / 악녀에게 의리가 어디있어","Charlotte had dedicated everything to the Emperor in the past… However, what she got in return was stone-cold betrayal and freezing loneliness.\nBut, while she had been awaiting her death after being confined in prison, a questionable man appeared in front of her!\n“Could you help me murder the emperor?”\nCharlotte, who had danced with a sword for the Emperor, meets Ruslan and is reborn as ‘Juju.’ Now, her sword is directed at the Emperor. And the two who had met as comrades start bearing feelings that go beyond just that…\nA romance that blooms in a revenge story that’s extravagant and strategic!\nThe story of the strong-willed and charismatic villainess, Charlotte!\n“Why would a villainess have virtues?”"]},{"title":"Tamed A Blackened Slave Man","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Tamed A Blackened Slave Man / Taming a Corrupted Slave Man / 흑화한 노예남을 길들였다"]},{"title":"Return of the Bloodthirsty Police","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Return of the Bloodthirsty Police, 킬러경찰, killer Police, Killer Cop","After being betrayed and killed by the organization he worked at, the infamous assassin ‘Bi-Gwang’ reincarnates as ‘Kim Gyeongsoo’, a police officer. He vows to take revenge on ‘Hwaguksa’, the organization of killers that has betrayed him."]}]