[{"title":"If You Want a Fake Sister","tags":["Drama","Josei","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa If You Want a Fake Sister / The Duke’s Imposter Sister / 가짜 여동생을 원하면","The lost princess of Grandia, Gris Benedict, had become a s*ave in a brothel at the age of nine. She was fortunate enough to have escaped her prison after eleven years. But the condition was to live under the grace of the House of Byrenhag.","She had accepted so in order to survive; it was a worthy proposition.","One day, she got a small, cute animal from her fake brother, the Lord Byrenhag. She thought it would be her first and last present from him, but then he kept bringing her bigger gifts.","When the time came that he finally tried to give himself, Gris foresaw that their relationship would end in a catastrophe."]},{"title":"Rookie Employee Kim Cheolsu","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa Rookie Employee Kim Cheolsu / 신입사원 김철수","On the day he was rejected by the company he had devoted his life to, He went back to the moment of his first day at work. Kim Cheol-su, a low-spec rookie employee who joined Han-young, a leading domestic company. Can he finally achieve his long-desired position as the ‘CEO’ in this lifetime?"]},{"title":"Come On Now, Even If I’m Not A Villain","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Come On Now, Even If I’m Not A Villain / Even If I’m Not The Original Villainess  / 이제 와 악녀가 아니라 해도","After being killed by her own father, I woke up… 500 years later?! To make things worse, I’ve been reborn into the body of a so-called villainess—a woman hated by her family and fiancé for her fragile health and sharp temper. All I wanted was to live quietly and figure out why I was reincarnated. But now, my once-cold family and fiancé are suddenly desperate for my attention, and my slave boy from 500 years ago has returned… perfectly alive. As if that wasn’t enough, immortal weapons from ancient times are starting to gather around me. “You shouldn’t have fed the stray dog.” I never gave anyone a single bite, so why is this happening?!"]},{"title":"The Beast Within the Greenhouse","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Beast Within the Greenhouse"]},{"title":"My Sister Picked Up the Male Lead","tags":["Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa My Sister Picked Up the Male Lead / 언니가 남자주인공을 주워왔다 / Kakakku Memungut Pemeran Utama Laki-laki / Mi hermana recogió al protagonista masculino / 姉が男主人公を拾ってきた / 姐姐把男主人公撿回家了 / 姐姐捡回了男主","My name is Amy. I’m glad to have been reborn as the main character’s little sister in a novel from my past life but… On the morning I turned sixteen, my sister said she prepared something special for me and had picked up a man from the woods?!!"]},{"title":"Vengeful Weapon, Tears of Poison","tags":["Drama","Fantasy","Magic","MANGA","Mature","Romance","Webtoons"],"disc":["Read Vengeful Weapon, Tears of Poison / Seiryaku Kon Kougou wa Fukushuu no Doku ni Saku / 政略婚皇后は復讐の毒に咲く","Amelia, the daughter of Yua Levanna’s second queen, is despised by the royal family due to her inherited “poison magic,” a unique ability from her mother. After enduring torment and witnessing her mother’s tragic demise, as the kingdom exploited her poison for military gain, Amelia clings to her mother’s dying words: “No matter what happens, don’t give up.” One fateful day, the enigmatic northern empire of Saulverka announces that its Emperor seeks a new wife. Meanwhile, Amelia’s half-brother Craig seizes the throne of Yua Levanna by assassinating the previous king and sends Amelia to the notorious and cold-hearted Emperor Noam in Saulverka. Her reception by Noam is chilling and unwelcoming. While lamenting her existence, Amelia uncovers the truth behind her mother’s death. Fueled by an intense desire for revenge, she embraces her seething anger and vows to avenge her mother against the royal family."]},{"title":"Here Reigns the Vengeful Villainess","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Here Reigns the Vengeful Villainess / The Crazy Villainess in This Area Is Me / I’m The Crazy Villainess in This Area / 이 구역의 미친 악녀는 나야","In the grand empire of Tygen, Robellia’s serene life takes a dark turn, catapulting her into a saga of vengeance. In a world of power and intrigue, she exposes hidden truths, navigating a tumultuous path between hero and villain. Armed with extraordinary magic, Robellia is steadfast in unveiling the obscured secrets of the empire and recovering her lost happiness."]},{"title":"My Angelic Husband is actually a Devil in Disguise","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Angelic Husband is actually a Devil in Disguise / 죽었던 남편이 계략남으로 돌아왔다"]},{"title":"Amelia’s Contract Marriage","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Amelia’s Contract Marriage / Amelia’s Opalescent Marriage / 아밀리아의 계약 결혼","Amelia married as if she were being sold to Count Domene – her family’s political opponent. That was a grey marriage without love.\nAfter being used as a spy without realizing it, her only thing left was a miserable death.","‘I won’t live a stupid life again.’","Amelia, who returned, resolved firmly and offered the Count a deal.","“I can help you win.”","“What do you want in return?”","“When we’re done…”… Please divorce me.”","“How come?”","“How can a married relationship that is neither loved nor loved be comfortable?””","Amelia dreamed of a free life after her divorce.","“I will not forgive those who have treated my wife recklessly.”","This man, by the way, is he always a nice man…?"]},{"title":"The Heat of the Reincarnated Villainess","tags":["Drama","Fantasy","Historical","Isekai","Josei","Mature","Reincarnation","Romance"],"disc":["Read manga The Heat of the Reincarnated Villainess / Akuyaku Reijou no Hatsujou-ki / Akuyaku Reijou no Hatsujou-ki / O Período de Cio da Vilã / The Villain’s Rutting Period / ระยะอันตรายของนางร้ายร้อนรัก / 悪役令嬢の発情期","A detested villainess and a proper prince are instinctually drawn to each other’s bodies before they have a chance to develop feelings. What will their destiny be!?"]},{"title":"Survival of a Tyrant’s Secretary","tags":["Fantasy","Romance"],"disc":["Read manhwa Survival of a Tyrant’s Secretary / The Emperor’s Secretary Wants to Survive / 황제의 비서는 살아남고 싶습니다","Ronaldine is an ambitious woman. When she finds herself as an orphan in a novel she once read, she decides to use her knowledge from the real world to become the best secretary anyone could ever have. Little did she know that her skills would take her all the way to the royal palace–where she becomes the tyrant emperor’s personal secretary. Ronaldine fears for her life and wishes to quit her job, but it seems that she is the only person who can calm down the emperor from going on a murderous rampage."]},{"title":"The Grand Duke’s Beloved Granddaughter","tags":["Romance"],"disc":["Read manga The Grand Duke’s Beloved Granddaughter","Mirabel is a famed mercenary whose mother, Cornelia, had long suffered from the guilt of leaving her family, the Grand Dukedom of Citron behind.\nAfter Cornelia’s failed attempts to contact her family left her distressed and led to her death, Mirable seeked revenge,\ntracking down her grandfather, the Grand Duke Criton and the assumed cause of all her mother’s misery.\nAfter finding out that he too was betrayed, Mirabel meets an untimely death at the hands of the true culprit, only to wake up back when she was nine years old, with her mother still alive.","Determined to stop her mother’s death, and seek revenge against the true villain, Maribel sets out to make things right.\nBut her choice to meeti her grandfather makes her cross traces of her past, while she experiences a life she never knew before."]},{"title":"Became a Black Flower","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Became a Black Flower / 검은 꽃이 되었다","A sword was pointed at Diana’s neck. It was a rather pathetic end for a female knight who once swept through the battlefield.","“I’ll never wield a sword again…”","Diana exhaled her last breath. With a chilling sound, the blade fell downward. She thought everything had ended that way. But… everything was reversed.","At the age of 10, before she had ever held a sword, Diana made a decision."]},{"title":"A Savage Proposal","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Savage Proposal / 야만의 청혼 / A Barbaric Proposal","When the ruthless Lord Tiwakan seizes the kingdom of Nauk, Princess Liene Arsac faces an impossible choice: marry her captor or watch her homeland crumble. But Lord Tiwakan isn’t just after power; he desires Liene, and his devotion stirs a…"]},{"title":"The Male Lead Monster Lives Under My Bed","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Male Lead Monster Lives Under My Bed / The Monster Male Lead Living Under My Bed / ベッドの下に主人公が住んでいます / 我床下有只萌物男主 / 我的床下住着怪物男主 / 내 침대 밑에 괴물 남주가 산다","I was given slime as a gift from my war-crazy brother. At first, I decided to keep it under the bed and raise it secretly. It’s a monster, but… … . “Muw.” I flirted every day with all kinds of secrets to my first-time friend. Everything from the fact that I am the possessor to the content of the original. “Actually, this is a 19-gold-dried romance novel. The male protagonist was amazing.” “music?” “As for what the water level was… … .” At my words, the slime’s blue body glowed red. It seems to be getting bigger as the days go by… … . Is this a real slime? But the curiosity and suspicion did not last long. Because my father killed the slime. A few years later, as in the original story, I married the southern prince, Archduke Ruslan. I was going to leave at the right time for the role of the man’s ex-boyfriend, but… … . “I heard you like being incarcerated.” … … Is it weird? When did I?! “I have no intention of becoming a formal couple. Of course, I plan to fulfill my duties as a married couple.” He whispered softly as he scanned my jawline. “You said that you like beeping things, so let’s start with that.” Even piercing through my bad taste. I didn’t notice because I was too confused. From the hand holding my chin, The softness of the cold is strangely familiar!"]},{"title":"It’s My First Time Being Loved","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa It’s My First Time Being Loved / First Time As An Adored Youngest Child / 사랑받는 막내는 처음이라"]},{"title":"Contract Concubine","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Contract Concubine / Contract Concubine / El Contrato De La Concubina / Hugung Gyeyak / Selir Kontrak / 愛妃，你的刀掉了","One day, Yesuh, a famous assassin, receives a strange request from a suspicious man.\nShe’s never received such a ridiculous request before, but after hearing how much the odd man was willing to pay.\nShe decides to bite the bullet and take on the request.\nHowever, upon starting the mission, Yesuh is shocked to find out that her suspicious employer is actually–?!\nThe Concubine Contract"]},{"title":"Duchess in Ruins","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Duchess in Ruins / 전리품 공작부인 / Duchess of Spoils","Edele Lancaster is the perfect noble lady who has been groomed for the job. But when her husband whom she married reluctantly commits treason, she is branded a traitor and becomes a slave. Distraught, she tries to kill herself to preserve honor as a noble lady, but her new master, Count Laslo Krissus prevents her from doing so. Will Edele be able to find freedom and happiness in her new life as Count Krissus’ maid?"," "]},{"title":"Let Me Kidnap the Male Lead!","tags":[],"disc":["Read manhwa Let Me Kidnap the Male Lead! / 남주 좀 납치합시다!","Following a carriage crash, our heroine recalls being reincarnated as Vivian in a novel called “The Bloody Flower.” Poor Vivian now knows she’s a side villain who dies after kidnapping the male lead. But if she doesn’t kidnap him and guide him to the female lead, the demon will destroy the world anyway! Unfortunately, the male lead was only described as “handsome,” and this world is crawling with handsome men. Thirty kidnappings later, all Vivian has is a handful of good-looking fans who loved their luxury hostage experience. If only someone could point her to the man she’s looking for…!"]},{"title":"Perhaps Invincible","tags":["Romance"],"disc":["Read manhwa Perhaps Invincible","Yu Hyeol, a third-rate warrior infamously nicknamed *“The Star of the Dark Arts”* due to his menacing appearance, lived a life plagued by false rumors and endless misunderstandings. One day, Seolhwa—the woman he once vowed his future to—reappears before him, no longer the gentle figure he remembered but a formidable master of martial arts.","From that moment, his name becomes entangled with the lives of countless warriors, spiraling his already infamous reputation. As his so-called “notoriety” spreads, the Murim Alliance, the Demon Cult, and even the royal court take notice of him.","*”No, really… it’s all just a big misunderstanding!”*","But can he convince the world otherwise? Or will he unintentionally become the legend he never aimed to be?"]}]