[{"title":"Worthless Profession: Dragon Tamer","tags":["Action","Fantasy","Martial Arts"],"disc":["Read Worthless Profession: Dragon Tamer, Worthless Profession: Dragon Tamer, I Got the Weakest Class, Dragon Tamer!?, worthless job: Dragon Tamer, 全民转职：驭龙师是最弱职业？","In a world where reality and gaming have merged, numerous ferocious beasts roam freely, and various mysterious realms and dungeons exist.\nTo withstand the onslaught of these beasts, everyone must undergo job changes and level up rapidly.\nOn the day of his job change, Lu Fan becomes the holder of the hidden class— Dragon Tamer. However, due to the immense power of giant dragons, taming them seems impossible, earning Dragon Tamer the title of the most useless class. Fortunately, he awakens the Super Treasure Map System. With his colossal dragon accompanying him, Lu Fan sweeps through everything, causing the entire world to tremble"]},{"title":"The Lord of the Wheel of Destiny","tags":["Action","Adventure","Fantasy"],"disc":["The Lord of the Wheel of Destiny, 命轮之主！当异变降临人间\nA planet called “Devil’s Star” has appeared out of nowhere, causing the plants and animals on Earth to mutate into monsters that are capable of annihilating humanity. Just when humanity is on the brink of extinction, humanity has found out a way to log in into Devil’s Star, and found out that they are able to obtain powers from Devil’s Star to fight against the monsters. Hence, humanity has stepped into the era of venturing Devil’s Star in order to survive……"]},{"title":"Could the Boy Next Door be a Vampire?","tags":["Childhood Friends","College life","Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Shounen Ai","Slice of Life","Yaoi(BL)"],"disc":["Read manga Could the Boy Next Door be a Vampire?","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","Navigating the uncertainty of early adulthood is no easy feat, as Hong Wooree is realizing on his year off from college. Not only is he trying to make it as a published author, but he also thinks that his best friend, Gong Minnee, is a vampire! After making some flawed assumptions, Wooree believes that Minnee’s secretive behavior comes from hiding his “true” identity– he’s completely unaware that Minnee isn’t actually a vampire, and just has a huge crush on him. While Wooree struggles to get his writing published and protect Minnee’s “secret,” Minnee must find a way to confess his feelings for the oblivious Wooree. Will these two be able to reconcile their misunderstandings and allow for a real relationship to blossom?"]},{"title":"I Won’t Go Back to My Family Who Abandoned Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Won’t Go Back to My Family Who Abandoned Me / I Will Not Return to My Family / 나를 버린 가족에게 돌아가지 않습니다"]},{"title":"Juvenile Prison","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Juvenile Prison / 소년교도소","‘Cha Ju-young’ is imprisoned in a juvenile detention center for rendering his gangster father comatose. Not long after, the father, who was thought never to wake up, comes to visit…"]},{"title":"Quest Supremacy","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Quest Supremacy / Questism / Quest Supremacism / Quest Supremacy / Quest 至上主義 / 任務至上主義 / 퀘스트지상주의","Gaming geek Suhyeon Kim hates school, and the dislike is mutual. Every day he faces relentless bullying from his classmates, leading him to wish his life was more like the RPG quest games he plays. Suhyeon’s wish is granted when a quest prompt pops up in real life with an easy quest and an enticing reward. With nothing to lose he takes the chance, and one quest soon leads to another. As the stakes get higher and the rewards get bigger, Suhyeon soon finds he’s gone from being an ostracized nobody to the top of the school. Just how far will Suhyeon take his quests, and how far will he fall if he refuses to participate?"]},{"title":"Please Take Care","tags":["Comedy","Drama","Fantasy","Manhua","Romance","Slice of Life"],"disc":["Read manhua Please Take Care / 请多关照 / Qing Duo Guan Zhao","Help! Why is my blind date my ex-boyfriend?!"]},{"title":"My Favorite Savior Girl","tags":["Drama","Fantasy","Manhwa","Music","Romance","Showbiz","Time travel"],"disc":["Read manhwa My Favorite Savior Girl / 최애 구원 소녀","As Lee Yeo-ju hums a song that comforted her during her long hospital stay, she is approached by an idol star named Park Jae-ha, whom she has only seen in videos. “I’ll help you. You need money for the surgery, right?” Jae’ha become Yeo-ju’s savior and favorite. However, five years later, he ends his life by making an extreme choice… Yeo-ju, in shock, cries out to a shooting star to save him. Did her wish come true? She goes back seven years and possesses the body of Jang Bo-ran, a top idol at the time and a judge on the audition program “I Am the Strongest Idol”… Among the audition participants is trainee Park Jae-ha! “Just like you saved me, I will save you this time.”"]},{"title":"Will you expose yourself today?!","tags":["Comedy","Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua Will you expose yourself today?! / 今天你露馅了吗？！","Mini is a “Scum Detector”, and her latest job is from a rich girl who wants to test her boyfriend’s loyalty. However, her boyfriend, Zhao Yueming, is a straightforward gentleman, and Mini’s usual methods don’t work on him. This is a bit tricky for Mini, who is used to dealing with scumbags regularly. This game of tug-of-war between the womanizer and the one who understands them best is about to begin. Who will fall into the trap of love first?!"]},{"title":"Lady Crystal is a Man","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lady Crystal is a Man / 크리스탈 아가씨는 남자다 / AKU SEBENARNYA COWOK"]},{"title":"I Was Told To Die","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Was Told To Die","I was told to die. From colleagues who I have been together with for 10 years. “I’m sorry, Rin. Die for the world instead.” Just like that, when it all felt like it was over. ‘…huh?’ Rin opened her eyes again. “You s*upid and even ungrateful girl! It seems obvious that I will be used by another guy, not knowing the grace that brought me to my castle!” After 30 years, I became an illegitimate child of the great family of Tuslena, who is called the apostle of God! * * * “You are the best talent. It would be a shame to leave you to rot here. Won’t you come with me?” Rin looked at the man who held out her hand to her. She is one of the four heroes that the world praises. A man who betrayed her former colleague Rin, wants to adopt her because she resembles his now-dead sword skills. Are you crazy? Is this an adoption shop for you?"]},{"title":"The Male Leads Were Stolen by the Extra","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The male leads were taken away by the extra / The Male Leads Were Stolen by the Extra","A woman who has lost her male protagonists to an extra who did not appear in the original story…\nThat’s me.","Selonia fell into a coma on the way back from defeating the Demon King.","After wandering through death for several months, she survived, but what?","“I want you to divorce me. I want to hurry up to marry Grace.”","“I want to make the knight’s oath unheard of.”","“Give me back my heart. I’ll give it to Grace.”","The fiancée who was the male lead, the paladin and the dragon who were the sub-male masters, and the fellows all turned away.\nThese reckless bastards! There was a lot of cursing in the danjeon, but what can I do to stop it?","I was trying to start a new life in a cool way. By the way…","“Do you know me?”\nHow is the dead demon king alive?","“What, I don’t know… .”","“No, you know me. tell me Who am I?”","To make matters worse, the Demon King, who has no memory, sticks to my side and does not leave.","Inevitably, I tried my best to prevent the return of the Demon King.","“How can I always hold your hand?”\nWhy is it not enough to spit out vulgar words?","“Are you going to kill all those who left you? Just speak.”","He’s even going to kill the male protagonists for me!"]},{"title":"I Was Mistaken As a Monstrous Genius","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I Was Mistaken As a Monstrous Genius / I Was Mistaken as a Monstrous Genius Actor / 대뜸 착각당했다 괴물 천재배우로","I, Kang Woojin, was quitting my design work and became a jobless person. The next day, my friend took me to auditions and I was forced to perform.\nAs i was given a script, the void space appeared in my mind and forced me to relive the character.\nI got stabbed. Became a serial killer. Became an Exorcist.\nAs I become an actor, the misunderstandings keeps growing day by day."]},{"title":"Childhood Friend of the Zenith","tags":["Action","Adventure","Fantasy"],"disc":["Read Childhood Friend of the Zenith","Gu Yangchun, who betrayed the Orthodox sects, became a demonic human under the Heavenly Demon.","Living as a demonic human, he led a life filled with regret. He committed countless evils not of his own accord, but under the orders of the Heavenly Demon.","In the Great Orthodox-Demon War, thanks to Wi Seol-ah, who cut down the Heavenly Demon that made even the three supremes of the Orthodox forces kneel, Gu Yangchun was taken prisoner by the Orthodox forces and suffered for his sins.","With whatever morals he had left in him, he died giving Wi Seol-ah information about the Demon Cult due to a bind the Heavenly Demon had placed on him.","Then, for some reason, Gu Yangchun regressed to when he had first met Wi Seol-ah. Realizing the regression was not a dream, Gu Yangchun decided to live a quiet life. However, bad ties from his previous life began to draw near, one by one."]},{"title":"Just Twilight","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Just Twilight / Just Dawn / 그저 여명일 뿐","Na Junyoung, a poor student, who can’t study well at home because of her abusive mom. One day, when her mom hurt her and hit her while drunk, Junyoung runs away to the mountains. Luckily, she finds an old house and uses it as her quiet place to study. But she’s not the only one who knows about it. Kwon Beom-jin, a guy known for not being so good in their area, also uses the old house."]},{"title":"I ended up living with the cursed prince!","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Mystery","Romance","Shoujo"],"disc":["Read manhwa I ended up living with the cursed prince!","Clarice, the daughter of a marquis, was taken in by her uncle, a nobleman of nobility, and raised as a tool for a political marriage. One day, with her uncle’s money, she is arranged to meet Wilbert, the second prince of the Aylford Empire! However, when Wilbert coldly rejects the proposal, Clarice is harshly blamed by her uncle for her mistake… A few days later, while Clarice is feeling depressed, she receives a letter from Wilbert. He says that he wants to give Clarice one of his mansions as an apology for the other day. However, when she arrives at the mansion, she finds a small boy covered in wounds… Clarice is suspicious, but cannot leave him alone and starts to look after him, but the boy has a shocking secret…?"]},{"title":"For The Queendom","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa For The Queendom / 포 더 퀸덤"]},{"title":"William in the Closet","tags":["Adaptation","Comedy","Drama","Fantasy","Manhwa"],"disc":["Read manhwa William in the Closet / 옷장 속의 윌리엄 / To My Juliet Boy"]},{"title":"Traces of the Moon","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Traces of the Moon / The Disappearance of the Moonlight / Wolheun / Wolhun / 월흔","One would think Asina has it all as the daughter of Cromwall’s archduke, but a serious case of the travel bug has her ditch her comfortable estate for the beautiful but deadly desert. Unfortunately, the first person she meets there happens to be Sihad Zain Behdad, the king of Cromwall’s enemy nation, Pesian. First, he throws her in prison because he finds her suspicious. Then, he captures her when she breaks out and throws her in his harem! Can Asina hide her identity long enough to escape from the Sihad, or will she fall prey to the aloof king’s unexpected charm?"]},{"title":"Golden Light Gratia, The Child Loved By God","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Golden Light Gratia, The Child Loved By God / The Child Loved by God, Golden Gratia /신의 사랑을 받는 아이, 황금빛 그라티아 / Golden Gratia","The useless troublemaker living in the slums, Gratia. One day, while believing that both the hatred from her family and the pain inflicted upon her were justified, she had a bizarre dream. “In the present and in the future, you shall walk a great path. Countless people shall gaze upon you with eyes filled with admiration, and shall not ever doubt the path you walk.” The man in her dream told Gratia that she would become a great person. “See you in the future, my lovely Gratia.” That strange and beautiful dream. After waking up from her dream, the ten-year-old Gratia realized that the dream had become reality."]}]