[{"title":"Return of the Legend","tags":["Business","Drama","Fantasy","Manhwa","Reincarnation","Shounen","Webtoons"],"disc":["Read manhwa Return of the Legend / The Legendary Return / 회귀의 전설\nDue to the situation like the second IMF, the security company Jang Taesan worked for goes bankrupt, and he becomes an unemployed man wandering around Noryangjin-dong. He loses his life saving an elementary school student who was almost hit by a car. But thanks to his good deed, he goes 14 years back in time and is welcomed to a new life.\nHowever the joy of being revived is short-lived. The thought of having to take the college entrance exam again makes me dizzy… But I remember all of the CSAT problems that I encountered while studying and the stock market graph I saw while working as a stockbroker…?! The last life was ruined, but the this next life will become a success!"]},{"title":"The Masters Are Subscribing To Me","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Masters Are Subscribing To Me","Yeon Chungwoon, who had long wished to become an outside disciple of the Wudang Sect, finds himself enduring harsh days after being singled out by his peer, Yoon Sihu, who is the eldest son of the Deokpung Yoon Clan. Suddenly, one day he hears an unexpected voice…","Thus begins the strange journey of communication between Yeon Chungwoon, who has gained a connection to the heavens, and the masters who just want to stop working late nights."]},{"title":"Rust","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Rust","“Ha maru, a butcher working at a world livestock company, is sent on a business trip to Japan at the suggestion of his boss. However, he finds himself entangled in a yakuza crime organization. Desperate to survive, he gradually discovers his talent for using knives. The butcher, now stepping into the shadows, challenges his way to the top of the underworld."]},{"title":"Maxed Strength Necromancer","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa Maxed Strength Necromancer / Li Liang Dian Man? Wo Keshi Wangling Fashi A! / Maxed Strength Stat Points? But I’m a Necromancer! / Maxed Strength Stats Necromancer / Necromante de Força Máxima / 力量点满？我可是亡灵法师啊！","Qiao Yu enters the world of the meta-Universe and gains the hidden class of a Necromancer. Unfortunately, his initial intelligence and spirit stats are both at 0, and he even draws a strangely unique talent. In a fit of anger, Qiao Yu puts all his attribute points into strength! Who says a Necromancer can’t engage in hand-to-hand combat? As Qiao Yu punches the World serpent, Yemojia, to death, players in the meta-Universe are driven mad. Bro, please, stop brawling! You’re a Necromancer! Just summon an undead, please!"]},{"title":"Living as a Maid in Confinement","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Living as a Maid in Confinement / Life as a Tower Maid: Locked up with the Prince / Surviving as a Maid of Confinement / My Life As a Captive Maid / Life as the Maid of the Prisoner Prince / 감금물의 하녀로 살아가기"]},{"title":"Dear Tyrant","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Dear Tyrant / Beloved Tyrant / 친애하는 폭군에게 / By Siksa Kubur dan Ratu Kunti","I was the hidden leader of a rebellion. I took in and ens*aved the blue knight, who because of me, would be executed. As previously promised, I was about to give him the title of a duke. “Don’t call me Knight, I’m not a knight. Please don’t even use honorifics with me. I’m not a noble.” “I am simply Your Highness’ s*ave.” Though he is a broken knight, with him, I must try and rebel once again."]},{"title":"Why Do You Love Me When I Refuse Your Request?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Why Do You Love Me When I Refuse Your Request? / Why Are You Obsessed When I Reject Your Favor?/ Why Are You So Obsessed with Rejecting Love? / Why Do You Love Me When I Refuse Your Request? / 총애를 거절하는데 왜 집착하나요"]},{"title":"The Top Couple Is a Bit Sweet","tags":["Comedy","Drama","Manhua","Romance"],"disc":["Read manhua The Top Couple Is a Bit Sweet / Sweethearts in the Spotlight / Ding Liu Fufu Youdian Tian / 顶流夫妇有点甜","Song Yan and Wen Li are a well-known contract couple in the entertainment industry. Ever since they are married, they are not in business and have not been tied together. Countless fans lament, yet many ship them together. That is until the two of them officially announced their participation in a national-level variety show for couples and they reluctantly began to come back to their career. During the recording process of the variety show, the two of them slowly discovered that their bond had already been firmly tied several years ago……"]},{"title":"The Villainess Debuts Gorgeously","tags":["Adaptation","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villainess Debuts Gorgeously / The Villainess Makes a Splendid Debut /  약녀는 회려히게 데뷔한다","Although she was born as a noble princess, her life was abandoned by her fiancé and betrayed by her family. “I don’t need to live kindly, I will live more splendidly than anyone else. Even if that’s called a wicked woman.” After her return, the prelude to her vengeance was to kneel before her cheating fiancé. But before long, “Princess! There is so much gold, they say, that the Royal Bank’s warehouses are running low!” “Princess! Every country is clamoring to serve the princess!” “Princess! Oh my God, the Emperor of the Empire has come to visit!” The world kneels before Erdella"," "]},{"title":"Auto-Hunting With Clones","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Auto-Hunting With Clones / Auto Hunting With My Clones / 분신으로 자동사냥","Sangwoo, a college student, decided to join an awakening program on an ordinary day. A system that enables even an average person to learn skills. The government has proceeded with this awakening program since a few years ago. Thus most of the population took the program and is awakened now. Sangwoo also participates in the program just like the others and gets cloning skill. The people around him think that the clone is just an illusion, but Sangwoo realises that the clone is real and decides to become a hunter. As Sangwoo was living well, using his skill, Jumper George Lucas appeared in front of him. After seeing the cloning skill of Sangwoo, he saw its potential and thus started to get interested in Sangwoo. When Sangwoo noticed what Lucas was thinking, he felt it to be a part of a big plan and couldn’t help but be nervous. Eventually, as Sangwoo was living as a hunter, he discovered Lucas’ plan and the dark secret behind it… Auto Hunting With My Clones 분신으로 자동사냥"]},{"title":"Boundless Necromancer","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Boundless Necromancer / 나 혼자 특성빨로 무한성장\n[By the studio that brought you and !] I never thought I could become a hunter. I never thought I’d get the chance. But that wasn’t the case. 「 The ‘Tower of Trials’ has selected all suitable candidates from Earth. 」 「 Please select your difficulty. 」 「 The rewards you get will be directly proportional to your chosen difficulty. 」 I was given a chance just now. A special one, at that."]},{"title":"Academy’s Genius Swordmaster","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Academy’s Genius Swordmaster / 아카데미의 천재칼잡이","Ronan lived a wasteful life filled with regrets. A second chance befalls him at the end of his futile life. He went back to the time when he was a ten-year-old child! For the people who sacrificed themselves for him, he becomes determined to live a new life."]},{"title":"A Con Artist But That’s Okay","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Con Artist But That’s Okay /  Lady Swindler / A Con Artist, but That’s Okay / A Swindler, but That’s Fine / La Revanche d’une arnaqueuse / You’re a Con Artist, but That’s Okay / You’re Swindler, That’s Okay / 사기꾼이지만 괜찮아","I. want. to. go. back!","Under the guidance of her obstinate father, Seizel had been living as ’the most perfect lady in the world’ until her demise as an unexpected murderer.","That very day when her miserable ten-year-long imprisonment was about to end with her beheading, her second life commenced.","I’m just not gonna give a f*ck!","I’ll screw them over before they screw me over!","I’ll chew them up and spit them out before they can leech off me!","No more Ms. Nice Girl. Now, Seizel decided to live however she wants!","While she was at it, she planned to become the greatest con artist who swindles the empire itself, and picked up some former cellmates to get the second act of her life going…","Why does it seem like the world’s gonna end when I’ve just made up my mind!","“……Open your eyes, you fine lad. I need to get my money’s worth.”","For a world that’s easier to exploit!","As a final, bite-the-bullet act of charity, she took in and patched up ’The Empire’s Last Guardian’ Duke Leviaus, saving him from the brink of death. Now, all he has to do is bring glory to the empire……","Wow. What kind of a sucker is this?","“About who saved me, I cannot remember anything.”","The person who saved him is me, yet I’m about to be done dirty by randos, hell no.","Thus, unintentionally gaining the title of duchess, Seizel kickstarts her ’getting her money’s worth’ project.","“As long as you pay the promised fees on time, I will act as the perfect duchess for a year.”","“That would not be necessary. Everything in this house belongs to Your Ladyship anyway.”","But this man was a sucker of another level that was never before seen or heard. Courteous, pushy, clingy.","“W-what are you doing here, Your Grace?”","“It’s our first night together, my lady.”","…and lecherous."]},{"title":"Mr. Magical Girl","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Mr. Magical Girl / 마법소녀 아저씨","202X.","In the back alleys of Seoul, South Korea…","He looked down at the heroes under his feet—the heroes who adorned themselves in a variety of colorful clothes, as if they were K-pop idols on TV.","Those heroes? They were crawling beneath him, their gaudy outfits smeared with dirt.","That was the true nature of being a hero. He hoped the individuals before him learned that lesson well.","It was time to ensure they never forgot it.","As a magical girl, he swung his hammer down.","This is a bright story. The story of a man reclaiming his light…"]},{"title":"My Husband Who Hates Me Has Lost His Memories","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Husband Who Hates Me Has Lost His Memories / My Husband Hates Me, But He Lost His Memories / 나를 미워하던 남편이 기억을 잃었다","Meet Lily Everett, the adopted daughter of the infamous Duke of Everett. She accepted this marriage for the sake of her family, her husband is named Theodor Valentino!","whose family is falling down, had no intention of accepting her.","As the story progresses, one day her husband will lose his memory…","“…When your memories return, you will regret this.”\n“No, I won’t regret it at all.”"]},{"title":"The Contract Couple: Ines & Kaisac","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhua The Contract Couple: Ines & Kaisac / Every Night of the Contract Couple / Night After Night / Night of Contractual Couple / The Contract Couple Every Night / 契约夫妻的每一夜 / 계약 부부는 밤마다 / 계약부부는 밤마다","As the adopted daughter of House Avano, Ines has always been grateful for her loving family. But tragically, half of them succumb to an ancient curse, and only after does she find a way to lift it. An oracle says that she must marry the cold and cruel duke, Kaisac Aljert, to prevent the deaths of the rest of her family. So she enters into a contract with him, but he has a rather steamy stipulation that he wants every night. Can Ines handle Kaisac’s passion when she just wants to save her family?"]},{"title":"Duke Please Fail!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Duke Please Fail! / Your Grace, Please Fail for Once! / 공작님, 제발 좀 망하세요!\nWhile toiling away at Alterwood Duchy, I worked myself to death and actually died.\nWhen I opened my eyes, I found myself in the past, and I was determined to seek revenge for my overworked demise.\nDuring my time as the steward, I swore to ruin the arrogant Duke’s territory and make him pay for his misdeeds!\nWasting the budget in all the wrong places and entrusting the fields to an infamous layabout, attempting to sabotage the crops…\n“Isn’t this an enormous harvest like never before?”\n“Thank you. The steward saved us!”\nStrangely, everything seems to be going well!\nI even managed to get back at the Duke himself this time.\n“You’ve laid a hand on me, so you must take responsibility. I need you, Nelly.”\nSuch an unexpected twist? No, I still need to seek revenge.\nDuke, please just go down without a fuss!"]},{"title":"Princess Summoning the Monster","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Princess Summoning the Monster / The Lady Who Summons Monsters / 괴물을 부르는 공녀님"]},{"title":"The Villainess Doesn’t Need A New Husband!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Doesn’t Need A New Husband! / 악녀님에겐 새 남편 따위 필요하지 않아요!"]},{"title":"Transcension Academy","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Transcension Academy","SeoJoon, who had been working to save in order to pay off his dead parents’ debt and to attend a hunter academy, ended up needing to spend all his savings for surgery due to an unfortunate accident. In his moment of despair, a weird ad played. [You can also become an awakener!] He decided to register since he had nothing else to lose. [Mr. Kim SeoJoon, welcome to Transcension Academy.] This hunter academy is on a different ‘dimension’ than other hunter academies! In the age of private hunter education, you can also become a ‘transcended’!"]}]