[{"title":"Lord Baby Runs A Romance Fantasy With Cash","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Lord Baby Runs A Romance Fantasy With Cash / Surviving a Shoujo With Coins / 아기님 캐시로 로판 달린다","I lived suffering without a home, religion, or parents, but an angel appeared and reincarnated me.","“You, a pro when it comes to romance fantasy novels, would you like to reincarnate in a world that was created based off of a romance fantasy novel?”","I reincarnated because he said I would have a (handsome) dad and a (handsome) older brother who would spoon feed me, and even gift me a diamond mine, but…","-I might be a child from my mother’s affair?","As soon as I was born, I was sent to my mother’s household and fell into a family that deprives me.","“If I stay like this, I might end up freezing or starving to death by myself!”"]},{"title":"I’m Looking for a New Husband","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Looking for a New Husband / 새 남편을 구합니다","Riat, caught up in her husband’s treason, faces death. After repeatedly returning to the past at the cost of half her lifespan, she finally breaks the cycle by offering her husband’s head to the emperor. With only 1 year and 3 months left to live, her one wish is— “I’m going to fall in love.” At last, an announcement spreads across the entire empire: a competition to find Riat’s new husband, with a grand prize of 1 billion gold. Candidates begin to flood in, but suspicious figures also start gathering around her…"]},{"title":"I Will Surrender My Position as the Empress","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Will Surrender My Position as the Empress / 황후 자리를 버리겠습니다","Adele was greeted by Emperor Karl’s “beloved” concubine upon their arrival at Ehmont Palace on the day of her wedding. To hear his concubine say “I want to enlighten you about his Majesty’s likes” was alarming.","She wed the Emperor, whom she had never met before. He showed up late to the ceremony and then immediately left to visit his beloved concubine at his palace.","The one person Adele was certain wouldn’t show up for her wedding invitation, the Duke of Valdre and Commander of the Imperial Guard, Lionel Baldr, had unexpectedly arrived."]},{"title":"Levelling Up In An Exclusive Dungeon","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Levelling Up In An Exclusive Dungeon / Level Up Through Dungeon Exclusivity / Leveling up by Monopolizing the Dungeon /던전 독점으로 레벨업"]},{"title":"Wasn’t this supposed to be a strategy game?","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Wasn’t this supposed to be a strategy game? / 이거 전략게임 아니었나요","I’ve possessed a hidden character in a notorious strategy game with a 0% clear rate. To escape this game, I must bring peace to the empire… “So, from now on, I’ll trust only you, Priest.” “You’d better give up on that plan.” “Priest, did you really use me?” “For some reason, I feel something special from you, Priest.” “You promised you’d come back.” …Why is my favorability rising, and why does it feel like this is turning into a reverse harem? Excuse me, wasn’t this supposed to be a strategy game?"]},{"title":"The Daddy Dilemma","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Daddy Dilemma / Looking For My Baby’s Father / My Baby’s Father Is Wanted / The Daddy Dilemma / 子供の父親を探しています / 애아빠를 찾습니다","After her coming-of-age ceremony, Lisian wakes up to find her room a mess. She’s shocked that she seemingly had a wild night with a stranger, but even more shocked to learn she’s pregnant! Now the question is — who’s the father? Her childhood friend, the crown prince, or a younger brother-like figure?"]},{"title":"I Want To Become The Emperor, So I Need A Divorce","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Want To Become The Emperor, So I Need A Divorce / 이혼해 주세요, 황제가 돼야 해서요","Born as an imperial princess, Arnoah was forced to marry a pathetic king from a small neighboring kingdom. Her older brother is the emperor, so what is she supposed to do? She wondered if her good for nothing husband would die after being assassinated, either because he cheated on his wife or not. Then as the next in line to the throne, the emperor will be Arnoah… or not. It’s her s*upid husband. Any title she inherits shall be vested to her husband in accordance to their marriage contract. She is determined not to let this happen until the day she dies.\n“I need to get divorced and become the emperor.”\nHer ex-husband doesn’t know anything yet, so she decided to act like a crazy queen and said everything she wanted to say to her husband. When he realized the truth, it was already too late. She spoke to her ex-husband who had his mouth agape.\n“I told you to keep your head straight. Didn’t you hear me?”"]},{"title":"How the Count’s Young Lady Tames the Emperor’s Dog","tags":["Drama","Fantasy","Romance","Shoujo","Webtoons"],"disc":["Taming the Emperor’s Hound / 백작가 영애가 황제의 번견을 길들이는 방법 / 伯爵令嬢が皇帝の番犬を手懐ける方法 / How the Count’s Young Lady Tames the Emperor’s Dog / How the Countess Tames the Emperor’s Guard Dog","Esmeralda, the Count’s daughter, is forced to enter into a political marriage by her father. But she asks Alphonse, whom she first met at a ball, to date her, as she wants to find her own destiny. Alphonse’s identity turns out to be the Emperor’s ‘watchdog’, who settles cases in the underground society for the Empire. It was Alphonse who started this relationship only to use Esmeralda for his mission, but his heart is gradually drawn to her, rushing without hesitation. Meanwhile Esmeralda who has been working hard and dating hard, gets caught up in the middle of Black German-Iris’s conspiracy…"]},{"title":"Master of Ancient Divine Weapons","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Master of Ancient Divine Weapons","Han Zhan Travels Through Different Dimensions: The girls here can transform into divine weapons and form contracts for battle. The boys, on the other hand, awaken as spirit contractors and form bonds with the girls to fend off insect swarms. As a traveler from another world, he was shocked to find that the ones being neglected were actually the renowned ancient divine weapons."]},{"title":"Return of the Runebound Professor","tags":["Action","Adventure","Fantasy"],"disc":["Read Return of the Runebound Professor","Magus Vermil was a scumbag — the most hated professor at a magic academy. Then someone murdered him. He never would have been heard from again if not for a lost soul from Earth by the name of Noah Vines…."]},{"title":"The Childe","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Childe / 귀공자","“Jin Taeha,” the successor of Korea’s leading company “Cheongu,” survived alone after a terrorist attack during a yacht trip with his family. “Jin Taeha” who learns that his family was killed not by accident, but due to power struggles amongst his relatives. Enters the “Salerno Family” an Italian mafia family, to prepare for his revenge.\nAfter 17 years, he returns to Korea and finally begins his revenge."]},{"title":"Imprisoned One Million Years: My Disciples Are All Over The World","tags":["Action","Manhua","Martial Arts"],"disc":["Read manhwa Imprisoned One Million Years: My Disciples Are All Over The World / Ten Thousand Year Stranded: Disciples Covering the Whole Vast Universe / Trapped for Millions of Years: Followers All Over the World / 被困百万年：弟子遍布诸天万界\nLu Chen, an immortal, was trapped in the Chaos Realm for many years, when he awoke again he discovered a whole different world. The old continent shattered into countless pieces, the north and south poles reversed, the heavenly suns went from nine to one, the wild beasts vanished, and the humans, who had only one. small wild country a long time ago, have spread all over the world. A mangy dog he’d picked up in the past turned out to be the ruler of a kingdom, and a little girl he kindly adopted turned out to be an immortal …"]},{"title":"One Husband Is Enough","tags":["Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa One Husband Is Enough / 남편은 한 명으로 족하다 / Semua sayang female lead","<I thought life would be fun if everyone loved me.> An ordinary office worker gets enchanted by the allure of a romance fantasy game, possessed by the character whose charm is 999 points, the Count’s daughter ‘Crochetta’. People rushing to her in frenzy as soon as their eyes meet hers. Crochetta decides to conquer the “male leads” and escape the game. The libertine prince, the misanthropic duke, the devoted knight. But all the male leads here seem suspicious. Moreover, it seems her powers don’t work on them… Can she successfully conquer the male leads and reach a safe ending?"]},{"title":"Legally, Dad","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Legally, Dad / Seolyusang Appa / Step Dad On Paper / Stepdad on Paper / 서류상 아빠"]},{"title":"Please Leave Emily Alone","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Please Leave Emily Alone / Please Leave Miss Emily Alone / 제발 에밀리 영애는 내버려 두세요","Emily Addisio, with her acceptance letter in hand, enters the academe, featuring of a happy academy life, but she suddenly gets into an accident. Ethan Valenti, who accidentally helped her, gradationally becomes attracted to Emily, and Emily also feels shocked by his aggressive style. Before Emily could feel a strange sense of relief, he seized the window hedge with his right hand, which reached up to his midriff, and fluently jumped inside the structure. ” What?” In a moment, a dark shadow fell on Emily, who was amazed by the unforeseen narrow distance. That was because Lord Valenti, who is higher than her, was looking at her with his reverse leaning against the window. And as the shadow girdled her, Emily artificially tried to step back. But before she could move, Valenti reached out to snare the handkerchief she was holding.” Thank you, Emily. That was kind of you, but you did not have to return it.” The beautiful romantic story of Emily, which is ordinary but always girdled by extraordinary situations, and Ethan, who gave her his first and last love."]},{"title":"Everyone’s Darling","tags":["Drama","Fantasy","Manhua","Reverse harem","Romance","School Life","Transmigration"],"disc":["Read manhua Everyone’s Darling / Another Me / Bao Jin Wo De Xiao Majia / Bào Jǐn Wǒ De Xiǎo Mǎjiǎ / Giữ Kín Thân Phận Giả Của Tôi / Holding My Mask Tightly / Man Ji Da Lao Fan Ci Yi Hou / Sau Khi Mãn Cấp Lão Đại Lật Xe / Ôm Chặt Áo Gile Nhỏ Của Tôi / お嬢様がしくじった後 / カンスト令嬢が没落した後 / 当满级大佬翻车以后 / 抱紧我的小马甲 / 满级大佬翻车以后 / 만렙 보스의 부캐 생활","The daughter, raised by the wealthy Lu family for over a decade, turned out to be an imposter! Yao Huo was sent back home to her “poor” birth parents. However, her father gave her an unlimited black card, and she met her four older brothers, which made her question everything. Were her birth family supposed to be penniless? And were her brothers supposed to be useless deadbeats? Even her ex-neighbor, the man who used to drive a beat-up car, seems to have a secret identity…"]},{"title":"But Please, Help Me","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["But Please, Help Me / 다만, 구하소서 / Please Save Me","This time, it’s my turn to save you. After being freed from a painful existence with the help of her ex-fiancé Prince Vicente, Elena wakes up inside the body of Evelyn, an orphan girl. 2 years later, Elena discovers that Vicente has been locked up in a palace for her death. With this, she who was once saved now seeks to be the savior."]},{"title":"The doomsday ruthless man: hoarding trillions of supplies at the beginning","tags":["Action","Adventure","Fantasy"],"disc":["Read The doomsday ruthless man: hoarding trillions of supplies at the beginning / 末日狠人：开局囤积万亿物资","The earth is affected by unknown energy, the core expands, and natural disasters and doomsday come. Extreme heat, earthquakes, volcanic eruptions, floods, severe cold… natural and man-made disasters come one after another! Su Chen struggled through the apocalypse and finally entered the safe zone, but was betrayed by his girlfriend in the end! Reborn and returned to one month before the end. This time, I only live for myself!"," "]},{"title":"I Contracted Myself","tags":["Action","Comedy","Fantasy"],"disc":["Read I Contracted Myself / 我契约了我自己","This is a world where Awakened and Mutated Beasts coexist. Zhang Ping is fortunate enough to become an Awakened, but his ability is rated as useless. Unwilling to live a mediocre life, he resolutely swallows a contract gem that ordinary people avoid like the plague. He contracts with himself, becoming his own summoned beast! From then on, the whole world opens up for him. With ever-changing superpowers, endless mutant beasts, and perilous parallel worlds, anything is possible."]},{"title":"Luce: My New Identity as a Contract Wife","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Luce: My New Identity as a Contract Wife / Luce – Fukushuu no Tame Reikoku Koushaku no Keiyaku Tsuma ni Narimasu / ルーチェ～復讐のため冷酷侯爵の契約妻になります～","When Claudia’s father dies, her stepsister ensures she loses everything -her family, her home, her status-and sells her to live out the rest of her days in a squalid brothel. At her lowest point, one person reaches out to her: a ruthless marquess known across the nation as the Crimson Devil. Vowing revenge, Claudia joins hands with the marquess to rebuild her life as his wife, Luce, and seeks out revenge against her stepsister. What comes to follow is a tale of revenge that will shake the very foundations of the nation’s court…"]}]