[{"title":"The villain tyrant has returned","tags":["Romance"],"disc":["Read manhwa The villain tyrant has returned / 악역 폭군이 회귀해 버렸다","“If you want, it’s okay to die.” The ‘tyrant’ Ludwig Magenta, who met his end at the hands of his beloved empress, Olive Charlotte. The moment he accepted death, he opened his eyes in the garden where he first met her when he was 12. If he started from scratch, would he be able to change his previous tragic life? Ludwig’s time begins only to win Olive’s love."]},{"title":"The Newbie is Too Strong","tags":["Action","Adaptation","Adventure","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Newbie is Too Strong / The Overpowered Newbie / ビギナーなのに強すぎる！ / 菜鸟手握通关秘诀 / 뉴비가 너무 강함","JaeJu (which means “skill” in Korean) grew up without parents in an orphanage skillfully, just like his name suggests. One day, he heard that the orphanage was having a hard time and would have to close in 3 years. While trying to raise money for the orphanage, JaeJu got an alert on his phone. On it, he saw a video of himself climbing the tower as a BJ (broadcasting jockey aka streamer). Seven years ago, a tower suddenly appeared and randomly took people into it. If you successfully complete the tower and become an “Awakened”, it’s only a matter of time before you get rich!"]},{"title":"Sovereign and Heartburn","tags":["Fantasy","Magic","Manhwa","Romance"],"disc":["Read Sovereign and Heartburn / 君主様に胸やけ / 주군, 속이 쓰립니다","The main character, Aria, is a career woman who serves as the captain of the prince’s guard at a young age in the Rosenberg Empire. Her lord, Prince Julius, not only possesses immense wealth and power but also has a stunning appearance that everyone can’t help but acknowledge. Unfortunately, his personality is a total disaster. Aria is fed up with being tossed around by him every day. But surprisingly, Julius might just want to be with Aria…?? It’s the divine-looking prince versus the overworked female knight, and a precious master-servant bickering couple is born!"]},{"title":"Bad Bastard that Can’t Be Cheated","tags":["Drama","Fantasy","Manhwa","Mature","Office Workers","Romance"],"disc":["Read manhwa Bad Bastard that Can’t Be Cheated / Bad Things That Can’t Be Stopped / Unbreakable Bad Deeds / 끊을 수 없는 나쁜 짓","“Meet me three times.” “Is it that you want to meet three times, or do you want to sleep together three times?” A faint smile curved his lips. “Of course, the latter.” A bold and intense romance between two people, with no compromises."]},{"title":"A Flowery Path for the Devastated Male Lead","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa A Flowery Path for the Devastated Male Lead / A Flowery Path to the Ruined Male Protagonist / Until The Tragic Male Lead Walks Again / 피폐물 남주에게 꽃길을","I have been reincarnated into a ruined novel and that was also right before my favorite character became the villain! If things continue like this, it is certain that my favorite character will become the villain and die. I can’t let my favorite character die, so i’ll do my best to protect him. But how? By marrying him!!"]},{"title":"100-Day Romance","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa 100-Day Romance / 100 Days of Romance / 100日のロマンス / 100일의 로맨스 / 百日罗曼史","In her final moments after being hit by a car, Yoon Jaeyi regrets never having been in a relationship. Fortunately for her, the god of the afterlife is really into returnee stories and has decided to turn back time for her! Jaeyi now has 100 days in which to find a boyfriend if she wants to keep living. Maybe this will be the nudge she needs to confess to that cute regular at her cafe! Or, when her childhood friend returns from overseas, she might finally get the romance she’s always dreamed of."]},{"title":"Earth’s Dawn","tags":[],"disc":["Read manhwa Earth’s Dawn","As strange phenomena continue to occur on Earth, Chen Chu accidentally joins the “Earth Dawn”, a cooperative organization of Earth and self-conscious aliens. From then on, she will also embark on a journey to understand…"]},{"title":"I’m Imprisoned By The Mad Dog I Raised","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Imprisoned By The Mad Dog I Raised / I Was Locked Up By The Crazy Dog/ 내가 키운 미친개에게 감금당했다 / I Was Imprisoned By My Own Mad Dog / I Was Held in Captivity By The Crazy Dog I Raised","Luckily, I was possessed by a romance novel, but I was an extra who would die at the hands of a traitor. And it was in a 19+ novel. ‘This is so bad.’ Elizabeth tried to stop the rebellion in order to survive, but… The original Elizabeth had an inappropriate relationship with the future traitor, and even committed a terrible act against him! She wanted to free him out of guilt… “No way. Betrayal.” He who claimed to be her dog returned to rebel just like in the original. “If you abandon a dog that was already abandoned, it might bite its owner this time.” With eyes that were half-mad."]},{"title":"The Old Man of the Otherworld’s Convenience Store is Actually the Strongest","tags":["Action","Adventure","Drama","Fantasy","Magic","Manhwa"],"disc":["Read manhwa The Old Man of the Otherworld’s Convenience Store is Actually the Strongest"]},{"title":"The Flower Dance and the Wind Song","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Flower Dance And The Wind Song / The Flower Dances and the Wind Sings / Bunga Menari dan Angin Bernyanyi / Flowers Dance and Wind Sings / Las Flores bailan y el Viento canta / The Dance of Flowers and the Song of the Wind / The Flowers Dance and the Wind Sings / Танец цветов и песнь ветра / Цветы танцуют и ветер поет / 꽃은 춤추고 바람은 노래한다","As Ersella lies on her deathbed, she has only one regret: never being a good mother to her son, Vicente. When fate sends her back three years, she gets a chance to make things right. While reflecting on her past as a young bride and reluctant mother, Ersella begins to untangle years’ worth of heartache. But as familial, marital, and even political issues enter the picture, she realizes there’s more to her second life than she thought. Will Ersella’s change of heart be too little, too late?"]},{"title":"Back to Spring","tags":["Drama","Fantasy","Romance"],"disc":["Read Back to Spring / 溯洄春时"]},{"title":"You Turned Off the Pain Setting?","tags":["Adventure","Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa You Turned Off the Pain Setting? / 통각 설정 꺼놨다니까요?","**Pain Perception 0, Capture rate is 100!** A virtual reality game with pain perception set to ‘0’. I was the first to clear all endings, and started the final 100th playthrough… but something is off. Suddenly, I have a strange disease with a terminal setting, and the capture target characters are starting to worry about me. I don’t feel any pain, so should I pretend to be sick? Before I knew it, to the capture target characters, I became a noble hero enduring pain and sacrificing for world peace. Since it has come to this, the concept for this playthrough is a terminally ill hero throwing herself for the world! I must end it with a happy ending. This is my last playthrough in my life!"]},{"title":"I Saw the Future With the Killer Grand Duke","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Saw the Future With the Killer Grand Duke, I Saw the Future With the Killer Archduke, I Saw the Future With the Murderous Archduke, Peony: I Saw the Future With the Killer Grand Duke, Peony: Vi Mi Futuro Con El Gran Duque Asesin, 피오니 살인귀 대공과의 미래를 보았다","Pretending to be good, pretending to be weak, pretending to be pitiable.","I possessed the body of Gabriella Nashiret, a villainess who managed a three-piece anger combo on the reader.","And to escape my predestined death, I requested a contract marriage with Ernst Eckes, the Grand Duke of the North.","So, far from the setting of the original work, the three years I spent with my husband were very sweet.","Even so, it all ended with my death.","“If you and I are given another life, I hope we’ll meet again.”","But when I woke up again, I found out that I was the daughter of the man who killed me.","Do I even have to have an arranged marriage with my ex-husband?"]},{"title":"Absolute Necromancer","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Absolute Necromancer / All-Master Necromancer"]},{"title":"How to Live as an Illegal Healer","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How to Live as an Illegal Healer / How To Live As An Unlicensed Healer / How to live as a fake healer / How to Live as a Bootleg Healer / 야매 힐러로 사는 법"]},{"title":"Our Majesty Has Changed","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa Our Majesty Has Changed"]},{"title":"Sleeping Ranker","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Read manga Sleeping Ranker","#game fantasy #game system #satisfying #enjoyable #Sleepyhead “We’re only taking a break for about 30 seconds? I’m not imagining things, right?” “…Yes.” After 15 hours of hunting, Hyunsung asked to rest for a while, and after 30 seconds, he had to get up again and started hunting. Actually, Hyunsung has a special skill. [Thananos’ narcolepsy skill is activated.] [You’re being forced into a sleep state.] After sleeping for a while and waking up, I got an item? Pay close attention to the story of the God-Rank Class, the descendant of Thananos, the unstoppable Hyunsung."]},{"title":"A.I. Doctor","tags":["Action","Drama"],"disc":["Read manhwa A.I. Doctor / A.I. 닥터","AI Baruda for diagnostic purposes developed by Taehwa Group for the future! During his first year as an internal medicine resident, Lee Soo-hyuk was caught in an unknown explosion while visiting Baruda and lost his mind. And when he wakes up again, he encounters the AI ​​Baruda that exists in his head. The two have already become a relationship that can never be separated. Baruda, whose purpose is to continue deep learning and become the world’s best diagnostic artificial intelligence, and Soo-hyuk, who have been striving for success even in difficult environments, will work together to treat patients and begin their activities with the goal of becoming the world’s best physician."," "]},{"title":"A Ghostly Song","tags":["Drama","Historical","Romance"],"disc":["Read manhwa A Ghostly Song","Since childhood, Noah has been plagued by a debilitating condition – hallucinations. When a mysterious murder rocks the town, the voices whisper that Noah holds the key to the killer’s identity. As Noah grapples with the truth, a series of unsettling events begin to unfold around her."]},{"title":"Falling Blue","tags":["Drama","Romance","School Life","Shoujo Ai"],"disc":["Read manhwa Falling Blue / Dropping Blue / Zhuì Lán / 坠蓝","“Warning: Yuri content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nLin Ling is unfortunate in everything she does… Until the day she met Fang Wan, a kind and perfect senior. She unconsciously grew attracted to her. Somewhere in the vast universe, there is always someone who is closely connected with you, and if fate allows, you will never be alone. [English: BBLOVER, PR: Zax ; BBL Scans]"]}]