[{"title":"The Perks of Being a Villain","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Perks of Being a Villain / The Merit of the Villain / 악역의 메리트","An orphan in real life one day wakes up as a main character in a novel she was reading. An orphan in the novel as well, she is adopted to a villainous family who served as the main adversary against the main character in the original plot… except, the family seems way nicer than she expected. Are these really the same villains that caused so much pain the novel?"]},{"title":"THE Son of a Dragon! Mommy is a criminal","tags":["Fantasy","Manhua","Romance"],"disc":["Read manhua THE Son of a Dragon! Mommy is a criminal / 龙崽来袭！妈咪狠又辣","Five years ago she left an egg, saying, «This is the son I will give you, and when he grows up, it will be my time to return.» A few months later, the son hatched with two shiny little dragon horns on his head, but she was nowhere to be seen. She disappeared for five years and he went mad for five years until the little dragon cub brought back a woman….. But the little dragon cub said, «Dad, she saved me, I want to give her my life!». From then on, father and son engage in an open and dark battle for her favor."]},{"title":"Seduce the Villain’s Father","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Seduce The Villain’s Father / Flirting with the Villain’s Dad / Agdaui Appareur Kkosyeora / 反派父亲的攻略指南 / 快去搞定铁壁皇帝! / 악당의 아빠를 꼬셔라","Upon opening my eyes after a bus accident, I found myself in the fantasy world of a webnovel I enjoyed reading… the only catch is, I reincarnated 20 years before the novel begins! Reborn as Princess Yerenica of the small Lebovny kingdom, I’m determined to change the future in order to prevent the series of unfortunate events that will soon occur.","In the original story, my older sister, Tejavia, is pregnant with the future female lead, when she’s suddenly kidnapped by the Belgoat Empire’s emperor. But in my desperate attempts to protect her, I got kidnapped instead!","And as if that wasn’t bad enough, my body is ridiculously weak to magic. But… strangely enough, whenever I’m by the emperor, I feel fine!","The only way to save the emperor, who’s destined to die at the hands of his own son after marrying the villainess, and save myself from being afflicted by magic… is for us to marry!","“Marry me, Father.”\n“Father? Princess, I haven’t married yet, nor do I have any kids…”"]},{"title":"The Princess Doesn’t Want To Marry Her Ideal Type","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Princess Doesn’t Want To Marry Her Ideal Type / 공녀님은 이상형과 결혼하기 싫어요 / TPDWTMHIT / Her Ladyship Objects to this Marriage!\n“My youngest daughter.” “Yes, Father.” “This Father swears. That at any cost I’ll find your particular, complicated, and confusing ideal type!” “Yes, Father.” The third Duchess Kiriel Empoleon of the empire’s greatest knight family Empoleon, while responding without interest, thought, ‘As if a person like that would exist when in the first place I made up that ideal type because I don’t want to get married.” But Kiriel overlooked two things. The first, her romantic father, if it’s about his children, his spirit blazes with passion, and the second, in Condition 3, she didn’t write exactly what kind of talent he must posses. “My youngest! This Father of yours! Finally in 10 years! Your ideal type! I found them of course!” At that, “Almost 300 years ago in the holy war! Although he’s a sorcerer, who were the enemy of knights!” “I’m going to go lose my mind.” “Huh?” “Nothing.” The mess that I made, I have to clean it up,. “Relel, relellellou.” “It’s read Edwin Solite Reli-ge-use” “Relige… Anyways, why are you in here?!” First, I need to chase out that person with the hard name. The story of a woman who asked for a fake ideal type, and a man who is pretending to be that fake ideal type."]},{"title":"Longing and Lies","tags":["Drama","Fantasy","Historical","Manhwa","Music","School Life"],"disc":["Read manhwa Longing and Lies / 동경과 거짓말 / Admiration and Lies / Yearning and Lies","Edelweiss Millan is a transfer student who sincerely longs for music. However, if he wishes to continue attending the music academy, he is threatened to pretend to be the successor of it instead of the real one. With this, he struggles to maintain his fake identity."]},{"title":"Deep Sea’s Son","tags":["Comedy","Manhua","Romance","Shoujo"],"disc":["Read Deep Sea’s Son / Song of the Deep Sea / Song Of The Sea / 深海之歌","A modern re-tail of The Little Mermaid. Featuring a delusional mermaid, and a whimsy “prince“."]},{"title":"Save me, Princess","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Save me, Princess / Princess to the Rescue! / 구해주세요, 공주님 / 公主病也能做勇者 / 助けてください、王女さま！ / เจ้าหญิงผู้กล้าท้าปีศาจ / Princesse, sauvez-moi ! / Prinzessin, auf zur Rettung!","Claudia De Porto is a dear princess of Porto who was about to have the most perfect 19th birthday party with her brother Juverin, who had prepared her birthday party to be everything she dreamed of, and Prince Kim, who was going to propose to her. However, right in the middle of Prince Kim’s proposal, Porto Castle bursts into flames from Demon King’s attack. Later, Claudia finds out that her kingdom has lost its valuable treasure and her brother a heart from the attack. Claudia falls into the great spirit Desire’s plan and becomes the next hero to save her brother and her kingdom. But… she has to go on the journey with her ex-fiancé, Demian Alphen. Will Claudia, who grew up sheltered by her brother Juverin her whole life, be able to cross the forbidden sea of death and get everything back from the Demon King? This is a story of a clueless princess becoming the next hero of the world through a journey she goes on to save her brother and her kingdom."]},{"title":"Insolence is Her Middle Name","tags":["Drama","Manhua","Romance","Yuri"],"disc":["Read manhua Insolence is Her Middle Name / Presumptuous / Fangsi / 放肆","Tang Ruoyao, who was only 22 years old, claimed the title of Best Actress. The following day, the media published an overwhelming press release, hailing her as “Little Qin Yinong.” A skilled reporter interviewed both of them regarding their impressions of each other. Qin Yinong grinned like a fox, and said, “She is unfamiliar to me.” Tang Ruoyao, in a rather formulaic tone, responded, “Queen Qin is a senior whom I greatly respect, and I hope for the opportunity to collaborate with her.”"," "]},{"title":"I Became the Tyrant’s Translator","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Tyrant’s Translator / The Tyrant’s Translator / 폭군의 번역기가 되어버렸다","Mikael, a tyrant more alone than anybody else, and Leticia, the only one who truly understands him. She stays by his side for a decade, serving as his interpreter as she is the only person who can understand him. She announced her resignation so that she may enjoy her second life… “I’m begging. Please stay by my side.” The tyrant, in fact, had been deceiving everyone by speaking solely in riddles. “Why did you do this?” Mikael slowly spoke to Leticia who was overwhelmed with shock and betrayal. “Because it’s the only way to keep you by my side.”"]},{"title":"I’m Not a Warrior!","tags":["Action","Adventure","Comedy","Drama","Fantasy","Magic","Manhwa","Romance","Shoujo","Supernatural"],"disc":["Read manhwa Accidental Warrior / I Am Not a Warrior! / I’m Not a Warrior! / I’m Not the Hero / 私は勇者ではないんです！ / 魔女无法悠闲生活 / 저는 용사님이 아닌데요!","“I’m a witch!” After ending the difficult life of Cheon Eun-ha due to an accident and bad luck, Bris was reborn as a witch in a fairy tale. Even from his friend Sion, he hides the fact that he is a witch and lives alone a little far from the village. Then one day, her fairy appears in front of her and she calls herself her dragon lord. “Yes? Fairy Ariel? Maybe the protagonist of that fantasy fairy tale? It’s unfair that the place of reincarnation is in a fantasy fairy tale I read by chance, but I have to become a hero to defeat the demon king! How can a witch do that?” And Bris finds out the truth about another witch… Is the villain in this fairy tale really the villain?"," "]},{"title":"When The Count’s Illegitimate Daughter Gets Married","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa When The Count’s Illegitimate Daughter Gets Married / My Unexpected Marriage / Kont’un Gayrimeşru Çocugu Evlenirse / Когда незаконнорожденная дочь графа / 当伯爵家的私生女结婚时 / 백작가의 사생아가 결혼하면","“Dirty wench! You stole my necklace!” “Unless I knew where your necklace was, I wouldn’t have been able to take it.” As an illegitimate child, Laritte’s biggest sin was being born. In the year she became an adult, she was sent to marry the ghost duke who was rumored to be dead. Her miserable life seemed to get worse and worse, however… Her life changed when the duke came back alive. “Madam, how do you like it?” Kind servants, “You have enough luxury to buy some residences in the capital.” “…no one will be able to look down on you anymore.” And the empire’s devoted and murderous duke. It was already too late for those who tormented Laritte to regret it."]},{"title":"The Dark Prince Is Hard To Please","tags":["Historical","Isekai","Manhua","Shoujo"],"disc":["Read manhua The Dark Prince Is Hard To Please / 黑化王爷超难哄","Since novelist Qiao Xiaoqi changed the ending to her novel, she was cursed to isekai into her own story as the female lead who gets killed by the male lead! When the personality of the male lead, Jun Mojue, grows more and more twisted due to constant persecution”, “Qiao Xiaoqi tries to stop him from going down this dark path. At first, she just wanted to decrease his darkness percentage so she could go home, but soon she started to have real feelings…"]},{"title":"Being a Maid is Better than Being a Princess","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa Being a Maid is Better than Being a Princess / 공주보다 시녀가 천직이었습니다 / It’s Better to be a Maid than be a Princess / A Maid Was More of a Calling Than a Princess","Cianna Asylond von Silité was a princess from a small kingdom. At least, before the imperial army invaded her kingdom… Moments before the merciless Crown Prince of the empire beheaded her, Cianna screamed, “Please, spare me!!!” With her desperate voice, Cianna begged the crown price, whose beautiful face was stained red with blood. “” I acquired many talents from the palace, wouldn’t it be perfect if I were just a maid? That is how Cianna became an apprentice maid. But to her surprise, this job actually suits her! The corridor was clean with one swoop. When she kneaded and baked the dough, it would turn into sweet cookies. When she washes the bedding, it becomes white and fragrant! She was just doing her best as a maid, but the Imperial family had slowly opened their hearts to Cianna. “” The tea you brew is always the best. “” You made this dress? It’s really pretty. “” I’d like to entrust the prince’s education to you. However, she never imagined she would even capture this man’s heart, too… “” I’m the same. “” … “” I also can’t live without you, Cianna. Cianna shut her eyes tightly after hearing the crown prince’s heartbreaking voice. Excuse me, Your Highness. I just wanted to live as an ordinary maid!"]},{"title":"The Life of Maria Lewellin","tags":["Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa The Life of Maria Lewellin / Insaeng-eun Malia Leuwellincheoleom / 인생은 마리아 르","",""]},{"title":"The Obsessive Male Lead Made Me The Female Lead","tags":["Adaptation","Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Obsessive Male Lead Made Me The Female Lead / Obsessed Male Lead Made Me The Main Character / 집착 남주가 나를 주인공으로 만들었다","[Welcome to 『The Opponent of the Dragon』.] “Oh my, the book talks!” [I am a guide for travelers who have transmigrated into the novel.] I possessed the body of Tiarozety Isol, a supporting character in 『The Opponent of the Dragon.』 The book will send me back to my world as soon as I complete the ending of the male lead, Lexion. The problem is, I’ve never read this book before. Besides… [If the development of the story deviates from the original, the traveler gets a penalty right away.] “Penalty?” [Yes. The penalty is that the novel proceeds in the direction the traveler doesn’t want the most.] “Oh my god.” I was able to play the role of Tiarozety firmly. But then, I suddenly fell in love with the male lead, Lexion Sparrow. “I’ll miss you.” I was able to complete the ending by dying for him. However- There was a problem with the ending. Thus, I returned to the beginning of the novel again. Somehow, I was sent back again inside the novel on my way home. And- “Titi, choose me. Not this damn fate.” “………” “Choose me, even if the path is rough. Because I’m ready for anything.” And that’s how… Lexion, the male lead, began to cling onto me."]},{"title":"My Younger Brother’s Friend Can’t Be This Big!","tags":["Adaptation","Adult","Drama","Fantasy","Manhwa","Mature","Office Workers","Romance","Slice of Life","Smut"],"disc":["Read manhwa My Younger Brother’s Friend Can’t Be This Big!","“Noona, you’re not planning to hit it and quit it, are you?” I never expected to see my boyfriend of two years, whom I was shopping for a birthday present for at the department store, walking hand in hand with an old friend of mine. I was completely wasted when I accidentally ran into my younger brother’s friend. So far, no problem. “Noona, are you okay?” But why am I on his bed?? “D-Did we sleep together?!” “We haven’t slept together yet…” “…What?” “Because last night, you said… with a cock like mine… it should be savoured sober…” Is it because I let my guard down with my younger brother’s friend who is young, good-looking, and well-endowed? Something seems seriously off. “What are you talking about? Us, dating?” “Noona, you’re not planning to hit it and quit it, are you? My body, my heart, even my virginity, I’ve given you everything…” He could have girls lining up for him, so why is he doing this to me?!"]},{"title":"The All-Knowing Cultivator","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhua The All-Knowing Cultivator , Omniscient Cultivator, 全知修仙者","A powerful cultivator entered a world ruled by superpowers, and decided to begin cultivation anew in this different world to achieve his long-held wish of transcending. Being born with the ability to cultivate, traces of long-ago cultivators… It’s not that there have never been cultivators in this world, it’s just waiting for a revival of the era of cultivation!"]},{"title":"The Betrayed Queen is Devoted To By The Beautiful Baron","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Betrayed Queen is Devoted To By The Beautiful Baron / I Broke off My Marriage With the Nation / Parting Ways With Destiny / 裏切られた女王は, 麗しの男爵に 尽くされる / 裏切られた女王は、麗しの男爵に尽くされる / 遭受背叛的女王为美丽男爵效劳 / 遭受背叛的女王為美麗男爵效勞 / 나는 국가와 파혼했다"]},{"title":"Please Don’t Eat Me","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa Please Don’t Eat Me / Tolong Jangan Makan Aku / 私を食べないで / 请不要吃我 / 나를 잡아먹지 말아줘","“It’s five billion marukas, it’s a bargain.” “Sure enough, it’s a bargain.” ‘Ertha’, who is destined to be eaten alive by the male protagonist bargained marriage with him to change fate! Ertha was reincarnated into a rated 19+ fantasy novel. As the original story goes, Ertha, was eaten alive by the protagonist Jahid, but I can’t die like that because I have my little brothers. I offered a deal to the main character who’d eat me up. I’m the target of the proposal, 5 billion marukas! All I have to do now is run away before the main character gets a chance to eat me. Can I, Ertha, escape from the hands of Jahid, the greatest wizard in the kingdom?"]},{"title":"The Creatures that We Are","tags":["Action","Adventure","Fantasy"],"disc":["Read  The Creatures that We Are  / 异兽迷城 / Beastly Maze / The Lost City of Alien Beasts / Yi Shou Mi Cheng / The City of Beasts/  Bewildering City of the Unusual Beasts","Gao Yang, an orphan, crosses over to a “parallel world” at the age of six and starts living in a warm family of five. At the age of eighteen, Gao Yang accidentally discovers the true nature of the world: it’s not a parallel world at all but a mysterious realm, and the family and friends around him are all terrifying “beasts”!"]}]