[{"title":"Soul Land III:The Legend of the Dragon King","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Soul Land III, Douluo Dalu 3: The Legend of the Dragon King\nfollowing the advancement of soul technology, the humans of Douluo Continent conquered the ocean and discovered two new continents. After being hunted by spirit masters excessively, the soul beasts are nearly extinct. After countless years of lying dormant, the King of the Soul Beasts has awakened in the Great Star Dou Forest. It will lead its remaining clansmen in taking vengeance against humanity!\nTang Wu Lin is determined to become a powerful Spirit Master. However, when he awakened his martial soul, it was actually an…\nIncomparable talent. The battle of the Dragon King. The Legend of our Dragon King hereby begins."]},{"title":"Cute Baby From Heaven: Daddy is Too Strong","tags":["Manhua","Romance"],"disc":["Read manga Cute Baby From Heaven: Daddy is Too Strong","Ye Sa endured humiliation for the sake of love in her marriage, but in the end, she got a divorce agreement from Huo Han Ting. Want to pat your back and leave? I Ye Sa, will not buy it. One second, she signed the divorce agreement painfully, and the next second, she sl*pt with Huo Han ting. After one night, she was pregnant .. I can’t keep the man, I’ll just keep his children."]},{"title":"To Make You Happy","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa To Make You Happy / How to Create Happiness / How to Make Happiness / 幸せの作り方 / 幸福的代价 / 행복을 만드는 방법","College student Soshin Kang has made a deal with the devil. When poverty and violent loan sharks force Soshin to take up an offer from Aram, Soshin’s high school friend-turned-bully, to live in Aram’s lavish house with all expenses paid, it seems like a dream come true. Although Aram appears sweet and gentle, in reality she is a cold, manipulative stalker who is obsessed with Soshin and will stop at nothing to keep her to herself. As people around her begin to get hurt, Soshin finds herself in a race against time to uncover the truth and escape Aram’s grasp"]},{"title":"Dazzlingly Bright","tags":["Comedy","Drama","Psychological","Romance","Slice of Life","Sports","Webtoon"],"disc":["Read manhwa Dazzlingly Bright / Dazzled By You / 눈부시게 빛나는","A webnovel author, 28 years old Yeonsoo, is immersed in developing her new work. But the plan that she had been working on diligently turned out to be unsatisfactory, and she collapsed while being on the phone with her editor. When she woke up, she was in a hospital room. Apparently she collapsed because she hadn’t been eating or sleeping well. The doctor advised Yeonsoo to walk for ten minutes a day as an exercise. And while she started to exercise on an impulse with the man with a limited time(?), ‘Han Gyul’, who was admitted next to her in the hospital, Somehow she felt her heart flutter…? Enjoy the freshness of an older female lead that unexpectedly gets her heart bombarded by a younger man!"]},{"title":"Whatever the Princess Desires!","tags":["Comedy","Romance"],"disc":["Read manhwa Whatever the Princess Desires! / My Way Putri / 공주님 마음대로! / As You Wish, Princess!","The prince saved the cursed princess! Will the prince and princess continue like this to the happy ending?! Searching for a calm love and fate, the prince-awaiting princess Lemon’s story unfolds! At least it’s supposed to…"]},{"title":"How a Villainess Survives as a Saint","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manha How a Villainess Survives as a Saint, 悪女が聖女として生き残る方法, 악녀가 성녀로 살아남는 방법","“You might regain all your powers If don’t cause any problems or chaos in the human world .”","“Aedes”, who was once the highest-ranking demon, lost a battle against his rival, the god Ferdinand.","and was forced to live in the human world as a saint. Unlike her days as a demon, Aides now has a frail body that will collapse if she cause any harm in the human world.","She can’t speak rudely to others, nor can she attack humans.","At that moment a figure identical to the god “Ferdinand” appears before her- “Emperor Leiden”.","“What a cute saint you are.”","The Emperor Leiden starts having an interest in her…","Can “Aedes” survive as a saint and return to her original world?”"]},{"title":"The Goal Is to Become a Gold Spoon so I Need to Be Completely Invulnerable","tags":["Action","Comedy","Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Goal Is to Become a Gold Spoon so I Need to Be Completely Invulnerable / I Dream of Health, Wealth, and a Long Life / My Goal Is to Live a Long, Healthy Life as a Golden Spoon / Mogpyoneun geumsujeolo mubyeongjangsuhagiibnida / Золотая ложка судьбы: Миссия выживание / Моя цель состоит в том, чтобы прожить свою жизнь с золотой ложкой! / 목표는 금수저로 무병장수하기입니다"]},{"title":"Please Answer Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Please Answer Me / Answer Me, Please / 내게 대답해 주세요","Rosetta, the princess who grew up beautifully in the royal palace. She goes on her first trip in her life before her arranged marriage. However, contrary to her high expectations, What was waiting for her was a hungry monster. “Run!” He’s a monster!!” Just when she thought she was going to die this way, She is barely saved with the help of Rosie, a woman around her. But because of this came another crisis. “She is nothing but a substitute bride!!” Rosie, who was injured while saving Rosita, was also about to get married. Unable to ignore her, Rosita decides to be a bride for just one night. And there… She is kidnapped by the notorious Kwat tribe leader. “I will take this woman as my wife.” The moment you meet the cold blue eyes of the tribe leader, Rosita’s life changes completely."]},{"title":"Pyeonghwa Restaurant","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Pyeonghwa Restaurant / Peace Restaurant / The Restaurant of Peace / 평화식당"]},{"title":"Black Storm","tags":["Action","Adventure","Drama","Josei","Manhwa","Romance"],"disc":["Read manhwa Black Storm / Dark Storm / 블랙 스톰","“Eyes that are filled with infinite trust without any greed. Usually, you can only find those in animals. Isn’t that right, Miss Lian?” The name Lian was still unfamiliar to her ears. The years she lived as Lian were longer than the years she lived as Gia, but she still feels that name unfamiliar, as if it belonged to someone else. “It seems you are mistaking me for someone else.” she just uttered that obvious answer. Like a machine, I repeated the words. She didn’t want to interact with his life ever again. “I never said it was a person.” “… yes?” As she slightly frowned, the corners of Tristan’s mouth rose in front of her eyes. It was just when she thought she could escape. He continued to pun his words, further. “I’ve lost one of the animals that I’ve been raising, but I think that it is possible to find it.”"," "]},{"title":"All I Needed Was Someone to Despise","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa All I Needed Was Someone to Despise / 다만 미워할 사람이 필요했을 뿐","“The noble act you do to your fiancé, do it to me too.”","The man smirked arrogantly with a bloodless face. He was the boss of the underworld, whom she met as a brief escape from her suffocating life. She could see that his patience was running out, so she managed to open her mouth.","“… I live in that baby’s halo. Stay safe like this forever. But I wouldn’t dare play with you and throw away my only shield.”\n“Protect?”","She groaned as he came closer.\nShe tried to hide the bruises under heavy makeup, but to no avail.","“You shouldn’t call that bastard a shield in front of me.”","A stubborn hand gripped her chin, and\na soundless voice continued.","“Angry, it’s me.”"]},{"title":"Flowers That Bloom at Night","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Flowers That Bloom at Night / 밤에 피는 꽃"]},{"title":"Kissing Is a Violation of Contract","tags":["Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa Kissing Is a Violation of Contract / Kiss Is A Breach Of Contract / Kissing is a violation of our contract / 키스는 계약위반","“Please be my girlfriend.” Jaehyun, a self-indulgent chaebol man, and Danbi, a confident woman, who relies on no one. We are terribly entangled in a rainbow(?) relationship?! Indeed, can this ‘contract love’ end safely?"]},{"title":"Cursed Night","tags":["Fantasy","Manhua","Romance"],"disc":["Read manhua Cursed Night / The Night the Curse Began / Zǔzhòu Kāishǐ Dì Nà Yīyè / 诅咒开始的那一夜"," "]},{"title":"I Have the Dragon’s Heart","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I Have the Dragon’s Heart / 드래곤의 심장을 가지고 있습니다\nSharon, a warrior who defeated a vicious dragon a thousand years ago. One day, an unidentified man appears in front of Aru, who grew up longing for Sharon. What? Are you that terrifying dragon? Besides, I’m that hero?! A cute and sad romance fantasy of a dragon and a hero who reunited after a thousand years!"]},{"title":"Immoral Parody","tags":["Drama","Ecchi","Psychological"],"disc":["Read manga Immoral Parody / [스태프온리 단편선] 패륜극 – 김종건 – 웹툰 – 레진코믹스","In her younger days, Lee Hee-jung was a well-known star actress. However, her life took a dramatic turn when her affair with ‘Yeon Seon-gu,’ a popular film director and the husband of her close friend ‘Kim Myung-hee,’ was exposed. Subsequently, she faced a series of scandals following Kim Myung-hee’s suicide and a traffic accident involving Yeon Seon-gu. As a result, Lee Hee-jung left the entertainment industry, and 12 years passed. She received a tempting casting offer for a new film and, after much contemplation, decided to make her comeback in the film industry. But what she didn’t expect was that the lead actress in the film would turn out to be ‘Yeon Ji-na,’ the daughter of Kim Myung-hee and Yeon Seon-gu…"]},{"title":"So I Married the Anti-Fan","tags":["Adaptation","Drama","Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa So I Married the Anti-Fan / Entonces me casé con la antifan (Jaerim) / Mein Anti-FAN (Jaerim) / Mon Anti-fan! (Jaerim) / My Anti-Fan! (Jaerim) (Indonesian) / Si je marié m’anti-fan (Jaerim) / So I Married an Anti-Fan (Jaerim) / So I Married My Anti-Fan (Jaerim) / แอนตี้แฟนกับนายท็อปสตาร์จอมเฟค (Jaerim) / だから俺はアンチと結婚 した (Jaerim) / 所以和黑粉结婚了 (Jaerim) / 所以我和黑粉結婚了 (Jaerim) / 그래서 나는 안티팬과 결혼했다 (재림)","Now a major (K-Drama) adaptation. How far would you go to take down the person you hate most? With no house, no job, and nothing left to lose, Geunyeong Lee is willing to risk it all to bring down the country’s national treasure, Korean superstar Who Joon. But once the two really get to know each other, bringing him down suddenly becomes a lot harder. Will she be able to ruin him once and for all after she learns the truth about the man behind the popstar?"]},{"title":"Hamburger Are My Favorite","tags":["Childhood Friends","Drama","Fantasy","Manhwa","Romance","School Life","Slice of Life"],"disc":["Read manhwa Hamburger Are My Favorite / Tôi Thích Hamburger Nhất / 햄버거가 제일 좋아","Will Hwa, who developed an ‘human allergy’ after breaking up with her ex-boyfriend, succeed in dating? A damp love story of free-spirited loners who meet in an empty new town in early winter."]},{"title":"The Reincarnated Witch Finds Her Beloved Prince and Lives Happily Ever After","tags":["Drama","Fantasy","Historical","Manga","Romance"],"disc":["Read manhwa The Reincarnated Witch Finds Her Beloved Prince and Lives Happily Ever After / Shijou Saiaku no Tensei Majo wa Saiai no Ouji to Koi Oshitai / 史上最悪の転生魔女は最愛の王子と恋をしたい / 転生魔女は運命の王子を見つけ出し幸せになります / TENSEI MAJO WA UNMEI NO OUJI O MITSUKEDASHI SHIAWASE NI NARIMASU","Before me stand five handsome princes. All of them are candidates for my hand in marriage. Prince Louis, who looks just like that person; Prince Pierre, who sounds just like that person; Prince Kurt, who is adored by animals, just like that person was; Prince Frederick, who is skilled in swordsmanship, just as that person was; and Prince Dietlint, who does not share any resemblance with that person in the slightest. As a reincarnated witch, I must choose from these five princes and find my beloved prince from my past life. At first glance, I couldn’t tell which one was my beloved prince, but I had plenty of time to spare. There was no way I could mistake the prince I loved in my past life. I will surely recognize him. However, each of the five princes exuded their own charms, and they were just as kind to me as they had been in my previous life. With their relentless advances, I fear that I may not be able to tell which one is my beloved prince anymore! Who on earth is my beloved prince?! It wasn’t supposed to turn out like this!”"]},{"title":"Your Eternal Lies","tags":["Action","Drama","Historical","Isekai","Manhwa","Romance","Shoujo","Time travel","Webtoons"],"disc":["Read manhwa Your Eternal Lies / Tus eternas mentiras /영원한 너의 거짓말","Rosén Walker was jailed for murdering her husband at the age of 17.","Having crushed the pride of the Imperial Army with two jailbreaks, she is captured again a year later and is sentenced to life imprisonment.","On a boat going to Monte Island, where only the vilest prisoners were gathered, another jailbreak is planned…","“What is your crime?”","“… I’m innocent.”","“Only a handful of prisoners would honestly admit that they have committed a crime.”","Ian Connor, a blunt and upright ideologist, who is in charge of her deportation, doesn’t give any leeway.","“Don’t say anything useless, just answer what you are asked.”","Rosén, the Empire’s best jailbreaker,","and Ian Connor, a young war hero who is loved by the entire empire.","Their story unfolds on the ship heading to the worst prison on earth!","Now, you shall be the judge. Is Rosén Walker a liar? Or is she not?","Chapter 1 will be updated on Harimanga within next hour. Follow us!!"]}]