[{"title":"A deadly sexy wife: The CEO wants to remarry","tags":["Romance"],"disc":["Read manga A deadly sexy wife: The CEO wants to remarry","A marriage to form business alliances makes the two of them the victims, and face provocations.","For Lu Nan Yin, one side she must pit her wits against people, the other side she must be a capable mistress and take care of the family.","Gu Xiao Cheng is forced to marry Lu Nan Yin, thus he deeply resents her, but then fall in love with her unintentionally.","Fatal Wife Mortal Love"]},{"title":"Prince’s Private Baby","tags":["Drama","Manhua","Romance","Webtoons"],"disc":["Read Prince’s Private Baby, Master’s Secret Baby, Prince’s Private Sweetheart, The Prince’s Private Baby, Wangjuede Siyou Baobei, Prince’s Private Sweetheart","Drugged by her own sister for money, Xiaomo didn’t know what was happening when she woke with a gorgeous but domineering man in her bed. She ran and ran but she would soon discover he was their nation’s prince?! What’s worse, she’s pregnant with his child…can the two live happily ever after?"]},{"title":"The Younger Male Lead Fell for Me before the Destruction","tags":["Comedy","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Younger Male Lead Fell for Me before the Destruction / The Younger Male Lead Fell for Me Before the Destruction / 파멸 예정 연하 남주가 내게 빠졌다 / The Destroyer Fell in Love with Me\nOut of one mistake erupts an exciting and intense romance story! The day after finally paying off all of her student debts, Amelia wakes up to find that she has been teleported into a novel she loves … But as the daughter of a count who has the kind of debt that takes one’s whole life to pay off. She heads to a bar to drink away her sorrows, but ends up drunkenly spending the night with Duke Kyle, a man on the fast track to self-destruction. She tries to get away from the Duke and his notorious reputation… But will Amelia be able to change fate and give this love story a happy ending?"]},{"title":"The Madam is Acting Like a Spoiled Child","tags":["Drama","Josei","Romance","Shoujo"],"disc":["Read The Madam is Acting Like a Spoiled Child / 太太又在撒娇了\n#CEO#Romantic Tang Xiaorou loved Mo Jicheng for several captivating but also torturous years. Because of her unrequited love and her strong wish to be with him, she schemed to marry him. However, even as a married couple, Mo Jicheng was still cold and indifferent to her. Even so, her heart still beats for him. However, Tang Xiaorou’s banter with her two faced husband left a ripple in both of their hearts. It seemed that fate would not allow her to escape the palm of his hand!"]},{"title":"Ghost Hubby Spoils Me","tags":["Drama","Romance","Webtoons"],"disc":["Read manga Ghost Hubby Spoils Me","As the heir of an exorcist family, she had a nightmare of a first mission.\nHowever, the moment she was about to be devoured by the evil spirit, a man came to her rescue.\nBefore she even managed to tell if this is an act of chivalry or just another hunt for food, she heard him saying\n“I finally found you, my wife…”"]},{"title":"Before It’s Too Late","tags":["Drama","Josei","Romance","School Life","Slice of Life"],"disc":["Read manhwa Before It’s Too Late / Before Losing You / 놓치기 전에 / Before I Lose You","“Eunho, you’re… like an angel, a guardian angel.”","Two childhood friends who were each other’s number one priorities for 15 years, Seohui and Eunho.","To call it friendship is, well…there’s something between the two of their relationship that no one else can interfere with.\nFriends, family, soulmates, lovers(?), they kept switching somewhere in between all those, but suddenly, Seohui broke the news, “Eunho, I don’t want to see you anymore.”","Those words made Eunho’s world fall apart.","I can’t act oblivious any longer. I’m crossing the solid line which has been drawn by time. Before you disappear from my side. Before I lose you."," "]},{"title":"I Just Want to be a Useless Duke’s Daughter","tags":["Fantasy","Historical","Manhua","Romance","Webtoons"],"disc":["Read manga I Just Want to be a Useless Duke’s Daughter / The Bizarre Adventure of Miss Capricious / Xiang Chen Wei FeiChai De GongJue XiaoJie / 想成为废柴的公爵小姐","Asterin, who has crossed into a fantasy novel to become the duke’s daughter, does not want to become the same character as in the original book, since her character was a shallow and love-obsessed girl. This rich and free-spirited girl, along with her two beloved cats, decided to ruin her reputation and throw away her money! However, one thing she wasn’t expecting was for one of her cats to be a dragon?! And so, under the protection of that great dragon, she began to accomplish many great achievements."," "]},{"title":"Come On Out, Romeo","tags":["Action","Drama","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manga Come On Out, Romeo / The Events of Romeo’s Household\nRomeo Montague, a boy thrown into the attic with disgust after an accident five years ago. Although the world knew him as a boy unable to move due to serious afflicted illness, he lived a happy and fruitful life as a hermit in the attic. Only his cousin, Benvolio, and the housekeeper, Miriam knows the truth. But his peace breaks when Miriam’s brother, Abram, enters the mansion. “I’ll get you out of this room on your own feet!” “You don’t need to make such promise.” Romeo begins to solve Abram’s various troubles with a single determination to preserve peace in the attic. Meanwhile, an unexpected adversary appears in front of him half-heartedly."]},{"title":"Charming and the Beast","tags":["Comedy","Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Something’s wrong; It’s like I’ve been possessed. Something weird has happened. Hair – fur? – has grown. My size has greatly increased too. Everyone who sees me looks terrified. I’ve become a beast. Why?\nThe Beau and the Beast"]},{"title":"Sincerely: I Became a Duke’s Maid","tags":["Drama","Fantasy","Isekai","Manhua","Manhwa","Romance"],"disc":["Read manga Sincerely: I Became a Duke’s Maid / A Tender Heart : The Story of How I Became a Duke’s Maid / 날것: 공작가의 하녀로 빙의했습니다 / 公爵家のメイドに憑依しました / 重生：公爵家的女仆 / Sinceramente: Me convertí en la criada del duque / Unripened: I Became the Maid of the Duke’s Family\nI woke up one day inside the story of a novel as the maid of the disgraced duke and side character, Alejandro Quillo Vel Laviti. Will Alejandro’s fate change with the appearance of a new ‘extra’ character? What is the truth behind his cursed mark?"]},{"title":"The Princess Imprints a Traitor","tags":["Adventure","Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa The Princess Imprints a Traitor / Revolutionary Princess Eve / The Traitor Conquerors Princess\nHer last memory was when the royal family was destroyed by the Homunculus, who caused treason and was drowned in the scheme of their brother standing on their side, by swallowing poison. But when she opened her eyes again,\n“I…I’m not dead.”\nShe realizes that she’s back to the past and was eight years younger. It was before the third emperor, who will be the next heir, was officially chosen as the successor.\nAn opportunity to prevent the fall of the imperial family by pressing the third emperor Bridgette and being recognized as the successor.\nAs part of the preparation, Evenrose decided to write her own article about Michael, the king of Homunculus and the monster of public prison, in order to win the emperor’s heart.\n“I need you, Michael. Very badly.”\nWill Evenrose be able to get him and protect the imperial family safely?\nFollow the story with us and don’t forget to leave your comments. Hope that you will always support us <<teenmanhua.com>> thank you very much!"]},{"title":"Knight in Flight","tags":["Historical","Romance"],"disc":["Amadeonte Elvin, the legendary swordsman of the Elcano Kingdom and the first woman to join the Royal Guard, and Cyonel Gavadien Meon, the prince who is entangled in a struggle for his succession to the throne and is hated by his own father. Two really different people who share one common goal: to escape the country. Will they be allied or enemies?\nKnight in Flight / Knight Flight / Night Flight! / 나이트 플라이트"]},{"title":"The Great Path of Fighting","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts"],"disc":["Read The Great Path of Fighting manhua,\nSince ancient times, the path of immortality cultivation has always been dominated by the Xuanmen family, not for mortals to covet. Zhang Yan, who came from the apocalyptic world, got the help of a mysterious residual jade, but he wanted to fight against the common people and vowed to step out on a road of longevity that belonged to him!"]},{"title":"Yu Ling Shi ( Tamers )","tags":["Action","Adventure","Fantasy","Manhua","Shounen"],"disc":["“I got thrown into my own manhua!”I became stronger,but also bald……””the guy who thrown me into this world,you know nothing about power!””But why am i a sidekick?The protagonist is really attractive……””but still i need attractive long hair to be a BOSS!”This is a manhua author story."]},{"title":"Help! My PokeMAN Boyfriend Is REAL","tags":["Comedy","Moder","Romance","Webtoons"],"disc":["Read manga Help! My Pokeman Boyfriend is Real / 救命！游戏男友成精了","Pokeman, a dating simulator game, is undergoing pre-launching testing. As its game tester, Fan Yin is having a BIG PROBLEM:\nThe game character, aka. Fan Yin’s virtual boyfriend, just became a living and breathing real person!\nA touchable, feelable, flirtable, and huggable virtual boyfriend that is jealous, jealous, and JEALOUS every hour of every day.\n“How can I lower his jealousy level! The game is soooo difficult! (╯‵□′)╯︵┻━┻”"," "]},{"title":"Switched at Thunder","tags":["Drama","Fantasy","Josei","Romance","Supernatural"],"disc":["Read manhwa Switched at Thunder / 영혼과 결혼사이","The story unfolds as two newscasters Joori, Byeon and Hari Byeon, whose lives are at two ends of the spectrum, get into a car accident. Joori quickly regains her consciousness at the hospital, but she finds out that she is now in Hari’s body and that she has to marry a total stranger Hueil, Hari’s fiancé, a millionaire with such rudeness. She tries to make sense of everything while Hari still remains unconscious. Along the way, she discovers that Hari’s marriage was contractual and that everything about her, from her parents to personality, was fake. Soon after the wedding, she starts seeing Hari’s spirit and it haunts her to death."]},{"title":"Baby Dragon","tags":["Comedy","Fantasy","Historical","Magic","Reincarnation","Romance"],"disc":["Read manhwa Baby Dragon / 베이비 드래곤","I’m happy to feel the strong power that no one has experienced. I also felt the love and kindness of the people around me for the first time.\nAs some make their every effort to have her, some also make their every effort to get rid of her."]},{"title":"Rippling Marriage: The Way To Your Heart","tags":["Romance"],"disc":["Read manhua Rippling Marriage: The Way To Your Heart","The craziest thing Stella has ever done is crawling into Uncle Luk’s bed. Leon Luk thought it was just an accident, but Stella posts their intimate video online. The woman who fears nothing dares to challenge powerful Leon! “Stella, you will pay for what you’ve done!”"]},{"title":"Unrequited Love","tags":["Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manga Unrequited Love","One of Zhenhua’s trilogies, this love is unforgettable, yet no one knows it. Because of a single, lasting encounter when she was younger, Luo Zhi has had a crush on Sheng Huainan for eleven years. His appearance was so radiant, and since then, Luo Zhi’s diary has become a one-sided love story that belongs to her alone. Because of Sheng Huainan, Luo Zhi followed him all the way and was admitted to his university. Because of multiple encounters, Luo Zhi and Sheng Huainan finally approached each other…"]},{"title":"The Princess’ Jewelry Box","tags":["Comedy","Drama","Historical","Romance"],"disc":["Read New Manhwa  The Princess’ Jewelry Box / 황녀의 보석함","In order to become a unparalleled empress, princess Ariana creates a collection of talented men. The heartwarming appearance of the jewels she gather will truly make her shine.. more or less something like that"," "]}]