[{"title":"The Scandalous Proposal","tags":["Drama","Romance","Shoujo"],"disc":["Read manhwa The Scandalous Proposal / 마침내 스캔들\nThe worst crisis in his 15 years of career as an actor! When he was considering to leave the line of business, she stepped into his life. “I could have a relationship of convenience with you, Dokyeong.” “How will I benefit from this?” “I’ll be your shield.” Her life story is even more pathetic than his. Apparently, she’s about to get sold into marrying a junkie. It sounds like she can be a perfect partner… “If things get worse, we might have to get married.” “I’m fine with that. I’d rather have marriage of convenience than be married off to a junkie.” But I wonder why I keep falling for her. “Just asking, can we kiss during the contracted period?” “Mr. Han.” “Yeah?” “Let’s do something more than just a kiss.” Finally, an outrageous rumor that’s only been on their minds comes to life!"]},{"title":"Prayers of the Vulgar","tags":["Adaptation","Demons","Fantasy","Historical","Mature","Reincarnation","Romance","Super power"],"disc":["Read manhwa Prayers of the Vulgar / Prayers of the Profane / 속된 자의 기도문","The servant of God, Saharo, breaks the biggest rule for an angel when she momentarily sympathizes with Evil. After letting Evil escape from heaven’s grasp, Saharo loses her angelic wings and won’t be able to reascend until she destroys the dark enemy once and for all. There’s just one problem: her target is reincarnated as a human boy named Yannick Unbrey. While angels have the power to eliminate Evil, they are forbidden from ever killing a human being. Thus, Saharo’s only choice is to watch over the boy and make sure the darkness within him never awakens. But the older Yannick gets, the more he becomes tainted by the wicked nature of the world. Will Saharo be able to protect Yannick from his slumbering demon, or will she end up giving in to its sinful call with him?"]},{"title":"My Crazy Journalist Wife","tags":["Action","Adventure","Romance"],"disc":["Read Daddy’s Persona Has Collapsed / My Son is A Matchmaker / Little Twin Matchmakers / 我爹地人设崩了","Adapted from the novel “Mu Muchen”. In order to make milk powder, Xia offended Uranus superstar Mr. Lu early in the summer and ordered: “Throw it out and feed the dog.” Later, everyone said: Mr. Lu spoiled Mrs. Lu in the sky and was afraid He fell and was afraid of it in his mouth. “This day can’t be over, I’m going to divorce!” Xia Xia leaned back on Xiaoman’s waist. “Mommy, are we going to play the game of running away from home again?” A little baby bag dragged the luggage happily."," "]},{"title":"A Billionaire I Am","tags":["Liexing","Manhua","Ping Ping Jun","Romance","School Life"],"disc":["Read A Billionaire I Am","“Rich? Spend as much as you like! When the poor girl Su ChengCheng becomes the richest heiress, she vows to get back all the humiliation she has suffered!”\nMangaToon got authorization from Weibo Comic to publish this content, the content is the author’s own point of view, and does not represent the stand of MangaToon."]},{"title":"Crossing Egypt: Becoming The Pharaoh’s Bride","tags":["Drama","Fantasy","Historical","Time travel"],"disc":["Read Crossing Egypt: Becoming The Pharaoh’s Bride / 穿越埃及：成为王的新娘 / Chuānyuè Āijí: Chéngwéi Wáng De Xīnniáng / Passing Through Egypt: Become the King’s Bride / Traveling Through Egypt: Turning Into the Bride of the King/ Egyptian Princess Reborn / Destined Love: The Pharaoh’s Bride","Under the wish of Yuya, the black cat, Nefertiti traveled to ancient Egypt and became the princess who was destined to be a bride in Egypt. Why did she, who just wanted to find a way back to the modern age, accidentally fell into the eyes of the next pharaoh, Akhenaten? And Yuya, who had been by her side all the time, seemed to have a secret. Destiny-like love started quietly from their reunion."]},{"title":"The Emperor’s Woman","tags":["Drama","Historical","Romance","Supernatural","Thriller","Tragedy"],"disc":["Read manhwa The Emperor’s Woman / Kwuncwuuy Yein / Pasangan Sang Kaisar / The Emperor’s Couple / The Lady of the Monarch / The Monarch’s Woman / 군주의 여인","Leia de Arze is a girl with bad temper. She was reborn to correct her mistakes in a previous life and be a kind girl. Leia is married to Hailon, a cold-hearted emperor. Her life began to change. But, the beautiful Ariel appeared and became the concubine of Emperor Hailon. Will the same thing happen to Leia again in her current life?"," "]},{"title":"To Melt Your Frozen Heart","tags":["Action","Comedy","Drama","Fantasy","Josei","Manhwa","Romance","Shoujo","Shoujo Ai","Time travel","Webtoon"],"disc":["Read manhwa To Melt Your Frozen Heart / How to Melt the Marquis / Method for Capturing His Highness the Marquis / The Way to Attack His Highness the Marquis / 攻略侯爵殿下的方法 / 후작님을 녹이는 방법\nWith his entire family either gone or missing, Adrian DeMonte must take the helm as the sole heir to the wealthy Velkra estate. By official decree of the emperor, Adrian is to choose a noblewoman for her hand in marriage. Adrian chooses the infamously ruthless Marchioness Frey Vuxia, known as the “Wolf of the Battlefield,” in hopes that she will reject his proposal. But to his surprise, she accepts! Now, Adrian must navigate not only the desolate corridors of the"]},{"title":"The Lady’s Law of Survival","tags":["Fantasy","Romance"],"disc":["Read manhwa The Lady’s Law of Survival / Aturan Lady untuk Bertahan Hidup / La Ley De Supervivencia De La Señorita / The Surviving Rule Of Lady / レディー生存の法則 / 淑女的生存法则 / 레이디 생존의 법칙","A total of four reincarnations, where in all of them, I died before my 25th birthday. However, the lifespan on the list was much longer than that, and Yeoram, who was in charge of the dead, said he didn’t know the reason for all of this. Is my life a blue screen? Anyway, I finally came up with a clever idea- to be transmigrated for my fifth life! I will live a healthy and long life with love under the influence of a young woman with money, power, and everything else! But… …after I opened my eyes, I found myself deceived by the fucking king of the underworld bastard."]},{"title":"I Parted Countlessly From My Beloved Over a Millennium, Now I Shall Become the Wicked Lady","tags":["Fantasy","Historical","Reincarnation","Romance","Shoujo","Villainess"],"disc":["I Parted Countlessly From My Beloved Over a Millennium Now I Shall Become the Wicked Lady ,\n愛しのあの方と死に別れて千年～今日も私は悪役令嬢を演じます～\n“Swear… that you will never fall in love with me, no matter what.”\nA thousand years ago, a sad fate separated this pair of lovers.\nNo matter how many times they reincarnated and reconnected, it always ended with his tragic death…\nAnd once again they are reincarnated, as a count’s daughter, Amelia, and a marquis’s son, William.\n“I absolutely will not let him die this time!”\nHaving decided this, Amelia swore that she ‘won’t love him anymore’, and put on an act of being a wicked lady.\nHowever, puzzlingly, he is the one trying to get close to Amelia this time, and even sends her a marriage proposal…?!"]},{"title":"The Flower That Was Bloomed by a Cloud","tags":["Drama","Historical","Manhua","Romance"],"disc":["Read manhwa The Flower That Was Bloomed by a Cloud","Hong Lyon, a pitiful young princess with only the title and no authority, meets a young boy named Do Un, who offers to help her become a true royal princess?"]},{"title":"No Way, My Best Actress Wife","tags":["Liexing","Ping Ping Jun","Romance","Webtoons"],"disc":["Read manga No Way, My Best Actress Wife / Ying Hou Laopo Buxu Tao / Ying Hou Laopo Buxu Tao manhua , No Way, My Best Actress Wife , 影后老婆不许逃","I thought this was just about me coming back to the stage. Who’d expect layers after layers of mysteries, lies, and conspiracies? Love that was once lost, memories that flood back, turns out we’ve loved each other time after time."]},{"title":"Borrowed Beauty","tags":["Comedy","Drama","Romance","School Life"],"disc":["What if you could swap bodies with the person you admire? Elise doesn’t like her body: she’s fat, frizzy-haired, and pimpled here and there. So, when she finds a technology that allows her to swap bodies with a willing participant, she jumps into it. To do so, Elise pays Riley, the most popular girl in their previous high school, to swap bodies with her, just for a few hours every day so that Elise can feel normal. But then problems arise when both fall for the same guy."]},{"title":"Princess Strategy","tags":["Comedy","Historical","Romance"],"disc":["Read manhwa Princess Strategy / Little Raider Princess System / 系统之小公主攻略 / The Princess Arrives","I’ve reincarnated! Different from those cold-blooded murderer fathers, my father is a total slave to his daughter (me) since I am his only princess! With a Princess System, I have hack tools whenever needed! However, I never had expected…"]},{"title":"Little husband in my home","tags":["Drama","Fantasy","Historical"],"disc":["The Dongnv clan, the legacy of the daughter of the matrilineal clan, has since ancient times followed the strict clan rules that women are superior to men, and they have lived a life of a paradise in the mountains and forests. The young girl of the east, Ji Qianjiao, was ordered by the patriarch"]},{"title":"Raising The Enemy Only Brings Trouble","tags":["Comedy","Fantasy","Manhua","Romance"],"disc":["Read Raising the Enemy Only Brings Trouble / Breed My Dear Enemy / How to Raise an Enemy / Our Binding Love: My Gentle Tyrant / Yang Di Wei Huan / 养敌为患 / 强制欢宠：我的温柔暴君 / 転移お嬢様は導きたい！ / 악당이지만 남주를 키웠습니다 / Guiding a Rival to Become the Emperor","Ye Mu transmigrated into a book as a tragic cannon fodder, who was supposed to support the female lead. But having no time for games, she decided to kill the male lead and let the world collapse so that she could escape! One look at the scrawny little boy in front of her and she couldn‘t do it anymore…what should she do? Raise the male lead up and let him help her? The idea is great! But as she raised him the male seemed to have grown devious! Ye Mu was tearful. Where did her upright protector go to? Could she restart again?"," "]},{"title":"Only Aurora","tags":["Action","Drama","Fantasy","Magic","Manhua","Romance","Super power"],"disc":["Read manhwa Only Aurora / Magical Girl Aurora","In a world where magic girls are illegal, living as magic girls are absolutely risky. Life as a magic girl was a big flaw for the popular idol, Aurora, and the appearance of strange wizard boy, Simcheong raises questions. Can Aurora finish her magic girl’s contract safely and continue living her glorious life?"," "]},{"title":"Divine Hero’s Skyfall System Comics","tags":["Action","Fantasy","Manhua","Martial Arts","Romance"],"disc":["Divine Hero’s Skyfall System Comics\nAfter three years as a son-in-law, Xiao Ge suffered countless glares and insults. But the kindness and beauty of his wife made it hard for him to give up. Finally, once the Shenhao system was awakened, life began to hang on from then then on he became unpredictable."]},{"title":"Spoiled Medical Princess: The Legend of Alkaid","tags":["Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Spoiled Medical Princess: The Legend of Alkaid","Have you ever experienced the feeling of being pushed into the abyss by the love of your life? ” Nangong Yue was from a famous and noble famous in her previous life. She was an excellent doctor. She helped him ascend to the throne but in turn, her family was slaughtered at his orders. The first-born daughter is back and she’s coming back to get even! We shall fight till there’s only one of us left standing! I thought I wouldn’t let anyone in my heart again. But a man changed everything"]},{"title":"Reason to Live","tags":["Action","Adventure","Fantasy","Historical","Manhua","Romance"],"disc":["Read Reason to Live / 必须活下去的理由\nHave you ever felt like your life is boring and meaningless? Would you still feel the same way if you have to live in an apocalyptic world, where you are unclothed and starving? When Li Jinnian was buried alive because of an earthquake, she unknowingly discovered a path to escape the rubble. However, what lied ahead on that path wasn’t light, but endless deception and killing. In a dog-eat-dog world, will Li Jinnian find a way to keep living?"]},{"title":"Beauty And Demon","tags":["Drama","Moder","Romance"],"disc":["Read manhua Beauty And Demon / Enchanted Beauty / 曼妙美人动情妖","She is just a pure and lovely girl who was deceived by scumbag! But she did not expect to discover that the president who could see through the hearts of the people at night was a monster! Whenever you are shy with the president, the pieces of memory in your mind will be pieced together! Who is the mysterious mermaid in the dream? The truth is…"]}]