[{"title":"My Husband Was Once A Long Aotian","tags":["Comedy","Fantasy","Historical","Manhua","Romance","Shoujo","Slice of Life"],"disc":["My Husband Was Once A Long Aotian manhua, Before transmigrating, Qin Wanwan was the happiest second generation Immortal in the Immortal Realm.She was a salted fish, a waste, but her parents bribed various outstanding figures who had fame and prestige to fabricate her achievement. Thus, she had a great reputation.Until one day, Jian Xingzhi, who cultivated Zhanlian Dao and had fought with people all over the world, came over to fight her out of admiration of her strength. With a slash of his sword, she transmigrated from the Immortal Realm to the novel “Strongest Mary Sue” and became the vicious Supporting Female, Qin Wan."]},{"title":"invincible (manhwa)","tags":["Action","Adventure","Fantasy","Manhwa","Martial Arts"],"disc":["invincible manhwa, The king who came out and claimed the world with only two fists !"]},{"title":"Miss Miracle","tags":["Fantasy","Historical","Liexing","Ping Ping Jun","Romance","Supernatural","Webtoons"],"disc":["“Miss Loser” transmigrated to a different realm and started her revenge with the young master of the demon clan.\nA story about a domineering female lead. Who will be the winner in this nip-and-tuck tug of war in love.\nA destined loser? A push-over? An ugly girl? She was an ace bounty hunter in my previous life, but she transmigrated into a weak girl’s body. Hell no! She fights villains, punishes scumbags and kicks the butt of her enemies. Boys are crazily attentive to her. The male is so angry that he even gives her a last warning: Hey, you’ve accepted the bride price from me. Try flirting with other boys if you dare!"]},{"title":"The Heaven’s List","tags":["Action","Adventure","Manhua","Martial Arts"],"disc":["The Heaven’s List\nSet in the “The Great Ruler” world in the distant future. We follow the journey of a young cultivator aspiring to join the “spiritual road”."]},{"title":"My Fiance is in Love with My Little Sister","tags":["Fantasy","Josei","Mystery","Psychological","Romance","Tragedy"],"disc":["There my fiancé stood, gazing intently at my charming younger sister. When I saw them fall in love the moment they laid eyes on each other, I was hit with an overwhelming sense of déjà vu.\nAah, again?\nMy fiancé had been in love with my younger sister even in my previous life.\nThere was nothing I could do but watch it all unfold.\nAnd for some inexplicable reason, I’m the only one who keeps returning to that exact point in time.\nTrapped by fate.\nAnd yet, amidst the turns of the hourglass, I still find myself falling for him…"]},{"title":"In The Name Of Marriage","tags":["Manhua","Romance","Slice of Life"],"disc":["Read manga In The Name Of Marriage on manhwaclan\nFive years ago, the talented designer An Zhisu was framed and became a suspect. Five years later, can she recover from scratch and stand back to the star-stud stage that belongs to her own starlight?"]},{"title":"Mr. Lu, Your Wife Is Trending Again!","tags":["Drama","Josei","Liexing","Manhua","Ping Ping Jun","Romance"],"disc":["Read manhua Mr. Lu, Your Wife is Trending Again! / 陆总 /你的老婆又上热搜啦","This story begins when our hero and heroine reunite seven years later. The heroine is now an overly cautious entertainer, and the hero is a wealthy tycoon. They both loved each other, but because of a misunderstanding seven years ago, they both thought the other was not interested. Luckily, after experiencing many hardships together, and uncovering the truth, the lovers finally got married and stepped into the realm of happiness.\nIn fairness, the content of the story meets the entertainment needs of the audience. However, in terms of content, the exploit story is not as deep as its hot topic. The first point to say is the image of the giants in the film."]},{"title":"Princess and Her Ancient Vine","tags":["Historical","Liexing","Ping Ping Jun","Romance","Webtoons"],"disc":["As the most successful business woman in the country, our female lead, a CEO, thought her battlefield would be business.\nHowever, things changed after she obtained a mysterious vine, which brought her to a world to a land of cultivation!\nThere she met her destined man…"]},{"title":"The Evil Lady Will Change","tags":["Drama","Manhua","Romance"],"disc":["Read manga Villainess No More / The Evil Lady Will Change / Akujo wa Henka Suru / La dama malvada cambiara / La dame mauvaise changera / È Nǚ Huì Gǎibiàn / 恶女会改变 / 恶女會改變 / 悪女は変化する / 악녀는 변화한다","Athanasia Cloix, a woman whose elegance and beauty is akin to that of a swan lake, was the Duke’s eldest daughter and the Queen of the social circles: an existence near to perfection. Due to some rumors, however, people began to misunderstand and belittle her. As she suffered through these unfortunate events, she learned to conceal her feelings by putting on a façade and agreed to a political marriage with the Winter-comer who’s also known as the “Northern Monster”.“As the Grand Duke, I will do my best to accommodate your needs and desires. But love alone is something I can’t give to you.” Unbeknownst to her, that very man will change her life and thus a new fate is about to unfold."]},{"title":"The Queen’s Blade","tags":["Drama","Romance"],"disc":["Read manga The Queen’s Blade","Surprising! A generation of over-bearing CEOs are under her financial support! However, the truth is with a man underneath her, she says, “You can warm the bed in peace, I am a professional in bloody blades and enemies!"]},{"title":"Wake up master","tags":["Action","Adventure","Historical","Manhua","Romance"],"disc":["Wake up master manhua,\nThe leader of the Immortal Sect, Wuzhen Sect’s prospective patriarch, Zhang Xuanze, accidentally reveals his half-demon blood and is attacked by all the sects in the Immortal World, and secretly unites with the demons to attack Zhang Xuanze. He is alone against all the enemies, and with his ” Kung Fu” technique, he is able to resist. However, the betrayal of his sister Shi Yunxuan seriously broke his immortal body. At the last moment, he succeeded in reincarnating in the human world, what will happen next?"]},{"title":"How to Change a Path Full of Thorns Into One Full of Happiness","tags":["Drama","Fantasy","Historical","Manhwa","One shot","Romance"],"disc":["Read manhwa How to Change a Path Full of Thorns Into One Full of Happiness / 가시밭길을 꽃길로 바꾸는법\nI am Karne Pivoine Feian, a poor and pitiful princess in hiding. Due to some unfortunate circumstances, I’m currently residing in the house of a Baroness under a hidden identity. I promised I’d do anything they asked me. But I didn’t think I’d be asked to do things that would put my life in danger! As expected, freeloading in someone else’s house is no easy feat. I’ve got no choice. I have to find a way to reclaim my identity! One day, a handsome man approached me to offer a deal. “I’ll give you an unimaginably great reward if you bring me what I ask of you.” I think I’ve already found my reward, though! I’ve not only gained money, but an absolute hottie as well. Will I finally be able to walk down a path of happiness?"]},{"title":"Nan Used To Be Mine Hd","tags":["Drama","Ecchi","Manhua","Romance","Webtoons"],"disc":["May escort deserve true love? It that her fault to fall in love with a powerful man like him?\nMan sees her as a social butterfly, woman disgraces her as a whore/escort. Nan flirted with all sorts of men but what she truly wants is him, no matter how cruelly he treats her with…"]}]