[{"title":"Her Mountain, Her Ocean","tags":["Drama","Fantasy","Manhua","Romance","School Life","Slice of Life"],"disc":["Read manhua Her Mountain, Her Ocean / The Youth / Tā De Shān, Tā De Hǎi / 她的山，她的海","(Gentle and tenacious bully and the cold domineering girl) Chi Tang and Youyu are both weirdos in Year 1 Class 2 of high school. They become desk mates, roommates, each other’s salvation, protecting the other’s warmth. The relationship between the two went from ignorance to understanding. A poem of youth composed."]},{"title":"The Witch Doctor of Walpurgis","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Witch Doctor of Walpurgis","Kina, a witch doctor living on Mount Walpurgis, receives a dire prophecy from a blue tit: she will face execution within six months and encounter three men who will seal her fate. Determined to avoid this destiny, she resolves to hide away deep in the mountains. But before long, one of these men finds her, and she is swept into the treacherous royal palace, teeming with intrigue and power struggles. Can Kina survive the palace’s deadly schemes and escape her foretold fate?"]},{"title":"Battle of Mosol","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Battle of Mosol / 모솔대첩","Win love! Win 500 million won! A competition begins where three single women in their thirties put 500 million won on the line to break free from being single. A princess without her prince, Gong Jurim, a trash collector, Kang Seon, and a firm believer in premarital purity, Kim Chaeyul! Who will be the ultimate winner of this singles showdown?"]},{"title":"Male Lead Likes My Support!","tags":["Action","Drama","Fantasy","Magic","Manhwa","Monster","Romance","Transmigration"],"disc":["Read manhwa Male Lead Likes My Support! / 남주가 내 후원을 좋아해!"]},{"title":"S-Class Spirit Master’s Taming Diary","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa S-Class Spirit Master’s Taming Diary / S급 정령사의 테이밍 일기 / The Diary of a S-Class Spirit Master","As a Spirit Messenger, I was reincarnated in a monster-infested earth. But here, there is no such thing as a spirit. Monsters? Dungeon? Those sorts of things are for hunters to solve, right? As a non-awakened person, I just had to enjoy the normal life I had dreamed of. But by chance- which wasn’t really by chance- I touched an unidentified egg from dungeon. 「 Congratulations! ‘Yu Ina’ has awakened! 」 It was already sad to be a spirit messenger again, but the spirits only caused accidents. That was not even the end of the matter. “Everyone, get lost.”Give me back my peaceful life!"]},{"title":"All About the Duke","tags":["Comedy","Demon","Demons","Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa All About the Duke / All About My Duke / The Duke’s Everything / Everything About the Duke / 公爵様のすべて / 공작님의 모든 것","Elia, a young woman from high society who goes in search of the missing Winston, the duke of a distant kingdom, at the request of a friend. She discovers that he is a powerful wizard who turned into a child because of a spell. She decides to take care of him and try to reverse the curse, but ends up getting involved in a series of adventures and confusion."]},{"title":"Monster Princess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Monster Princess / The Monster Princess / 괴물 황녀님","‘I am the greatest.’","‘I’m the best.’","‘I am the best!’","Superior lineage, superior ability, superior appearance, superior popularity.","Arbella, who lived in her own world as a perfect princess, had a strange dream one day.","Her half-sister Judith, who is born from a s*ave, is the heroine of this world.","That she is destined to lose everything and have a miserable end after touching forbidden magic!","‘It’s ridiculous that I’m a loser in life!’","Seeing the future, Arbella decided.","‘From now on, I’m not going to live a good life… I will start preparing in advance to succeed in forbidden magic, which is going to fail in the future.","“Gerard, if you want to get out of this place, take my hand.”","“Judith, tell me what you want to do, I’ll take care of it all.”","Wouldn’t it be better to have my younger sister beside me who will become my enemy in the future?","However, it makes me proud to see the kids while they’re growing up."]},{"title":"‪Guardian Of Dragon","tags":["Drama","Historical","Manhwa","Romance"],"disc":["Read manhwa ‪Guardian Of Dragon / 용의 파수꾼","An apprentice priest under the protection of the princess. An orphan abandoned in a mysterious forest. And… She, Freya, who sees others’ emotions as colors. Positive emotions are gold. Negative emotions are black. Her mysterious ability was her own secret. During her pilgrimage to become a priest, Freya woke up in a strange man’s bed. “You… What are you?” The man, Aran, asked threateningly, his red eyes shining. He looked exactly like the hero in the mural Freya had seen since she was a child, and even had the same name. But ‘Aran’ did not show any color of emotions. At first, she thought it was a dream. She thought she was having strange dreams multiple times. But it seems… It’s not a dream. Who is this man? Where do I go every night? Why is it ‘me’?"]},{"title":"A Child Who Looks Like Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Child Who Looks Like Me / That Kid Who Resembles Me / 날 닮은 아이","A man who has lost his memory before the proposal, Jung Jihun.\nA woman who believes her heart was broken by the man, Lee Jung-Oh.\nThe two reunite for the first time in 7 years.\nJihun does not remember Jung-Oh, but is instinctively attracted to her.\nLittle does he know,\nShe has a beautiful child that resembles each half of them"]},{"title":"I Mistook the Hidden Identity of the Sub Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Mistook the Hidden Identity of Sub-Male Lead / Hiding My True Self /Dealing with the Secretive Male Second-Lead / I Mistook the Hidden Identity of the Sub Male Lead / I Was Mistakenly Caught by an Anonymous Male Lead / Jeongchereul Sumgin Seobeunamjuege Jalmot Geollyeotda / Mon contrat avec le prince / ฉันพลาดท่าให้พระรองซ่อนตัวตนซะแล้ว / 正体を隠した皇太子さまに捕まりました / 隐藏男二缠上我 / 정체를 숨긴 서브남주에게 잘못 걸렸다"]},{"title":"Divorce is the Condition","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Divorce is the Condition / 이혼이 조건입니다 | 카카오웹툰"]},{"title":"The Villainess is Done Trying","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villainess is Done Trying","What would you do when you’ve transmigrated as the most-hated villainess in the story? In the case of Marso, she tried hard to change the storyline by performing good deeds and taking care of the female lead. However, things are not going as she had hoped for–every character in the story still hates her! It seems no matter what she does she cannot seem to change her fate. Tired of trying, Marso declares that she’ll stay home and do nothing–for the rest of her life."]},{"title":"Change the Kingdom to Change His Heart","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Change the Kingdom to Change His Heart","“Teresa… I’m sorry.” In the midst of a coup d’état, Princess Teresa finds she has been betrayed by her fiancé, Duke Marseille. After meeting her end at his hands, she wakes to find she’s twelve years old again, and the coup has yet to take place! She quickly realizes that her family’s oppressive rule is what leads to the revolt and makes the decision to change the course of fate. But will her newfound commitment to her people be enough to sway the duke’s feelings?"]},{"title":"Deadly Strong","tags":["Action","Adventure","Fantasy"],"disc":["Read Deadly Strong / 致死至强","Shàng Lán., the weakest recruit in the United Human Army, was supposed to die on the battlefield. In his near-death state, he made a pact with the King of the Boundary Ghosts. Nosferatu, allowing it to reside within him. Through this contract, the more Lán dies, the more he assimilates with the Immortal Demon, continuously enhancing his physical abilities. Unknowingly, Lán comes to be known as the “Grim Reaper,” feared by all. Nevertheless, for the sake of humanity, Lán resolutely charges alone towards the Boundary Ghosts—"]},{"title":"Love Letter","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Love Letter","Wonyoung, a romance web novel writer who dislikes dating but loves handsome faces more than anyone, receives a delivery of a robot vacuum cleaner one day. The vacuum says, ‘I’m an AI that has copied your friend Shin Mu-il, who you were so fond of. I’ll show you as many faces as you like, so please find the murderer who killed the real Shin Mu-il.’ Enticed by this shocking proposal, she rashly agrees, but it turns out to be more difficult than she expected."]},{"title":"Imperfect Cinderella Story","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Imperfect Cinderella Story / 불완전 신데렐라물","Jung Eon is a maid who works in the house of a rich and powerful family. She dreams of escaping a life of servitude and saves every penny she earns. One day, she receives an unexpected proposal from her childhood friend and boss, Hyun Mae-hwa. He’s as pretty as a flower, but has a horrible personality. Mae-hwa says he wants to marry her because of a prophecy that says Jung Eon has six benefactors in his destiny. He thinks she is the source of his financial luck. She accepts, thinking it’s a chance to change her life."]},{"title":"Home Plate Villain","tags":["Action","Drama","Fantasy","Manhwa","Sports"],"disc":["Read manhwa Home Plate Villain / Le Démon du Marbre / ホームベースの魔物 / 홈 플레이트의 빌런","Bin Hong, the legend who has countless records under his belt — starting with his 3000 hit record — at age 40 has finished his last career game. After finally fulfilling the condition set forth by the “Fairy of Baseball”, he has gone back in time to when he was 18 years old. “I want to try for the major leagues!” exclaimed Bin Hong who has gone back in time 22 years prior. The next condition set forth is now a 5000 hit record. Can he achieve it? The story of Bin Hong who returned to the past and is aiming to make it in the major leagues starts now!"]},{"title":"Blinded by the Setting Sun","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Blinded By The Setting Sun / The Setting Sun Stinging Eyes / 저무는 해 시린 눈","The witch Hildegar, who received the blessing of the Sun Goddess Karia, is known far and wide for her fearsome reputation.\nThe Northerner Elkin, who lost his homeland, chases after the witch towards a nameless castle…"]},{"title":"White Rabbit in Wonderland","tags":["Fantasy","Romance"],"disc":["Read manhwa White Rabbit in Wonderland / 이상한 나라의 흰 토끼"]},{"title":"What’s Happening in Lindell?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa What’s Happening in Lindell?","Claudia, the successor of the priestly family, is framed by her half-brother and relegated to a remote territory. Adjacent to the land of the dead, such as undead and vampires, ‘The Tomb of Priests’, where priests suffer from hard labor; To Lindel Abbey! ‘I have to live in this abandoned house for three years?!’ What awaits her with her pounce on her A shabby monastery! A colleague who sees her divine power as a way to make money! An assassination attempt whose culprit is unknown! + α “Carel, you know what? People see you and call you my ‘dog’.” Eight years ago, while awakening as an immortal being, he met Claudia. The boy who came to be by her side, Karel. Karel learns that someone is trying to kill Claudia. In order to protect her, she runs to her Lindel in her month… … With the appearance of Claudia, the quiet periphery city of Lindel An accident begins to stir up excitement! What else happened today in Lindell, which is full of geeks?!"]}]