[{"title":"The Crown Princess Audition","tags":["Fantasy","Historical","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manga The Crown Princess Audition\nAs a daughter of nobility, Apple Arden is expected to take part in the Crown Princess Audition. But one day, a never-before-seen girl named Rose arrives at their family home wishing to be adopted into the Viscount Arden family for her own chance to become the next crown princess. When that doesn’t work, she offers to buy the family’s candidacy to participate. The family accepts her generous offer, but Apple can’t help but notice how strange everyone has become since Rose’s arrival. Nonetheless, and Apple becomes Rose’s lady-in-waiting as support, and declares to support Rose by participating in the auditions. But why is everyone in Apple’s family acting strangely ever since Rose’s arrival?"]},{"title":"Revenge with the Demon King","tags":["Historical","Romance"],"disc":["Read Revenge with the Demon King / Your Majesty, Madame Has Gone Violently Again!","She, an infamous fool in the capital, a loser in everyone’s eyes, is set up by her vicious elder sister and perishes. When she wakes up, a modern girl’s soul is reincarnated in her body. From then, she is no longer the pushover but becomes “the avenger”. Her vile-hearted sister and heartless fianc must kneel before her and beg for their lives!"]},{"title":"Let’s Do It After We Marry","tags":["Josei","Manhwa","Romance"],"disc":["Read manhwa Let’s Do It After We Marry / Save It for the Honeymoon / 결혼하고 합시다","Mo-Ah is a nonogamist who always went around shouting, “I’ll never get married in this life! Until one day, she faces her boss Geon-Hu, who is known for being strict and level-headed…naked. But it surely can’t be true… You’re telling me that such a figure belongs to a human?! He’s as grand and brilliant as an art statue. To the point that she forgets her shame on the spot, and is unable to take her eyes off of him. After witnessing Geon-Hu’s perfect naked body, Mo-ah suffers from a terrible aftereffect. Wherever she was and whatever she did, all she could think about was his figure. The distressed Mo-Ah confesses to him one night while drunk. Excuse me… Team Leader, could you sleep with me once? It was a confession that she definitely couldn’t bring up had she been sober. There was a rush of regret the moment those words left her mouth, but his reply was an even more troublesome answer. I’m sorry, but I won’t do it unless it’s with the girl I’m going to marry."]},{"title":"Becoming A God By Teaching Six Sisters","tags":["Action","Fantasy","Harem","Martial Arts"],"disc":["Read manga Becoming A God By Teaching Six Sisters / Super God started from training six sisters","Ye Luo’s six sisters are extremely proud of the sky. The eldest sister is at the top of the battlefield, a dominating force. The second sister’s cultivation is outstanding, a generation of divine emperor. The third sister has countless divine beasts, the head of a family. The fourth sister is the one who can bring back the dead, the one who has the best hands. Fifth sister formation through the sky, no one dares to mess with. Sixth sister… and so on! And little sister, the daughter of the head of the villain also to be entrusted for life! Ye Luo: I really… too difficult! It’s so hard to choose, wa ha ha ha ha ha!"," "]},{"title":"The Princess Doctor’s Revenge","tags":["Historical","Romance","Webtoons"],"disc":["Read manhua The Princess Doctor’s Revenge","Having survived by transmigrating into the past, only to die for a bowl of her heart’s blood?! The worst part about the whole thing is the combined efforts of a cheating b*stard and a two-faced b*tch to torture her body and torment her heart. That cheating scum even planned to harvest her body as medicine in order to treat the back-stabbing woman. D*mn it, only a crazy person would not go red with rage! She was going to give that treacherous couple a taste of their own medicine. Yet What kind of person was this man who climbed into her bed every night and forced himself on her?"]},{"title":"Why Would The Princess Be Mischievous","tags":["Liexing","Ping Ping Jun","Romance"],"disc":["Xiao Aiai found her boyfriend cheat on her when the day her mother died. She sweared that she would be a green tea bitch in her next life. Rumble! A thunderstorm struck her and when she woke up again… Where am I?!"]},{"title":"Why The Princess Acts Like White Lotus","tags":["Comedy","Historical","Liexing","Ping Ping Jun","Romance"],"disc":["Xiao Aiai found her boyfriend cheat on her when the day her mother died. She sweared that she would be the white lotus (girls who win boys’ love by acting innocent) in her next life. Rumble! A thunderstorm struck her and when she woke up again… Where am I?!\nI want to be a white lotus!\nWish accomplished.\nMangaToon got authorization from xiamen1819 to publish this content, the content is the author’s own point of view, and does not represent the stand of MangaToon."]},{"title":"Your Tears are Sweet","tags":["Romance","Slice of Life"],"disc":["Read Your Tears are Sweet","In order to become a normal person who can cry, Zuo Xiaoxia began to collect other people’s tears. But who would’ve thought that she’d become entangled with the school hunk in the process?"]},{"title":"The Sweet Ace","tags":["Manhua","Romance"],"disc":["Read manga The Sweet Ace / Sweet Ace / My Ace is Sweet / 王牌甜蜜","Wei Mingxue, who’s always dependent on others, became a black swan. Not only was she well-off in her career, but she was the epitome of a perfect lover. She tolerated her colleagues scheming, but during an emergency, not only was she abandoned by those colleagues, her boyfriend also cheated on her! Despite these hardships, Wei Mingxue did not fall to their slander. Her strength lies in her will. As long as she doesn’t give up, she will always rise on top."]},{"title":"Pretty peasant girl","tags":["Adventure","Isekai","Manhua","Romance","Shoujo"],"disc":["Read manga Pretty Peasant Girl / 农女殊色","A 35 year old female doctor, Su Xin Yu got isekai-ed into another world,\nwhen she woke up,\nshe was in a child’s body,\nshe hid this secret as she grew up,\nwhile trying to survive in this gender discrimination world,\nXiang Zhi became best friends with a boy named Shi Tou brought by a mysterious man,\nwhile not knowingly,\nshe showed her skills and ideas which far exceeded what a child was capable of,\na skilled mysterious old lady in the village noticed…"]},{"title":"The Villainess Needs a Tyrant","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Psychological","Supernatural","Survival","Tragedy","Villainess"],"disc":["Read The Villainess Needs Her Tyrant / The Villainess Needs a Tyrant / 那个恶女需要他 / 그 악녀에게는 폭군이 필요하다","Just now, I stole the lips of a man who is notorious as a tyrant.","In front of my younger cousin, Arinel, who stole everything I had in my previous life.","***","“Why did you kiss me?”","“Because my younger cousin loves you, Your Majesty.”","“Is that so?”","His arms wrapped around my waist. The distance that was formed vanished in an instance. The cold-blooded, powerful man’s smile filled my view.","“Open your lips. If you are going to do it, then do it properly.”","Credit goes to Travis Translations."," "]},{"title":"Only You","tags":["Drama","Josei","Romance"],"disc":["Read manhwa 미치도록 너만을 / Crazy For You\nSe-hee, an intern, entered the hotel guest house in search of a cat that was under temporary protection. Lee Jae-hyun, the executive director of Hana Group, happened to be staying there. She went into the bathroom to hide because she was startled by the noise. The stream of water flows out with a sensual breath, and the hazy steam fills the bathroom. When the shower curtain was pulled back, Se-hee was confronted with Jae-hyun’s icy gaze. “Do not appear in front of me until your last day of work.”"]},{"title":"Singing at Night","tags":["Drama","Josei","Manhua","Mystery","Romance","Supernatural"],"disc":["Read manga Singing At Night ; 过分暧昧的夜晚\nXin Ran is a popular female star who debuted in the center position in an annual competition. She is really strong, vain and loves competition. In reality, however, she is kindhearted, a little lonely, and does not know how to love others! A mysterious vampire’s appearance changed her worldview. Subsequently, she was made into a blood servant. She was unable to resist the manipulation and humbly begged for it. She embarrassed herself in front of the media and was oppressed by a daddy-like, overbearing CEO? “Among the creatures of the darkness, don’t you know that this eldest sister is the real Queen?!”"]},{"title":"Her Smile So Sweet","tags":["Romance","School Life"],"disc":["Xu Jingshu from class one in second year is a cold person who doesn’t talk much. If it wasn’t because the math teacher constantly sent her out as punishment, she may have been considered invisible in her class. Chu Youning, a new transfer student, falls in love with her candy-like smile. On certain afternoons, one can find him, the best student, personally teaching Xu Jingshu mathematics in the study room… sweetly.","她的微笑像颗糖"]},{"title":"Beware of the Red Thread","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoon"],"disc":["Read Beware of the Red Thread / My Red String of Fate / 붉은 실을 조심하세요. / Beware of the Red Thread\nI fell into the reverse harem novel! I’m going to live quietly, but my god. The villain and the red thread are twisted….life is twisted."]},{"title":"My Imperial Physician","tags":["Martial Arts","Romance"],"disc":["Lin Feng, heir of a secret family full of legendary doctors. Ning Mengyan, heir of a famous family in Yan Jing. Fulfilling the task from his master, Lin Feng went to Zhong Hai the legendary sacred place of medical industry. Ning Mengyan was also there to select doctors for her family. Destiny drew them together. They met for the first time when Lin Feng was treating a mad cow patient. Lin Feng’s incredible skill got her attention. Their story was about to begin. Where will destiny lead them? What kind of stories will there be in Lin Feng’s life of being a legendary doctor? Let’s find out together!"]},{"title":"Reverse Villain","tags":["Action","Manhwa","Martial Arts"],"disc":["Reverse Villain Jung-woo, who was reincarnated in the past and tried to conquer Murim, continued his conquest. Because of Shin-Ryong, who is left in a reincarnation cycle along with him, he fails to conquer Murim. In the end, even the fifth attempt fails and he is reincarnated into modern times. Reincarnating into the modern world changes Jung-woo’s passion and dream. He seeks a battle with a powerful enemy, but he’s too powerful for most. This is a story of a persistent relationship that has continued from lifetime to lifetime and how he breaks free from a monotonous goal."]},{"title":"The Lady’s Butler","tags":["Fantasy","Josei","Magic","Manhua","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Lady’s Butler\nWoori is heartbroken to learn that his favorite character – Lancelot tragically died in the novel “The Flower Raised her Sword”.\nShe knew all too well that the housekeeper had to endure her unrequited love for the heroine Charlotte, and even sacrificed her own life to avenge her death.\nSo when Woori awakens in Charlotte’s body, she is determined to guide Lancelot out of his miserable fate.\nBut with the original Charlotte re-appearing, as well as the villainous Duke Vestia, things may not be so simple after all.\nCan Woori guide Lancelot to a happy ending without revealing her true identity?\nFollow us on the story and don’t forget to leave your comments! I hope you will always support us >> teenmanhua.com <<"]},{"title":"Touch Touch You","tags":["Comedy","Romance","Slice of Life"],"disc":["Read manga Touch Touch You","I, Junhee Baek fell in love at first sight. But he rejected me immediately! One day, I was in a marriage arranged by my grandfather and turns out- “Argh!” We haven’t seen each other after twelve years… “Junhee Baek, do you want to marry me?” Why the heck does he want to marry me?! “But you’re not my type” I don’t want to marry you either! But why does my heart beats rapidly whenever he touches me?"]},{"title":"Coddled Princess’s Second Life","tags":["Action","Adventure","Fantasy","Magic","Manhua"],"disc":["Read manga Coddled Princess’s Second Life","Sonia Syland, the only princess of Syland Empire, fell ill and died in her youth. Be pitied by goddess, she reborn to 10 years ago and lived her life again. In her second life, she found that there was a great conspiracy behind her painful death. The beloved father and brothers, who is the one that framed her? In this new life, Sonia made up her mind to live…"]}]