[{"title":"I Got Divorced and Abandoned My Family","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Got Divorced and Abandoned My Family / 이혼하고 가족을 버렸다","“Even if it’s my child, I can still not love them.”","The day she terminated the 5-year-long contracted marriage and filled out the divorce papers, Hilia left Caligo without a second thought. Leaving the byproduct of the contracted marriage, their child, with him.","Hilia Halos was a woman who was colder, more selfish, and more wicked than anyone else.","[Here’s the alimony. Since I don’t need this anymore, I’ll hand it over to you.]","That was what he thought, until he ceded the baronial estate that she so coveted and disappeared.","***","Hilia was sure she would be indifferent.","About leaving the child, and about abandoning the man who brought her excitement.","“Mother, you don’t, hab to, lub, Riche. Riche gonna, only come, sometime. Riche will, lub you more……”","She was actually indifferent. She would have been in the future, as well. If only the dirt-covered child didn’t just appear out of nowhere after four years and told her such a thing.","“So……!”","Tears dripped down the child’s cheeks. Hilia backed away from the child, who was running towards her with arms wide open. She could not be a good parent, nor could she love anyone.","“My baby, there are things in the world you just can’t love.”","So, after leaving that single comment, she turned away.\nPretending not to notice the unfaltering gaze in front of her."]},{"title":"Reincarnation Of The Businesswoman At School","tags":["Action","Comedy","Drama","Fantasy","Isekai","Reincarnation","Romance"],"disc":["Read manhwa Reincarnation Of The Businesswoman At School","She was originally a puppet of her family, a business spy, and an assassin that the police were pursuing. Then, she was betrayed and fell into the deep sea. When she opened her eyes once more, she had become a normal high school student in her third year. Because of her disgraceful birth, her relatives ostracized her since she was young, while her classmates bullied her because of her low self-esteem and withdrawn nature. After her reincarnation, she became a domineering person and beat those people when they bullied her again. Others had to gamble or rely on their luck to see if a jade was valuable. However, with a powerful cheat in her hands, the Spiritual Jade Vision, she could easily detect spiritual qi in pieces of jade with one glance! Life was comfortable, but there were jealous people all around her, and her skin crawled with every move they made!"]},{"title":"Endless Summer","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Endless Summer / 엔드리스 서머","“I shouldn’t be doing this to you…”\nRyu Jin-han, her brother’s best friend who she met by chance.\nHiya Yeon, who witnessed her boyfriend’s affair with Jin-han, was happy for a moment.\nAfter that, Ha-yeon strangely showed an unsightly appearance whenever she ran into Jin-han,\nbut at some point, he began to care\nabout her as a woman, not as his friend’s younger sister."]},{"title":"Hunter World’s Gardener","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Hunter World’s Gardener / Gardener of the hunter world / 헌터 세상의 정원사","Jiha, the weakest labor-class hunter with neither skill nor fighting ability, made a living by running a store while holding the lowest hunter rank.\nBut one day, his life as a hunter changed when he entered a garden from a different dimension through his dream…\n<You have obtained Friendly Plant Lv.1> <You have obtained Blessing of XXX Lv.1>\n‘I gained a skill just by planting one twig…?’\nHis unique adventure as the sole gardener in the hunter world begins."]},{"title":"Lovely Fish","tags":["Fantasy","Historical"],"disc":["Read manhua Lovely Fish / 鲛人崽崽三岁啦","After experiencing the tragic death of her family in her previous life, Mo Jiaojiao has been reborn back into her 3 y/o self! This life, she decides to enter the palace earlier to save Mo Yuan State, but never would have thought her papa was a cruel tyrant. he not only forced her to learn etiquette, but also kills without reason… After, Mo Jiaojiao becomes the little princess most doted on, and even connects with that hostage from the enemy state. The tyrant can only angrily warn: all of you scram! jiaojiao is a treasure that belongs only to me!"]},{"title":"Love in Body","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Love in Body / 러브 인 바디","‘Do Ye-ji’, an 84kg extremely obese person who has been on a diet for many years\nOn Christmas day, the sight of her clothes falling apart was broadcast live and she became the subject of public ridicule as a woman with a ripped stomach.\n‘Love in Body’ was an opportunity for Yeji, who could do nothing but cry.\nIf you fill your heart with love, you will never gain weight?!\nWill Yeji be able to graduate from dieting?"]},{"title":"If You Get Caught, You’ll Die!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa If You Get Caught, You’ll Die! / Love at First Bite / 들키면 죽습니다!"]},{"title":"The Tyrant’s Replacement Bride","tags":["Adult","Drama","Fantasy","Magic","Manhwa","Mature","Revenge","Romance","Royal family","Smut"],"disc":["Read manhwa The Tyrant’s Replacement Bride","“Yes. I am the replacement. You have been fooled!” To save the world and seek revenge, Isla replaced her elder sister, the Wise Princess Ava Cassia. In order to successfully deceive Sebastian Leodegrance, the Evil Tyrant, she must bury her own identity along with her sister’s death. Will Isla succeed in her revenge and destroy Sebastian Leodegrance, or… fall in love with him?"]},{"title":"Dragon Raising Manual","tags":["Drama","Fantasy","Manhua","Romance","Shoujo"],"disc":["Read Dragon Raising Manual / Si Long Shou Ce / Handbook for Feeding Dragon / Sì Lóng Shǒu Cè / 饲龙手册","At dawn, the female lead suddenly died at the subway station due to overwork. “If there is such a thing as reincarnation, please let me be born with a gold spoon. I want to have supreme authority, and also immeasurable wealth that can’t be squandered off~” These final words which were meant as a half-hearted joke somehow came true?! The female lead’s soul entered into a game and became a true princess, is this the legendary “blessing from good karma”???"]},{"title":"I Vow to Take the Tyrant’s Throne","tags":["Fantasy","Romance"],"disc":["Read I Vow to Take the Tyrant’s Throne","Joo-hyun Mo, CEO, has a big day ahead, and is awaiting her big break, when she gets into a car accident. She wakes up, but is reborn as the third daughter of the evil emperor, Mezan Nox. Without a clue as to why this has happened, Mo lives as Gloria for seven years before she finally gains a clue into a magic portal that could help her go back to her world. She is determined to play the part of docile sister to evil father and mini-me daughter, Isabelle, while also looking up to her oldest half-sister, Dorothy. With the help of a prince from another country Rubilion’s Autus, she finally passes through the portal, only to be met by an even more impossible deal: she must sell her soul and succeed in seeing her father fall to his miserable death, just as the real Gloria wished before she died. She has one shot to succeed, and to go back to her own world."]},{"title":"I’ll be Taking a Break for Personal Reasons","tags":["Action","Adventure","Fantasy","Manhwa","Murim"],"disc":["Read manhwa I’ll be Taking a Break for Personal Reasons, 일신상의 이유로 잠시 휴재합 니다 ,The Creator is on Hiatus","I am a failed, third-rate webnovel author, Yu Ill-Shin. Don’t start praying at me just in case because you think I’m a god. It’s just my name. This foul world where only hunters are appreciated. But even if you awaken as a hunter, not all hunters end up the same. A life dependent on hunter rank, which normally wouldn’t change once it’s been set. One day, I was able to awaken just as I had desperately wanted. But my awakened ability is somewhat strange?\nIn this little world connected to my smartphone, those insignificant and weak ants being slaughtered consider me their god? And someone as insignificant as me has to save the world? Is that correct?"]},{"title":"A Mouse Biting a Dragon’s Tail","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Mouse Biting a Dragon’s Tail / 용의 꼬리를 문 생쥐","“You’ll die if you stay here.”","Ten coins and a charred roast chicken. That was the worth of the girl. Born an orphan and sold to a back-alley restaurant, the only thing given to her over the 16 years was a name—Rat.","A name as insignificant and dirty as her appearance, which made it hard to tell if she was a boy or a girl.","One evening, after being kicked around by thugs for no reason, Rat stood in front of a noble family’s mansion and made a wish. She thought it was a wish that would never come true, but she wanted to enter that mansion just once, even if it meant dying afterward.","To her surprise, she was granted permission to enter. Without hesitation, Rat stepped forward, not knowing what fate awaited her or where it would lead her."]},{"title":"Who Knew Dragons Could Be This Cute","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Who Knew Dragons Could Be This Cute / Le secret de mon adorable Grand-Duc / 孤高の公爵様が私にだけ可愛すぎます！ / 세계관 최강자 를 너무 귀여워하면"]},{"title":"You’re Addictive!","tags":["Action","Adventure","Chinese","Comedy","Drama","Fantasy","Full Color","Manhua"],"disc":["Read manhua You’re Addictive! / Excuse Me! You’re so addictive","Excuse me!\nCan you help Ling Zhixi who has been punished from heaven to help him through his tribulation?\nDisguised as a man, she became a puppet emperor in the Ling Kingdom.\nwhile becoming Xiaohan, the proud Major General was his mortal identity.\nXiaohan accidentally finds out that Ling Zhixi is actually a woman! In their day-to-day interactions, this icy Major General, not sexually attracted to women, has gradually opened up."]},{"title":"See You, My King","tags":["Drama","Fantasy","Historical","Romance","Shounen Ai","Time travel"],"disc":["Read manhua See You, My King / 再见，我的国王","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","Zhang Li witnessed the “stone statue” he was closely associated with disappear in front of his eyes. Filled with grief and regret, he comes to arrive in at Elbis, a mythical ancient civilization from long ago that had mysteriously perished. At last, he encounters the stone statue again, only to find that he wasn’t the old crybaby that clung to him every day, but a cold, ruthless tyrant instead. Can he stay with him this time…"]},{"title":"My Inventory is Abnormal","tags":["Action","Adventure","Fantasy","Romance"],"disc":["Read manhwa My Inventory is Abnormal / 내 인벤토리가 이상하다","The game has turned into reality,\nand a “Great Migration” has occurred all over the Earth.","As a top-tier ranker thanks to massive in-game purchases,\nalong with the special privileges from the game administrator “Nel,”\nI got a new lease on life.\nI even inherited the inventory of my max-level game character\nas it was prior to the game shutting down.","From cash items that no one else can acquire,\nto special items of legendary grade that everyone desires!","Now, everything that everyone wants\nunfolds infinitely within my inventory.","Please, let it be known to only you!","My inventory is… abnormal."]},{"title":"Altruistic Warrior","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Altruistic Warrior / Selfless Warrior / 이타적 용사 / Altruistic Hero / Selfless Hero","A world where the game system is default. In that world where there were levels, inventories, skills, and dungeons, Aine’s level was only 7. Growing up alone in a small village on the outskirts, she barely lived through beginner monster hunting and she thought she would continue to do so for the rest of her life… . [Caught by a rare Torong curse] [Curse intensity: S Rank] Life has changed since being cursed. The pain that comes every night. Her priest said to her that she was having a hard time. ‘If you have a relationship with someone with strong divine power or drink their blood… The curse may be purified.’ A person with mighty divine power. Like a warrior, for example."]},{"title":"I Became the Villain’s Trainer","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga I Became the Villain’s Trainer /  I Became the Obsessive Lead’s Trainer / 흑막들 의 조련사가 되었습니다 / Aku Menjinakan Serigala Grand Duke!","She thought she was dead but she woke up inside a novel – to an extra who will die a year later.","Not wanting to die like this, Alexa decided to tame the male protagonist in the form of a dog. Two years from now, the male lead will return to his human form. In the meantime, she was thinking of leaving the Grand Duchy after receiving the right pay for doing them a favour.\nThe problem is that when the male lead returns to his human form, he forgot all his memories.\n“You have to remember me, okay? There’s no point in looking so cute. Promise me!”\nShe told him many times because she didn’t want to mistakenly die by the male lead’s hands, who became a villain.\nBut,\n“You told me to remember, so I remembered everything. Alexa.”\nYsildus unbuttoned his jacket.\n“If there’s no other way to return that favour then I have to pay it with my body.”\nA cute puppy that grew up into a weird wolf.\nDamn, what did I raise?"]},{"title":"I Only Came to Find my Dad","tags":["Fantasy","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Read manga I Only Came to Find my Dad / Just Wanted to Find My Father / Searching for My Father / Why Did You Come To My House? / 只想找爸爸 / 아빠만 찾으려고 했는데 / 우리 집에 왜 왔니 (블루밍부케)\nDespite her lack of father, Louise lived happily with her mother.\nThen one day, with her mother’s death, her happy life came to an end.\nAs her self proclaimed guardian, her uncle Benjamin, a scumbag who coveted her mother, took her in as his niece.\nThe only rebellious thing that little Louis could do whilst in her uncle’s grasp was to kill herself.\nBut for some reason, Louise returned to the year her mother died. The joy of meeting her mother again was not able to prevent her death from repeating, so I left to find my father, recalling my mother’s words, “dad is alive,” the only clue that will eventually change my fate in this life. But for some reason, Louise returned to the year her mother died. The joy of meeting her mother again wasn’t able to prevent her death from repeating, so she left to find her father.\nHer mother’s words, “Dad is alive” were the only clue she had, and that would eventually change her fate in this life. I escaped from Benjamin and barely made it to my dad’s house… but he wasn’t the only one there…?"]},{"title":"Taram Taram Taram","tags":["Manhwa","Romance"],"disc":["Read manhwa Taram Taram Taram / 타람 타람 타람, 타람타람타람","“Dawn” entered the hall with her calm movements and stood in the middle. Her face showed no emotions, like a doll, but she was captivating and elegant, strikingly like an ice queen. Exer smiled lightly, spread her legs, and said, ‘As Lord, I will embrace you tonight.’ A fateful encounter for the first time. A woman falls in love at first sight. And a man fights the world for this woman. ‘If this world cannot accept her as a wife, then I will change this world.’ A love story between Dawn, the Eastern girl who endured a tough childhood while fleeing from war and became a slave, and Exer, the handsome man who was known as the strongest warrior in the kingdom."]}]