[{"title":"I’ll Love You Forever","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua I’ll Love You Forever","During high school, the wild Xiao Kaikai liked the tricky teacher, Xu Moran. But on the day that she was going to confess, Xu Moran disappeared without a trace. Six years later, Xiao Kaikai made her dream of becoming a pilots’ instructor come true. And the Xu Moran who had disappeared six years ago reappeared and started to crazily pursue Xiao Kaikai. If you liked me, then why did you disappear at that time? If you don’t like me then why did you come back to pursue me? All the mysteries surrounding Xu Moran get revealed one by one…"]},{"title":"Dangerous Man","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa Dangerous Man / 위험한 남자","Han Bomi is a paralegal who moved to L&B law firm after being caught up in rumours that she had seduced a man with a fiancée. There, she meets Eren, the new CEO of the L&B law firm, a man with a dangerous vibe. Bomi’s resemblance to someone attracted her to Eren and although he is constantly concerned about Bomi, she always feels intimidated. “Don’t flinch. There is no one who can hurt you.” “Yes, I wasn’t like this from the beginning. It won’t be easy but I’ll change slowly but surely.” A romantic drama about the growth of a woman who is proudly reborn with the love of a man who looked dangerous!"]},{"title":"I Am Being Chased To Fall In Love Everyday","tags":["Comedy","Drama","Manhua","Romance"],"disc":["Read manhua I Am Being Chased To Fall In Love Everyday / Forced to Fall in Love With the Boss Every Day / Meitian Bei Po He Da Lao Tan Lian’ai / Mỗi Ngày Bị Ép Cùng Đại Lão Yêu Đương / 每天被迫和大佬谈恋爱","Xue Xi, who has been gone for eighteen years, was ridiculed by her grandmother and cousin as soon as she returned home. She was also disgusted by her classmates when she arrived at school. Unexpectedly, when she met Xiang Huai, he inexplicably triggered the debuff of “If you don’t fall in love, you will die”. In order to save yourself, she can only fall in love with the owner of this little gangster of the grocery store. A love relationship between an almighty boss and a learning boss has begun…"]},{"title":"Happy Ending for the Time-Limited Villainess","tags":["Drama","Fantasy","Isekai","Magic","Romance","Shoujo"],"disc":["Read manhwa Happy Ending For The Time-Limited Villainess / The Villainess’s Days Are Numbered / El Final Feliz de la Villana / 余命僅かな悪女にハッピーエンドを / 坏女孩的幸福结局 / 绝症恶女的完美结局 /시한부 악녀의 해피엔딩","‘Please have a happy marriage with me only for six months’\n“What good does that do me?\n“We will, of course, give you the Reno family fortune and estate.”\n“… Suppose you give it all to me. He said he would divorce me in half a year. If so, what do you do then? ”\n“…There’s something I’m thinking about doing. I won’t be able to use this money anyway.”\nClea always lies. This body will soon die. It will only last half a year.\nAfter a fulfilling marriage, Clea Reno wants to close her eyes for the last time in a quiet place.\nWhen I was stabbed to death, I was summoned before the Demon King and had a six-month term as a villain.\nMy body uses up one energy when taking a step, three health when talking, 300 health after running for ten seconds, and I bleed when one third of my energy is exhausted.\n“Oh my, she did it again to get attention.”\n“It’s amazing that she takes the paint with her wherever she goes.”\n“Well, Sir Detroit coldly rejected her.”\nMy reputation is the worst.\nThe demon lord said that he would save my body if I married happily, but the situation is getting worse.\nI had to marry the man I was in love with, the Duke of Detroit.\nI said I would do anything to get married, but I don’t know what a “happy marriage” is…\nWill I be able to survive?"]},{"title":"Your Majesty Is So Handsome","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Your Majesty Is So Handsome / Your Majesty Is So Handsome / 폐하가 너무 잘생기셔서"]},{"title":"Accidental Everlasting Love","tags":["Drama","Psychological","Romance","Shoujo"],"disc":["Read manhwa Accidental Everlasting Love / Love You By Mistake / I’ll Love You Even If It’s Wrong / Loving You, a Mistake After All / Ai Ni, Yi Cuo Dao Di / I’ll Love You Even If Its Wrong / 愛你，一錯到底","Accidental Everlasting Love: After being betrayed by her own boyfriend, the female lead is suddenly engaged to the esteemed Mr. Fu. Where should she go from there? “I’ll need to train you to become my qualified fiancee. You’ll need to get used to my touch, my gaze, and the scent of my body. If you can get everything you’ve ever wanted six months after you were betrayed, would you choose to be filthy rich, get the admiration of everyone… or get my love? It’s a mistake that you’ll have to deal with for the rest of your life.”"]},{"title":"The Villain Dreams Of The Heroine Every Night","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villain Dreams Of The Heroine Every Night / The Villain in the Horror Game Dreams of the Heroine Every Night / 공포게임의 악역은 밤마다 여주인공의 꿈을 꾼다","109 death endings.\nShe possessed the heroine of a horror game, Celine.\nAs she was getting tired of repeated deaths, the villain appeared in front of her.","“I thought you were going to die, but you look perfectly fine.”\n“Yes…?”\n“Say… Why are you dying in my dreams?”","A sweet and bloody symbiosis between a villain who desperately needs a good night’s sleep and a female protagonist who doesn’t want to die anymore!"]},{"title":"The Comic Changes My Destiny","tags":["Action","Adventure","Fantasy","Manhua","Romance","School Life","Shoujo","Slice of Life","Webtoons"],"disc":["Read manhua The Comic Changes My Destiny / 我的命运之书","When the book of destiny can portray and change the future, when the characters in the pen become a living reality, the comic world and the real world overlap! Ordinary female college student Luo Youzhen is about to experience an unprecedented experience, and embark on an adventure journey… A hidden cartoonist, a cartoon character with abilities, a hegemonic young man next to him, a mysterious female killer, who represents justice Who is evil? The comic legend that crossed the dimension opened!"]},{"title":"Mrs. Bo Was Stripped of Her Vest Again Today","tags":["Romance"],"disc":["Read Mrs. Bo Was Stripped of Her Vest Again Today / CEO Bao Was Dumped By His Wife / Báo Tàitài Jīntiān Yòu Bèi Bā Mǎjiǎle / 薄太太今天又被扒马甲了","The beloved wife of CEO Bao ran away as soon as their marriage contract ended. He didn’t expect that he was just a plan B among many plans of his wife. She was one of the top students in college. She is the champion of boxing. And now, she has stolen his heart! Unbelievable…."]},{"title":"Aidin","tags":["Action","Adventure","Drama","Fantasy","Romance","Time travel"],"disc":["Read manhwa 아이딘 / Aidin / Aideen","Aideen, the daughter of a Duke and leader of the assassination troupe “Owl”, is betrayed by her master Raymond and executed for crimes that she didn’t commit. However, when her life seemingly reaches its end, she somehow travels back in time five years. Learning the truth about her father’s death, Aideen vows to eliminate the Empire of Perdi and take her revenge against its Emperor. Sent to the enemy kingdom of Jeldion, Aideen is tasked with negotiating peace, but she has yet to realize that fate has unimaginable things in store for her…!"]},{"title":"There was a Hero","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Read manhwa There was a Hero","You want me to become the hero’s experience points and loot??? With pleasure!!! A hero who bravely ventures forth to defeat evil, and a monster (named El) whose sole life goal is to be killed by said hero…is finally confronted by the hero’s party after dreaming about a comfortable afterlife for so long! But… The hero is way too weak! Everyone except one was wiped out by El’s attack. When his dreams of happily retiring in the afterlife are about to be shattered, Laphie from the hero’s party says out of desperation: “I’m with child!!!” El comes to a realization spurred by Laphie’s statement: “if the hero who was supposed to kill me isn’t here… then I’ll raise one myself!” Now, with El (the Lieutenant-General of the demon army who knows nothing about raising a child), Laphie (the inexperienced mother), and Dino (the cutest baby hero), their “ordinary,” child-raising fantasy story unfolds! Here comes the world’s most unpredictable family!","So You’re Raising a Warrior"]},{"title":"Give the Harem to the Villainess","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Lin Ci transmigrated into the otome mobile game she created and became the villainess. The only way she can go back to the real world is avoiding the harem ending and letting the heroine, Rutas, end up with one love interest. Otherwise, Lin Ci would be killed according to the plot. To survive, Lin Ci must win over the men from the heroine one by one!"]},{"title":"Date First, Love Later","tags":["Drama","Manhwa","Office Workers","Romance","Shoujo"],"disc":["Read manga Date First, Love Later\nJaerim Lee, a student in film studies major, needed a way to quiet down the rumors that he’s into guys. Gaeun Cha, a student in screenwriting major, needed to get away from the dorky senior who was always hitting on her. The two of them begin a contractual relationship to solve their problems, but as they get to know each other, Gaeun starts to fall for Jaerim’s charm little by little…"]},{"title":"True Beauty","tags":["Drama","Manhua"],"disc":["Read manhwa True Beauty","A high school girl who rises to pretty girl fame in her school after she masters the art of make-up via YouTube. From Naver: Everyone has a secret. Then what kind of secret does a goddess have?"]},{"title":"Peerless Doctor In The City","tags":["Action","Adventure","Comedy","Fantasy","Harem","Martial Arts","Webtoons"],"disc":["Read manhua Peerless Doctor In The City / Top Doctor’s Urban Adventure manhua / The strongest doctor in the city ,最强神医混都市,The strongest mixed medicine city ,Dokter terkuat sekota , Siêu Thần Y Tung Hoành Đô Thị, Genius Doctor In The City","The genius of medicine and Taoism, Yang Yunfan, He is the only disciple of ancient medical immortal and a super soldier with a mysterious identity. He obeyed his master’s orders to go down the mountain to fulfill the marriage contract he had set up since he was young, but he was arranged to be a trainee in a community hospital by his beautiful wife wife."," "]},{"title":"My annoying boss","tags":[],"disc":["Read manhwa My annoying boss / 나의 불편한 상사 / My Uncomfortable Boss","Sera’s boyfriend, whom she expected to marry, cheated on her.\nOn her first day at her new work, she sees the back of her ex-boyfriend and chooses to throw coffee on him, only to discover that it wasn’t him at all, but a COMPLETE STRANGER.\nThe stranger turns out to be a man she has to see every day: her boss!","“My annoying boss” is a romantic comedy set in an office about Sera’s biggest crisis in her life."]},{"title":"Spicy Wife’s Reborn World","tags":["Drama","Romance","Webtoons"],"disc":["Read Space for rebirth: a spoiled wife / 重生空间：豪门辣妻不好惹 / Istri Reinkarnasi Presdir yang Galak / Rebirth: The Journey of a Wife Spoiling Her Husband / Don’t Mess With Mistress","Reborn in pursuit of revenge, I am sure I can easily achieve my goal, as—\nI happen to be as rich as Bill Gates, as beautiful as Audrey Hepburn, and as deadly as deadpool.\nHowever, none of these above works when it comes to dealing with a sweating and panting CEO, who is poisoned, who is in need of “immediate relief.”\nI’d love to help, but…don’t pull an ice-cool face when you’re kissing me, sir!"]},{"title":"Am I the Daughter?","tags":["Comedy","Fantasy","Webtoons"],"disc":["Read manhwa Am I the Daughter? / 내가 딸리에요?","She was adopted by the devil-like count. Before dying, Hailynn lived her whole life being confined in a hut. When she opened her eyes she was 8 years old. She returned back in time right before she was to be adopted by the count. Hailynn wanted to ask God… What was it that she had done wrong?!?! She cursed God and threw herself out of the carriage that was en route to the count’s estate.\nOn that path, she met the Duke Kalisto, the representation of the sacred Vincent Kalisto. But… “She is of noble blood.” She thought she was an orphan but in actuality, she is actually the first daughter, in a thousand years, of the ducal household of Kalisto. “Am I really… the daughter?”\nHowever, Vincent has never approved of any woman and lived his life in abstinence. He swore he did not commit any act that may produce a child, thus he denies that he’s the father… “…A monster?” What is the secret behind Hailynn’s birth and the abrupt movement from the empire and the holy country?! This is the first-time father, Vincent, and first-time daughter, Hailynn’s clumsy yet lovely story."]},{"title":"The Queen Of Heaven","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua The Queen Of Heaven / 天后上位法则","A idol died bizarrely. In order to investigate the truth of the death, she added an idol audition competition and used her knowledge of human nature and public opinion to finally reach the top of the show. Unexpectedly, she was betrayed by someone close to her at this time. It turned out that he had been pretending to be by her side, waiting for the opportunity to pull her into the abyss. This lunatic, who was full of “tragedy makes beauty more beautiful”, could hardly communicate with her in normal language. He and her established a gambling contract by marriage and started with the entire entertainment industry as the stage."]},{"title":"The Wicked Girl Is Arriving Tonight","tags":["Drama","Fantasy","Harem","Historical","Romance"],"disc":["If Li Xing unexpectedly received the abuse residue and becomes stronger, she can absorb the decomposition value and strengthen her attributes, and clean up the messes and women who ruined her family in the past life! The evil woman, who had been fighting everywhere with her golden arm, only to find herself in a strange situation: A hundred million dollars worth of medical professionals were scrambling to carry her school bag. The Face of the World: The Three Golden Film Awards? Top gangster turns a wolf into a dog and asks to pat his head? Imperial business tycoon Dieying tried to tear up her clothes, but she still had ten to one."]}]