[{"title":"Archmage Streamer","tags":["Action","Adventure","Fantasy","Manhwa","Webtoons"],"disc":["Archmage Streamer manhwa, BJ Archmage, 대마도사\nJung Hyun-Woo didn’t have talent, money, or luck.\n‘Why am I seeing the hidden information of the game?’\nAfter getting electrocuted, he begins to see things that shouldn’t be seen in-game."]},{"title":"I Became the Wife of the Male Lead","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Became the Wife of the Male Lead / Author of My Own Destiny / ラスボスの私が主人公の妻になりました / 成为我男主的妻子 / 成为我笔下男主之妻 / 내 남자 주인공의 아내가 되었다","I possessed the body of “Fiona,” the final villainess whose soul was sentenced to eternal suffering after her gruesome demise at the hands of the world’s hero.","She was tortured by her own family just because she was an illegitimate child.","And so… arriving six years before the start of the novel, I was sent to war at the age of thirteen! Fortunately, as the story’s greatest villainess, Fiona was a genius mage.","I had to survive the monster invasion. But now, I couldn’t be in the middle of a battlefield.","Just before I ran out of breath, I encountered the teenaged male lead.","…Why is he here?","Well, if the male lead dies here, then the world will be destroyed. So, let’s save him first!"]},{"title":"Gods’ Gambit","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Gods’ Gambit / 신들의 계략","One day, a city was summoned for a game of the gods. Choi Yul acquires “Book Krasina, The Sacrifice of Sovereignty,” a first payment reward that reveals all of the game’s strategies. However, the item’s ability monopolizes all of the rewards acquired by people who shared the strategies! Will Choi Yul, who has received this double-edged sword item, be able to survive until the end?"," "]},{"title":"Ha Buk Paeng’s youngest son","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa"],"disc":["Read manhwa Ha Buk Paeng’s youngest son / The Youngest Son of Habukpanga / Revenge of Young Master Peng / 彭家四公子 / 하북팽가 막내아들"]},{"title":"The Eighth Bride","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Eighth Bride / 8th Bride / 8番目の花嫁 / 8번째 신부 / 第8位契约新娘"]},{"title":"Brother, Am I Cute?","tags":["Drama","Fantasy","Manhwa"],"disc":["Read manhwa Brother, Am I Cute? / 형아, 나 귀엽지?","[Healing emotional parenting story of 20-year-old brothers]","Si-hyuk loses his parents in a sudden car accident and his younger brother Si-ha is 20 years younger than him.","The family was whispering about me and my younger brother at the funeral.","“What to do with those two? Who wants to take charge?”\n“Oh my. “Now that he’s a college student, how would he raise his little brother?”\n“I heard there is insurance money?”","In the midst of this chaos, Siha opened his mouth.","“Brother. Brother. “Uwaa!”","Siha pronounces the words correctly for the first time and cries.","Brother.\nHe said brother, not dad, not mom.\nSi-hyuk slowly approached and hugged Siha.\nI will protect you."]},{"title":"I Created a Salvation Organization","tags":["Action","Adventure","Fantasy"],"disc":["Read I Created a Salvation Organization / 我打造了救世组织","He got a doomsday salvation system. As long as he saves the world, he can have everything. He recruited top talents to build the Pan-Human Principle Guardian Association. He descended into the doomsday worlds as the guardian of human principles, allowing the whole world to admire him and worship him as a god. The ultimate natural disaster. The mutation frenzy. The whisper of the evil god. Thus, a huge organization spanning many worlds, taking the protection of human principles as its own responsibility and saving civilization from the fate of destruction, gradually appeared in the eyes of the world."," "]},{"title":"The Reversal of My Life as a Side Character","tags":["Action","Adventure","Fantasy"],"disc":["Read The Reversal of My Life as a Side Character","In the midst of a repetitive and boring everyday life, a game appeared as if it were fate—*Heroes Destiny*. After spending ten years playing it, I finally completed the game, but all that remained was the emptiness of having to return to an ordinary life. At that moment, a message appeared on the screen: “Do you desire a new adventure? [Yes/No].” Little did he know that he would wake up in an unfamiliar body and an unknown place. “Remember, I am now Calix Shaekin.” And thus… “I will become the protagonist of this world!”"," "]},{"title":"I’m Fine, Thank You, And You?","tags":["College life","Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m Fine, Thank You, And You? / 아임 파인 땡큐, 앤유?"]},{"title":"The Constellation That Returned From Hell","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","Romance"],"disc":[]},{"title":"Invasion of the Myriad Races: Starting by Taming a Legendary Beast","tags":["Action","Adventure","Drama","Fantasy","Manhua"],"disc":["Read manhua Invasion of the Myriad Races: Starting by Taming a Legendary Beast / 万族入侵：开局驯化史诗级巨兽"]},{"title":"Irreplaceable Kiss Scene","tags":["Drama","Romance"],"disc":["Read manhwa Irreplaceable Kiss Scene","Is there a top actor who turns into a 7-year-old child just by kissing?! Due to an accidental incident, the stunt double ‘Kang-som’ must take responsibility for the actor who has transformed into a child because of her. A life of bickering with a prickly and sensitive superstar! While they worry about being found out, an opportunity for Kang-som to become a popular actor arises…?!"]},{"title":"My Family is Obsessed with Me","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Devoted to Diamond / Keluargaku Terobsesi denganku / My Family is Obsessed with Me / 가족들이 나한테 집착한다","I was a warrior, who died after being taken advantage of, in my previous life.","I was reborn, so I tried to get revenge, but how could I be so unlucky to get kidnapped and sent to an orphanage?","But;","“Why don’t you come with me?”","I was adopted by a rich family. I decided to leave in three years time, after causing a moderate amount of trouble.","“Are you going to leave?”","“Yes?”","“Are you really leaving us?”","My family refused to let me go. Why are they so obsessed with me?!"]},{"title":"Dangerous Office Romance","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Dangerous Office Romance / 위험한 사내연애","I met my one-night stand partner again at work. And it was as a CEO and an employee!","Jisoo grew up being raised in a family that taught her that ‘women should be modest.’","Five years ago, the one-night stand with Hyunwoo, whom she first met at a club, was just a one-time affair…","One day, she ran into Hyunwoo at work! What? This guy is the CEO of our company starting today?!","Jisoo is uncomfortable with Hyunwoo, who has a dark past together with her,\nbut she gradually starts\nto feel swayed by Hyunwoo, who only knows how to be straightforward…"]},{"title":"I Tried To Live A Good Life, But!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Tried To Live A Good Life, But! / 착하게 살려고 했습니다만"]},{"title":"??? Rank no Ura Soubi Musou","tags":["Action","Drama","Fantasy","Magic","Manga","Romance"],"disc":["Read manga ??? Rank no Ura Soubi Musou"]},{"title":"Doppio Senso","tags":["Action","Drama","Manhwa","Mature","Romance"],"disc":["Read manhwa Doppio Senso / 复仇女的双重面孔 / 도피오 센소","Nothing tastes sweeter than revenge, and Lee Eunha is dying to get a bite. Following the assassination of her father by rival thugs working for Noh Hyungchul, a distraught Eunha takes his place in the Serim Family gang, eager for a chance to bring down the man responsible. That opportunity comes when she is asked to infiltrate the life of of Shin Kyunghyung; Hyungchul’s right-hand man masquerading as an executive at Yongsung Family’s puppet company. A thrilling tale of deception and seduction unfolds, with Eunha willing to do whatever it takes – and become whoever necessary – to follow through with her mission. But as the femme fatale weaves her web of lies, will she lose her sense of self along the way…?"]},{"title":"The False Saintess Overturns Her Fate","tags":["Romance"],"disc":["Read manga The False Saintess Overturns Her Fate","Reincarnated as Philomela, the hated character in the novel, she is doomed to die a cruel death… She has been called a fake saint, betrayed by her family and loved ones, and left with no way out. This is a fantasy of a saint who was called a fake, and whose life is turned upside down."]},{"title":"Genius Grandson of the Loan Shark King","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Genius Grandson of the Loan Shark King / 사채왕의 천재손자","Will Kim Mu-hyuk, the grandson of the loan shark king be able to ascend to the throne of the ruthless Loan Shark Empire, feared by even gangsters? Kim Mu-hyuk, the Grandson of the Loan Shark King Cheon Tae-san, whom even the wealthy elites of South Korea bowed to, strives to be recognized as a member of the Cheon Family. Despite his efforts, Mu-Hyuk is betrayed and killed by his uncles in a vicious struggle over his grandfathers inheritance. However, instead of dying, he wakes up in the 1990s, with a second chance to rewrite his fate. Determined to prevent the death of his grandmother, who raised him, and reclaim the legacy of the Cheon family, Mu-hyuk sets out to preserve his severed friendships and take brutal revenge on his uncles and anyone else who stands in his way. Though once a troublemaker, Mu-hyuk quickly rises to the top both academically and socially, earning his grandfathers trust. As he solidifies his place in the family, Mu-hyuk begins manipulating the underworld, gaining control over criminal organizations and influential figures in politics and business. Gradually, he paves his path to fulfill his ambitions and exact his revenge, one step at a time."]},{"title":"Contract Grand Duchess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read mahwa Contract Grand Duchess / 계약직 대공비 / The Contractual Grand Duchess","“Rien, a princess whose husband dies every first night, has married for the sixth time. This time, she hoped for a happy marriage, but what she got was her husband’s mistress, an illegitimate son, and a poisoned glass of wine.","“You were just a means to an end.”","Rien closes her eyes as her sixth husband mocks her as she agonizes.","And then… When she opens her eyes again, it’s the funeral day of her fifth husband!”"]}]