[{"title":"I Ran Away From The Hunter","tags":["Demons","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa I Ran Away From The Hunter / Getting Away From the Hunter / 사냥꾼에게서 도망쳤다","Ravi, a dream demon, ran away into the world of a novel while trying to avoid a demon hunter. But out of all the genres, she managed to slip into a bl novel! Men who used to line up to be with her after making eye contact were suddenly all cold-hearted inside the novel. It’s now been half a year since her life of being rejected and dumped by characters who instinctively recognize her as a women despite dressed as a man. “I’m not going to die from not eating enough energy, am I? Please, anyone is okay, so please come to me…!” Hopeful and with an open mind, Ravi meets a nerd with glasses to spend the night with, but… “Why are you here?” When his glasses fall, the person is none other than… the demon hunter she was running away from?! “I can’t die like this!” says the dream demon who met the demon hunter after running away, but a predator will prey, and a hunter will hunt. Will Ravi choose to survive while in the middle of the relationship that will forever draw parallel lines?"]},{"title":"What Kind of Rice Cake Is This","tags":["Comedy","Romance","School Life"],"disc":["Read manhwa What Kind of Rice Cake Is This / Lucky Strike / 이게 웬떡 / My Lucky Strike","One day, Gong Siru, who was losing interest in college life, had a pleasant campus life with the appearance of Seol Gibaek, a returning student. Shocked by Kibaek’s ideal type, Siru takes her anger out with a drink and kisses someone present while drinking… A jumbled campus love story between Gong Siru who has a crush on Seol Kibaek, and Jo Chung, who becomes strangely connected to Gong Siru."]},{"title":"Lend Me Your Lips","tags":["Comedy","Drama","Romance"],"disc":["Read manhwa Lend Me Your Lips / 입술 좀 빌려주세요\nIs there a chance to kiss this man..? A love story between a woman and a man involved in an absurd relationship"]},{"title":"After Becoming everyone’s Favorite, I went on a killing spree","tags":["Fantasy","Romance"],"disc":["Read After Becoming everyone’s Favorite, I went on a killing spree","Growing up as an orphan in the arena, Ora was determined to awaken her summoner bloodline and gain immense power. However, her world turns upside down when she learns that the king has taken her loyal companion, Dragong, putting him in grave danger. In a daring escape, Ora and Dragong flee together, embarking on a series of thrilling adventures. Along the way, Ora hones her strength and resilience, while meticulously planning her revenge against those who have wronged her."]},{"title":"The Precious Girl Does Not Shed Tears","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Precious Girl Does Not Shed Tears / Houseki Shoujo wa Namida wo Nagasanai / Precious Girl Does Not Shed Tears / الفتاة الثمينة لا تذرف الدموع / 宝石少女は涙を流さない / The Jewel Girl Does Not Shed Tears","This is the beautiful life story of the “gemstone girl” imprisoned by death. Ingrid, who cries jewel tears, suffered abuse for the sake of her family’s prosperity. Ultimately, she is killed by her father, for “the tear shed upon death will become the ultimate power.” However, the power of her dying tear rewinds her life. In the course of countless returns, countless deaths, she learns that her execution by her father was at her younger sister’s counsel. “Father will listen to anything I say.” “Die for the sake of my happiness, dear Onee-sama whom I despise.” Knowing she was killed for her sister’s self-indulgence, Ingrid makes a decision. “From now on, I’ll cry no more unwanted tears.” Using the power of her dying tear to its fullest, she begins her final return."]},{"title":"The Imperial Court Maiden’s Curse","tags":["Fantasy","Romance"],"disc":["Read The Imperial Court Maiden’s Curse","The world is plagued by demons. They attack people and livestock, and consume their souls. For some unknown reason, Lingling Wang seems to attract them. Knowing that exorcists are the only ones who can repel them, she travels from the eastern land of Jingluo all the way to the capital city to become a court attendant and meet the imperial exorcist. Meanwhile, the exorcist is worried that the spiritual power passed down to him from past generations has begun to dwindle. At the young age of seventeen, Feng Liang is the head of the imperial exorcists. He’s been trying to translate tens of thousands of research documents that could potentially hold the secret to artificially enhance an exorcist’s powers. At least, according to his father, who was an exorcist from the eastern lands. That’s when the emperor’s arrangement brings the two of them together. Lingling’s mysterious condition! A whirlpool of jealousy and resent from the other court attendants! Action-packed battles between the unfathomable demons and exorcists! And, the budding romance between Lingling and Feng… The stage is set for a spectacular tale set at the imperial court!"]},{"title":"She Became A Billionaire After Divorce","tags":["Drama","Romance","Shoujo"],"disc":["Read manhwa She Became A Billionaire After Divorce / A Billions of Dollars Inheritor / Lihun Hou Jichengle Yi Wan Jiachan / 离婚后继承了亿万家产"]},{"title":"Some Kind of Marriage","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Some Kind of Marriage / Unfriendly Married Life / Unkind Married Life / 不亲切的婚姻生活 / 불친절한 부부생활"," "]},{"title":"Office Worker Who Sees Fate","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance","Super power","Supernatural"],"disc":["Read manhwa Office Worker Who Sees Fate / 운명을 보는 회사원","A child born to become a shaman with the fate of putting the world in chaos. To let go of his greed and refuse god, he’s trying to become an ordinary office worker. Choi Yeonghoon, the one who can see destiny through physiognomy (face fortune reading) and fortune telling. Will he succeed in becoming an ordinary office worker?"]},{"title":"Level-Up Doctor","tags":["Fantasy","Manhwa"],"disc":["Read manhwa Level-Up Doctor / Level Up Doctor Choi Ki-seok / 레벨업 닥터 최기석","Growing up as an orphan, Jeong He-Jin didn’t open his heart to anyone.\nAfter giving his all to become a cardiothoracic surgeon, he got into an unfortunate accident,\nafter which he woke up not as ‘Jeong He-Jin’ but as ‘Choi GiSeok’.\nAnd on top of that, he has to using his skills…?\nThe accident changed his fate drastically…\nCan he become ‘the Greatest Cardiothoracic Surgeon’ as ‘Choi GiSeok’?"]},{"title":"My Hot Friend Is Glowing","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa My Hot Friend Is Glowing / My Friend Is Handsome / 僕の友達がイケメンすぎて無理 / 내 친구는 잘생겼다"]},{"title":"The Archduke’s Gorgeous Wedding Was a Fraud","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Archduke’s Gorgeous Wedding Was a Fraud / The Archduke’s Fabulous Fake Marriage / The Grand Duke’s Splendid Marriage Is a Scam / 그 대공의 화려한 결혼은 사기","When I opened my eyes, I found myself in a crate about to be sold as a slave in an auction. It was going well when the novel’s male lead burst in and saved me, but all of a sudden, this man asked me to marry him. “” Please be my wife and show this empire your worst behaviour, so wicked that no one would dare to approach me when they see you.”” “” What’s in it for me?”” “” I’ll give you 10 billion.”” What the F..X..? Welcome, dear customer! I would gladly uphold the ‘crazy bitch’ reputation to drive away those stalker fans just to live a comfortable life. However- “” I can’t imagine my life without you now.”” Seems like I somehow failed to protect the male lead, and instead acquired him for myself! Will acting as a villainess with all my might bring me money, power, fame, and even love?"]},{"title":"Princess Wars","tags":["Fantasy","Harem"],"disc":["Read manga Princess Wars / War of the Princesses / 公主战争","After the Princess died, the soul entered a life-betting game! She will be the famous Pea Princess and other princesses in a fairy tale who will pursue the only prince. Only a princess who has successfully married a prince can return to the real world and continue her life and receive a huge bonus! How can she fight powerful princesses to capture the prince’s love? !"]},{"title":"Limited Extra Time","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Time of the Terminally Ill Extra / Limited Extra Time / Karina’s Last Days / Limited Time Extra / Time of the Terminally-Ill Extra / 시한부 엑스트라의 시간 / 配角时间有限","The existence of the second child, Karina, who was the successor’s youngest twin and the one who wasn’t as competent as her sibling, has been concealed by the people around her all her life.","One day, she finds out that she only has one year left to live. So, she foolishly visited her fiancé, whom she has never had an exchange with.","Along with the divorce papers that he longed desired for.","“Frankly speaking, I want to stay here for a year.”","“….. Are you crazy, Miss?”","“I’ll break off the engagement.”","But she didn’t know at that time.","“It seems that you keep trying to pretend that you don’t know, so I should definitely tell you then.”","“Pardon?”","“I am fond of you.”","It didn’t occur to her that she would receive attention and affection from him without anything in return. So she comes to desire this much for a life without regrets."]},{"title":"I Play The Horror World As A Simulation Game","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I Play The Horror World As A Simulation Game / Game of Death / Wo Ba Jingsong Shijie Wan Cheng Yang Cheng Youxi / 我把惊悚世界玩成养成游戏","A mysterious force descends upon Earth, giving rise to a horrifying civilization. While everyone is immersed in fear, struggling to survive, Qinnuo discovers that he can earn system rewards by manipulating the emotions of ghosts. With each completed instance, he can establish his own industry in this terrifying world. Whether as a waiter in the Yinquan Restaurant or a chief doctor in the Death Hospital… As Qin Nuo completes one instance after another, he realizes that he has become a giant in the ghostly realm."]},{"title":"Xiao Bai’s father is a wonderful person","tags":["Drama","Manhua","Romance","Shoujo"],"disc":["Read manga Xiao Bai’s father is a wonderful person\nBecause of a conspiracy they had a cute baby together. A few years later, they meet again and she finally felt some “love” for him. After meeting him more often her perspective of him changed. The ruthless man in the rumors doesn’t seem to be as she imagined…"]},{"title":"Dear My Friend","tags":["Adaptation","Adventure","Crime","Drama","Ecchi","Fantasy","Historical","Isekai","Josei","Manhwa","Mature","Music","Reverse","Romance","Shoujo","Webtoons"],"disc":["Read manga Dear My Friend / 디어 마이 프렌드 on MANHWACLAN\nThe main character in Maristella’s life was her friend Dorothea. Maristella was no more than a supporting role, and she struggled and sacrificed herself for her friend’s happiness, only to be betrayed in return.\nDorothea threw Maristella to her death for her own benefit.\n“We’re friends, Marie.”\nIt was Maristella who died miserably.\n“So make a concession, will you?”\nAs I watched Dorothea sacrifice her “friend”, I vowed never to have a miserable ending like that novel.\n“You don’t seem like the person I know. It’s like you’re a different person.”\n“I decided I would not be subservient to Dorothea anymore.”\nI wouldn’t be as kind-hearted as Maristella. So this time I won’t suffer, Dorothea."]},{"title":"The Young Marshal Is Jealous Every Day 2: Young Marshal Is the Concentrated Vinegar","tags":["Comedy","Drama","Fantasy","Historical","Romance"],"disc":["Read manhua The Young Marshal Is Jealous Every Day 2: Young Marshal Is the Concentrated Vinegar / The Young Marshal Is Jealous Every Day 2: Young Master Is the Elite in Jealousy / 少帅每天都在吃醋2:少帅是醋精","A female forensic doctor who traveled to the Republic of China after her death, an ambitious military and police commander, a massacre that disturbed Shuncheng, and involved a 20-year-old extraordinary case. Let’s see how the female forensic doctor copes with the open and secret struggles of the rich and powerful, and how to join forces with the handsome director to solve the strange cases, the husband and wife are invincible in the world!"," "]},{"title":"The Lady Locksmith of Mengliang","tags":["Drama","Historical","Romance"],"disc":["Read manhua The Lady Locksmith of Mengliang / Mengliang Has a Three-Day Magpie / Meng Liang You Zuo San Ri Que / Mèng Liáng Yǒu Zuò Sān Rì Què / 梦梁有座三日鹊","There was a quarrelsome couple in Mengliang City who met each other because of a murder case. One case after another, the pair became the detective duo. A smart lady locksmith and a macho civil officer made a the world think they were the perfect couple! But what did they think about dating? “Dating?” he asked.“No way!” she scoffed.“We only want to solve crimes!” they answered in unison."]},{"title":"An Unseemly Lady","tags":["Drama","Fantasy","Harem","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa An Unseemly Lady / The Little Lady Behind the Scenes / 비선실세 레이디","I was the only younger sister of the female protagonist in the reverse harem novel.","In addition, I was exceptionally pampered by the female lead after waking up after being very sick.","I used that to defeat the original inexcusable tr*sh male leads who only hurt my sister…","‘Lili, how are you? Do you like cake?’","‘Lili is really pretty because she resembles her sister. Won’t you eat cookies? Please tell your sister that these were given to you by your wonderful brother.’","‘Would you like to eat this and go over there for a while? I have something to say to your uncle and sister.’","For some reason, the male lead candidates seem anxious to see me.","***","“I don’t play with ugly kids.”","The boy in front of me muttered with a deep frown.","What? Did you really just say that?","I’ll show you what the real world is like.","I gently pulled the hem of my sister’s clothes and shook my head.","“I hate him, so I hate the older brother who brought him.”","At the same time, Cedric’s face turned pale, similar to someone who had been sentenced to death."]}]