[{"title":"When I Opened My Eyes, I Had Become The Devil","tags":["Action","Adventure","Comedy","Fantasy","Magic","Reincarnation","Romance","Supernatural"],"disc":["Read manhwa When I Opened My Eyes, I Had Become The Devil / 눈을 떠보니 마왕이 되어있었습니다 / Demon Queen Just Wants To Make Peace / When I Opened My Eyes, I Became a Demon King / When I Opened My Eyes, I Found Myself a Demon","‘Lee Jinjoo’, who dreams of being a musical actor and works part time for her living expenses. After a car accident, she had opened her eyes and found herself in her favorite romance fantasy novel where she possessed the devil who’s the final boss in part 1. Jinjoo, who had been possessed by a devil who’s fate was to die by a warrior, tried all she can to change her fate as the devil… I’m go back to my original world no matter what! Will Jinjoo be able to change her fate as she wants to?"]},{"title":"It’s Finally Love, Demon Lord!","tags":["Comedy","Demons","Fantasy","Romance"],"disc":["Read manhwa It’s Finally Love, Demon Lord! / 마침내 사랑이에요 마왕님!","After unifying the Demon World and leaving the Demon Castle for a while, the Demon Lord Eligor (600 years old), who was living a boring life, saves a boy from his appearance while taking a walk. He’s a paladin, I’m the devil! This emotion, shaken by mere human being, “Is it anger after all?”"," "]},{"title":"The Side Character’s Cheating System","tags":["Drama","Manhua","Romance","Shoujo"],"disc":["Read manga The Side Character’s Cheating System"]},{"title":"The Feeding Rules Of The Cold Blooded Prince","tags":["Action","Drama","Fantasy","Isekai","Manhua","Romance"],"disc":["Read manhua The Feeding Rules Of The Cold Blooded Prince / 冷血王爵的饲养法则\nThe heroine accidentally travels to another world and becomes an 8-year-old loli, who becomes a sacrifice to the legendary Night King. Wang Jue was so moved that he adopted her as a daughter. After becoming an adopted daughter, childhood sweethearts’ ex-boyfriends need to approach, wealthy CEOs need to pursue, and mysterious wizards need to form bonds. Wang Jue: Don’t think about it, I want to cultivate it!"]},{"title":"A Magical Kiss","tags":["Drama","Manhua","Romance"],"disc":["Read manhua A Magical Kiss","MIN-AH, a young woman looking for a job finds out about JIN-HYUK’s secret on her way to an interview. In order to keep his secret, he hires her as his personal secretary. What is going to happen to MIN-AH now?!"]},{"title":"The Sachet of the Last Empress","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Sachet of the Last Empress / 황비의 향냥","Screenwriter Hwang-bi Koh is curious about an old perfumed sachet left behind by his late father. As he investigates, he is soon approached by parties who claim the sachet is a secret treasure map. Hwang-bi’s life changes as he begins exploring the secrets of Queen Myungseong’s perfumed sachet."]},{"title":"The Counter Strike : I’m Back","tags":["Manhua","Romance"],"disc":["Read manga The Counter Strike : I’m Back","“President Zhang, President Zhang, there’s a big shot who wants to see you.” Zhang Yu, who was reading the file, glanced up at him and then look down again and asking leisurely, “Which big shot wants to see me?” “Gu Dong Yang.” “Oh, I thought it was some great big shot. “Gu Dong Yang I don’t know him.” Zhang Yu said casually. “What do you want me to say? I live with you under the same roof for countless days and nights, you actually say you do not know me, do I have to do something to you to remember who I am?"]},{"title":"Escort Agency Of The Apocalypse","tags":["Action","Adventure","Fantasy","Manhua","Post apocalyptic","Survival"],"disc":["Escort Agency Of The Apocalypse\nThe world came to an end, and cities became ruins. All living creatures had undergone unknown evolution and became monsters across the world! Mankind was forced to build base towns to survive, and escorts who possess various abilities to deal with monsters and beasts became an important existence in the new world connecting human settlements. A juvenile, Lu Renjia became an escort in an order to investigate the truth about the death of his elder brother. However, the journey of being an escort is dangerous, and the person behind the scene started to arouse more suspicion… “I’m the strongest Black Iron level escort! I’ll beat anyone who dares to stand in my way!”"]},{"title":"The Way to Protect the Female Lead’s Older Brother","tags":["Action","Drama","Fantasy","Historical","Manhwa","Philosophical","Romance","Webtoons"],"disc":["Read manhwa The Way to Protect the Female Lead’s Older Brother / Roxana / How to Protect The Heroine’s Older Brother, / The Way to Keep the Older Brother of the Heroine Safe, / Yeojuingongui Oppareul Jikineun Bangbeop, / 여주인공의 오빠를 지키는 방법","Kidnapping, murder, and risqué relationships! Within the scandalous pages of The Abysmal Flower, the downfall of Roxana Agrece’s criminal family is already foretold. So when Cassis Pedelian, the heroine’s older brother, is kidnapped by Roxana’s father, she can either wait for the heroine’s revenge… or take matters into her own hands, since Cassis is the key to her survival. But with deceitful characters on all sides, can Roxana and Cassis trust each other enough to bring down the brutal Agreces?"]},{"title":"The Shaman Baek Cheoyong","tags":["Drama","Fantasy","Supernatural"],"disc":["The Shaman Baek Cheoyong manhwa, “Ahjussi, you can see them too? I can also see them. The ghosts.” Shaman Baek CheoYong. A shaman who turned to a life of depravity as he loses his divine powers and is abandoned by the god he serves. One day, his god appears in his dreams once more saying “A noble soul’ will soon appear and will change your life”. Afterwards, he met a high school girl named Kang Jiyoon. A psychic with no powers, a student who sees ghost. The two strike a deal!"]},{"title":"Husband, the throne is mine!","tags":["Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Husband, the throne is mine! / Deer Culture / 夫君皇位是我的","The female emperor Chu Xi died of overwork and traveled to the world of male respect. When she encountered the frail and sickly prince Xie Yi, with the intention of “robbing men of the people”, the two became married. Chu Xi, who was unwilling to succumb to fate, did not intend to follow the trend. What’s the point of being a princess and queen? Isn’t it fragrant to make a serious career and open a harem?"]},{"title":"The Cold-Hearted Evil Prince’s Indulgence","tags":["Comedy","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read manga The Cold-Hearted Evil Prince’s Indulgence","She was a top secret agent of the 21st century. Once she transmigrated, she actually became the ugly, stupid, and cowardly Fifth Princess of Eastern Yue. He was the regent of a foreign country who could manipulate any situation with a flip of his hand. He was extremely hand, cold, and cruel. When they first met, she was schemed against by her scumbag fianc who drugged her with an aphrodisiac. Somehow, this led to her accidentally bumping into him, who was seriously injured and unable to move. Who knew that one thing would lead to another, and that a silly comedy would unfold? The mysterious woman must have been sent by the heavens to take him in."]},{"title":"108 Women","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Dessa, a witch who built an empire for the human she loved, but did not believe in him.","In a situation where she must renounce her witch’s powers and become an ordinary human in order to give birth to an imperial grandson, she proposes a bet to test the emperor Hartwan who swore eternal love.","To find yourself among 108 women with the same face.","Emperor Hartwan accepts this, and in the end, no matter who he chooses, he even puts out an unconventional condition to welcome the chosen one as an empress.","The empire and 107 women resembling the witch gather at the imperial palace.","Meanwhile, Arit, ayoung witch who admires Dessa sneaks into the imperial palace in order to prevent Dessa from becoming human interferes with the her bet with the emperor?!","The search for the empress proceeds with chaos.","Who will win in the end?","108명의 그녀들\n108 Girls"]},{"title":"Married a Celebrity Manager","tags":["Comedy","Manhua","Romance"],"disc":["Read Married a Celebrity Manager / 金牌甜妻 / Married a Celebrity\nSoo Bei was supposed to lead a life of fame and fortune. However, not only had she been betrayed by her best friend and boyfriend, but she had also lost her virginity to a stranger. Her only way out was to flee her home in tears. Five years later, she became a top celebrity manager. Along with her twin children, she walked the path of vengeance."]},{"title":"Princess, Please Distance Yourself A Little","tags":["Action","Fantasy","Harem","Manhua"],"disc":["Princess, Please Distance Yourself A Little, 公主殿下请离我远一点啊 / Your Majesty, Please Keep Away From Me\nwoman? It’s okay to play, but as for the sweet words of the alliance and each other and staying together for a lifetime? Oh, sorry, I can’t believe a word. Especially when this was said from the mouth of a beautiful woman… I used to think so, but until one day I passed through inexplicably and was put to sleep by a princess Loli – I seemed to have changed a little."]},{"title":"101 Lovers Pet","tags":["Romance"],"disc":["Read manga 101 Lovers Pet","In a world where the bad boy rules, a good girl can only dream. He’s cruel and heartless yet loved by many girls. He has 100 girls waiting in line to be his girlfriend and 101 badges for the waiting slot. She’s weak and timid but accidentally became his 101st backup lover because of the ‘Magic Wings’. All the girls despised her because of that."," "]},{"title":"He’s From Mars","tags":["Manhua","Romance"],"disc":["Read manga He’s From Mars / 他来自火星","Manman was an ordinary young female earthling who married Cathieu in a fairytale wedding. Cathieu was a gentle and considerate husband who made an all-out effort to learn Earth’s ways and build common ground with Manman. Their married life was filled with happiness. After they returned to Dikken, His Majesty the Emperor Soron seemed to take an interest in Manman too. Cathieu’s instinct told him danger was afoot and he immediately led Manman to escape. The Planetary Wars began not long later, which Cathieu was bound by duty to join. He bid his wife goodbye, and it was then that Manman realised her love for the prince. Just as she came to terms with expressing her true feelings to Cathieu, she received news of his death in battle. The magical, transplanetary love story between earthling and alien came to an uncertain end."]},{"title":"The Beloved Yin Yang Consort","tags":["Fantasy","Historical","Romance"],"disc":["Read manhua The Beloved Yin Yang Consort / Hunt Ghost, Hunt Love / The Beloved Yin Yang Consort / Vigorously Pampering the Yin-Yang Imperial Concubine / Flourishingly Spoiled Imperial Concubine of Yin and Yang / Shèng Chǒng Yīn Yáng Fēi / 盛宠阴阳妃","21st century Yin Yang Master Zhao Mingyue dies in a battle to seize the precious Lunar Horn back from a thief. Her soul should have disappeared, but she is suddenly summoned to another world and comes back to life by transmigrating into the body of a freshly buried girl. However, the moment she pops her head out of the ground, she gets attacked by a man in a ghost mask."]},{"title":"I really love his bad temper","tags":["Comedy","Fantasy","Harem","Historical","Isekai","Manhua","Romance"],"disc":["Read manhua I really love his bad temper / 少主好凶我好爱","Twenty-seven-year-old crossed to the Ming Dynasty in a car accident and came back to life as a 14 year-old beggar she stumbled upon two beautiful men, the young master and the young son, who were plotting to find the former crown prince.The poisonous tongue is the yin and yang of Xiaohai’s master, and the gentle son is her” old acquaintance.The true identity of the little beggar is closely related to all previous dynasties, and who is behind everything?The truth was waiting for them to unravel after the fog"," "]},{"title":"Substitute Bride","tags":["Drama","Romance"],"disc":["Read manhua Substitute Bride / 替身新娘\nLuo Jiayue, a small-time actress turned substitute bride, married a rich president! Being together day and night lit the sparks of affection, but was it true love or possessiveness? Forget it, I’m willing to sell my act but not my body, Luo Jiayue thought. Boss, if you’re going to be like that… you need to pay more money!"]}]