[{"title":"Looking For The Villainess Whom I Spent My First Time With","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Looking For The Villainess Whom I Spent My First Time With / 첫날밤을 보낸 그 악녀를 찾습니다","I’ve possessed the villainess ‘Liberata’ from the novel <The Misadventures of Leonie> and been executed on the gallows twenty times already! I was just drunk out of my mind, tired of the endless regression, but why is the Grand Duke lying next to me? “Don’t worry, I won’t let you die.” But then… “If you don’t put everything back in its place in your twentieth life, this world will be destroyed.” The fortune teller leaves behind an ominous prophecy."]},{"title":"Ending Maker","tags":["Action","Comedy","Manhwa","Martial Arts","Romance"],"disc":["Read manhwa Ending Maker / Pencipta Ending / 엔딩메이커","Two heroes of the game Legend of Heroes 2 that were rotten water*. Kang Jin-ho in the first place and Hong Yoo Hee in the second place. One day, I opened my eyes and reincarnated as a character in the game… “Hey…you too?” “Hey…me too!” The ending of Legend of Heroes 2 is the destruction of the human world. But if there’s two of us and we’re not alone. If it is also the #1 and #2 in the server rankings. The path of rotten water begins for a perfect happy ending! (*Rotten water is Korean slang for someone who has played a certain game for a long time and mastered everything. Think of them as oldbies, veterans, or game pros.)"]},{"title":"He Is So Flirty","tags":["Comedy","Drama","Romance"],"disc":["Read He Is So Flirty Can’t Hold / Ta Na me Liao / 他那么撩 / He Is So Flirty / He’s So Flirtatious","The obedient female schoolmaster Qin Qing was accidentally involved in a fight on the first day of transfer. Qin Qing used a plan to save the besieged senior. She did not expect that the senior was the discolored school bully Wen Yufeng. From now on, Qin Qing’s peaceful campus life will never return. . ."]},{"title":"Merciless","tags":["Action","Fantasy","Martial Arts"],"disc":["Read manhwa Merciless / 무자비하게도/ Mercilessly","‘Do Janggon’ is a human weapon and forcer special forces spy against North Korea.\nWhen both of his arms got injured he was caught and brought to the ‘Daesan Welfare Center’, that abuses human rights and exploits labor.\nThe doctor said it would take him a month to fully recover. So he has to hold out in the welfare center until his arms are healed."]},{"title":"A Returner’s Magic Should be Special","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Martial Arts","Romance"],"disc":["A Returner’s Magic Should Be Special, , Kikan-sha no mahou wa tokubetsudesu , 귀환자의 마법은 특별해야 합니다 , 帰還者の魔法は特別です\nOw that I’m back, I won’t allow my loved ones to die again!”\nThe Shadow Labyrinth – the most catastrophic existence humanity has faced in history.\nDesir Arman is one of the six remaining survivors of mankind within it.\nThe six attempt to clear the final level of the labyrinth but ultimately fail, and the world comes to an end.\nHowever – when Desir thought he would meet his demise, what is revealed before him is the world… thirteen years ago?!\nDesire is returned to the past, back to the time when he enrolled at the nation’s finest magic academy – Havrion. He is reunited with his precious friends, and is prepared to change the past to save the world and his loved ones…!\nThree years remaining before the emergence of the Shadow World!\nChange the past and gather powerful comrades to save mankind!"]},{"title":"You, My devil","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa You, My devil / 나의 그대는 악마","Yuri, the Prince of the enemy country who colonized Heina’s homeland, Constance, and brutally murdered her fiance.","Called the red-haired devil, he takes Heina, the Princess of Constance, as his trophy.","The person she can never love starts asking her for love…","A romantic fantasy of a man who tries to defy fate and a woman who is trapped in his world."]},{"title":"The Villanins Favorite Is Me","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villanins Favorite Is Me / The villains’ favourite is me/ I’m the villain’s favorite / 악당들의 최애는 나","Lumina lost her parents and was left only both alone with her step-younger sibling.","After only being taken advantage of by her relatives who were aiming for her family’s fortune, she met a horrific death, but…","When she opened her eyes, she was back to 12 years old when her parents died!"," ","‘My relatives are doing well? I can’t bear to see it.’"," ","As she vowed revenge on her relatives, she visited the Hart family, the most transcendental family in the Empire and the villain family, and confidently asked for support."," ","“You said you can heal my son?”","“Yes, I will heal the Young Lord!”"," ","How is it possible, you ask?","It’s because I’m a healer, and the one and only medicine of the transcendents!"," ","However, the regressing situation is a bit strange?"," ","“Why are you so kind to Older Sister?”","My younger brother, who felt awkward, had a massive misunderstanding without knowing that I was plotting behind him,"," ","“As expected, it will be nice for you to celebrate a wedding with my son.”","I have won the villain’s heart more than necessary."," ","To the extent that I become the daughter-in-law of the villain family!"," ","***"," ","“Since the contracted period has expired and it was a forcibly pushed marriage, now for the divorce…”","“You know that I can’t live without you, don’t you. But a divorce?”","“…”","“Do you want to see me going crazy?”"," ","What’s even worse, after saving my husband, who was originally destined to die, he is obsessed with me."," ","I said that my goal after revenge is to live a minimalist life!"]},{"title":"A Capable Maid","tags":["Drama","Historical","Manhua","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa A Capable Maid / A useless person becomes a talented maid / A Talented Maid / A Competent Maid / La sirvienta capaz / Marie Sang Pelayan Berbakat / Neungryeog Issneun Sinyeonim / Una criada capaz / Una mucama competente / Une bonne capable / Une bonne compétent / Une domestique capable / Une domestique compétent / Une femme domestique capable / Une femme domestique compétent / Способная горничная / できるメイド様 / 超能力侍女 / 능력 있는 시녀님"]},{"title":"The Tyrant’s Crush","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Tyrant’s Crush / The Tyrant’s Crush / รักของจอมเผด็จการ / 暴君の恋 폭군의 사랑"]},{"title":"All About Dominative And Exclusive Destruction","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Mature","Romance"],"disc":["Read manhwa All About Dominative And Exclusive Destruction / About Exclusive And Proprietary Destruction / 독점적이고 배타적인 파멸에 관하여","“While I am being played with by Yang Sa-ae, I am completely hers.”\nOn the other hand, ‘Yang Sa-ae’ was a former gladiator slave and ‘Ru Yurak’ was a nobleman and a top soldier of his country.\n‘Yurak’ is reduced to a slave due to defeat in the war and is offered as a prize to ‘Yang Sa-ae’.\n‘Sa-ae’ sexually tortures him without emotion.\nThe arrogant ‘Yurak’ eventually succumbs, accepting his pain as pleasure. while denying his surrendering self, he realizes his feelings for ‘Sa-ae’. ‘Yurak’ becomes more and more desperate, obsessed, and longs for her love."]},{"title":"My Place","tags":["Adaptation","Drama","Fantasy","Historical","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Place / Finding My Place / 나의 자리","Ashé, who had hoped for a stable life was forced to another country after her brother got a marriage offer. Due to the fear of dying in a horrible way if she does an unwanted marriage, she ends up poisoning her own brother. One day, after being imprisoned in the palace for that crime, the imperial prince came to find her."]},{"title":"Emperor Qin returns! I am the Eternal Immortal Emperor","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Emperor Qin returns! I am the Eternal Immortal Emperor / Emperor Qin returns! I Am the Immortal Emperor of the Thousand Years / I Am the Immortal Emperor Has Returned / Qin Huang Gui Lai! Wo Wei Qiangu Xian Di / 秦皇归来！我为千古仙帝","Emperor Qin Ying Zheng was unable to overcome the tribulations in the immortal world. He was reborn in the city, where the spiritual force was restored. With his sword, he vanquished the strong men from outside the realm, conquered the ladies in the harem, and called forth the fierce warriors and fierce generals with his hands to conquer the entire world! He held the title of Emperor of the Immortals during his previous existence. He pledged to return to the immortal realm and reach the pinnacle of immortality in this life!"]},{"title":"The Villainess is a Marionette","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Is A Marionette / 악녀는 마리오네트 / 恶女是提线木偶 / Agnyeoneun Marionette","Cayena, the Imperial Princess, was known as the most beautiful woman in the Empire. She was a woman who knew nothing but evil and luxury.\nHowever, she was destined for ruin: she would be used as a chess piece by her younger brother to secure his throne and killed by her crazy husband.","“I’ll make you the Emperor.”\n“… Sister, are you referring to me?”\n“In exchange, give me freedom.”","She had to change things before she became that Cayena.\nRussian / Русский:\nПринцесса Каена, прославившаяся своей красотой на всю Империю, не ведает ничего, кроме алчности и злобы. Долгое время она пыталась избавиться от своего младшего брата-тирана, но встретила смерть от руки своего мужа.\n— Я помогу тебе стать Императором.\n— Сестра… Вы обо мне?..\n— Но в обмен… ты подаришь мне свободу.\nДо того, как «я» стану принцессой Каеной."]},{"title":"The Villainess Wants to Enjoy a Carefree Married Life in a Former Enemy Country in Her Seventh Loop!","tags":["Fantasy","Reincarnation","Romance","Shoujo","Time travel","Villainess"],"disc":["Loop 7-kaime no Akuyaku Reijou wa, Moto Tekikoku de Juukimama na Hanayome Seikatsu o Mankitsu Suru, The Villainess Wants to Enjoy a Carefree Married Life in a Former Enemy Country in Her Seventh Loop! , ループ7回目の悪役令嬢は、元敵国で自由気ままな花嫁生活を満喫する\nRishe, the daughter of a duke, is stuck in a time loop that begins at the moment her engagement is annulled and ends with her early demise at the age of 20. She has now entered her seventh life.\nIn her past do-overs, Rishe experienced life in various occupations, including being a merchant, a healer and a knight. But this time around, she simply wishes to live a long and leisurely life!\nThat was the plan, only for it to be derailed by an unprecedented marriage proposal from her murderer in the previous life, the Crown Prince—?!"]},{"title":"Ashtarte","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Read manhwa Ashtarte / 아슈타르테"," "]},{"title":"A Wife’s Sweet Revenge","tags":["Action","Adaptation","Adventure","Drama","Historical","Isekai","Josei","Manhua","Romance","Shoujo"],"disc":["Read manga A Wife’s Sweet Revenge / The Wife\nDayoung Kim happily donated her liver to her mother-in-law, but all she got was betrayal in return. Her husband’s whole family nefariously used and abused her, kicking her out before she even fully recovered from surgery. They went on with their lives, blissfully unaware that Dayoung swore revenge. She begins to systematically destroy their lives as they did hers, but what happens when someone unexpected gets in the way of her best-laid plans? Will accomplishing her mission bring her happiness… or will it only get in the way of true love?"]},{"title":"You’re just a supporting character, so love me!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa You’re a Supporting Character, Just Love Me / Side Characters Deserve Love Too / He’s a Supporting Character but I Love Him Anyway / 어차피 조연인데 나랑 사랑이나 해","“I want to convey my heart.” I suffered from a unilateral fever of love for the supporting character in the book who faces a miserable ending. But… was that a little too much? To the point where you’re in a book? I don’t know who God is, but the consumer satisfaction assessment is satisfactory. ‘Sorry, I saw your butt on the way out. Kyle’s ass is so pretty.’ ‘Why are you looking at my ass!’ ……no, I didn’t mean to express my feelings this much. Help me, Roban. Help me. Telepathy that you can only hear it with sincerity. Do you really count the insidiousness? Kim Geum-ja is struggling today with her dark heart towards her favorite character.I’m gonna be Josephine and I’m gonna be next to Kyle! “I don’t know if it’s a man, but Josephine, who doesn’t know how to write, doesn’t do anything.” What? Well……I’ll be your man. Hello, my name is Joe. I’m a man from today."]},{"title":"The Villainess is Busy Baking Bread!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read The Villainess is Busy Baking Bread! / 악녀는 빵 굽느라 바쁜데요! / The Wicked Witch is Busy Baking!","“Nothing can interfere with my bakery now!” Two days ago, I possessed a villainess from a novel. Since I knew how the story unfolds, I tried to avoid the destructive ending and instead pursue my lifelong dream of becoming a pastry chef. Yet, the Northern Duke — the original male lead — along with the head of the merchants and even the crown prince fell in love… with the taste of my bread?! Hence, I’m very busy baking so if you’re interested in anything besides buying, please leave!"]},{"title":"The Male Lead Is In Charge Of The Successor","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Male Lead Is In Charge Of The Successor / Hiding the Archduke’s Humiliating History / The Dark History of the Male Lead / 男主要我对他的黑历史负责 / 黒歴史の責任を取れですって!? / 남주가 흑역사를 책임지라고 합니다 / 주가 흑역사를 책임지라고 합니다"]},{"title":"I Am Invincible in the Fantasy World of the Apocalypse","tags":["Action","Comedy","Fantasy"],"disc":["Read I Am Invincible in the Fantasy World of the Apocalypse / 我在末日玄幻世界无敌了","In a world where corpse cultivation thrives, Chen Yuan is betrayed by a villainous person. He unexpectedly awakens the All-Things Extraction System, which enables him to extract cultivation, techniques, spiritual energy, and more from any deceased entity. “So, if I kill him, his decades of cultivation will be mine?” With the system’s support, Chen Yuan embarks on a journey of battling monsters, levelling up, and making significant allies, all while facing various trials. Unbeknownst to him, behind each trial lies a vast conspiracy woven specifically against him…"]}]