[{"title":"The Provincial Commander’s Self-Cultivation","tags":["Comedy","Historical","Romance"],"disc":["Read manga The Provincial Commander’s Self-Cultivation / The Self-Cultivation Of The Provincial Commander","Qihuang Kingdom was run by women, and as the head eunuch, Yan Lang’s dream was to mix in, eat, wait for death, and resign from office with honor, while disguising herself as a man. However, Yan Lang unexpectedly encountered the biggest failure of her career when the new empress ascended to the throne. Wait a minute! Why was the empress a male? Yan Lang barely managed to convince the empress to spare her life, but without even the time to celebrate, that damn empress forced a pill down her throat. “All this drug will do is keep you in check. Behave well, and I will make sure you have nothing to worry about.” “Just be a good empress! Starting from today, I’ll be your loyal subject during the day, and kick your ass in the evening!” Every day, Yan Lang wanders on the brink of danger, for someday, the empress may discover her secret: that Yan Lang, the provincial commander, is actually female!"," "]},{"title":"My Queen Untouchable","tags":["Historical","Liexing","Ping Ping Jun","Romance"],"disc":["Read manhua My Queen Untouchable","“You know who’s the Queen, and keep that in your mind. Don’t play with fire! ”\nIn order to get back my memory, I have to travel between time spaces over and over again! All the ones that go against me and my plan, will be “eliminated” by me! Oh, right, and those little bees flying around my man, they cannot devour his kind heart."]},{"title":"Love Is Never Enough","tags":["Romance","Webtoons"],"disc":["Read manga Love Is Never Enough / Love Won’t Redeem My Hate","After three years of marriage, I found my husband is a two timer and did not want to hide his betrayal any more. I tried my best to please him and save the marriage but all I have done is far less important to the other woman – his first love in his eyes. Finally, I abandoned myself and chose another path of attack. At this time, the man I met was like a landscape that opens the door to my new world. He said to me, “There are so many a**holes in the world. If I hold your hand tight, you won’t be afraid."," "]},{"title":"Surviving as Twin Sisters","tags":["Drama","Fantasy","Manhwa","One shot","Romance"],"disc":["Read manhwa Surviving as Twin Sisters / 쌍둥이 왕녀로 살아남기"]},{"title":"The Grand Duke of the North Wants to be Loved","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Grand Duke of the North Wants to be Loved , 북부 대공님은 사랑 받고 싶어","Allen Pratt, the cold-blooded northern Duke. He’s the unlucky prince who was exiled to the north because he could not inherit the throne. Thus he turns dark, turning into the villain of this world. He said that he’ll wreck havoc in the future, but…","I was the only one who knew. No matter how evil he is, I am certain. He’s the person who can both save me and the story. My only ."]},{"title":"The Emperor’s Mask","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Emperor’s Mask / Emperor’s Mask / Máscara Del Emperador / 황제의 가면"]},{"title":"Let Me Stay Over Tonight!","tags":["Full Color","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Let Me Stay Over Tonight!","28-year-old Gyuri Gam has never dated anyone before in her life. When she wakes up one morning after a night of heavy drinking, she suddenly recalls that someone at work asked her out but can’t remember who it was! Gyuri narrows it down to three possibilities: Seunghu, her hot co-worker who is nice to her; Myeongseok, her talented but cranky boss who she’s sure hates her; and Leo, a popular actor who anybody would kill to date. At first, Gyuri thinks the identity of her secret admirer is obvious… but is it?"]},{"title":"Heavenly Martial God","tags":["Action","Manhwa","Reincarnation"],"disc":["Heavenly Martial God\n“Who’s this male prostitute-looking kid?” I am the Matchless Ha Hoo Young, the greatest martial artist reigning over all the lands! There is no one that is my equal! I was drowning in futility and emptiness because there was no more that I could accomplish in the human realm. To reach the peak of martial arts, I must become a saint! “I finally succeeded!!!” “Stop! Your ascension is not permitted!” The other saints refused my ascension due to my karma after much slaughter, and I fell, just like that.\nWhen I woke up, I was 60 years in the future. I was reborn as the second lord of the Namgoong family, Namgoong Hyuk. Where has all the internal energy that I’ve accumulated gone?! Moreover, I have the Nine yin energy blockage?"]},{"title":"Waiting for You at the Spring","tags":["Drama","Manhwa","Romance","Shoujo"],"disc":["I Wait for in the Spring Water; Spring Water Waiting for You","Three years ago, Si Ning and her team rose to fame after winning the Summoner’s Cup. However, after learning that her boyfriend and teammate cheated on her, she withdrew from professional play, vowing to never return. Three years later, she became a full-time video game streamer, sporting her new long peppermint green tresses. Through hard work, her stream steadily grew until one day, a random in-game opponent destroyed her 5-0 in front of all her viewers. Unfortunately for her, the embarrassing defeat went viral. Her opponent turned out to be the newest sensation in pro player circles, superstar Ye Feisheng, who continued to be a major thorn in her side. He regularly showed up uninvited, first plying her stream with massive donations, then visiting her home in person with a large horde of fans in tow. Why does this little brat keep bugging me? What does he want?? Watch as she fights back to reap the seeds of success and love!"]},{"title":"Don’t Call Me Sister","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Don’t Call Me Sister / Don’t Call Javotte an Evil Stepsister / 자보트를 새 언니라고 부르지 마세요","At the age of 19, I, Zabotte Winchester, inherited the legacy of my stepfather and became the owner of the Winchester family.\nI thought my mother would run the family, so I could live a comfortable life. When I found out I might die from a car accident, I rewrote my life plan.\n“From now on, I will be the real owner of Winchester.”\nI will protect Winchester’s wealth and honor, the future of my old and new sisters, and win the loyalty of a man who was the start the night at a ball, all by himself.\n“Miss Winchester, I will only tell you. Actually, my real identity…”\n“Shh. Keep your secret, Merrick. The only thing I care about is a man’s kind heart.”\n“…But why have you been touching my thigh since a while ago?”\n“Don’t get me wrong. I was exploring where the man’s heart comes from.”\nShe has a little temper, but it turns out she’s a caring older sister."]},{"title":"I Love You More Than Ever","tags":["Drama","Romance","Shounen"],"disc":["Yu Lan had tirelessly loved sheng youting for 11 years, despite his lack of reciprocation and her feeling inferior in the relationship. When she finally couldn’t take it anymore and let go of him, it hurt her so much that it almost cost her life. She had gotten so used to loving Sheng Youting that without him, she would never feel complete…"]},{"title":"Celeste Academy","tags":["Action","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Celeste Academy manhwa ,\nWhat’s worse than going to school? Going to school in another world to become a… knight?! After accidentally witnessing a sword-wielding woman slay a demon in the streets of Boston, Valeriana is kidnapped and forced to enroll in the magical Celeste Academy. It would’ve been great if she fit right in, but while everyone’s learning to use their magic powers to protect the world of Valemnia from demons, she’s stuck being the only human in class! To make matters worse, the demons are getting stronger. Not only is Valemnia in growing danger, but Earth could be their next target. Surely demons can wait to destroy the world until she gets her life together, right?"]},{"title":"It is my First Love","tags":["Comedy","Drama","Romance","Slice of Life","Webtoons"],"disc":["Read It is my First Love / 첫사랑입니다만","She wants to hide and his secret romance to reveal!"]},{"title":"The Red Empress","tags":["Drama","Fantasy","Historical"],"disc":["Read The Red Empress / 천하루 / 千一日の夜想曲 / 女皇的一千零一夜","When the emperor murders the python, god of the waters, a curse is put over the Cha Kingdom preventing men from succeeding the throne. So begins the reign of empresses and the endless struggle against men who try to control the kingdom. After all her sisters are killed by the hands of Yom, the young Empress is seated on the throne. Rather than performing her duties as a ruler of a kingdom, the empress spends her days and nights drinking and sleeping with different men, whom she all executes immediately after. The people call her the Blood Empress, attributed to her violent behavior and the red hair, which is dyed with the blood of the men she killed. One day, the Empress meets a handsome and intellectual young man named Kanghee. As she picks up her sword to kill him, Kanghee convinces her to spare him and begins to captivate her heart by telling her stories he’s read from book. As the empress gets closer and closer to Kanghee, she begins to change her violent ways. Is he someone she can finally put her trust in? Or is he not?"]},{"title":"I, Queen Edith","tags":["Drama","Fantasy","Historical","Isekai","Magic","Romance"],"disc":["Read manhua I, Queen Edith / 我，伊蒂丝女皇","High school student, Gu Yunyun, suddenly found herself in another world and woke up to discover that she was now a one-year-old queen known as Edith! Now she was a child blessed by the gods, with an entire empire at her bidding… But being a young ruler isn’t easy. Though the empire may seem to be flourishing, Edith began to notice it’s gradual deterioration. Not only that, a mysterious church lurks in the shadows and she soon realizes just how difficult the path of a queen is. But soon a child named Caden appears at her side and her life grows even more complex."]},{"title":"The Duke Of Cold Blood Plan Of Attack","tags":["Manhua","Romance","Vampire"],"disc":["Read manga The Duke Of Cold Blood Plan Of Attack","It was my 25th birthday wish, but why did I suddenly become the princess of the holy blood clan? And these handsome guys in front of me actually said that they are my fiances? So confusing, who should I choose? Only children will make choices, I, Hu Luo Bei, want them all! Come and read, how a single girl travels to the empire of vampires and became the queen of the holy blood clan with stunningly handsome men!Notes from mangabuddyAll our manhua content is protected under copyrighted law. manhwaclan never gives anyone authorization or permission to publish our content on another website/app. If you’re publishing our content on your website/app, it’s mean that you’re infringing the copyright of our works. Therefore stop stolen our works or else we will take legal action against you."]},{"title":"A Quarter of The Secret","tags":["Action","Adventure","Comedy","Manhua","Reverse","Romance","School Life","Slice of Life"],"disc":["Read manga A Quarter of The Secret on manhwaclan\nYin Luowen’s mother died in a sudden traffic accident. After receiving a parcel sent by her mother before her death, the “accident” seemed to be premeditated. Yin Luowen embarked on the journey of revealing the secret. Just as the truth of the incident became clearer, the identities and secrets of the four men who were associated with them began to surface…"]},{"title":"Visions of the Night","tags":["Adaptation","Drama","Magic","Mystery","Slice of Life","Supernatural","Tragedy"],"disc":["Can you trust what you see? Lio lost everything she held dear when her home burned down and her grandmother went missing in a suspicious incident years ago. Now, left with nothing to trust but her mysterious powers of illusion, she hopes to discover the truth of her tragic past in a world where nothing is what it seems to be.\n가올의 감옥 / 秋の牢獄 / Maboroshi wa Yoru ni Seichosuru"]},{"title":"My Dear Fluffy Fox","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manga My Dear Fluffy Fox / Nine-Tailed Fox Top Student Has Fixated After Me / 九尾狐校霸盯上我之后\nNatural fishing human cub vs arrogant and innocent nine-tailed fox! When humans study in a school full of monsters, it is like a sheep falling into a wolf’s den, weak and pitiful and helpless? no no."]},{"title":"The Goddess’s Taste","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Goddess’s Taste / 여신의 취향 / Goddess’s Taste\nYuyu was always bullied in school for being fat. Now, after hard work and effort, he’s a beauty director receiving rave reviews from customers. Suddenly, his first love Ahin appears in front of him. But wait — is it really her?"]}]