[{"title":"The Witch and The Bull","tags":["Comedy","Fantasy","Romance"],"disc":["Read manhwa The Witch and The Bull","Tan’s job as the King’s royal advisor has nothing to do with his hatred for witches, but it does make him a prime target for a curse that turns him into a BULL! The only way to undo this hex is to rely on the beautiful witch, Aro. Can her kindness turn his feelings around, and break this spell?"]},{"title":"I Am the Villain","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Am the Villain","Working hard is supposed to take you far – but into the world of your best friend’s novel? For Lucy, being whisked into a life of ballrooms and picnics isn’t exactly what it’s cracked up to be; at least, not when everyone has mistaken her for the villain flagged for death. To escape this fate, Lucy must transform from modern workaholic to high society schemer if she even has a chance at returning home. Will she make it? Or will this world of beautiful outfits, strawberry desserts, and dashingly handsome gentlemen seal her fate?"]},{"title":"My Father Is the Enemy of My Past Life?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Father Is the Enemy of My Past Life? / 전생의 원수가 아빠라고요?","I lived to the age of 19, only to be constantly taken advantage of by fake family members. With the vow to seek revenge still fresh in my mind, I made the choice to live my life again. Yet why have I returned to the night I was kidnapped from a burning castle? “Hwelp me! Hwelp me! The willian ish twaking Maedie!” My savior ended up being the enemy’s son?! For days and nights I followed him to the enemy’s castle, but upon arrival, a warm welcome… “Ack! Father! Second Brother’s picked up another living thing!” …wasn’t what awaited me."]},{"title":"I Stole the Number One Ranker’s Soul","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["I Stole the Number One Ranker’s Soul manhwa,\nOne day, Son Mo-Ah fell into a dungeon and became a gathering hunter. Son Mo-Ah, who somehow narrowly escaped death, was going to live a normal life but gets caught up in a dungeon yet again. In a moment of crisis, she is rescued by Seo Ji-Han, the number one ranker, and succeeds in surviving the situation. Somehow, Son Mo-Ah got entangled in a fateful relationship with said number one ranker. But he said something really unusual to me. “Promise me that you will kill all the dungeons bosses in this world, as many as you can.” What?"]},{"title":"The Little Prince In The Next Life","tags":["Romance"],"disc":["The Little Prince In The Next Life"]},{"title":"The Flower That Swallowed the Sun","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Flower That Swallowed the Sun / Flower That Swallowed the Sun / The Sun-Swallowing Blossom / 太陽を染める華～天使には秘密がある～ / 태양을 삼킨 꽃","For 200 years, Amarzan the Great Sorcerer strived to become a god. So when he was told that he still lacked something, he chose to start over. Now, he has been reborn as Shuriah, one of the Brionia Empire’s greatest beauties and Crown Prince Lenkaizer’s maid. Despite trying to focus on finding what she lacked as Amarzan, Shuriah finds herself overcome with the urge to kill Lenkaizer whenever he shows her interest. Is she in danger, or is this just a new emotion she’s never experienced before?"]},{"title":"Surviving The Game as a Barbarian","tags":["Action","Adaptation","Fantasy","Manhwa"],"disc":["Read manhwa Surviving The Game as a Barbarian","[By the studio that brought you <Regressor Instruction Manual>!]\nThe protagonist, Lee Hansoo, finally reached the boss stage after nine years of playing the game “Dungeon and Stone”, which no one had been able to clear until now. However, just as he entered the boss room, he saw a notification alerting him that he had cleared the tutorial and that he had possessed the body of the barbarian, Bjorn Jandel, who was a playable character in the game. In the world of “Dungeon and Stone”, only one city remained standing after the destruction of the world. A labyrinth would open every month, offering explorers a chance to clear it for rewards. In this world where barbarians are seen as useless in everything but battle, a barbarian who does not fight will not be able to survive. If one cannot pay the outrageous taxes demanded by the city, the only fate that awaits is a downgrade in status to a ‘lower-class citizen’. If it is revealed that you are possessing the character you are playing, you will be named an “evil spirit” and killed. The only way for Lee Hansoo to survive is to enter the labyrinth and fight while risking his life. With the skills he has accumulated over nine years of gameplay and a stupidly strong barbarian physique, he strives to survive in this game…"]},{"title":"Your Majesty, I Will Raise Him This Time!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Your Majesty, I Will Raise Him This Time! / Heika, Kondo wa Watashi ga Sodatemasu! / Your Majesty, I Will Raise Him This Time / 陛下、今度は私が育てます！ / 陛下今度は私が育てます","“Who would have thought that the day would come when I would be killed by my own son…” Empress Dahlia of the Empire is killed by her son’s rebellion. Dahlia, who has been kept in the dark finds it difficult to comprehend the drastic change of her son. “I’ll accept any punishment. Please, give me one more chance to face that child…!” Dahlia, having turned back time, need to face her strict husband, Klaus, in order to restore their already severed parent-child relationship. Can she use this opportunity to redo the parenting and avoid the worst future?"]},{"title":"Dream of Learning","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Dream of Learning / 학식의 꿈","Ye-jin, who has persistently studied in a challenging environment to gain admission to a prestigious university but has a score of 0 in dating. She tries various things with the hope of finding a boyfriend… Just when Ye-jin’s only male friend and a physical education major, Hyeon, who is wearing the mask of friendship, appears in front of her and gradually becomes obsessed with her. Can Ye-jin achieve both her dream of raising her family through her high education and her dream of dating while pursuing her education?"]},{"title":"The Slumbering Saint","tags":["Fantasy","Romance"],"disc":["Read manga The Slumbering Saint","The main character, Kamitsure, was mistreated as a bastard child in the duke’s family. She is troubled over the difference between how she is treated compared to her sister Cattleya, who is loved by the family, but she believes that one day she too will be cared for by them… However, she is cruelly killed by her father. She hopes to rest in peace, but she is reincarnated as Anemone, the princess of a certain kingdom. Will she be able to find happiness in this life as Anemone?"," "]},{"title":"A Second Chance at Saving You","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Second Chance at Saving You / 극악한 그대를 살리기위해"]},{"title":"The Fire Fighter","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Fire Fighter, Fireman, 소방관","Cheol-woong, an ordinary college student who was contemplating what to do with his life, finds himself on the path to becoming a firefighter after saving a life in a fateful incident. However, in the early 2000s, the treatment of firefighters in South Korea was far from what Cheol-woong had imagined. As a new firefighter, he dedicates himself fully to his duties. One day, he encounters an event that will become a turning point in the history of firefighting in South Korea."," "]},{"title":"I was Reborn as a Housekeeper in a Parallel World!","tags":["Comedy","Fantasy","Isekai","Magic","Reincarnation","Romance"],"disc":["Read manga I was Reborn as a Housekeeper in a Parallel World!","Erena, a high school girl, died in a fire… but she was reborn in a parallel world! She now works as a housekeeper for a wealthy elderly couple, using the housekeeping skills she honed in her men-only family. One day, the elderly couple move in with their son, but his house is the royal castle! The couple were actually the retired previous King and Queen, and their son is the King! Can Erena’s housekeeping skills help pave a new way for the kingdom?!"]},{"title":"Our Similarities","tags":["Shoujo","Yuri"],"disc":["Read Our Similarities / Tónglèi / Monster / Similar / 同类","You must take the fall with me. The abuse people suffer during their childhood will all burst out all at once when they grow up. Some people choose to vent their anger to the outside world, but some people will only keep it in and torture themselves"]},{"title":"Scorpion time","tags":["Action","Crime","Drama","Fantasy","Manhua","Revenge","Violence"],"disc":["Read manhua Scorpion time","It’s time for revenge on the perpetrators who escaped the law! ‘Seung-ah (22/female)’, a national air pistol gold medalist who lived a moderately conscientious and moderately selfish life, conformed to reality. When her younger sister, whom she loved more than her own life, dies in a car accident right before her eyes, Seung-ah’s life falls apart miserably. A headhunter from the secret organization ‘Scorpion Time’, which directly punishes human scum, comes to her, and she learns that her younger sister’s death was not a simple car accident. With nothing left to lose, Seung-ah accepts the offer to join, and through training, she grows into an action agent! She reaches the true identity of ‘Shin Yu-rim (31/female)’, the head of the group ‘Faust’, which supports those who commit crimes using money and power as weapons…"]},{"title":"Empress flower garden","tags":["Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance","Royal family"],"disc":["Read manhwa Empress flower garden / Empress’s Flower Garden / 女帝の花園 / 여제 화원","I will survive the fierce competition and return to my original world! On what should be the happiest birthday, I get sexually harassed by the store manager, and then get hit by a truck and die. When I wake up after a flash of light… a historical drama set? No, another world??? And before I can even adjust, I have to go to the palace tomorrow. “Can I… become a court lady?” “Court lady? What do you mean a woman who will become a crown princess?” This world is a country ruled by women and men are concubines. It’s not hereditary, but the ‘crown ladies’ who are candidates for the next emperor compete against each other and the final winner becomes the ’emperor’. The moment I hear that, I think of what the strange old lady said… “Is there a law that says women can’t become emperors?” Ryu Jeong-ha suddenly gets involved in a bloody battle for the throne. Will he be able to survive and return to his original world?!! <Empress’s Garden> filled with a charismatic empress and beautiful male and female concubines!"]},{"title":"The Reason why Princess White Rose Wears Thorns","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Reason why Princess White Rose Wears Thorns / Shirobara no Hime ga Toge wo Matou Riyuu / 白薔薇の姫が棘をまとう理由","After her mother’s death, Princess Rosa endured the abuse of her stepmother, the Queen, but remained determined to become the next queen. One day, while in the royal palace forest, she was attacked by a thug and accidentally unleashed the “forbidden power” she had long kept hidden. As a result, following her younger sister Lily’s suggestion, she was banished to live with the “Count of Blood” in a remote land. The Count, Lambert, though unsociable, had a kind heart, and over time, the two began to grow closer. However, her “forbidden power” and an ancient “pact with the fairies” made by the kingdom were linked to her fate. Despite the harassment from the Queen and her sister, as well as the weight of her destiny, Rosa grew into a strong and resilient woman. — “Mother, I’ll find my happiness, no matter what.”"]},{"title":"The Sleeping Duke’s Bride","tags":["Fantasy","Romance"],"disc":["Read manga The Sleeping Duke’s Bride, 眠り公爵の花嫁","When she was young, Karenzia lost her parents and was taken in as an adopted daughter by the Count Giese family, where she endured years of mistreatment. One day, Karenzia is sent to marry an elderly duke in place of her stepsister. However, at the secluded mountain estate where the duke supposedly resides, she instead encounters a melancholic young man. To her shock, a dagger is lodged in his abdomen! The duke, cursed with immortality, pleads with Karenzia—the only one who can see the sword—to remove it for him. Yet, he warns her that pulling the sword will end his life. To protect the newfound place she’s finally come to call home, Karenzia proposes a contract marriage to him, but…"," "]},{"title":"Lemon Pie Night","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family","Yuri (GL)"],"disc":["Read manhwa Lemon Pie Night / 레몬파이 나이트","A young woman, Ariel, is on the run from her brother and lord, Arik. Threatened by an assassin arranged by Arik, she is rescued by a mysterious knight named Verita, and together they flee. To escape Aric’s ever-threatening shadow, Ariel learns to fend for herself with Verita’s help. Along the way, Ariel learns to lean on Verita even when she feels vulnerable, and to be honest with herself about her feelings…"]},{"title":"The Handmaiden Dreams at Sunset","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Handmaiden Dreams at Sunset / 하녀는 해질녘의 꿈을 꾼다","On Dahlia Belohr’s first day as handmaiden, she simply receives one instruction: Whatever you do, do not, under any circumstances, go to the annex. But when an errand meant for another maid falls on her lap, Dahlia reluctantly finds herself walking through the very doors she was forbidden from entering and meets…him. The ghost of the annex. A permanent stain on the duke’s legacy. The cursed bastard boy. What blooms is an unexpected connection that heals the pit of loneliness in both their hearts, despite the constant outside threats wanting to keep them apart."]}]