[{"title":"A Thousand Ways For Her to Take Revenge","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Thousand Ways For Her to Take Revenge / Avenging Lady, The Lady Who Takes Revenge /The Vengeful Lady /  彼女が復讐する千通りの方法 /복수하는 영애님","There is no such thing as God.","‘ My fiancé who betrayed me, my family who stole everything from me…’","I swore that I would never forgive them even in death. I cursed myself to the point of breaking apart. Did that wish come true? “Lilith, wake up! you have to get ready to leave!” i travelled back in time before my parents passed away!","“Who are you?” “My name is Lilith.” I won’t repeat my mistakes in this life. Those who trampled on me and belittle me in my past life… I will make them all pay. because now, I’m the one in charge."]},{"title":"The Final Boss Who Triggers Massacres, I’ll Make You Happy as a Supporting Character!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Final Boss Who Triggers Massacres, I’ll Make You Happy as a Supporting Character!","“The Last Boss Who Causes a Great Massacre— In the world I was reincarnated into, my favorite character’s life held tragedies that were never depicted in the game? This is the love story of a supporting noble lady who cherishes and protects her favorite character and a once-lonely former final boss who gradually opens his heart to her actions…”"]},{"title":"I Thought I Tamed the Villain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Thought I Tamed the Villain / 악역을 길들인 줄 알았는데","I met the him in an orphanage and approached him in order to not die since he’ll become the villain in the future.","“Iris, you’ll never leave me, right?”\n“You’re the only one who calls my name properly and thinks I’m a good person.”\n“I’ll keep all the promises I made with you, so can you not leave me?”","I unintentionally rehabilitated the villain too well! All that remains now is our own futures that has nothing to do with the novel. I thought I was moving toward a happy ending with a well-tamed villain.","Was it all my misunderstanding?","“How could you shoot a arrow as soon as you see me, Iris?”\n“Are you going to kill me?”\n“I’ve endured ten years of harsh torture only thinking about you.”","The man I thought I had tamed came back to me after 10 years. With my efforts overshadowed, he also became a perfect villain."]},{"title":"Rebirth in the end times: I reached the top by opening boxes","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Rebirth in the end times: I reached the top by opening boxes / 末世重生：我靠开箱子问鼎巅峰","Jiang Xiaoyong was betrayed and killed by a green tea girl in the apocalypse, but was accidentally resurrected a year ago and obtained the blind box system. He was always one step ahead of others, collecting supplies and spending a fortune to build a safe house before the apocalypse. He became stronger through the system and avenged his enemies in his previous life. From then on, he embarked on the road to the king’s counterattack."]},{"title":"A childhood friend became an obsessive husband","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A childhood friend became an obsessive husband / My Childhood Friend Became an Obsessive Husband  / My Childhood Friend Became an Obsessive Male Lead / 소꿉친구가 집착 남편이 되었다 / 青梅竹马成了执着的丈夫 / [JIMINWIFE]","“She has to become a villain to survive? But she’s not the villain, how did she do that?”\nOne day, Kim Da Jeong, an ordinary Korean office worker, suddenly entered the world of a novel.\nIn short, she unwittingly took possession of the body of Christine Rosaline, the villain who would die at the beginning of the novel that was being published in series.\nPerhaps because Da Jeong already possessed her body she was able to avoid death in the first part, but that was only for a moment.\nHow can she live without dying?\n“A world collapsed, characters all distorted. If you want to live, you must know who you are.”\nThat statement was simply that she could only live if she was a villain, did that mean that she could only live like that? In the end, she heard the voice of a villain, but Da Jeong’s life was difficult and painful. It turns out that Christine is just a person born with a ‘half-life’ fate.\nIn front of Da Jeong, who was in such trouble, characters she didn’t expect suddenly appeared.\nRaymond Myers, the main male character in the original and Christine’s enemy.\nDiane Schneider, who is not mentioned in the original but is famous as an evil witch in the world.\nCordelia Parker, owned by the original author, the heroine of the original and the creator of this world.\nThe three of them approach Da Jeong with different goals…\nMy Childhood Friend Became an Obsessive Husband"]},{"title":"Genius Martial Arts Trainer","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Seinen"],"disc":["Read manhwa Genius Martial Arts Trainer / 천재 무림 트레이너","During the great pandemic, my gym went under. While desperately trying to make ends meet, I possessed a character in Murim. I was excited to see that I was in the Shaolin Temple, but what the hell? Everyone’s bodies are wrecked from working out the wrong way! How can I just sit back and watch when I used to be a personal trainer?! I’ll teach you the correct, modern exercise methods and heal you all with low-frequency treatment and infrared therapy using inner energy! X Days until the Shaolin Gym opens."]},{"title":"My Exclusive Tower Guide","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa My Exclusive Tower Guide","[Which guide will you use?] A mysterious message came to me the same day the end of the world befell us and a survival game began. A tower that makes humans distrust one another, instigates fights, and leads humanity to destruction… I will not be shaken. I will see this to the end with the people I trust. …Yes, I will create a happy ending with them all!"]},{"title":"I Became The Young Wife of The Male Protagonist of a Martial Arts Novel","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became The Young Wife of The Male Protagonist of a Martial Arts Novel / I Became the Young Wife of the Male Lead in a Martial Arts Novel / 무협지 남주의 어린 아내가 되어 버렸다","I possessed the body of the distant ancestor of the male lead in a martial arts novel where the male lead does everything.","To faithfully fulfill the role of supporting the male lead, I worked tirelessly, breaking my bones to establish the greatest family.","Afterward, I closed my eyes peacefully.","“What? My family has fallen?!”","When I opened my eyes again, it was 300 years later.","The family I painstakingly built was on the brink of complete ruin. Moreover, the male lead I devoted my entire life to supporting was about to enter a humiliating political marriage with the villainess of the original story.","But the biggest problem is…","“Why did I become that villainess?!”"]},{"title":"I Can’t Date a Fictional Man!","tags":["Drama","Fantasy","Isekai","Manhua","Reincarnation","Romance"],"disc":["Read manhua I Can’t Date a Fictional Man! / 我不可能和纸片人谈恋爱 / I Can’t Fall in Love with Paperman!","When a BL manhua artist suddenly transmigrates into a Liao Dynasty princess, she decides to keep doing her own thing… but she had the misfortune to see her “child” come out of the book and refuse a gay relationship with the general?! With a sword poised at her throat, would she surrender or remain steadfast? To make things worse, she can’t control the events of her own story anymore; who exactly is this mysterious person manipulating everything behind the scenes?! Same editor with “The villainess refuses to flirt with the male lead”"]},{"title":"I’m Divorcing My Tyrant Husband","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Divorcing My Tyrant Husband / I Will Divorce My Tyrant Husband / Aku Mau Cerai! / I’ll Divorce My Tyrant Husband / 폭군 남편과 이혼하겠습니다","In the novel of Rofan, she was in possession of the Empress.\nIsn’t that good? The problem is that the empress was pushed by a crafty queen, beaten by the emperor, and eventually died of disease.\nI could not die waiting for my master to arrive in the freezing cold like the original Empress. I need to be a villain to get divorced.\nShe was so extravagant, talked to others and bullied her husband.\nBut the more I act tough, the more obsessed you are, Are you perv?!"]},{"title":"Ah, It’s Wonderful To Be Alive","tags":["Action","Drama","Fantasy","Manhwa"],"disc":["Read manga Ah, It’s Wonderful To Be Alive / ああ、生きているって素晴らしい","Called a failure by his adoptive parents, bullied at school, ignored by teachers, high school boy Kurogane Rikuto has nowhere to belong neither at home nor at school.\n“Life is shit. I guess I’ll die.” After saying this, he was about to commit suicide by jumping off the school’s roof when suddenly all sorts of monsters started appearing from students’ smartphones, transforming the school into a hellscape of screaming agony.\nGoblins, orcs, slimes… Everybody has seen them in games: “small fry monsters”. However, humans in the real world, where there is no magic, no special abilities, and no leveling up, are devoured by those “small fries” without any means to retaliate.\nRikuto, spared from the incident due to his bullies destroying his phone, seeing the students who bullied him and the teachers dying unsightly deaths and the collapse of order, realizes he does have a desire to survive.\nJust then, a goblin wielding a club attacks him from behind—\nThus begins the survival action tale of one insignificant human driven into extreme circumstances."]},{"title":"Light of Arad: Forerunner","tags":["Action","Adventure","Fantasy"],"disc":["Read Light of Arad: Forerunner","I was summoned to undo the corruption in Arad…? Jinsung is a user who has dedicated his life to Dungeon & Fighter.\nHe was summoned by the Transcendent, Nemyr, to act as her forging tong.\n[You shall become my forging tong to guide the blade through its trials.]”I’ll become a fire tong or whatever. I’m going to survive in Arad no matter what!”\nWill Jinsung, a veteran player of Dungeon & Fighter, be able to fulfill his given duties and return to his reality?\nThus begins the story of the dark knight Jinsung to stop the end of Arad!\nLight of Arad Forerunner, The Light of Arad The One Who Walks First"]},{"title":"Childcare Diary with the Villain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Childcare Diary with the Villain / Childcare Diaries / 和反派的育儿日记 / 흑막과의 육아일기","Marie is reincarnated as the nanny from a seedy fantasy novel. She has to take care of Brielle, a baby who is the villain destined to destroy the world, but all she wants is a normal, peaceful life. Marie meets Brielle’s uncle, a cold and ruthless knight who is the king’s right-hand man. He neither despises nor worships her, but protects her with his sword and his heart. They will have to face enemies, intrigue and sacrifices on their journey to change destiny"]},{"title":"I Will Not Be The Supporting Character Forever","tags":[],"disc":["Read manhwa I Will Not Be The Supporting Character Forever / 永遠の脇役なんていない","“Why a supporting character instead of the main character?! And out of all supporting characters, why must I be this girl…” When she came to, she was in the middle of the novel, [Empress Rosalynne], as the supporting priest character, “Elena”. Moreover, the story starts right after Elena messed up a holy ritual and she was treated awfully by everyone around her… “There’s only one way to get out of this! I have to become the tutor of the Emperor’s little brother, Duke Levi!” Elena thought she could watch over the protagonist of the story, Rosalynne, as the events of the story unfolded at the imperial court, but something was wrong. “Equality between commoners and me, a noble? You better watch yourself!” The protagonist she had admired so much was a villainess that discriminated against others based on their social status. “I won’t be able to stand it if everything ends up the way she wants!” And so, Elena resolves to change how the story unfolds. Can she rise from her role as a supporting character and claim the position of protagonist?!"]},{"title":"The Invincible Banished Shadow Archer","tags":["Action","Adventure","Drama","Fantasy"],"disc":["Read manga The Invincible Banished Shadow Archer / 日陰のアミル 追放されて無双する最強弓使い【タテスク】","Amir Waker is an archer who’s been banished from an S-Rank party [The Band of Prodigies], which mainly consisted of nobles. He then falsified his identity and registered himself as an F-Rank adventurer. He took an escort quest to the countryside. The quest was supposed to be an easy task for him as a former S-Rank. But surprisingly, the client of this quest is none other than the 3rd princess who’s being targeted for some certain reasons! Will Amir be able to escort the princess safely from the [strongest] knight’s division of the kingdom? Amir is thus dragged into the political struggles and conflicts of the kingdom."]},{"title":"Dao of the Bizarre Immortal","tags":["Action","Adventure","Fantasy"],"disc":["Read Dao of the Bizarre Immortal, 道诡异仙","High school student Li Huowang possesses an ability: whenever he closes his eyes, he enters a bizarre cultivation world. In that strange world, he is captured by someone who calls him “Master” and is made into a living medicine—a human cauldron that could be turned into a pill at any moment.","In the real world, however, Li Huowang is a mentally ill patient living in a psychiatric hospital, unable to attend school. The doctors tell him that the bizarre cultivation world is nothing but a hallucination.","Now, caught between reality and illusion, truth and lies, Li Huowang breaks down, crying and shouting:\n“Mom, I really can’t tell what’s real anymore!”"]},{"title":"My Introverted Boy","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Introverted Boy","Nowadays the MBTI is a very popular personality test in a bunch of countries like South Korea, this categorizes each person in a certain group corresponding to the way they think, feel and express their emotions. This takes us to a secondary school where the most popular and handsome guy “Jaehyuk”, who is actually totally an introverted with difficulties to understand how popular he is and how others see him, develops a crush on a quiet and strange girl of the same class. The problem arises when Jaehyuk starts causing misunderstandings and awkward situations because of his introverted personality while at the same time his crush doesn’t understand why the most popular guy in school is trying to approach her. What is going to happen between these two? Are they going to be able to go past their personalities to have a normal conversation? Will Jaehyuk be able to confess his feelings?"]},{"title":"I Will Take Responsibility for the Welfare of the Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Take Responsibility for the Welfare of the Male Lead / Writing My Male Lead’s Happily Ever After /남주의 복지를 책임지겠습니다","I possessed a character in the novel I’d been writing for nearly a year. About a wicked woman destined to die a horrible death within two years time. “Is this the price I have to pay for making my readers suffer?” And as for the male lead, he’s stuck rolling over and over like a hoop. For the welfare of my work, the poor male lead, and my own survival, I got a job at the mansion as a maid. But now… “Lady Laria is the best after all. I want you to be the madam of the Blackwell Archduchy.” “Laria is the best!” “Laria, aren’t you like my mother?” The entire archduchy household likes me. Even the Archduke himself. He performs all sorts of things… “The Lady and I are engaged.” We are? Since when? “My children and I need Lady Sherwood. I have no intention of letting her go.” What’s wrong with everyone all of a sudden? I’ve ended up just working for the welfare of the male lead."]},{"title":"Twenty Nights","tags":["Adult","Childhood Friends","Drama","Fantasy","Manhwa","Mature","Romance","Slice of Life","Smut"],"disc":["Read manhwa Twenty Nights","Ha-eun, a romance novelist, gets rejected for her adult-themed novel because it sounds more like educational material than anything risqué. Feeling unbearable humiliation, Ha-eun ends up having a drunken one-night fling with her long-time friend Shiwoo. What she thought was just a one-off incident leads to Shiwoo’s sincere confession… “Ha-eun, I really like you! I’d like to have a chance!” “…How many times?” Ha-eun and Shiwoo end up in a contract romance, where she promises him twenty chances."]},{"title":"The villain’s young backer","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Young Supporter Of Darkness / The Villain‘s Little Sponsor / The Villain‘s Young Backer / 흑막의 어린 후원자","I have been reincarnated as Daphne, a villain who will soon die in the future.\nBut I don’t want to die, nor do I want to be sold.\n“Then you have to change the story now!”\nFor that reason, I tried to win the favor of the heroine and make the male lead the crown prince.\nOK. Now I thought that all that was left was to walk on the flowery path.\n“Goodbye, my sister. You’re really helpful.”\n…The male lead betrayed me.\nMe – Daphne is back again at the age of 13, this time I decided…\n“You have to make the royal filthy royal and that damned male lead kneel on the floor and beg”\nAnd….\n“I will support you”\nSo I decided to support the worst villain ever.\n***\nBut when I decided to support this villain…\n“Come here, my beautiful child”\nWhy did the father-in-law become so emotional?\n“Madam, I was going to bring the duck…but your lunch is flying away!”\n“I heard this is good for health!!”\n“My lady, I caught a bear!”\n“Let’s all get out”\nWhat is it about me that makes people love it so much?\n“Ah, if you know, can you pretend you don’t know?”\nObviously, in my previous life I was most afraid of the villain, but why do I keep teasing him now?\nI thought people here wouldn’t be bothered by my departure, so I left them alone. But…\n“Where do you want to go, Daphne?”\nI was wrong!"]}]