[{"title":"The Genius Grandson of Namgung Clan","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Genius Grandson of Namgung Clan / The Grandchild of Namgung Clan Is a Prodigy / 남궁세가 천재 외손자","Disaster struck ten-year-old Ha Hyeon, wiping out his entire clan. Having lost everything—his household and family—he barely survived and arrived at the Namgung family. There, he says to his maternal grandfather, ‘Sword Saint’ Namgung Muryong: “I don’t want to lose anything precious anymore.” Seeing Ha Hyeon’s determination to walk the righteous path despite his desperate situation, Namgung Muryong sends him to the entrance exam. There, Ha Hyeon begins to stand out with his remarkable achievements, learning and utilizing martial arts he’s never been taught just by observing. The heaven-sent prodigy ‘Ha Hyeon’ embarks on the righteous path to become the greatest under heaven as a ‘Namgung’!"]},{"title":"The Lord’s Coins Aren’t Decreasing?!","tags":["Action","Fantasy","Time travel"],"disc":[]},{"title":"I Returned as an FFF-Class Witch Doctor","tags":["Action","Adventure","Fantasy"],"disc":["Read manga I Returned as an FFF-Class Witch Doctor","The protagonist, Ma Jinsung, was on the verge of clearing a quest in the game, [Demon King Raid] when he was betrayed and abandoned by his expedition teammate. Just when he thought everything was over, he was pulled away by a strange voice and regressed… ‘Notification: you are being granted a different class according to the conditions of the final goal.’ [Witch Doctor] He enters the game once again as a character he had never considered before. An exciting adventure of the Witch Doctor, Ma Jinsung!"]},{"title":"The Selfish Romance","tags":["Manhwa","Romance"],"disc":["Read manhwa The Selfish Romance / Selfish Romance / Selfish Love Theory / รักหลอกหยอกแฟนเก่า / 自私戀愛論 / 이기적 연애론","Hyeondo and Yumin, an ordinary man and woman in their 30s, break up with their respective partners for different reasons despite still being in love with them. Selfishly hoping to get their old flames back, the two form a plan. They pretend to date each other in hopes of provoking their former lovers. Will their selfish and foolish plan really work?"]},{"title":"Becoming the Swordmaster Rank Young Lord of the Sichuan Tang Family","tags":["Action","Drama","Fantasy","Historical","Manhwa"],"disc":["Read manhwa Becoming the Swordmaster Rank Young Lord of the Sichuan Tang Family, Becoming the Sacheon Dang’s Swordsmaster-Rank Young Lord , Becoming the Sacheon Tang’s Sword God Level Young Lord , 사천당가의 검신급 소가주가 되었다 , Он стал главой семьи Четырех Небесных Дангов , He Became the Swordmaster , Rank Young Lord of the Tang Family of Sacheon , He Became the Head of the Four Heavenly Dang Family","Once a prestigious lineage of poison and hidden weapons, the Sichuan Tang Family has now fallen into decline. Born there, Tang Yeon-myeong suddenly becomes obsessed with sword, awakening memories of his past life where he reached the pinnacle of swordsmanship. “In this life, I want to live quietly.” To live quietly, I must hide my swordsmanship skills. However, there are too many obstacles hindering me."," "]},{"title":"Star-Embracing Swordmaster","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Star-Embracing Swordmaster / Star-fostered Swordmaster / 별을 품은 소드마스터","Vlad was a vagrant child of the slums who always admired knights. After an incident where he was struck by black lightning, he began hearing a voice. A knight of blue moonlight appeared one day, and Vlad’s back-alley life was turned upside down… Even an obscure star that does not shine in the highest peaks of the night sky is still a star if it wishes to shine."]},{"title":"Swim In The Cherry","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Swim In The Cherry / 스윔 인 더 체리","During his innocent high school days, Soo-yeong shared an awkward first kiss with his first love, Cherry. But before they could clear up the misunderstanding, Cherry transferred to another school, leaving Soo-yeong with a lingering sense of regret. Years later, after completing his military service, Soo-yeong attends an orientation party and unexpectedly reunites with Cherry, who has now transferred to his university. Intrigued by her mysterious behavior, Soo-yeong impulsively sleeps with her, but then Cherry offers him a chance to make things right: “What if I gave you a chance to make amends?” “You were the one who started it…”"]},{"title":"My Husband is Weak by Day, Strong by Night","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Husband is Weak by Day, Strong by Night / I Married a Sick Husband / 병약한 남편에게 시집갔는데","Meredith is the illegitimate daughter of a duke. Scorned by her own family, she is shocked to hear that they have arranged a marriage for her–with no other than the Emperor of Valtzein. She soon learns that His Majesty has been placed under a curse and is weak during the day, returning to his former self only at night. When he tries to kill her on their wedding night, she strikes a deal with him–she will find a way to use her healing magic to break him free from the curse, in return for a divorce. But the Emperor has other thoughts–he’s slowly fallen in love with her, and he won’t let her go without a fight."]},{"title":"Valhalla Saga","tags":["Action","Adventure","Fantasy"],"disc":["Read Valhalla Saga / 발할라 사가","A professional gamer dies unexpectedly during an E-Sports tournament and is sent to Valhalla, a heaven reserved for only the greatest of warriors.","The warriors of Valhalla are pitted against a struggle for survival in the face of a common enemy. Fortunately, within each warrior lies the roots to their own saga, a legendary tale of their ascendence to fame and feats of great achievement alike.","Witness the birth of an epic saga as this gamer challenges legends and carves a path toward the ultimate glory.","The story itself revolves around Nordic mythology and incorporates a gaming system alongside magical wizards and mighty warriors."]},{"title":"The Zenith","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The Zenith / 정점의 별","“Without victory, survival is impossible.” In pursuit of becoming the supreme being among all living creatures, the mad martial artist, Ma Jinwol, once turned the martial world into a sea of blood. However, after a climactic battle with the Five Masters of the World, he was sealed away. Millennia have passed… and now, he awakens, not on Earth, but on an alien planet. Here, at the GSP, a universal combat tournament is held once every 100 years, and he prepares to face the strongest warriors once more."]},{"title":"Surviving in a Romance Fantasy Novel","tags":["Fantasy","Romance"],"disc":["Read Surviving in a Romance Fantasy Novel","I, Seo Tae-pyung, ended up transmigrating as the younger brother of the heroine in the fantasy romance novel *Celestial Love*. As romantic as this place is supposed to be, I was too busy just trying to adapt to my new life. Romance? Yeah, right. My goal was to keep a low profile and live quietly… But then… “How could you make the crown princess fall for you of all people?!” At that point, I had no idea. I was only just beginning to scrape the surface of this bizarre turn of events…"]},{"title":"The Lone Necromancer","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Reading manga/manhwa/manhua The Lone Necromancer , 나 혼자 네크로맨서 , ソロ降霊術 , The Alone Necromancer , The Only Necromancer , Solo Necromancer , Solo Necromancy\nThe world is ending. Monsters from legends appear everywhere. They eat people, conquer the streets, and begin to make dungeons in the buildings and subways. If you could choose one job in this decrepit world, what would you choose? For a “necromancer” extinction is my playground and death my wealth."]},{"title":"The Bully In-Charge","tags":["Action","Adventure","Drama","Manhwa"],"disc":["Read manhwa The Bully In-Charge / 일진담당일진 / Iljin in Charge Iljin / Designated Bully","After dropping out of school, Kwon Daegun is preparing for his qualification exam. While working a part-time job in a convenience store he got into a fight with some thugs. Daegun, who easily overpowered them, is offered a project called “Iljin in Charge/The Bully In Charge” by the Educational Foundation, which has been closely watching him for a long time. He, who accepted the offer after much consideration, enters a high school that belongs to the foundation and defeats the core bullies of this school one by one according to the order of the foundation."]},{"title":"Born a Princess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Born a Princess / Baby Tyrant / Baby Dictator / A Baby Tyrant / Beibi Poggun / Born a Princess / 베이비 폭군","‘Less than a month old… I became the great empire’s treasured princess…!’","In all my life, I wanted love. Love from my family, But the family I had, failed me in the end. Abandoned… abused… I don’t want this so-called family. It’s a waste of time.","I came to a new world after a miserable ending…","‘The empire’s treasured princess… that’s me… but why is father, the emperor, so strange?’","“Mabel, I will give you the Ponce Castle.”","“My sweet child, the most fertile land is yours.”","“No, wait, this whole country will be yours for the plucking.”","‘Father, he’s strange… is this what family love is like?’"]},{"title":"I Tried To Be Her Loyal Sword","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Tried To Be Her Loyal Sword / Cassmire: The Loyal Sword / I Tried to Be a Loyal Sword / I Was Planning to Become a Loyal Sword / Loyal Sword / 충직한 검이 되려 했는데 / 我只想成為忠誠之劍 / 本想成为忠诚的剑\nOne day, I fell down and remembered my past life.\nIt’s actually a reverse harem novel where my sister is the main character, and I was the daughter of the mad blood-devil Duke Chrysis. I didn’t mean to get involved with Duke Chrysis, but my sister’s illness deteriorated rapidly and I was forced to visit him as his daughter…\n“My daughter doesn’t have to kneel for anyone. Even if this was the Emperor of the Empire, you wouldn’t need to bend your knees.”\nDuke Chrysis, who had no blood, no tears, was a little strange.\n“If you cry before my sister’s eyes, you’ll only die.”\nMy angel-like sister, Aria, also blackened for some reason.\n“You’re the one who saved my life, and you’re responsible. Have you forgotten the night you spent with me?”\n“I’ve admired you for a long time. Can’t you give me a part of you?”\n“You don’t want to be Queen? Then you will be the King. I’ll be your husband.”\n“People think I’m the Pope who serves the Sun God, but do you know that God is you to me?”\nThey were the fishes of my sister’s fishing grounds.\nWas the world crazy?"]},{"title":"I Adopted a Villainous Dad","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Adopted a Villainous Dad / 악당 아빠를 입양했다 / I Adopted a Villain as My Father","One day I woke up and I was six years old. I had transmigrated into the main character of a tragic novel, Saint Priscilla, who walks through all sorts of thorny paths! Since I’m here, I need to avoid the scheduled special misfortune and live happily with my favorite character. The final boss of the story and the villain, Melchizedek, the tyrant of the Rehel Empire, who has no blood or tears! A happy life of adopting my father and becoming a princess, with my favorite character. I also saved the male protagonist, in order to remove my father’s death flag. “If you approach my daughter, you will die.” Why does my father keep putting up death flags? Moreover… “If you tamed me, you have to take responsibility.” Why is the male lead so obsessed with me? What’s going on?"]},{"title":"My Disciples are All Invincible Monsters","tags":["Action","Adventure","Fantasy"],"disc":["Read My Disciples are All Invincible Monsters / 我的徒弟都是无敌大妖","man and successfully awakens an invincible system. However, to his dismay, the system leads him into a world ravaged by monsters, where he must wait 500 years before it activates.\nJust as he is about to lose hope, a monkey demon appears before him, seeking to become his disciple!\nTo safely survive the 500-year wait for the system to activate, Chu Xuan Yan decides to use this monkey, teaching it the terrifying powers of the Hell Whale and the self-determination magical arts, ensuring the monkey is fearless. Years later, this monkey becomes…"]},{"title":"All My Alter Egos Are Tycoons","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa All My Alter Egos Are Tycoons / 내 분신이 거물이 되어간다","A young man, Han Sunghyun, loses his family in an indiscriminate attack by superhumans. While living a reclusive life due to the trauma of the incident, one day, he awakens the ability to control avatars in his place!","“What?! I can send avatars to hunt in dangerous otherworlds while I stay safely at home, just focusing on strengthening my powers?!”","As his avatars grow rapidly, crossing dimensions, races, and professions, Han Sunghyun begins to hunt down the superhumans who abuse their powers!"]},{"title":"Cry, Even Better If You Beg","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Cry, Even Better If You Beg / Cry, Even Better If You Beg / 울어 봐, 빌어도 좋","Orphaned at a young age, Layla Llewellyn feels like the luckiest girl in the world after she moves in with her uncle Bill, a gardener who lives on the scenic Arvis estate in the Berg Empire. To Layla, Arvis seems like paradise; she loves to explore the vast forest, always bringing her notebook to record the wildlife she encounters. She especially loves the birds, watching them with awe as they hatch and grow from fluffy chicks into beautiful birds. Duke Herhardt, the young, handsome lord of Arvis, is also interested in birds-and in Layla. But the difference is, he’s interested in birds because he likes to hunt them… and he’s interested in Layla because he likes to make her cry. “read at kaiscans.com to support us” If a lovely bird is trapped in a golden cage, which will she choose: a life of luxury, or freedom?"]},{"title":"Return of the Flowery Mountain Sect","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Return of the Flowery Mountain Sect /Return of the Flowery Mountain Sect  / Return of the Mount Hua Sect\nChung Myung, The 13th Disciple of the Great Flowery Mountain Sect, One of the 3 Great Swordsmen, Plum Blossom Sword Saint, defeated Chun Ma, who has brought destruction and disarray onto the world. After the battle, he breathes his last breath on top of the headquarter mountain of the Devil’s Worship Sect. He is reborn after 100 years in the body of a child. ……What? The Flowery Mountain Sect has fallen? What kind of nonsense is that!?"]}]