[{"title":"They Say i Was Born a King’s Daughter","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa They Say i Was Born a King’s Daughter / 왕의 딸로 태어났다고 합니다 / Moi, fille du roi !"]},{"title":"You Are Extraordinary","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa You Are Extraordinary / 압도적 그대 / Overwhelming You / Kamu yang Luar Biasa"]},{"title":"The Boutique at 97th Sheldon Street","tags":["Fantasy","Isekai","Romance","Shoujo"],"disc":["Read manhwa The Boutique At 97Th Sheldon Street","After regaining her senses, Yoo-Eun finds herself inside a game! No logging out! No inventory! All she can do is design clothes?! While struggling with her reality of being in a survival game, Yoo Eun arrives at the boutique on Sheldon Street and encounters a mysterious noble, Ashton. Holding onto her, he asks for her help. It seems as if he was waiting for her… Isn’t that suspicious?"]},{"title":"Blind Nine","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Supernatural","Webtoons"],"disc":["Read manhwa Blind Nine / Gǔ Zhái Yè Jīng Hún / House of Nightmares / Night Terror in the Old House / Дом Ночных Кошмаров / เรื่องหลอนหลัง 3 ทุ่ม / 古宅夜惊魂 / 블라인드 나인"]},{"title":"Black Winter","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Black Winter / 블랙윈터","On a dark winter night, a young boy was cursed and a young girl had sinned."]},{"title":"Love Me Gently, Bossy CEO","tags":["Liexing","Ping Ping Jun","Romance","Webtoons"],"disc":["Read manhwa Love Me Gently, Bossy CEO / Badao Zongcai Qing Dian Ai / Bàdào Zǒngcái Qīng Diǎn Ài / Domineering President, Lightly Love / Into Her New Life / Presdir Mencintaiku Dengan Kelembutan / President Director Loves Me With Tenderness / 霸道总裁轻点爱 / 대표님 진도가 너무 빨라요"]},{"title":"Lady Cindrella","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Lady Cindrella / 레이디 신데렐라","“I need a fake fiance to protect me!” After her mother’s death, Elladis(Ella), who had fallen from her father’s favor, was reduced to being a maid under the abuse of her step-mother and sisters. Her stepmother wasn’t satisfied to treat Ella as her maid, so she forced her to marry a gambler-crazy Viscount. The only pleasure for Ella, who lives a difficult life, was the country’s hero, Archduke Wellington. Ella goes through each day memorizing anything about Archduke Wellington. However, a man, who is her husband only in name, sells Ella to his gambling debts, and Ella, who runs away with the intention of dying, returns to the age of 18 after a desperate wish. The opportunity came once again like a miracle! She decided not to live the way she used to, until Ella inherited her mother’s legacy. She decides to entrust herself to Archduke Wellington. “Please save me from this house.” “What can I get in return for saving you?” “I’ll be your fake fiancee.” What will be the conclusion of Ella’s bold choice, who proposes a contractual engagement to Archduke Wellington using the information she knows from her previous life as bait ?"]},{"title":"Thursday’s Blue Moon","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Thursday’s Blue Moon / ブルームーンへようこそ / 목요일의 블루문","“Welcome~ To Blue Moon, a cocktail bar!” After leaving her job at a successful company, Nayeon is now working part-time at her cousin’s business, “Blue Moon.” She’s having a great time making various cocktails, but she’s still contemplating what she really wants to do. One day, a mysterious customer, Inwoo, appears in front of Nayeon. “…Thank you for your concern.” Unlike Nayeon, Inwoo seems to be pursuing his dreams. But he seems to have his own troubles that he can’t talk about… A story of youth wandering between reality and dreams! The drama between Nayeon and Inwoo begins with cocktails!"]},{"title":"The Magic Tower Librarian","tags":["Fantasy","Magic","Manhwa","Romance"],"disc":["Read manhwa The Magic Tower Librarian / Demon Tower Librarian / Matabui Saseo / Matou no Shisho / Pustakawan Menara Sihir / The Librarian of St. Bright Tower/ 魔塔の司書 / 마탑의 사서"]},{"title":"Hey, Prince!","tags":["Comedy","Shounen Ai"],"disc":["Read manhwa Hey, Prince! / Hold On, Crown Prince! / ¡Oye, Príncipe! / 别这样，皇太子殿下！ / 저기요, 황태자님!"]},{"title":"Failed to Log Out, but Succeeded in Marriage","tags":["One shot","Romance"],"disc":["Read manhwa Failed to Log Out, but Succeeded in Marriage / 로그아웃은 실패했는데요 결혼은 성공했습니다"," "]},{"title":"Mr. Y & Mr. J","tags":["Romance","Shounen Ai"],"disc":["Read Immediate Violation / Jíshí Wéiguī / 即时违规","The actor Ye Changshi unfortunately discovered that he had advanced stomach cancer at the peak of his career, but he did not expect to transmigrate into his younger self in another world, and accidentally “dropped” into the bathtub of the Great Master Ji Ling…"," "]},{"title":"CEO Above, Me Below","tags":["Drama","Josei","Manhua","Romance","Shoujo"],"disc":["Read manga CEO Above, Me Below / Bossy President / My Paranoid Lover Webcomics  on manhwaclan\nDo you want to steal my genes then leave?? He grabbed her and tried to force her to hand over the child that was born three years ago.She never had a baby? Then conceive one!The delusional CEO’s desperate love. Her inability to resist as she fell deeper…"]},{"title":"Leave Me Alone!","tags":["Manhwa","Romance","School Life"],"disc":["Read manhwa Don’t Act Like You Know Me! / Don’t Pretend to Know Me! / 아는 척 하지마!","You don’t know me. Got it? After a rough three years in middle school, Doeun decides to return to her hometown and attend high school there for some peace and quiet. But with her old besties now the hottest, most popular guys in school, that might be harder than she thought. Why can’t everyone just leave her alone?!"]},{"title":"Seasons Of Blossom","tags":["Romance","School Life"],"disc":["Read manhwa Seasons Of Blossom / Youth Blossom / Cheongchun Blossom / 청춘 블라썸","Children who are beginning their youth. Their growing pain on their way to spring."]},{"title":"I’ll Just Live on as a Villainess","tags":["Comedy","Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’ll Just Live on as a Villainess / The Villainess is Retiring / Aku Akan Hidup Sebagai Antagonis / I’ll Just Live as a Villain / Solo viviré como una villana / Я просто буду жить, как злодейка / 作为恶女活下去 / 作为恶女生活 / 悪役として生きていきます / 그냥 악역으로 살겠습니다 / 作为坏女人活下去","After an office worker is reborn as Everia Oberon, a romance novel villainess destined for an evil life and a tragic death, she decides to skip the drama by retiring to the countryside. Having moved to a frigid region full of nonflammable wood, Everia calls on archmage Theoharis to warm her home with his azure flame… not realizing that she’s bound herself to a lifelong contract! Now that she’s master of a bloodthirsty (but breathtakingly handsome) demon dog, can she kiss the quiet life goodbye?"]},{"title":"The Antagonistic Goddess Attacks","tags":["Manhua","Romance"],"disc":["Read manga The Antagonistic Goddess Attacks / 反派女帝来袭","An adaptation of Mo Ling’s novel: Coming of the Villain Boss! It’s said the plots of quick-transmigration systems are classified as: normal-hard-hell-goddess. Beating up white lotuses, trampling on scum men, using unpredictable means of revenge…see how a goddess makes them tremble in fear, fleeing in all directions. However this time, why is he not dodging or hiding, instead sticking to me? “Because this time, I want you to fall in love with me.”"," "]},{"title":"The Story of the Hated Mule","tags":["Fantasy","Romance"],"disc":["Read manhwa The Story of the Hated Mule","“This is her daughter?” Tara, the illegitimate daughter of the noble Queen Adelaide, was thrown away as a baby and raised by poor relatives. They sent her to a notorious mage in the west named Judas, whom she had never met before. While she is overwhelmed by her so-called guardian’s impossible beauty, he and the others in the castle treat her warily, hateful of the queen. However, the girl’s lovable innocence and pitiful nature begin to melt the immortal magician’s frozen heart… “Stop acting cute. You’re like a vixen.” “Why do you keep calling me a vixen?” “I don’t care if that child is broken. To me, life and destruction are one and the same.” A healing romance blooms between an obsessive and frigid ‘guardian’ that only shows kindness to one girl, and a little ‘miss’ scarred by her past."]},{"title":"A Thousand Miles Across the River: Qin Chuan and Zhixia","tags":["Fantasy","Josei","Romance"],"disc":["Read manhwa A Thousand Miles Across the River: Qin Chuan and Zhixia / 隔河千里，秦川知夏","Qin Chuan, the administrator of Baifuquan Relic Park, is keen on small animal protection. Under an unintentional coincidence, the learned man is invited to design a tour route along the Beijing-Hangzhou Grand Canal for Zhan Zhixia. An accidental intersection in life leads to a shared life. From acquaintances to lovers, with the beautiful scenery of the Grand Canal, the dilemma of life has become bright with love…"," "]},{"title":"The Flower of Heaven","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Flower of Heaven / Empty Love / The Elegant Love of Konghua / The Flower of Heaven / This World Won’t Let Me Go / Kong Hua Qi Lian / Konghua Qi Lian / Kōng Huá Qǐ Liàn / 空华绮恋 / 이세계가 나를 놔주지 않는다","The female botanist An Lan tripped on a snowy mountain and accidentally fell into the legendary and mysterious country – Floscaeli. What’s more, she was hailed as the prophesied “goddess” and the future queen… Between romance and politics, a story of dreamlike love slowly unfolds…"]}]