[{"title":"Twin Sister’s Strike Declaration","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Twin Sister’s Strike Declaration / 쌍둥이 언니의 파업 선언","‘I don’t want to go back to the past.’ Rosette, who was born a saint, but lived as a surrogate all her life in place of her sister who was not given any powers. But the only thing that came back to him was betrayal and a tragic death. An unfamiliar voice sounded in his ear. And Rosette is forced to return to the past. “Are you crazy, Rosette?! What are you thinking about? You can’t do anything without my name!” “Shut up, Lea.” “What, what?” Rosette decided. I will live the opposite of my last life. I will make the position of saint and family mine. The Rosette twins are a joyous revenge drama against their family."," "]},{"title":"Overpowered Sword","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Overpowered Sword,","The protagonist of a story is always decided from the start. No matter how hard the supporting role tries, they’ll just be a supporting role in the end. Then, a moment came where all of that changed. [Leon, do you think you’re qualified?] The holy sword that was supposed to choose the hero of the oracle came to him. What? You’re untalented, poor, and have no connections? Don’t worry! The hero who can resolve anything with the holy sword is here! “…There was a period when I thought like that too.” This is where Leon’s story as the hero begins."]},{"title":"The World Without My Sister Who Everyone Loved","tags":["Adaptation","Drama","Fantasy","Historical","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The World Without My Sister Who Everyone Loved / A World Without You / A World Without My Sister Who Everyone Loved / The World Where the Beloved Sister Disappeared / The World Without My Sister Whom Everyone Loved / 备受宠爱的姐姐消失的世界 / 사랑받는 언니가 사라진 세계","“I hate you enough to want to kill you, Sienna.”","I was my sister’s shadow all my life, and I was betrayed by her and died. But… people have changed since the day I came back in time.","“You’re the only child Nacht chose.”\n“Your Highness recognizes you as family.”","Something’s wrong. These people seem to mistake me for my older sister.","“I beg you, believe in us for once, that we care for you.”","I once wanted to be loved. Now I fear that this mindset will become my weakness. One betrayal was enough.","Everything is over when you bet everything in love. I just want to get my life back so…"]},{"title":"She’s Not Our Daughter!","tags":["Fantasy","Historical","Romance"],"disc":["Read manhwa She’s Not Our Daughter! / 얘 우리 딸 아니에요!","Six years ago, Sierra broke up with her ex-boyfriend, Cassius, without a word. Now he’s back as a duke, claiming he regrets abandoning her. But wait, wasn’t she the one who ended things? To make matters worse, he starts getting strange ideas after meeting Hanael, her 5-year-old niece whom she’s been raising in place of her sister. “I had no idea, Sierra. I never knew you were raising our child all alone…” Hanael, who had been hiding, suddenly yells at Cassius instead of being shy. “Please, stop denying it… our relationship, and our child.” “You’re a bad man! You abandoned us!” No, Hanael, he didn’t abandon you. And I’m not your mother!"]},{"title":"Leave the Divorce to a Professional Lawyer","tags":["Manhwa","Romance"],"disc":["Read manhwa Leave the Divorce to a Professional Lawyer / 이혼은 전문 변호사에게 맡기세요","Natasha is an experienced divorce attorney.","And for some reason, this empire was overflowing with couples who wanted to divorce for various reasons.","For example, a husband who suddenly becomes obsessed with a wife or a wife who suddenly wants to get a divorce.","Thanks to this, Natasha was making a sizable profit by helping them.","In particular, when claiming alimony or part of property division as a fee, it was almost like sitting on a cushion of money.","‘Which lawyer would refuse this?’","Natasha hummed inwardly.","***","“…Miss Estelle. Lawyers are always on the side of their clients.”","The words that came out with a face that were not impressed were very emotional. When Estelle made a face that she couldn’t believe, Natasha continued.","“To be precise, I’m on the side of those who give me money.”","“That’s better.”","“Honesty is also a basic skill of a lawyer.”"]},{"title":"The Hunter Wants To Live Quietly","tags":["Drama","Fantasy","Manhwa","Romance","Super power","Supernatural","Time travel","Yaoi(BL)"],"disc":["Read manhwa The Hunter Wants to Live Quietly / The Hunter Wants to Live in Peace / The Hunter’s Gonna Lay Low / 헌조살 / 헌터는 조용히 살고 싶다","[Translated by Lilith Scanlations] Hunter Cha Euijae, sent to seal a rift over the West Sea, was flung out after closing it. When he regain consciousness, he found himself in a garbage dump—eight years in the future. Starving, he stumbled into a hangover soup restaurant and realized the world had changed. Now, disaster alerts warn of rift openings, slime ASMR videos are trending, and hunters livestream A-rank sword unboxings. Instead of the looming apocalypse, the future is oddly peaceful, leaving Cha Euijae feeling empty. Deciding to leave his hunter days behind, he chooses to work part-time at the restaurant. But his quiet new life takes a turn when he meets a mysterious figure in a gas mask…"]},{"title":"Martial God Regressed to Level 2","tags":["Action","Manhwa"],"disc":["Read manhwa Martial God Regressed to Level 2 /  The Martial God Who Regressed Back to Level 2 / The Warlord Returned to Level 2 / Warlord Who Returned to Level 2 / El dios marcial que regresó al nivel 2 / Deus marcial retorna ao nível 2 / レベル2から始まるやり直し / 2等武神 / เทพนักรบผู้หวนคืนสู่เลเวล 2 / 2레벨로 회귀한 무신 / 回归到level 2的武神","[Humanity, which has been deemed worthless, will be deleted]. “Battle Net,” which was thought to be a game, turned into a disaster for humankind. After the “Space League” was hosted, all living organisms in the universe fought for their lives. Humanity, represented by Earth, kept failing and was eventually annihilated. Except for one person, “Martial Saint” Seong Jihan. His skill, “Nameless Divine Arts,” resisted the system’s deletion. Humanity, which had been deemed worthless, received another “chance.” This was the second chance granted to Seong Jihan. “Things will be different this time.” Since he, the one who completed the game, had returned."," "]},{"title":"The Priest of Corruption","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Priest of Corruption","I used a cheat to create a character in the game. When I came to my senses after pressing the play button, I had possessed the “Priest of Corruption” character I had created. It had to be a character who had bad stats and was hated by all! All I had on me is a woman’s dried up hand, but that hand was a goddess’s?!"]},{"title":"The Wirepuller Gets Lucky in Happier Years","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Wirepuller Gets Lucky in Happier Years / 흑막의 말년운이 좋다","Park Doah is a person one who can tell a person’s destiny by their face . After her death, she reincarnated in the body of a girl with a similar faite to her own.\nPerphaps the skills she has learned in her previous life are not useless after all.\nGrand Duke Credel’s daughter, Ophelia’s replacement, taken from the slums. She is tortured by the maids, Ophelia’s brother and the Grand Duke himself. She uses her skills to carve out a new life for herself…\n” I don’t wish to be used and discarded like in my previous life.\nBut the Credel family is to be ruined in eight years, so she has to find a way to escape.\nBut then…\nA shadowy figure appears in front of her. The cursed one, the black shadow of war.\n” A rabbit?\nEyes that are full of black light, the eyes of a phoenix!\nAs he looks at her, she sees his destiny in those eyes.\n” I will make you an emperor!\nFear and exictement coexist. I take his hand which holds the future.\n” Will you share you destiny with me?"]},{"title":"I’m The Princess of All","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m The Princess of All / 모두의 황녀님","It’s a place where you dream of being horribly murdered by Your Mother.","I thought it was a dream, but it also happened in reality. To survive, I decided to make a different choice from my dream.","The only way to survive is to meet the Empress, but the only one that I encountered was my half-brother, the Crown Prince, Rudan. When I thought I was wrong, he reached out to me…","“Can I stay here?”","“This is your room now.”","I just cried because I was hungry, but everyone was so kind to me."]},{"title":"Charlotte’s Wheel","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Charlotte’s Wheel / 샬롯의 수레바퀴","Vivian, an evil woman called the old castle witch. After committing all kinds of crimes, he was finally killed by the revolutionary forces. Just before her death, the Dusk Witch appears in front of her and returns Vivian to three years ago, leaving a meaningful message. After vowing never to lose her loved ones again, Vivian rose to power."]},{"title":"The Object of your Obsession is Wrong, Lord of the Tower!","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Object of your Obsession is Wrong, Lord of the Tower!, The Object of Your Obsession is Wrong, Magic Tower Lord!, 집착 대상이 틀렸어요, 마탑주님!, You Are Obsessing Over the Wrong Person, Lord of the Tower!","When Selina accidentally regains her memories of her previous life, she is horrified to discover that she is related to the infamous Croft family and tries to stay away from them.Louis, the second male lead, relentlessly pursued the female lead in the story. She tries to avoid him, but for some reason, he takes a keen interest in her, claiming that Selina has made the sound in his ears go away. Read at kaiscans.com to support us! ‘I’m not the one you’re going to obsess over, am I?’The murderous but comically charming couple and their bizarre cohabitation begins!"]},{"title":"The Princess Blooms as a Crazy Flower","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga The Princess Blooms as a Crazy Flower / Melody: The Crazy Flower Blooms / Her Highness, the Wildflower / La Princesse, cette fleur sauvage / 황녀, 미친 꽃으로 피어나다","It’s been a year since I pretended to be crazy to find a way to stop this marriage.\n“Your Majesty! I really want to get married, as a representative of the nation!! If the Aizen Empire doesn’t work, send me to Vladimir Kingdom! I heard the king will be there today today and tomorrow, so I want to get married there and live happily ever after!”\n“Your Majesty must not send that madness, Your Majesty!!”\nThat’s right! I finally heard it!! I really like the tune. Just listening to it drives me crazy.\n* * *\nThe best way to live in peace and comfort! I even planned to marry Caesar Bethel, who was said to be the most handsome man in the empire.\n…….\nSomething is strange.\n“Fight me.”\n“…….”\nYes, that’s not it.\n* * *\nIn addition, even the Crown Prince, who has no conscience:\n“Walk with me, Melody.”\nHe is really friendly because of the way he treats the younger brother he has never shared with.\n“Isn’t that ridiculous even if you think about it yourself?”\nI want to live a peaceful and comfortable life, but is this okay?\n* *"]},{"title":"I Saved You, but I’m Not Responsible","tags":["Drama","Fantasy","Magic","Manhwa","Mystery","Romance","Shoujo","Webtoons"],"disc":["Read Manhwa I Saved You, but I’m Not Responsible / Don’t Expect Me To Take Responsibility / 어쩌다 구원했지만, 책임은 안 집니다","I’m the one who was abandoned, but I think I grew up with the healthiest mindset!","I went undercover as the fake’s lady-in-waiting, but when I got there, my old family seemed… off?\nI thought, “Not my problem!” and focused on my mission, but then…","“Are you not going to live with us?”","The eldest, who used to be controlling towards the fake, starts acting weird around me.","“I never thought I’d feel such camaraderie and trust with someone of the opposite sex.\nYou make me feel strangely comfortable.”","The second brother, who almost went down a dark path, managed to get his life back on track—thanks to me.","‘I didn’t come here to help them film a family regret drama.’","I tried to ignore it and rush off to my next mission, but everywhere I go, I run into people whose lives are ruined.\nI mean, why is everyone so conveniently messed up for me to save them?!"]},{"title":"Youngest Scion of the Mages","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Youngest Scion of the Mages manhwa / Youngest Son of the Renowned Magic Clan / Magician’s youngest son / The Youngest Son of Magical Master / Magical Master Youngest Son / 마법명가 막내아들","Youngest Scion of the Mages manhwa, Youngest Son of the Renowned Magic Clan It was a ridiculous piece of fiction, one that I’d be ashamed to call a novel. Yet, that was exactly what I was transmigrated into.Larsen Mayton.I became that supporting character, a wretched scoundrel who got purged at the age of 17.Now, as the writer and creator, I shall reshape the world of the character Larsen Mayton. A flimsy plotline and a garbage setting.A string of words too embarrassing to even call a novel.Yet I ended up inside the pages of that very same novel I wrote.And as Rasen Mayten no less, a bastard of a side character who gets murdered at the age of 17.As the writer and creator of this world, I will now recreate the world of the character Rasen Mayten’.Other"]},{"title":"I Become a Legendary Arch Mage by Reading a Book","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I Become a Legendary Arch Mage by Reading a Book","I was reincarnated as a grimoire with all the magical knowledge of this world.","Anyone can become a legendary arch-mage with my help.","Read me and I’ll give you endless power."]},{"title":"Myst, Might, Mayhem","tags":["Action","Adventure","Fantasy"],"disc":["Read Myst, Might, Mayhem","Jeong, the Slaughtering Scythe Demon, feels joy in killing others. He happens to look just like Mok Gyeongwoon, the third young master of the Mok Sword Manor…\n“If you pretend to be me and live my life. I will let you out of this prison.” “Will you really give me that chance?”\nSlash Kill the third young master and live his life pretending to be him. Will the fake Mok Gyeongwoon survive this life?\nThe serial killer begins his new life as the third young master of the great Mok Sword Manor."]},{"title":"Subscribing To The Transcendent’s Channel","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Subscribing To The Transcendent’s Channel / 초월자의 채널을 구독했다","Living by selling information about monsters, Maeng Siwoo is considered completely useless in the hunter industry without any standout qualities. However, he fiercely battles to provide for his sick younger sibling.","One fateful day, he is gifted a mysterious smartphone by a transcendent being within a dungeon, appointing him as the channel manager for such beings. Upon subscribing to the channel, he unlocks the ability to wield the powers of the gods."]},{"title":"The Barbarian of Seoul Station","tags":["Action","Adventure","Fantasy"],"disc":["Read The Barbarian of Seoul Station / El bárbaro de la estación de Seúl / 서울역 바바리안","Cheoldu, a barbarian raised on Earth, lives a mundane life with his best friend Jintae. But when he sees an alien creature from his planet on the news, everything changes. Thrown into an apocalyptic challenge, Cheoldu and Jintae must adjust their lives in Nova, a savage world filled with goblins and ogres.","Will the two conquer Nova’s perils and uncover the secrets that could change Earth’s fate? An epic tale of friendship, survival, and untamed adventure awaits."]},{"title":"Savage Castle","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Savage Castle  / 새비지 캐슬","Due to his uncle’s conspiracy, the king leaves the throne and hides in a desolate land. The story unfolds with the king and a pitiful yet beautiful noble lady, who has made him her slave, entangled in obsession and affection."]}]