[{"title":"God of Blackfield","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa God Of Blackfield /  Goddo Obu Burakkufiirudo / ゴッド オブ ブラックフィールド / 갓 오브 블랙필드","“Who am I?” The legend of the French Foreign Legion, ‘Kang Chan’! During the African war, he was called ‘God of Blackfield’, the black land’s God, by his enemies who were terrified but in awe of him. However, during a mission to kill Masallan, the brain behind SISS, the group of sunni supporters, Kang Chan was killed in action by an unknown bullet shot from behind him. As his vision got blurry, he saw his thirteen team members, who had absolute faith in him, getting killed one after another. As Kang Chan was awaiting death after being shot by a traitor, he was saved by a mysterious power and woke up 3 years later in South Korea. However, he was in the body of another ‘Kang Chan’, a 19-year-old high school boy who was being bullied at school. Kang Chan’s journey to get revenge on the traitor and to find out the truth behind his rebirth begins now! he was called ‘God of Blackfield’, the black land’s God, by his enemies who were terrified but in awe of him. However, during a mission to kill Masallan, the brain behind SISS, the group of sunni supporters, Kang Chan was killed in action by an unknown bullet shot from behind him. As his vision got blurry, he saw his thirteen team members, who had absolute faith in him, getting killed one after another. As Kang Chan was awaiting death after being shot by a traitor, he was saved by a mysterious power and woke up 3 years later in South Korea. However, he was in the body of another ‘Kang Chan’, a 19-year-old high school boy who was being bullied at school. Kang Chan’s journey to get revenge on the traitor and to find out the truth behind his rebirth begins now!"]},{"title":"All Hail the Sect Leader","tags":["Adventure","Comedy","Fantasy","Historical","Martial Arts","Psychological","Romance"],"disc":["All the members of my sect are abnormally strong. All my disciples turn out to be big shots, and I’ll definitely become invincible in this world!"]},{"title":"Azelda: The Spirit Master’s Contract Marriage","tags":["Drama","Romance"],"disc":["Read manhwa Azelda: The Spirit Master’s Contract Marriage"]},{"title":"I am the descendant of the Divine Dragon!","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua I am the descendant of the Divine Dragon! / I, the Queen of Dragons! / 我，神龙之后！","I am the descendant of the Divine Dragon! – In the world of fierce competition among warriors on the Xuan Realm Continent, they refine their bodies, cultivate their martial meridians, seize the essence of heaven and earth, and strengthen themselves to surpass the limits of the mortal realm! Our warrior, Lu Hao, was unjustly targeted by his own clan since he was young. Fortunately, Lu Hao luckily awakens the bloodline of the Divine Dragon! From then on, with unwavering determination, he rises step by step amidst numerous threats, reaching the pinnacle of power! Unraveling the veils of mysteries from his past life!"]},{"title":"Reset Life of Regression Police","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Reset Life of Regression Police, Police Returner’s Reset Life, Regression Reset Life of Police, Regression Resets a Police Life, 회귀 경찰의 리셋 라이프","The story of Choi Jong-hyuk, the head of the crime investigation intelligence team, when he wanted to find his mother’s body, he had a mysterious accident then somehow he returned to 1997."]},{"title":"Reasons Not to Enter a Haunted house","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Reasons Not to Enter a Haunted house"]},{"title":"How to Tame the Merciless Villain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How to Tame the Merciless Villain / 악역의 주인님이 되었다","I transmigrated into the novel called “The Treacherous Sorcerer” as a supporting character who’s destined to be killed by Kian, the main villain of the story. According to the original plot, Kian ends up slaughtering every single noble in the empire-including me-so I must do everything in my power to stop him and save myself from an untimely death. Kian has survived a harsh and painful past, so I will spoil him and take good care of him so that he won’t turn out to be the vicious supervillain! But what have I gotten myself into? After I rescued Kian from the slave market… he’s suddenly obsessed with me! Will I be able to protect Kian and myself from a disastrous fate?"]},{"title":"Only I Can Speak the Ancient Language of Magic","tags":["Adaptation","Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Only I Can Speak the Ancient Language of Magic / 빙의했는데 고대 언어가 한국어였습니다"," "]},{"title":"Maxed Out Leveling","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Maxed Out Leveling , 만렙부터 레벨업 , Level Up from Max Level\nMax-level internal arts, max-level external arts. Jianghu, Murim’s famous and strongest, Cha Shin Hyeon. I came back to Earth after reaching the peak of martial arts, but why has everything changed so much? A world where monsters are coming out of dungeons, and hunters are leveling up via their status windows. ‘Start again from level one? That doesn’t phase me at all, since my martial arts are already at the max level.’"]},{"title":"You’re Unforgiven, Your Majesty","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhaw You’re Unforgiven, Your Majesty / 날 버린 황제의 집착은 거절합니다","A royal mistress of the emperor. That’s all Roen Setia could be to the man who loved her. But framed with the attempted murder of the empress and her unborn child, the punishment for such crime is death… The resentment of the betrayal of the emperor yields another life-another chance. Roen is the royal mistress once again, but this time, she curates a different life. Claiming revenge on the people that abandoned her and drove her to her death, she creates a new place for herself."]},{"title":"Vengeance from a Saint Full of Wounds","tags":["Fantasy","Josei","Magic","Romance","Shoujo","Villainess"],"disc":["Read manga Vengeance from a Saint Full of Wounds/ The Holy Wound Became a Villain / 傷だらけ聖女より報復をこめて / Kizu Darake Seijo Yori Houfuku wo Komete","Lua, was a candidate for a Saint with the power to heal, however, there was a flaw in her ability, since she transferred the symptoms to herself to be able to heal them, that way treating someone meant that in return she experienced pain and suffering. The Saint candidates treated her as flawed, but her best friend Arian was the only one who always protected her. One day, Garrot, the leader of the Knights, whom Lua was in love with, was on the verge of death after being injured, so Lua decides to heal his wounds completely, but after doing so she ends up wandering between life and death at the limit of her powers. Finally when Lua wakes up, she realizes that all the credit had gone to Arian as if she had saved Garrot, and they inform her that these two are already celebrating their engagement. After witnessing Arian’s true nature, Lua goes to see Garrot and he treats her coldly as well. Desperate, Lua swore never to heal anyone again, then the second prince, Suwen appears in front of her and asks: “Wouldn’t you like to take revenge on those who humiliated you?” This way, using her other hidden ability, which was the ability to inflict the symptoms she had already cured on others, Lua joins forces with Suwen to start a new life as a “Villain” instead of a “Saint”."]},{"title":"He’s Not Just a Pretty Face","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa He’s Not Just a Pretty Face / 얼굴밖에 볼 게 없어"]},{"title":"A Fairy Tale for Villains","tags":["Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Happy Ending for Villains / A Fairy Tale for Villains / 惡棍的童話 / 악당들을 위한 동화","Despite being born as the daughter of a nanny, I considered myself blessed. With my loving mother, caring masters, and their three children, I couldn’t have asked for a better life.However, this all changed during the year my mother and masters died of a plague. That was when I remembered who I was before this life.Somehow, I was reincarnated as a side character of an angsty reverse harem romance novel. The problem was that I was the final boss in this novel, the queen of snakes who uses the young masters, the future main villains, to send the Empire to ruin.I knew what I wanted to protect, at all costs."]},{"title":"Are We Still in Love?","tags":["Adaptation","Manhwa","Romance"],"disc":["Read manhwa Are We Still in Love?  / 우리 아직 사랑하고 있나요? / Apakah Kita Masih saling mencintai?"]},{"title":"The Villainess Refuses to Flirt with the Male Lead","tags":["Fantasy","Harem","Historical","Reincarnation","Reverse harem","Romance","Shoujo","Villainess"],"disc":["Read manhua The Villainess Refuses to Flirt with the Male Lead / The Wicked Woman Refuses to Pick Up Male Lead /恶女拒绝泡男主\nTransforming into a villain in a cliché imperial manhua is still not the scariest thing.\nThere is a special thing that the male leads are all children! Not only did I have to take care of the kids, but one of them flirted with me and called me “wife”!\nI just want to swear and blame God for my life…."]},{"title":"Don’t Look Back, Seisia!","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Don’t Look Back, Seisia! / 떠난 악녀를 찾지 마세요"]},{"title":"The Grand Duke is Mine","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Grand Duke is Mine / 정략결혼 대공님은 제가 갖겠습니다","If you got a second chance at life, what would you do differently? If Ignette’s life was a Shakespearean story, the genre would be a tragedy. But when her death triggers a do-over for some of her life’s most significant events, she is determined to approach each choice carefully, and with the most informed intentions. But with so many obstacles in the way, will she succeed in creating a different life than her last? Her pursuit of happily-ever-after with the Grand Duke is only about to begin."]},{"title":"MookHyang – Dark Lady","tags":["Action","Adventure","Fantasy","Magic","Manhua","Manhwa","Webtoons"],"disc":["Read manhwa MookHyang – Dark Lady / 묵향 다크레이디 / MukHyang – Dark Lady","As the master of the School of Unholy Arts and as the undefeated Unmasked Demon, MookHyang unfortunately falls to a strange fantasy world by the magic of his enemies (School of Blood Arts). In the new world of elf, sorcerer, knight, and dragon, MookHyang’s adventure of finding a way back to his old world (Murim) unfolds."]},{"title":"Princess’s Doll Shop","tags":["Fantasy","Isekai","Josei","Magic","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Princess’s Doll Shop / The Princess’ Doll Shop","“There is this small thing I want to do, but I need to leave the palace.”\n“…Leave the palace, you say?” asked Deon nervously.\nSomehow, he displayed a bigger reaction to her leaving the palace compared to when Kathia asked for a country before.\nKathia, blinded by the joy of her wish coming true, did not notice. She looked at Deon with sparkling eyes, as if to press him to ask more details.\n“What is it that you want to do?” As soon as he asked, the young girl, who would become the prettiest woman of the empire, smiled brightly and shouted:\n“A doll shop!”"]},{"title":"Please Cry, Crown Prince","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga Please Cry, Crown Prince\nAfter having the worst first meeting with the Crown Prince, she discovered a way to avoid this marriage. That is, the crown prince’s miracle power—the tears of blessing. Unfortunately, no matter what she did, he didn’t shed a single tear…"]}]