[{"title":"I Became the Stepmother of an Irrevocable Dark Family","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Stepmother of an Irrevocable Dark Family, I Became a Stepmother of an Impossible Black House, I became a stepmother in a dark family that cannot be rehabilitated, 갱생불가 흑막가의 새엄마가 되었다","“A romantic fantasy heroine possessed in a child care novel, ‘My golden baby!’”","Although the child care is a genre that heals the body and mind of a cute and lovely child who becomes the main character and is loved by everyone…\nThere seems to be something completely wrong with this genre I am in.","Even though it’s the age of glamor and regression, it’s hard child care.\nThe possessed Leona becomes the stepmother of Rebecca, the only child of the black family, who is the dreamer of a heinous evil woman.\nShe was a minor character who died after suffering from Rebecca’s intrigue, so I have to ran away somehow and try to save my life.","“You, you’re going to leave too, right? You’re going to abandon me like any other mother…”\nWhat should I do when I feel weak after seeing a kid talking like this?","“You seem a little different. I need to keep you next to me.”\nWhy is the duke of black family has this reaction?","Can Leona survive in this world safely?"]},{"title":"Love Or Attraction","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Love Or Attraction / Sexual Love Affair / 성애적 순애보"]},{"title":"Sacrificed to Be the Beast King’s Bride","tags":["Animal","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Sacrificed to Be the Beast King’s Bride","Once, she lived the life of a criminal. Now she lives a life married to her doting husband, the Beast King! His beautiful violet eyes upon her, she’s warmly embraced by his large body covered in fur. But…can she trust him?"]},{"title":"The Young Lady Who Broke Her Engagement Is Only Obsessed With the Ending","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Young Lady Who Broke Her Engagement Is Only Obsessed With the Ending / 파혼한 영애는 엔딩 외엔 집착하지 않는다"]},{"title":"Love Doesn’t Matter","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Love Doesn’t Matter / 상관없어, 사랑 따위","One might think being engaged to Hadius Myer, the son of one of the most prestigious families in the kingdom, sounds like a fairy tale, but for Emilia Bern, a commoner, her reality is nothing but a nightmare. Tired of the constant criticism she receives from other nobles and her fiancé’s cold attitude, all Emilia wants now is to end this charade. But when Hadius turns 19, his attitude suddenly changes. The truth is, Hadius has always been in love with Emilia, but he has been keeping his distance from her because of his unstable position within his family. Unfortunately, Hadius has already lost Emilia’s trust and must prove his sincerity to gain it back. Will the two be able to overcome adversity and hardship and find a way to be together?"]},{"title":"The Unmatched Powerhouse Just Wants To Farm","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["Read manhwa The Unmatched Powerhouse Just Wants To Farm / The Peerless Strong Man Only Want to Return Home and Farm / Jué Shì Qiáng Zhě Zhǐ Xiǎng Huí Jiā Zhòng Tián / 绝世强者只想回家种田","When Chen Fan transmigrated to the world of martial arts, not only was he abandoned by the system, he was also a cripple without martial spirit. He had no choice but to be the most inferior mortal. But unbeknownst to him, his home was full of divine things; the bath water is a spiritual spring, the person ploughing his land is a dragon prince, the person watering the vegetable fields is the first saint, the person who washes his clothes is an imperial empress. Unknowingly, Chen Fan had gathered many of the continent’s top powerhouses around him and became a landlord who controlled the world."]},{"title":"Is the Friend of a Friend a Stranger?","tags":[],"disc":["Read manhwa Is the Friend of a Friend a Stranger? / 친구의 친구는 남인가요?","Was it too much of a wish to hope that the relationship, which is ambiguous from the name, would not be awkward? No, at least there must have been many ways not to face it naked like this. Sylvia Appleton squeezed her eyes shut as she looked at the stocky naked back that seemed to protrude from her mythology.\nIt has been 10 years since she fell in love with her childhood friend. On the day the childhood friend got engaged to another woman, Sylvia ended up spending the night with her friend’s friend."]},{"title":"Bad Boy Who Lies in Love","tags":["Drama","Fantasy","Romance"],"disc":["Read Bad Boy Who Lies in Love","Just an ordinary girl who has just started her high school life, but she never thought that something would happen and she would end up involved with the most senior bad boy in school. Moreover, she was asked to be his girlfriend. What will her life be like after this?"]},{"title":"Possessed the Sacrificial Princess","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhua Possessed the Sacrificial Princess / 被献祭后我成了帝国公主","Xia Wei encounters an accident and crosses into the Haitang novel “The Sacrificial Princess” she is reading, and transforms into Hedwig Phil, the adopted daughter of Duke Phil. Facing a sacrifice crisis at the beginning, he was rescued by the male protagonist Savile. Because of the awakening of his magic power, all kinds of handsome guys want to stick to the heroine. And Heiwei is actually the direct heir to the empire. What a piece of shit princess, I just want to go home!"]},{"title":"I Became the Mad Emperor","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["I Became the Mad Emperor / 미친 황제가 되어버렸다 manhwa,","A long but slowly serialized novel, [The Great Human-Demon War],\nBang GwangSuk binge read it over and over, infatuated by the majestic world building and story development.\nOne day, a mysterious message was sent to him.\n[This story ends here.\nPlease use your power to save my world from ruination.]\nBefore he could get an answer to the questions in his mind, a new world was presented before his very eyes—from the perspective of the Mad Emperor Exceltrion that would lead the world to ruins.\n“That’s right. I’ve become the mad emperor from the novel!”"]},{"title":"The Prince Wants You","tags":["Drama","Fantasy","Historical","Manhua","Mystery","Romance","Shoujo"],"disc":["Read manhua The Prince Wants You / Your Majesty Please Let Me Go\nThe Prince wants you summary\nThat night, from an innocent girl, she became his woman.\nHe was a handsome and wild prince with an aura of a dominator.\nWhether the meeting between such a lowborn servant like her with him was destiny or just an unfortunate fate?"]},{"title":"I Proposed to the Pope","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua I Proposed to the Pope / 漫美映画 / I Proposed to the Pope / Wo Xiang Jiaohuang Qiuhunle","Empire Princess Helene is reborn on the day when the younger brother of the crown prince brings back the female protagonist from the book. In her previous life, her own hand-raised younger brother becomes infatuated with the female protagonist from the book, causing national turmoil and mercilessly killing her sister due to a single word from the female protagonist. After being reborn, infatuation? Lock it down for me! An ungrateful white-eyed wolf? Then I won’t raise it. The female protagonist dares to shake the foundation of the empire with her halo? This princess will beat you until your teeth fall out! Worried that the Pope and the time-traveling woman will disrupt the empire’s foundation together."]},{"title":"The Heavenly Demon’s Descendant","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Heavenly Demon’s Descendant / 천마의 후손이 되었다","Jin Suho lost his mother as a child and decided to become a hunter as he sought revenge for her. He gave his life to training himself and finally became a B-rank hunter. Then one day, Suho meets a mysterious man at a Red Gate, which appeared by chance. The mysterious man who introduced himself as the Heavenly Demon revealed to Jin Suho that Suho was his descendant and that he requires Suho’s body to deal with his rival, the Blood Demon."," "]},{"title":"My Sickly Sister Always Misses Me","tags":["Fantasy","Romance","Yuri"],"disc":["Read My Sickly Sister Always Misses Me / Bìngruò Mèimei Zǒng Shì Xiào Xiǎng Wǒ / Bingruo Meimei Zong Shi Xiao Xiang Wo / 病弱妹妹总是肖想我","She was the thing she had coveted since she was a little girl, the one she loved but couldn’t love, the projection of all her desires. Xu Yuliu is a young woman from a rich family, intelligent, beautiful, she should have had a peaceful life as a girl, but she encountered an obstacle called “Xu Wenjiao”. This girl of unknown origin is the person she hates the most.","When she was a child, the fragile and sickly Xu Wenjiao stole her mother’s love, and when she became an adult, Xu Yuliu had a crush on her neighbor and before she could confess, she came across a scene where the other party confessed his love for Xu Wenjiao. Yuliu has a family where there is her but there is no Xu Wenjiao, and there is Xu Wenjiao but there is no her.","Xu Yuliu, his head full of anger, from one day to the next packed his bags and prepared to leave the house, but Wenjiao grabbed his wrist, blocked him in a corner, and with red eyes , bit his ear:","“Yuliu, why do you like her but don’t like me?”","Xu Yu Curtain’s face was red with embarrassment — “Xu Wenjiao, are you sick?”"]},{"title":"Falling Into The Deep End","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Falling Into The Deep End / 갑자기 남편과 자식이 생겨버렸습니다"]},{"title":"Moonshark: Sharks Are Born To Be Stars","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Moonshark: Sharks Are Born To Be Stars / 문샤크: 상어가 스타성을 타고남","Princess Sid of the Underwater Kingdom is destined to inherit the throne of the sea. However, she becomes a fan of the land idol ‘Raon’, and she becomes eager to see her favourite star, so she runs away to the surface. While leading a satisfying life as an ordinary fan, Sid’s world is suddenly turned upside down when she meets the famous actor ‘Jihan’. Unintentionally, the two keep getting entangled with each other, and Sid unexpectedly becomes an SNS star overnight…!! This story captures Sid’s journey of growth and love as she navigates her new life on land, discovering herself between the two worlds of the underwater kingdom and the human world."]},{"title":"How to Gracefully Divorce a Dragon","tags":["Magic","Manhwa","Romance","School Life","Shoujo"],"disc":["Read manhwa How to Gracefully Divorce a Dragon / How to Divorce a Dragon Beautifully / 아름답게 용과 이혼하는 방법\nTwenty-year-old Jeong Seyun, a rabbit descendant, knows that dragons are considered the chaebols of the beast world. But she’d rather have a relationship based on love than an arranged marriage with a dragon. And as fate would have it, as soon as she enters college, she falls in love with fox descendant Kim Hangyeol at first sight! She musters up the courage to confess, but… to the wrong person?! While Seyun’s dream of a romance come true?"]},{"title":"Crash On Paradise","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Crash On Paradise / Falling to Paradise / A Marvelous Morganatic Marriage / 추락한 곳은 낙원","Anze, the daughter of a duke, is forced to marry Aiden, the illegitimate son of the Emperor, at the Emperor’s behest. After an uneasy first meeting, they arrive at Aiden’s home in the countryside, where they grow up together."," "]},{"title":"Lower Dynasty","tags":["Romance","Yuri"],"disc":["Manhua to read Lower Dynasty / 潮夏 at manhua website","After her parents divorced, LuYang moved to live with her mother’s best friend, living with her daughter-SuGui. Sugui is radiant and gentle, like the sun in winter, enthusiastic without exaggeratious, like the moonlight illuminating LuYang’s life, and also easily attracts her heart. To LuYang she’s like a sister, a friend, a mother…After that, LuYang doesn’t want to be her sister anymore, but wants to be her lover. But when she found out about his feelings for SuGui, LuYang didn’t want to lose the harmony between them, even more afraid that the “younger sister” identity is no longer and can only endure the retardation, extending the distance with SuGui. But because of the problem of meeting SuGui again at work, long-suppressed emotions rise, like a branch of roses, wrapping her and SuGui together. Is it premeditated or fate…."]},{"title":"In an Attempt to Get Revenge, I Seduced My Husband","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read In an Attempt to Get Revenge, I Seduced My Husband / Flirting With My Husband as an Attempt to Revenge /  In an Attempt to Get Revenge I Seduced My Husband /복수하려다 남편을 꼬셔버렸다","My father sold me out, and my husband made me miserable. Just once, if I had just one more chance, I will never live like that again. “I’m probably not a bad choice. I’m young, pretty, and have no powers, so you can use me as a trophy for whatever you need.” Therefore, she requested a contract marriage from Duke Boncruger of the North. To a man who will always keep his promises and never love me. “The only one who can save me is myself.” But why do I keep thinking of you?"]}]