[{"title":"Perfect Mine","tags":["Romance","Webtoons"],"disc":["Read manhwa Perfect Mine","A twisted school romance of someone who can “truly be mine” and love me to death."]},{"title":"Try To Tame Me, Secretary Cha","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Try To Tame Me, Secretary Cha / 나를 길들여 봐, 차비서","If you make a human out of this mess that is the second-generation chaebol, you’ll receive 300 million won! I barely managed to make a human out of Kang Juwon, the second-generation chaebol who has excellent visuals and superior physicals but acts like a fool but what do I do when he says he likes me? Cha Youngae, who lives together with Kang Juwon for the sake of money, finds it difficult to choose between 300 million won or love."]},{"title":"Mushroom Brave","tags":["Action"],"disc":["Mushroom Brave/ 蘑菇勇者 /  Mushroom Guts / Mushroom Warrior is a Manga/Manhwa/Manhua in (English/Raw) language, Action series is written by Updating This Comic is About\nA Small mushroom monster, try to make a comeback, try to become the strongest hero!"]},{"title":"It Was All You","tags":["Drama","Isekai","Medical","Mystery","Romance","Sci-fi","Survival","Tragedy"],"disc":["Read manhwa It Was All You / 모두 너였다","In the near future, bioengineering doctoral and clone tester – Yuri lives in pain from her husband’s affair. However, after testing the latest love clone ‘Victor’, which is destined to be discarded a month later, she finds comfort in her heart. In the process, she realizes the terrible things her husband has done! In the end, Yuri plans a brutal revenge… What is her fate?"]},{"title":"My Queen Is the Leader of Martial Arts","tags":["Drama","Fantasy","Manhua","Romance","Royal family"],"disc":["Read manhwa My Queen Is the Leader of Martial Arts / 朕的皇后是武林盟主"]},{"title":"THE BEAUTIFUL WIFE OF THE WHIRLWIND MARRIAGE","tags":["Manhua","Romance"],"disc":["Read manga The Beautiful Wife Of The Whirlwind Marriage / 闪婚娇妻：老公，深深爱","Wealthy, powerful and handsome; Gu Jingze is the cream of the crop in the entire country. Every guy wants to be him and every girl wants to be with him. His life is perfect… except that he has one tiny secret that keeps him from getting close to any woman—apparent impotency.","That is, until he wakes up in bed with a total stranger one day. The next thing he knows, he is forced to marry this stranger; a feisty and boisterous woman by the name of Lin Che.","Lin Che is an average girl whose only aim is to become a successful actress. Ostracized by her family and forced to become independent, she cooks up a scheme to attain her goal. But her plan fails and she ends up marrying this cold and seemingly heartless Gu Jingze. Not only that, she must now find her place in high society, where jealous women and devious plots lay abound – all while juggling her new career.","Two strangers under one roof: From the outset, they agree to stay out of each other’s lives, but he somehow always manages to appear during her moments of crisis. Slowly and unwittingly, Lin Che begins to find it difficult to imagine a future without him. Will their relationship grow, or is their marriage destined to remain just a contract?"]},{"title":"I Raised the Beast Well","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Reading I Raised the Beast Well / I Raised a Beast / I Raised the Beast / My Gently Raised Beast / Ich habe ein Biest gezähmt / J’ai élevé une bête / My Cute Friend / เสือดำขย้ำหัวใจ / 吃定你了，禽兽 / 我的野蛮萌友 / 我的野蠻萌友 / 곱게 키웠더니 짐승 / 곱게 키웠더니, 짐승","Blondina, a princess who had commoner’s blood, lived quietly in a separate palace. Due to her mixed blood, she received ill-treatment and was surrounded with contempt. One day, she happened upon a wounded black cat and decided to treat it.\nBut, the lovely cat she assumed it to be was actually…?\n“If you run away like that, of course, I’d want to hunt you.”\nAmon’s lips gently wandered down her skin.\n“You’re the one who picked me up. You’re the one who kept me by your side.”\nAmon whispered, as his feverish breath made her skin crawl.\n“So you have to take responsibility for me till the end, Bridey.”\nOnce the lovely cat was all grown up, she realized…\nShe thought she raised him well, but she’s going to be eaten up as well."]},{"title":"BetrayaIism Romance","tags":["Drama","Romance","School Life"],"disc":["Read manhwa Treacherous Romance / 배신 주의 로맨스","Bae Shinju, Jang Maro, Yoo Hana, and Cho Jihoon, who have been close friends since elementary school, one day in the 2nd year of High School, Maro confesses to Shinju. Shinju refuses to confess for the sake of friendships with her friends, but… On that very day, Jihoon and Hana started dating…! This is a betrayal..! A Betrayal! A Romance of Caution."," "]},{"title":"Miss, It’s Really Not What You Think","tags":["Comedy","Drama","Fantasy","Romance","Slice of Life"],"disc":["Read manhwa Miss, It’s Not What You Think! / Miss, It’s Really Not What You Think / 小姐姐不是你想的那样"," "," "]},{"title":"I Picked Up a Lamp Today","tags":["Action","Adventure","Fantasy"],"disc":["Read I Picked Up a Lamp Today / 오늘도 램프를 주웠다","The main character, Kwak Chung, who was an orphan from birth and was born in Chengdu, suffered from polio as a child and was disabled in one leg. He sold rice cakes to merchants returning from the West for a living while being ignored by all kinds of uncomfortable bodies, and one day on his way home, he accidentally picked up a lamp. I rubbed it a few times because I thought it would make money if I sold it. “I will grant you three wishes, my lord.” A wish-fulfilling lamp fairy appeared. “Are you sure you’ll grant all your wishes?” Kwak Chung’s first wish is money, not just money, but also enormous wealth such as silver, gold, silk, and jewelry. My second wish is to change into a tall, strong built, and handsome and strong man. And the third wish is… “Let me go back to before I met you.” That’s how Kwak Chung’s infinite return journey begins!"]},{"title":"A Guide to Proper Dating","tags":["Comedy","Romance","School Life","Shoujo"],"disc":["Read manhwa A Guide to Proper Dating / 바른연애 길잡이 / Romance 101 / The Right Love Guide","Bareum’s planner might be full, but one thing she desperately needs in her diary is a date. When she is lured into joining a programming club by her friend’s hot coworker, it looks like there might be hope for her. But will her inexperience lead to her downfall? And why does she keep running into his bad-tempered friend instead?\nRomance 101"]},{"title":"Auto-mode Expired in the 6th Round of the Otome Game","tags":["Fantasy","Isekai","Reincarnation","Reverse harem","Romance","Shoujo","Villainess"],"disc":["Auto-mode Expired in the 6th Round of the Otome Game manga, The 6th Loop: I’m Finally Free of Auto Mode in this Otome Game, Otome Game Rokkushuume, Automode ga Kiremashita, 乙女ゲーム六周目、オートモードが切れました\nWhen I regained consciousness, I found myself in an otome game. I would quickly head towards destruction. It made no difference whether it was a good ending or a bad ending. I became the character known as, “Mariabell Tempest,” the daughter of a pedigree family. Despite possessing an unrivaled level of beauty, I had the worst personality, that of a villainess.\nNevertheless, I was conscious, but was unable to make any actions as I was completely in auto-mode. In the first playthrough, I was extremely flustered; on the second playthrough, I was despairing; by the third round, I had already given up. And now, the fifth round has already ended. For the sixth round, for some reason I had become a young girl and regained the ability to move and talk. Eh, what the heck is this?"]},{"title":"Daughter of the Emperor","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Daughter of the Emperor / Emperor’s Only Daughter / Koutei no Hitori Musume / 皇帝の一人娘 / 皇帝的独生女 / 황제의 외동딸","Ariadna Lereg Ilestri Pre Agrigent. And so my life begins with this ridiculously long name, born to royalty and the center of attention – all because of one dangerous man; the veritably insane tyrant king, ruthless conqueror of ten empires, nightmare of all continents- and my father?! Will I be able to survive this maniac?"]},{"title":"Love Hawk","tags":["Manhwa","One shot","Romance"],"disc":["Read manhwa Love Hawk / 사랑의 매"]},{"title":"The Princess Back From Hell","tags":["Comic","Drama","Fantasy","Josei","Manhua","Psychological","Romance","Webtoons"],"disc":["Read manhua The Princess Back From Hell / 恶役王女"]},{"title":"You Loved Me First","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhwa You Loved Me First"]},{"title":"My Engagement Was Called Off Under False Accusations, but Who Ever Said My Face Was Ugly Beneath the Mask?","tags":["Drama","Romance","Villainess"],"disc":["My Engagement Was Called Off Under False Accusations, but Who Ever Said My Face Was Ugly Beneath the Mask?\n“The refined daughter of a Duke strikes back against the bizarre charges put on her…with the help of her Dear Brother, of course!” Katya has always hid her face under a mask during her days at the academy. Now, right in the middle of the graduation party, her fiancé the First Prince calls off their engagement, accusing her of being as mean-hearted as her ugly appearance. But he should’ve thought twice, because after all, who ever said beneath the mask was an ugly face?"]},{"title":"Welcome, Guardian Spirit!","tags":["Fantasy","Romance","Shoujo","Super power","Supernatural"],"disc":["Read manhwa Welcome, Guardian Spirit! / 신령님 어서오고! / Come on God!","“I’m your matchmaking guardian spirit!” On the lonely day of her high school graduation, Jinri receives an anonymous bouquet of peonies… which changes into a man claiming to be her guardian spirit! Dodeok insists he can help Jinri find her true love, but there’s no time for love in the hard-knock life of an orphan — is there?"," "]},{"title":"The Scorned Villainess Survives in the Wilderness","tags":["Action","Adaptation","Adventure","Drama","Fantasy","Historical","Isekai","Josei","Manhwa","Romance","Shoujo","Time travel","Webtoons"],"disc":["Read The Scorned Villainess Survives in the Wilderness","The Crown Prince Wilhelm suddenly announced the dissolvement of his betrothal to Constance (Connie), the daughter of a marquis. It seems like he had fallen in love with someone else… a saint who had appeared recently. Connie grew depressed at the cruel declaration, as she had spent the past two years acting as his consort. But one day, her memory returned, and she realized that she had been reincarnated as the villainess in a romance novel. “Whatever. I don’t need a cheater (with the option to become a villainess). I’ll live on as the leader of my land!” This is Connie’s story of how she lives her life with strength in the borderlands far away from the capital city!"]},{"title":"4 Ways To Save Your Wife","tags":["Comedy","Drama","Josei","Manhwa","Romance"],"disc":["Read manhwa 4 Ways To Save Your Wife / Four Ways to Find a Wife / 4 Ways to Get a Wife / Four Ways to Get a Wife / 아내를 구하는 4가지 방법","He posted an ad on social media for a contractual wife. She works hard to follow her family mottos everyday. Follow the story of a man who has a phobia of marriage, and suddenly fell into a contractual relationship with a strange woman who entered the interview room. How do the two of them fit into each other’s lives?"]}]