[{"title":"Mystical","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural"],"disc":["Read manhwa Mystical / 신비 / Mystique","Garam has always loved to draw, but his dreams of being an artist have been on hold ever since his mother passed away. Wanting to become more independent and focus on his art, he moves into his grandmother’s empty house by the ocean. There, he meets his greatest muse: a mystical water creature with no memories of her past. Now it’s up to Garam to help her uncover what she has forgotten."]},{"title":"Sunbae, Don’t Put on That Lipstick!","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa Sunbae, Don’t Put on That Lipstick! / 선배, 그 립스틱 바르지마요 / She Would Never Know","Gentle in demeanor yet fiercely independent and competent, Songa is a top assistant brand manager at Klar Cosmetics who gets things done with a smile. Thriving in life, she is suddenly caught off guard by her charming junior colleague’s enigmatic warning, “Don’t put on that lipstick.” Then an unexpected revelation changes everything."]},{"title":"I’m a Wolf, but I Won’t Harm You","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga I’m a Wolf, but I Won’t Harm You / This Wolf Won’t Bite /늑대지만 해치지 않아요\nA sheep was born into the political family of lions, the well-known Leopardi Family?! ‘Lucy, your grandmother from the eighth descent was a sheep…’ Lucy has lived a lonely life among her carnivorous blood relatives with no one to lean on. As usual, she begins playing by herself at a social gathering but is suddenly approached by Roman, a wolf with ears pricking through his shiny, silver hair. But one day, Roman’s secret leaves her with a great sense of betrayal! “Hey, I thought you were a dog?! A dog!” Can the two’s fates, which cannot be achieved, be made"]},{"title":"The Shaman","tags":["Action","Drama","Fantasy","Historical","Manhwa"],"disc":["Read manhwa The Shaman / A Mystery Story – The Shaman / 신비소설 巫 / 신비소설 무 / 신비소설 무(巫)","Deep in the remote mountains, there lived a young boy named Nakbin with his shaman mother. Nakbin longs to venture into the world, but his mother constantly forbade him from doing so. This was because Nakbin possessed extraordinary shamanic abilities. All his mother wished for was a normal life for her son. But despite her efforts, Nakbin’s power went out of control. Nakbin’s unrestrained power grew as he invoked numerous gods one after another. Even though his mother fought the gods bravely, she was ultimately overcome by their immense might. The small child stepped in and defended his mother just in time before a powerful ancient god smite her down. The god, moved by Nakbin’s purity and bravery, retreated. However, as it withdrew, it left behind a terrible prophecy for Nakbin. He might become the chosen shaman, one with the potential to either save or destroy the world, a being known as the “Ancient Earth God”."]},{"title":"Betrothed to My Sister’s Ex","tags":["Adaptation","Drama","Fantasy","Historical","Romance"],"disc":["Read manga Betrothed to My Sister’s Ex / ずたぼろ令嬢は姉の元婚約者に溺愛される / Zutaboro Reijou wa Ane no Moto Konyakusha ni Dekiai Sareru","With unmaintained red hair and shabby clothes, Marie, the baron’s daughter, has been treated like a servant all her life. Count Granado, the country’s richest man, who is said to be a difficult misogynist, falls in love with her at first sight. However, due to a misunderstanding, Count Granado proposes to her sister Anastasia, who looks like a princess, instead of the ragged Marie. A very popular work from “Become a Novelist”! Marie’s Cinderella story that began with a hero’s misunderstanding!"]},{"title":"Please Treat Your Friends Preciously","tags":["Comedy","Drama","Fantasy","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa Please Treat Your Friends Preciously / 친구는 소중히 대해 주세요","I reincarnated as the younger sister of the male lead in a BL novel. She’s a fragile sunfish whose life is in danger even from catching a cold. So, I took advantage of a childhood friend who has healing abilities. The problem is, that ability manifests through skinship. Anyway, it was only a matter of time before this little guy fell in love with the male protagonist, so I didn’t worry for long. We held hands and I stole his first kiss… But then, Since when… “Lavie, you’re beautiful.” “Huh…?” “You should look outside. I couldn’t stop myself when I saw you.” “Ack, stop.” “If you keep getting nervous like that, it makes me wanna do it more.” Why is the guy who should be with the male lead suddenly doing this to me?!"]},{"title":"You Didn’t Say the Start of the Regression Was a Gate","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Read manhwa You Didn’t Say the Start of the Regression Was a Gate / 회귀 시작이 게이트라곤 안 했잖아요","I closed my eyes while fighting my last battle. That would have been my peaceful rest.\nBut when I opened my eyes,","[Notification: You have entered the gate.] [Verifying user.] [Verified individual ‘Han Seo-Ha (Awakener).’] [Connecting to the system.]\nI was in the worst gate, which took three whole years to clear.","“Pack things to eat, drink, weapons, and necessities for survival. Pack mostly canned food! Also, things like lighter and flammable items.”","Forget my transmigration. I should just escape from this hellish gate first!"]},{"title":"Liar","tags":["Drama","Josei","Romance"],"disc":["Read manga Liar / 虛實之愛 / 虚实之爱 / ライアー / The Liar / เกมรัก นักโกหก  / Usotsuki (MITSUBA Yuu)","“The only time I will be meek and willing with this man… is when we’re in bed.” Her first impression of him is that he is the worst. Uncaring, attached, and completely not worth her consideration, until… Misao Narita is a fresh graduate and brand new office worker, who absolutely hates her superior at work. His name is Ichikawa. He is extremely tall and always has a dark look in his eyes. And yet…?! Due to an accident, they end up as friends with benefits. A purely physical attraction, it is completely different from the ideal romance that she had in mind. She knows they should stop, but somehow, they can’t!"," "]},{"title":"Flowers of Worship","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa/manga/manhua Flowers of Worship / The Flower of Veneration / 경배의 꽃","It was in the middle of the night that the woman who would be the Duchess came to see me.","She said my father and mother died, and my kind uncle became king.","She said it’s not worth it for me, the crown prince, to be living in hiding, too.","“A while ago, Your Highness had been hiding from me. With all due respect, is that for the sake of survival? Just because your parents died doesn’t mean you have no reason to survive. Actually, that fact alone made it all the more reason why you should live. If you die now…”","If I died now?","When I asked her while looking at her eyes, the woman eventually brought out the harsh truth with empathetic eyes.","“It’s like a dog’s death.”","“That’s rude….”","It’s been a long time since I said that. In a short while, he has been treated as a madman and beaten to death just by saying similar things. She loosened her arms that held me and I suddenly stiffened up due to it. Because I thought she might have loosened her arm to hit me. But she didn’t.","She knelt down with one knee in front of me, just like a knight.","“Hastred’s Sarian raised her salutations. May you accept it gladly.”","My first knight is beautiful and kind.","“Are you on my side?”","“Yes, Your Highness.”","It was all a lie."]},{"title":"A Mismatched Complicated Love","tags":["Comedy","Romance","School Life","Shoujo"],"disc":["Read manga A Mismatched Complicated Love  / Mismatched Love / A Mismatched, Complicated Love","Saiga Kyousuke, the hottest boy in high school, has been rejecting confessions from every girl for one year straight. What he wants is someone who is interesting and different from others. One day, he meets a mysterious junior who is more than a little different…"," "]},{"title":"Slave To The Enemy Emperor","tags":["Action","Drama","Historical","Romance","Webtoons"],"disc":["Read manhwa Slave To The Enemy Emperor / 적국 황제의 노예가 되었습니다","If you want to protect your country, you’ll have to assassinate the emperor of the enemy country. Emperor Lan of the Northern Kites had plans to send a woman of wisdom, courage, and beauty as a princess to take down the emperor of the enemy country… But woman the enemy emperor wanted was none other than the haughty and impudent… Lan hides her identity and became a princess to directly assassinate the enemy emperor, Orhan.","The Emperor’s Concubine"]},{"title":"Divine Inconvenience","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa  Divine Inconvenience / Kami-sama ga Watashi no Koiji wo Honki de Jama shite kuru / เทพเจ้าจอมป่วนกวนทางรัก / 神様が私の恋路を本気で邪魔してくる / 신께서 내 연애를 진심으로 방해하신다"]},{"title":"Please Teach Me, Senior","tags":["Drama","Josei","Romance"],"disc":["Read manhwa Please Teach Me, Senior / 가르쳐주세요, 선배"]},{"title":"Opening The Female Match Making Strategy Game","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa Opening The Female Match Making Strategy Game / Opening The Female Match Making Strategy Game / 开挂女配攻略系统美男","The heroine travels into the game and is reborn as a cannon fodder female supporter. In order to return to the world, she needs to complete the strategy task. In the process of getting along with the game system, the emotionless little system gradually has human emotions, and the system has grown from Zhengtai to a handsome man., in love with the heroine.The heroine travels into the game and is reborn as a cannon fodder female supporter. In order to return to the world, she needs to complete the strategy task. In the process of getting along with the game system, the emotionless little system gradually has human emotions, and the system has grown from Zhengtai to a handsome man., in love with the heroine."]},{"title":"Teaching the Tyrant Manners","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Teaching the Tyrant Manners / Teaching Courtesy to a Tyrant /  The Tyrant’s Etiquette Tutor / 폭군에게 예의를 가르칩니","I came into the world of a novel I was reading, and became an unknown extra destined for a miserable life. Teaching manners to a crazy bastard who turns into a tyrant? Manners, my ass! Quick thinking was my only means of survival. I tried everything to prevent such a tragic relationship with the tyrant from happening. I kicked, punched and screamed my head off, but I was still beaten in the end. Actually, he’s unexpectedly docile at times and even told me, “You’re the first person who understands me.” The male lead’s personality is strange. “Anyway, you shouldn’t do that to a woman.” “Isn’t it okay to kiss in a bind?” “No! I meant that you can’t kiss someone without their permission.” Somewhat miffed, Croft then gave a mischievous grin as he approached her. Bending down to Rivi’s eye level, he asked in a soft voice with glimmering red eyes, “So you’re saying there’s no problem if you give me permission?” After hearing his words, Rivier’s heart pounded in trepidation. Tugging at her hand, he held it tightly, pulling his elbow as far as he could, before he stretched his arm out like a bow. Bam! Rivier accurately jabbed Croft’s abdomen. Wait, why is there such a hard lump?!"]},{"title":"Soaring Phoenix from the East Palace","tags":["Action","Fantasy","Harem","Historical","Martial Arts","Romance","Supernatural"],"disc":["She is a venomous demon of a consort in the eyes of the world. On the wedding day, she snatches someone else’s husband, scaring the wife into unconsciousness. The princess consort of North chen has an arrogant name, domineering Chang’an. But this world just happens to have someone more arrogant than her. Even when everyone condemns her, he only says: “I dote on the princess consort, what business is it of yours?” A strong woman and a strong man make for a strong alliance."]},{"title":"The Return of the Prodigious Swordmaster","tags":["Action","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Return of the Prodigious Swordmaster / 은퇴한 소드마스터의 귀환","Yuma devoted his life to the empire as a eunuch, but was framed and executed. ‘If I had just one more chance…’ Just when he thought his last moments were near, he regressed to his past, when he was sixteen.\nWas it a dream? No, he was really back in his past. And he knew the first thing he had to do. ‘I will not become a eunuch this time’. He may have been an unfortunate eunuch in his past life, but this life will be prosperous! Yuma had become a eunuch at the trick of fate, but he had also regressed to his past because of fate. He began righting all the wrongs and misfortunes in his past. This marks the beginning of Yuma’s sensational life of changing the world’s fate!"]},{"title":"Summer Season","tags":["Drama","Shounen Ai","Slice of Life"],"disc":["Read manhwa Summer Season / 하절기","Cha Do-hyeon and Yeo Eun-ho, who were born in the same neighborhood and have never been apart, stayed together throughout elementary, middle, and high school, and were able to confidently say that they were as close as family, because they had been friends for 19 years.”From day one, Do-hyeon and Eun-ho, who have been acting strangely, does not understand and are confused. A conflict that will inevitably arise someday, but Eun-ho doesn’t want to believe in this current situation. 하절기"]},{"title":"I Became a Maid in a TL Novel","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read manga I Became a Maid in a TL Novel\nI was bored and read a TL (teen’s love) novel with lots of sexual scenes, and ended up reincarnating into it. As a maid that get executed quickly, at that! The goal, of course, is survival… but the situation keeps getting twisted.\n“I have no intention of sharing something I like with my brother.”\nI was so surprised that I harshly bit my lip.\n“Don’t become the Duchess. The rumors that my younger brother has fallen for a rabbit have reached even my ears.”\n“Your Majesty! No, that’s…”\nHe rubbed my bleeding lips. Then he nonchalantly licked the bloodied finger. It was just his finger that touched me, but I somehow felt nervous.\nYour Majesty, please save me. I don’t want to be executed.\nNote: Teen’s Love is a mature-rated genre aimed at women, with the stories centered around a heterosexual couple and the sex and romance between them."]},{"title":"Ex’s Equation","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhwa Ex’s Equation / Former Formula / Qiánrèn Fāngchéngshì / 前任方程式"," "]}]