[{"title":"King The Land","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa King The Land / The vast land","Read on manhwaclan for faster updates!"]},{"title":"Something Between Us","tags":["Drama","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa I am not Dating / We Did Not Date / We were Not Dating / 我们没在交往 / 사귄 건 아닌데","",""]},{"title":"The Guidance on Black Lotus","tags":["Fantasy","Historical","Romance"],"disc":["Read manga The Guidance on Black Lotus / Black Lotus Learning Manual / Black Lotus Study Manual / 黑莲花学习手册","Yu Chu, a top student in the 21 century, accidentally picked up a third-rate story about an ambitious ML avenging himself. Having finished the story, a voice appeared and the next thing Yu Chu knew was that she was transmitted into the book! What’s worse could be … that she became the tragic villain in the book and will soon be crushed by the ML. To save her own life, she decided to behave but the system appointed her a series of annoying tasks… “Hope the ML wouldn’t mind… I’m forced to do so!”"," "]},{"title":"Maria The Telepathic Animal Healer","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Maria The Telepathic Animal Healer / The Life of Maria Lewellin / The Life of Maria Llewellyn / 人生就像玛丽亚·勒沃林一样 / 인생은 마리아 르웰린처럼","A girl from modern day, is transported into the kingdom of Larson after being hit by a truck while trying to save a stray cat. She wakes up in the body of Maria Lwelin. Maria lives an ordinary life in the backwoods of the Larson Empire. She learns about her complicated relationship with her sister, and that she has the power to hear animal’s thoughts and interact with them. Upon hearing that the emperor is seeking for a vet that can heal his pet panther, she jumps at the chance for adventure."]},{"title":"Did You Reject Mr.lu Today?","tags":["Adventure","Drama","Romance"],"disc":["Read manga/manhua Did You Reject Mr.Lu Today? / Do I Refuse Mr. Lu Today / Mr Lu?,今天拒绝陆先生了吗？","Gu Yixue fell into the trap laid by the commercial male god Lu Liyang and had to be the little wife of the overbearing president. Unfortunately, she is not a poor and obedient little white flower! Want to tame her? Might as well  just turn around. But She will tame this beast!"]},{"title":"The Noble Pirate","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance"],"disc":["Read The Noble Pirate manhwa, 그다지 사랑하지 않는 그대에게\nFrom the high seas to high society. When the infamous pirate Rosetta gets poisoned to death, she wakes up in the body of noble lady Leah. Now, to avoid a second death, Rosetta must play the part of a noble and… get engaged?! But to whom? Could it be to the strange admiral who has suddenly come chasing after “Rosetta”?"]},{"title":"The Return of Princess Amy","tags":["Drama","Fantasy","Historical","Magic","Manhua","Romance","Royal family","School Life","Time travel"],"disc":["Read manhua The Return of Princess Amy / Her Royal Highness the Princess Returns to Full Level / Princess Amy’s Magic / Ai Mi Gong Zhu De Mo Fa / Ài Mǐ Gōng Zhǔ De Mó Fǎ / 艾米公主的魔法","A prophecy declared that a child would lead the empire back to glory. That same year, Amy and her half-sister, Aurora, were born. Both girls competed for the title and when it seemed like Amy was going to win, Aurora convinced everyone that Amy was an evil witch and she had her burnt at the stake. But Amy didn’t die. She traveled back in time to her childhood and with the help of her best friend, Atlas, realized that she still had some of her magic. Amy will do anything to get her powers back, but will it be enough to claim her destiny?"]},{"title":"Unbending Flower (Season II)","tags":["Drama","Fantasy","Romance"],"disc":["Read Unbending Flower (Season II) / Unbending Flower / Princess’s Adventure Abroad / 逆风之花 / 왕녀님은 파혼하고 싶어 / Princess Adventure Abroad (Season II)","The continent is full with unseen surges of political waves. Princess Dongchu from a small southern country travelled thousands of miles to the north alone – to break a pledge of marriage with the High Lord, Ling Zhenying! The imperious High Lord was framed up and turned to a cute little baby. Ling Zhenying: Don’t squeeze my face, woman! Dongchu: Be good, you naughty boy! I will reclaim the crown you lost! But should I get married with him？"," "]},{"title":"Portrait","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Portrait / The Portrait / Portrait (INA) / Self Picture / Shouzouga / 肖像画 / 초상화","In 18th century Europe, the painter Whip Blemeur was commissioned to paint a portrait of his daughter from the family of Count Cleiton. However, he sends his disciple Heli instead…"," "]},{"title":"Baby Who Catches The Wind","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo"],"disc":["Reading manhwa Baby Who Catches The Wind / What is Your Love Forecast / Windy Baby / 바람잡는 아기님","Two divorces, a life never loved. I wondered if this life was ok, and I was thrown away just previous life. The reasons are different, but the result is the same. that no one loves me.\n“From now on, your name is Tilias”\n“Welcome to my house, Tilly.”\nHandsome Baron Daddy Picked Me Up is family really that awkward and warm?\n“By the way… What’s floating on everyone’s head?”\nCloud shape, sun shape, cloud shape with rain and lightning. Aha, you were born with the ability to read human emotions! However, there are people who continue to rain and lightning strikes regardless of their mood."]},{"title":"A Contractual Couple Again","tags":["Drama","Josei","Manhwa","Office Workers","Romance"],"disc":["Read manhwa A Contractual Couple Again / The Remarriage Contract / Please Marry Me Again / Let’s Get Married Again / Again, A Contractual Couple / Again, A Contract Couple / Again, The Contract Couple / Again, The Contractual Couple / 또다시, 계약 부부","Gun-ha and Seo-yeon were strongly attracted to each other, but because they lived completely different lives their marriage ended short and eventually they chose to divorce.\nFive years later, Gun-ha proposes to Seo-yeon again to be a ‘contract couple’.\n“Please marry me again. This time, we stay as an ordinary couple.”"]},{"title":"The Duchess of the Glass Greenhouse","tags":["Fantasy","Isekai","Manhwa","Romance","Time travel","Webtoons"],"disc":["Read manhwa The Duchess of the Glass Greenhouse / Duchess of the Glass Greenhouse / 유리온실의 공작 부인","Reina was born from a high noble lineage and became the wife of Duke Heathville. However, she faces a miserable death in which she is despised by her loved one, and even her child is taken away from her. But when Reina finally gave up on everything…she was given a second chance. «This time, I won’t turn a blind eye to whatever I see!» Reina summoned her courage and began to live her second life. « Edhart. I know everything now, and I hate you.» Reina realizes now how ignorant she was in the past. “I’m going to divorce you.” Even the husband that she once loved. “Alright.” Her husband, who she thought had despised her, was crying."]},{"title":"The golden dawn light will shine for you","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga The golden dawn light will shine for you on manhwaclan\nRosha Lewen, an extremely ordinary girl.\nOne day, a half-human monster, Ramia, invaded the village, and all her life was taken away.\n“did you wake up?”\nThe moment Rosha opened her eyes after the pain of death, she was in the ‘Golden Dawning’, which was called a pseudo group , that greeted Rosha.\nKnights to protect the Son of God who will save the world, Rostelier.\nRosha was saved from them and became Rosha Rostelier.\nWhat remained for Rosha was a feeling of guilt for surviving alone, a tenacity to find her younger sister who may be alive, and…\n“… … I will tear them to death. All of those monsters, all without exception.”\nThere was nothing but anger."]},{"title":"Living With The Vampire Lady","tags":["Drama","Fantasy","Romance","Shoujo Ai"],"disc":["Read Living With The Vampire Lady / 和吸血鬼姐姐同居了","On the day that Song Yu moved into her new home, she was bitten by a vampire who popped out of a strange stone statue in her yard. Wei Lei, a hot vampire, was awakened by Song Yu, a sweet innocent university student. Wei Lei seduced with her with gold coins to make her stay and serve her. And so thus, the two began living a complex life with each other."," "]},{"title":"Unabiding to the Husband’s Virtue","tags":["Drama","Fantasy","Historical","Josei","Romance"],"disc":["Read manhua Unabiding to the Husband’s Virtue / Unruly Husband / 転生女帝は夫に徳を守らせたい / 不守夫德(别名:撒娇女帝最好命)","Si Long lived in a matriarchal society in her last life. As the Empress, she took the supreme power, enjoyed countless beauties and infinite wealth. But she travelled to another world and suprisedly found it a patriachal society! What’s more, she even has to bear children on her own! This is intolerable! But my imperial teacher is really … tasty?!"]},{"title":"He is a Beast","tags":["Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhua He is a Beast / 他是野兽 / Gentle Beast","A cat? A dog? No, it’s obviously a beast! In a small town where a bloodshed occurred, Chana, a typical female high school student met Yumu, a popular male high school student, who was suspected of being a murderer. As the relationship between the two changed as time passed, the man who seemed to be gentle and kind in front of her gradually showed his true self, and the truth of all the incidents also surfaced."]},{"title":"Full Marks Hidden Marriage: Pick Up a Son, Get a Free Husband","tags":["Comedy","Drama","Romance","Shoujo","Slice of Life","Webtoons"],"disc":["Read manga Full Marks Hidden Marriage: Pick Up a Son, Get a Free Husband / Full Marks Hidden Marriage / Hidden Marriage / HM / Xu ni wanzhang guangmang hao / 许你万丈光芒好 (manhua)\nHer boyfriend was taken from her, her parents were ashamed of her, and she was exiled abroad without consent! Everyone thought she was abandoned and only she could fend for herself… After five years, Ning Xi returns to fulfil her childhood dream of becoming a famous actress. However, her sister is still out to sabotage her every chance she gets! What schemes will she have to avoid"]},{"title":"Pharaoh’s Concubine","tags":["Adventure","Fantasy","Historical","Josei","Manhua","Romance"],"disc":["Read Pharaoh’s Concubine / The Song of Sand and Seas / Sand and Song of the Seas / Shā yǔ hǎi zhī gē / Sủng Phi Của Pharaoh / The Pharaoh’s Concubine / Sha Yu Hai Zhi Ge / Песнь песка и моря: наложница фараона / 法老的宠妃 / 砂与海之歌 / 砂與海之歌 / 모래와 바다의 노래","She is a girl that everyone loves but she cannot speak of the love she has for her brother because her brother already loves someone else. In despair, she gets dragged into Ancient Egypt by a snake shaped bracelet that is engraved with a three thousand year old love oath. There, she meets the Pharoah’s heir, a party boy…."]},{"title":"Rosemarie Reincarnated","tags":["Adaptation","Comedy","Drama","Historical","Isekai","Reincarnation","Romance"],"disc":["Read manga Tensei Oujo wa Kyou mo Hata wo Tatakioru / 転生王女は今日も旗を叩き折る / Rosemarie Reincarnated: Fixing Bad Suitor and Getting Her Beloved","Who cares about being cute?! Rosemarie is a young girl who got reincarnated in the world of a dating sim. That game was famous for being a crappy game full of hopeless men! She has a bad feeling about it, but she has no time to waste getting upset about it! She’s going to change the peculiar dateable character for the better and meet the man she really loves at all costs!"]},{"title":"For Stella","tags":["Action","Comic","Drama","Isekai","Manhwa","Reincarnation","Romance","School Life","Time travel","Webtoons"],"disc":["Read manhwa For Stella / 스텔라를 위하여","In order to return to her past life, she must find a way meet her end. However the male lead who’s traveled back in time, keeps preventing her death.\nDana is a side character destined to die for the leading couple, Arcane and Stella.\nSo to get back to my real world, I have to do my best to fulfil her role…!\nBut, why is the male lead so obsessed with me all of a sudden?\nAnd why do I get the feeling he’s purposely going against the flow of the original…?\n“I won’t let you die again because of me, Dana”"]}]