[{"title":"Estea: Inheritor of the Magic of the Beginning","tags":["Action","Adventure","Fantasy","Magic","Romance"],"disc":["Read manga Estea: Inheritor of the Magic of the Beginning / Estea: Hajimari no Mahou wo Tsugu Mono / エスティ はじまりの魔法を継ぐ者","A wand and a spell. Those are the tools that are needed for mages to perform miracles. But people have made “magic-enhancing apparatuses” with their technology, and the old robe-wearing mages are a thing of the past. The main character, Estea, is a mage who grew up in the backwaters of the countryside. She was trained from a young age by her grandmother, a woman who valued tradition, Estea, however, is so clumsy that she cannot even master rudimentary magic. She had given up on herself completely, but upon leaving her hometown and entering into a magic school in the city, she is caught up in a mission that all mages must take up – a battle to protect the world. Spirits? An abandoned city? An adventure of miracles and curses begins."]},{"title":"Kiss Me and Hug Me!","tags":["Comedy","Historical","Manhua","Romance"],"disc":["本王不要公主抱","Fu Ruan had to work very hard to pay off her huge debt. But thanks to her outstanding strength and perfect massage skills she was hired to work as a maid. Her new job was to take care of the prince who suffered injures at the war and help with his rehabilitation. She though that her new employer would be a collected and mature man, but he turned out to be a sharp-tongued tsundere?! How will they cope with each other? And how soon will their employer-employee relationship become a blissfull love story?"]},{"title":"Heart Crush","tags":["Manhwa","Medical","Romance","Shoujo"],"disc":["Read manhwa Heart Crush / Crush Heart / 하트 크러시"," "]},{"title":"Even If…","tags":["Adaptation","Drama","Josei","Romance"],"disc":["Read manhwa Even If / Even If It’s Not / 아니라도","Even if it isn’t love, it’s still you. Woohyun lives life on autopilot as a high-ranking member of a crime syndicate. But all that changes when his sister, conned by her boyfriend, commits suicide. Wanting revenge, Woohyun targets the boyfriend’s sister, Yoohwa. But as their lives collide, she slowly weakens his resolve… and his heart."]},{"title":"Beauty BIoggers in Another WorId","tags":["Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read manhwa Beauty BIoggers in Another WorId / Queen, Would You Like To Buy Lipsticks? / 립스틱 사실래요?","Two beauty bloggers find themselves in a different universe after an accident! The first thing they decided to do was…make lipsticks and facial mask sets?\nTo go back to where they came from, two bloggers need to gather their hearts and work together!"]},{"title":"Tycoon’s Sweet Little Devil","tags":["Drama","Romance"],"disc":["Read My Godfather Calls Me Little Devil / My Big Boss Calls Me Little Devil","Ye Rongyin was set up by her boyfriend Ling Jiyan. It turned out that this man approached her only to coax her kidney for her sister Ye mingzhu. At her last breath, she saw Fu Jingsi, the man who she had been running away from all the time. He chose to die with her. Ye Rongyin was regretful that she had been so indifferent and aloof to him… Open her eyes, and Ye Rongyin finds herself reborn at the age of 20. This time, she will protect the one who truly loves her! However, Fu Jingsi clearly feels uncomfortable about her caring attitudes.\n“She must be pretending it. But… it still satisfies me as long as she is by my side.”\n“Fu Jingsi, stop being possessive! I’m not your toy!”\n“No, you are not my toy. You are my sweet little devil.”"," "]},{"title":"Physician Princess","tags":["Romance"],"disc":["Read manga Physician Princess","A modern medical doctor and kickboxing trainer was reincarnated in the body of an 11-year-old girl as the eldest daughter of the Xie family. In order to survive, the little girl waged a battle with her closest family members. After the bloody war, she was informed of her wedding contract with a handicapped person who was no different from a eunuch. All that was hidden from her by her father, which led to the little girl’s demise in the wilderness, where the reincarnation took place."]},{"title":"Empress Mother","tags":["Drama","Historical","Romance"],"disc":["Read manga Empress Mother/ A Harem for My Empress / Empress Dowager’s Dres / Queen Mother / 太后の男たち / 太后裙下臣 / 태후의 남자들","The tyrant Xi Wuji always thought that his pampered queen treated him affectionately, like a delicate little lotus flower. He thought she loved him, but on the day of his death, he opened his eyes. As a result of his death, she took charge of the government and had many lovers, and lived in debauchery. But he became her favourite lover again in this new life‽"]},{"title":"May I Kill You, Your Majesty?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa May I Kill You, Your Majesty? / 죽여도 될까요, 폐하","It was a sunny and warm spring day, but it was different from usual.","[ There’s a day like that , Erendel. ] My mother once told me. But she died more than a decade ago.","[ A curious day so I get to do things that I don’t usually do. You have to be very careful on such a day.","[ Why ?]\nThat day , my mother’s purple eyes were shining dimly in the sun. She gave a cool look at her daughter’s question.","~~~~~~~~~~~~~~","[ If you make a mistake , you may be bewitched. ]\nShe said something I couldn’t understand.","[ Being fascinated is for a moment , but bewitched is for a lifetime. ]","~~~~~~~~~~~~~~","Erendel was sitting on the floor and looking up at the man with blank eyes. His face that was covered in blood was unfamiliar. No , maybe she really doesn’t know . Maybe I’m dreaming right now. But as if to inform me that it was a hopeless hope. A low voice called my name. “…… Erendel.”","“Tell me again . What we talked back then.”","On the light purple eyes of Erendel was the blood-soaked Kin .…… Prince Castian’s face was reflected .","“I like you.” [ I really like Prince Castia. That’s a lot, too. ]","“I mean it” [ I’m serious ]","“….. you said that, didn’t you?”","“Or were you lying to me?’’ Castian’s smile was empty.","“I’m being fooled.”","Then he said again “So just tell me that I need to save your life. Then tell me that you’ll be by my side.”",".You came to me because you wanted to live anyway, didn’t you?” He’s arguing.\n…..I mean, I really didn’t know. That my friend in that I thought was a nut, was Prince Castian who had killed me so many times.\nalso know what will happen because of the words choose."]},{"title":"Peerless Medicinal Sage","tags":["Action","Harem","Manhua"],"disc":["Peerless Medicinal Sage manhua, The Miracle Doctor , Great Medical Saint, Peerless Medical Saint, 绝品医圣, The Miracle Doctor\nHe is a medical expert with the magical powers of the sky. He is also the first-class soldier in the underground world, but he… married a superb willful wife, let’s see how the soldier can respond…"]},{"title":"How to Tame a Dangerous Husband","tags":["Drama","Manhwa","Romance","Webtoons"],"disc":["Read manga How to Tame a Dangerous Husband\n“I don’t want to marry that man.”\nHye-ri, Lee’s illegitimate daughter, takes the place of her stubborn half-sister.\nHe has a ruthless personality. He is a psychopath, a very dangerous man.\nThe man surrounded by rumors that he was the ugliest man of the century, he killed people because of his violent personality, he was a psycho, yes, a man quite dangerous."]},{"title":"The Pampered Regent of the Richest Woman","tags":["Drama","Historical","Romance"],"disc":["Read manhua The Pampered Regent of the Richest Woman / 温流素言，主笔","Great Yan’s richest woman, Wen Jiu, struggled throughout her entire life to become wealthy. However, she was deceived by a scumbag, which caused her to lose both her life and wealth. When she woke up, she has become 15 years old again. Opening her eyes, she sees an old enemy on top of a sedan coming for marriage in place of his fifth brother! Knowing that the handsome man in front of her will one day become the regent, Wen Jiu firmly decided to show her favour to him: I will be responsible for earning money to support our family. Eldest brother please be at ease! Who would’ve expected that on the wedding night… Wen Jiu (Stunned): Eldest Brother, why did you enter the bridal chamber!"]},{"title":"Let’s Hide My Younger Brother First","tags":["Drama","Fantasy","Isekai","Romance","Shoujo"],"disc":["Let’s Hide My Little Brother / Let’s Hide My Younger Brother First / 先把弟弟藏起来 / 弟は今留守番中です / 우선 남동생부터 숨기자","I’ve possessed a character in an R-rated BL manhwa.\nIt’s in a world where people, whose craziness ranges from one to ten, appear.","“Franz, can you take off your clothes for a moment?”\n“Sister? Wh-Why my clothes?”","Their crazy serenade had already begun.\nHaving been faced with the violence my younger brother had to endure, I made a vow.","“Instead of Franz, I’ll have [Schuette] instead.”","Those people are coming soon.\nThe people who will exterminate my family, and when that’s not enough, they’ll devour my younger brother’s innocence.","“And I’ll become a knight to succeed our family and carry on its legacy.”","If he doesn’t go, I’ll die!","That’s how I thoroughly hid my brother and\ndecided attend all the official events myself.","…But something’s wrong.","“I do! I love Kayla Vesta!”\n“If Young Miss gets hurt, then I’ll…”\n“I don’t feel the need to wait any longer.”","Didn’t you all like men?\nWhy are you all suddenly obsessed with me?"," "]},{"title":"A Howling Sacrifice: The Wolf General’s Bride","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manga A Howling Sacrifice: The Wolf General’s Bride / Ookami Shougun no Ikenie no Hanayome / 狼将軍の生贄の花嫁","Elise, a noble lady who is treated coldly by her family due to her illegitimacy, loses her fiance in the ongoing war. Then, she is forced to marry General Wolfried, a man known as a cruel and ambitious military leader. To Elise, she would be getting married to the person who killed her fiance. Surely to Wolfried, it must be a pointless marriage since he had requested to marry the kingdom’s princess as his reward for winning the war. As Elise shudders at the thought of her new unwanted marriage, General Wolfried calmly informs her that… if she wants to get revenge for her former fiance, he’ll make it happen."]},{"title":"Never Die Extra","tags":["Action","Adventure","Comedy","Fantasy","Harem"],"disc":["Read manhwa Never Die Extra / 죽지 않는 엑스트라","Extras die every day in various ways in the game [Demon King’s Palace 3]. He was an extra when he reincarnated into the game. I’ll never die. Never. “Let’s get started.” Evan had come to a conclusion. He tapped his cheeks as a way of signaling to himself that he had made up his mind. He would become a character who never dies."]},{"title":"The Sacrificial Princess","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Tragedy"],"disc":["Read The Sacrificial Princess, 제물황녀님","The Empire’s Sacrifice, The Imperial Sacrifice manhwa\n“You, who has always been useless all your life, can now be useful for once.”\nLudis, an illegitimate child of the Emperor, was always abused by her own father due to her lameness and uselessness. She was offered to an ancient god so as to save their Empire that was currently in crisis. In the midst of offering herself, a man approaches her.\n‘Who would have thought that I’d die in this way…’\n“What’s your wish?”\nHair as dark as the night sky and eyes as bright as the stars. Ludis found it harder and harder to breathe being next to him.\n“I don’t know what to wish for.”\n“Tell me anything you want. I’ve waited for five thousand years just to give you what you want.”\nThe princess, Ludis, who became a sacrifice for the Empire, is now in a contract with the ancient god, Lavane."]},{"title":"Wedding Delusion","tags":["Drama","Fantasy","Manhwa","Psychological","Romance","School Life","Shoujo"],"disc":["Read manhwa Wedding Delusion / 결혼까지 망상했어!"]},{"title":"Necromancer Survival","tags":["Adventure","Comedy","Drama","Fantasy","Sci-fi","Shounen Ai","Slice of Life"],"disc":[]},{"title":"One Step Away From Happiness","tags":["Comedy","Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa One Step Away From Happiness / One Step to Happy Ending / Selangkah Menuju Happy Ending / 해피 엔딩까지 한 걸음","Binah has lost her father in an accident and ever since her mother worked hard to earn money for both of them. She often left alone at home while her mother was working. During that time, she met the twins Heeseo and Heewun and soon they became close friends, even closer as family. A few years later, Heewun confessed his feelings to Binah. The thing is, they have the 10 years age gap. What would happen to their long friendship?"]},{"title":"The Secret of the Friendly Duke","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa The Secret of the Friendly Duke / My Sweetheart Duke Has a Secret / Secret of the Affectionate Duke / The Kind Duke’s Secret / 溫柔公爵的祕密 / 다정한 공작님의 비밀"]}]