[{"title":"Beatrice","tags":["Drama","Historical","Josei","Manhua","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Beatrice / Béatrice / ベアトリチェ / ベアトリーチェ / 比亚特丽丝 / 被俘虏的王女 / 贝阿特丽刺 / 베아트리체","As the Kingdom of Elpasa fell before the blade of the Empire’s greatest hero, in order to survive, Princess Beatrice assumed the guise of ‘Chloe’, a slave. But then, she caught the eye of that very same hero…"]},{"title":"I Simply Cared For My Frail Dad","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I Simply Cared For My Frail Dad / 병약한 아빠를 간호했을 뿐인데","I was only fourteen when my whole family was destroyed due to my father’s great ‘mistake’ and I also died. No, I thought that I died.\n“Knock knock…!” When I opened my eyes, I saw my father lying in the hospital bed just like he did 9 years ago!\nIf everything happened just like in my previous life, Solgren will be destroyed and I will die because of my father’s ‘mistake’ again!\nThe only way to avoid the terrible fate is to increase the power of Duke Solgren and oppose the Emperor.\nYes, that works… Or not…\nThe crown prince, who had a bad relationship with me in my past life, suddenly changed his mind?!\nWhat should I do now…?"]},{"title":"Locked to Death","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Locked to Death / 잠겨죽어도","Hye-seong, a boy living on a remote island, meets Yoon-hae, a mermaid he met in the sea, and they become each others only friends. However, the two soon break up against each other due to Hye-seongs move. Six years later, Yunhae gains mysterious abilities and returns to Comet. However, many things have changed for Hyesung to spend all his time with Yunhae like he did when he was young. Im a different person than you, Yoonhae. Yoon Hae’s attachment to the comet is slowly spreading into control… The winner of the 2nd largest contest on earth in 2022."]},{"title":"To You Who Never Loved Me","tags":["Action","Adaptation","Comedy","Drama","Fantasy","Horror","Isekai","Josei","Liexing","Manhwa","Martial Arts","Mature","Romance","Shoujo Ai","Shounen","Slice of Life","Tragedy","Webtoons"],"disc":["Read manhwa To You Who Never Loved Me / 나를 사랑하지 않는 그대에게","It was a hero with dreams of unifying the continent that saved me, who was about to become an offering made to a monster.\nAnd inevitably, I fell in love with him.\nBut, the sad truth is, every famed and mythical hero eventually ends up with a beautiful and noble princess. And I was just a girl he’d saved.\nSo, when he finally did unify the continent and marry a princess like any other hero,\nI, who couldn’t bring myself to kill you, decided to leave forever.\n“Goodbye, my moonlight.”"]},{"title":"Concubine’s Invitation","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":[]},{"title":"The Strongest Florist","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manga The Strongest Florist / 꽃만 키우는데 너무 강함 / The Macho Florist / Too Strong to Grow Only Flowers\nHwang Jae-Ho joins a game and wants to open a flower shop, thus begins his long journey of being a florist in a virtual world"]},{"title":"Like A Wind On A Dry Branch","tags":["Action","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Like A Wind On A Dry Branch / Cursed Blesing / Seperti angin di ranting yang kering / 마른 가지에 바람처럼","Count Casarius fell victim to a plague and died suddenly, leaving behind a will stating that Rietta, a beautiful young widow of the manor, whom he tried to use as a concubine, be buried alive alongside him. Just before Rietta is buried, Archduke Axias, rumored to be a cruel tyrant, arrives at the funeral to collect the enormous debt Count Casarius still owes him.","“Everyone here seems to feel sorry for her, and I still have a debt to collect from Casarius… If I take her instead, I think all of you here should be happy,” he smiled, “Hello, my temptress.”"]},{"title":"I Give You My All","tags":["Mature","Romance"],"disc":["Read manhwa I Give You My All / I’ll Give You Everything / 다 줄게요","Sehui Yun, a promising designer, lives as nothing more than a puppet for her family and is under the constant watch of her abusive stepmother. One day, she meets a seemingly perfect man, Taehyeong Han, who offers her an amazing job to free her from her shackles. However, it seems he may want more than just a standard work relationship."]},{"title":"The Demon King’s Confession","tags":["Action","Adventure","Comedy","Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa 마왕의 고백 / The Confession of the Demon King","The ‘curse’ left by the demon king a thousand years ago turns people into magicians. Lapis dreams of becoming a paladin while hiding her identity as a magician. One day, she accidentally summoned the demon king ‘Kara’! The demon king will remove the curse if she helps him, but… Wait, this Demon King’s confession is unusual?! Chasing the stars, Lapis approaches the truth of a thousand years ago."]},{"title":"I’m Dating A Psychopath","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m Dating A Psychopath","When a new serial killer arises in her city, Finn suspects that he may be related to her past. Against her better judgement, she decides to pursue him in hopes of finding answers. Shortly after, Finn meets Isaac, who reminds her too much of the mysterious boy from her past…"]},{"title":"Even though you know it’s crazy","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Office Workers","Romance","Smut"],"disc":["Read manhwa Even though you know it’s crazy / 미친 짓인 줄 알면서도 / Even though I know it’s crazy","“Do you want to sleep with me?” “No limit on the number of times.” A daring proposal, a bold acceptance, this is how it all began. Cha Jeong-mu, the sole heir of Venus Group, and his capable secretary, Min Seol-ha. “It feels so good, I could go insane.” The night, driven by instinct alone, dug deeper and deeper, leaving a profound imprint on their hearts. “How well do you think you know Min Seol-ha?” Even in the moment, when the reality was wielding a knife against his throat, he was unable to come to his senses. “Let’s cover it up.” Even though they knew it was a crazy thing to do."]},{"title":"I’d Rather Abandon You Than Be Abandoned","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa I’d Rather Abandon You Than Be Abandoned / I Would Rather Abandon You Than Be Abandoned / I’d Rather Abandon Than Be Abandoned / 버림받느니 버리겠습니다","I found myself embodied in an otome game. The problem is that I am not the heroine, Nyla, but the villain, Claudia. Naturally, Claudia’s social reputation is at rock bottom. My brother himself despises me, and my fiancé treats me like a stalker. In this case, I will be unjustly executed by guillotine for crimes I did not commit. So, in a desperate move, I propose a contractual marriage to the Cursed Prince to get his help, but he takes his role as my husband too seriously! Additionally, the original heroine, Nyla, who I thought was good, seems suspicious. Why are you trying so hard to portray me as an evil character? Was Claudia really as bad as everyone thought?"]},{"title":"A Way to Protect the Lovable You","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Way to Protect the Lovable You / Saving My Sweetheart / Dajeonghan Geudaereul Jikineun Bangbeop / 如何守护温柔的你 / 将温柔的你守护的方法 / 다정한 그대를 지키는 방법","I was forced to marry a man who hates me. Which is to be expected since my mother killed his family. “I want you to promise me before we get married. After 6 months of marriage, I want you to divorce me.” “…What?” “I know you were forced to marry me. We don’t need to draw out an unwanted marriage, do we?” “An… unwanted marriage?” He dazedly kept on repeating my words. ( Return to past life / Marriage first, romance later / Powerful FL / Respectable ML / ML big-dog type / Slight misunderstanding / Finding healing / Double salvation / Pure romance ) Story: Hound Art: Kim Ji-ee Adapted from: Drug Jelly"," "]},{"title":"Men of The Harem","tags":["Drama","Fantasy","Romance"],"disc":["Read Men of The Harem / 하렘의 남자들","“Why should I only marry one man?” the female emperor declared. “During past generations, the emperor has had at least five concubines and an average of fifteen. Now that I’m Emperor, I should have at least five concubines, too. The son of a chancellor? The successor to a powerful family? If they’re good, send them to the harem.” “My favorite one will become the male empress.”"]},{"title":"The Team Leader is Tired of Being A Newlywed","tags":["Comedy","Drama","Fantasy","Manhwa","Office Workers","Romance"],"disc":["Read manhwa The Team Leader is Tired of Being A Newlywed / I Spy a Married Life / 팀장님은 신혼이 피곤하다","Today marks the 145th day from when a man ignited the fire within a new recruit’s heart. That man is none other than ‘Gi Joo-won’, the extraordinary ace of NSO, a secret investigation agency affiliated with the government. Although known to have a bad personality among his coworkers, she still finds him attractive, especially when he frowns. Just then, a golden opportunity came upon her. As if it wasn’t enough that they became a fake couple, she even ended up living together with him! Where would this act with hidden motives possibly lead to?"]},{"title":"Spirit Farmer","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Spirit Farmer","The average Korean citizen who has been desperately trying to be a hero for 11 years has realized that this is not his craft or his dream. After giving up everything, Lee Kun Woo decided to become a farmer and live his quiet life. But is it that simple?"]},{"title":"THE HEAVENLY DEMON LORD WHO DOESN’T WANT TO LEVEL UP","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa THE HEAVENLY DEMON LORD WHO DOESN’T WANT TO LEVEL UP / Heavenly Demon Who Doesn’t Want to Level Up / 레벨업하기 싫은 천마님","“Jin Yuseong, the absolute master of the Middle Kingdom, found life too boring. ‘I must be crazy. Just unifying the martial world…'” “‘I should have just been a farmer.'” “‘No, I wish I wasn’t born at all.'” “In ‘The Heavenly Demon Lord Who Doesn’t Want to Level Up,’ one day, he encounters a gate… And upon passing through it, a new world unfolds.” “Jin Yuseong, the top martial deity and leader of the Celestial Demon Cult, arrives in Korea."]},{"title":"The Raider","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Raider / 더 레이더","In a world where humans and monsters are indistinguishable, the “True Raider” emerges! After the appearance of monsters that tear humans apart, society has divided into two parts, “Raiders” and “Non-Raiders.”","24-year-old Lee Semin, unable to become a Raider no matter how hard he tries, confines himself to a small room. One day, he stumbles upon a strange website.","｢ Welcome, new member.\nTo Transcendental Network.\nA community connecting transcendent beings across dimensions.｣","They reveal to him the true world of martial prowess. Amidst the chaos where humans and monsters are indistinguishable, the “True Raider” is about to make their entrance!","“Bring it on, you bastards.”"]},{"title":"The Daughter of Evil and Miss Devil","tags":["Fantasy","Isekai","Manhua","Romance","School Life","Shoujo Ai","Villainess"],"disc":["Read manhwa The Daughter of Evil and Miss Devil / 恶役千金与魔王小姐","Two girls, hand-in-hand, cross over to another world, into a magical academy set in a melodramatic Western fantasy novel. They transform into two people completely unrecognizable to each other: One is a rich villainess who is incapable of using any kind of magic, while the other is a young girl extremely talented in the field of magic, who’s said to be the reincarnation of the Demon Lord. Originally set to save the world, the two of them unexpectedly fall in love. “Male lead, female lead, may you two live a long and happy life together, forever. I, the villainess, am going to elope with Miss Demon Lord!”"]},{"title":"I Don’t Even Know Who the Child’s Father Is","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Don’t Even Know Who the Child’s Father Is / Who’s the Baby’s Father? / この子のパパは誰ですか？ / 애 아빠가 누군지 나도 모릅니다 / 애아빠가 누군지 나도 모릅니다","Reeling from the shock of waking up in labor, a woman realizes that she is in the body of Princess Etricia Lette, the anti-heroine of a novel she never finished. The only thing she recalls is that Etricia had countless suitors, so the father of her baby girl, Loustina, is a mystery, but he could be one of four powerful men. Is it the captain of the imperial knights, the prince of a neighboring country, the master of the mage tower, or a descendant of dragons? Who will Loustina call father?"]}]