[{"title":"Finally, The Blue Flame","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Finally, The Blue Flame / The Blue Guardian of the Princess / Machimnae Pureun Bulkkocci / Blue Fire Whirlpool / Finally, a Blue Flame / Goblin si Pelindung / Seika no Uzu / The Goblin Protector / 青火の渦 / 마침내 푸른 불꽃이 / 작품명마침내 푸른 불꽃이"]},{"title":"I Am Being Chased by My Husband","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Am Being Chased by My Husband / 남편에게 쫓기고 있습니다"]},{"title":"Master Of Divination: Prince Husband Doesn’T Believe In Evil","tags":[],"disc":["Read manga Master Of Divination: Prince Husband Doesn’t Believe In Evil / 天机神术师：王爷相公不信邪","As a master of divination, Ling Xiang Ruo was struck by the lightning due to divulging heaven’s will, and she met a prince who doesn’t believe in supernatural beings. Ling Xiang Ruo’s little temper flared up, since you don’t believe it, I’ll definitely make you believe in it! Therefore, she followed the prince to investigate various kinds of strange/abnormal cases. Finally, the prince believed, but there are some discrepancies with her imagination…… “Wife, since you are so good in fortune-telling/telling someone’s fortune, are you able to find out/tell that you lack me in your life? ” the prince pushed down Ling Xiang Ruo, he bent down and laughed."]},{"title":"Secretary Undone","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Secretary Undone / Beloved Secretary / Biseo Silgyeog / My Lovely Secretary (Bihyang) / Secretary Disqualification / Sur le Fil / เลขาคิมที่รัก / 秘書失格 / 비서실격","From her looks to her background, everything abut Mia seems so ordinary. But then she lands a job as the secretary of Siwoo Lee, a former model who is now a director at Taeyang Group, a conglomerate he is set to inherit. Siwoo is a notorious playboy and Mia finds out that she only got the job because she was the farthest from his type. But as they work together, she proves to be very capable and always seems to be there when he needs her the most. But when their professional relationship begins to take a turn into a heart-pounding romance, Mia is faced with a life-altering situation."]},{"title":"The Chef Hides His Blessing","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Chef Hides His Blessing / The Chef Hides His Blessing / 요리사가 축복을 숨김","Even though right now, he’s only a college clinic’s temporary cook, Jung Dong’s dream is to be a chef. With just his one dream of becoming a chef, even though it’s hard, he’s still walking the windy path ahead of him. However… Du dun!! “I am your goddess, Charis.” This adorable being is a goddess?! One day, he heard a deity’s voice and Everything changed after he became her disciple!! Heartfelt made cooking, along with memorizing cute recipes! “Do cooking along with blessing heartfeltly!” Cooking filled with blessings for everyone!! Starting as a college clinic’s temporary cook, With the dream of working in a Michelin Guide Restaurant, And filled with sincerity, Jung Jung-Dong Will do it together with Charis’ blessing filled cooking, right?"]},{"title":"Opening Up Prince Charming With the Right Strategy","tags":["Comedy","Ecchi","Shoujo"],"disc":["Read Opening Up Prince Charming with Correct Strategy / Opening Up Prince Charming With the Right Strategy / 打开男神的正确姿势 / Opening Up Prince Charming Using the Right Strategy","“Warning: Mature content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nIn order to recover her memories, a female tyrant must travel through the multiverse capturing the hearts of all the Prince Charmings. What?! I need to make the perfect Mary Sue type character’s male lead… fall in love with me? System, what kind of mission is this?"," "]},{"title":"Oh My Savage Princess!","tags":["Liexing","Ping Ping Jun","Romance","Supernatural"],"disc":["Read manga Oh My Savage Princess!  / This Princess Lu Ziye","The Queen of Hell travelled through time and space and took position of a human’s body! What?! I’m the weak Princess Royal? Not any more! For those who bullied “me” before, go to hell! I mean… literally. And for handsome who won’t bow to me?! Alas, it won’t happen! I am the Queen of Hell. I always get the man i want even if he is so dead!"]},{"title":"My Contract Beast Is A Chinese Pastoral Hound","tags":["Action","Adventure","Fantasy"],"disc":["Read My Contract Beast Is A Chinese Pastoral Hound"]},{"title":"Not My Ideal Type","tags":["Comedy","Romance","Slice of Life"],"disc":["Read manhwa Not My Ideal Type / 이상형은 아닙니다","A romance to find the perfect ideal type for a 29-year-old man who has never had a date, let alone a relationship with a 29-year-old woman who has reached the full level of dating experience! Kim Jin-hyeon, a young man who appeared in front of Cha Eun-tae, who is at the peak of love. With his worst fashion sense, he doesn’t even drink alcohol and plays games at home on the weekends. This man who seems to have fallen out of the other world… Cha Eun-tae begins to be attracted to this man who has absolutely not her ideal type."]},{"title":"Wicked King’s Favour","tags":["Fantasy","Historical","Romance"],"disc":["Read manhua Wicked King’s Favour / The Cold-Hearted Evil Prince’s Indulgence / My Dangerous Prince; Wicked King’s Favour / Prince’s Overwhelming Love","She was a top agent from the 21st century. After transmigration, she became the fifth princess of Dongyue Kingdom who was ugly, retarded and weak. He was the powerful, cold and ruthless prince regent. Sometimes misfortune is a blessing in disguise. When she was framed by her fiance, she met him who was badly injured. A sweet love story thus begins…"," "]},{"title":"My Unexpected Marriage","tags":["Comedy","Cooking","Historical","Romance","Shoujo","Slice of Life"],"disc":["My Unexpected Marriage manga, Botsuraku Reijou no Ikoku Kekkonroku manga, 没落令嬢の異国結婚録\n“From now on, you will be my wife.” Reifa, a daughter of a fallen family, is bought for 100 gold coins in a faraway foreign country to pay off her family’s debt. In a land where she can’t speak nor understand the language, she was almost treated as an object. But, she is rescued by the beautiful and (rumored) sickly, head of a noble family, Sin Yu. A story of married life, that aims to be the ideal couple with cooking and compassion."]},{"title":"I am Han Sanqian","tags":["Drama","Romance"],"disc":["Read manga I am Han Sanqian","Han Sanqian had been in the Zuo Su family for three years and was called a son-in-law of trash by his relatives.\nHis wife is Su Yingxia, in order to protect Su Yingxia from being humiliated by others, Han Sanqian secretly worked to become a precious son-in-law and began to prepare for his return."]},{"title":"Three Lifetimes","tags":["Fantasy","Manhua","Romance"],"disc":["Read manhwa Three Lifetimes","Juju fell in love with Jin Lei, the God of War, at first glance. The problem is, he doesn’t seem to know she exists. Determined to sweep him off his feet, she accompanies him down to the mortal realm as he takes on three trials to attain greater divinity. However, in those three lifetimes that are given to them, will she be able to make him love her back?"]},{"title":"Romance In Seorabeol","tags":["Adaptation","Fantasy","Historical","Isekai","Romance"],"disc":["Read Romance in the Capital City / Seorabeol Romance / 서라벌 로맨스","Soyoung is a college girl who insists that life is unfair and nothing changes no matter how hard she tries. She hangs out with her friends every day, spending meaningless time. Just before Coming of Age Day, she finds herself into the body of the princess of Shilla. Soyoung has to hide her blonde hair, which can be a fatal flaw for a royal family member."," "]},{"title":"Green Light for Romance","tags":["Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa Green Light for Romance / Romance Can Be Accomplished / Romance Can Be Done / The Romance Is Possible / この恋愛、してもいい？ / 해도 되는 로맨스","When the fortune teller told Shion Lee, “You are destined to be with bad guys!” Shion was skeptical, but so far, the fortune teller has been 100% correct. Every single man she has dated turned out to be a shameless jerk! Enter Yujin Oh, a student she met years ago when her teaching career had just begun. He’s all grown up now, and he’s handsome, kind, and sincerely interested in her. Will Yujin turn out to be a green light in her love life or is he just another horrible date?"]},{"title":"The Great Wish","tags":["Action","Drama","Fantasy","Romance"],"disc":["Read manhwa The Great Wish / 위대한 소원\nThe Empire’s only princess – Sienna Argent.\nShe has everything from birth: intelligence, beauty, talent and even the right to be the next ruler of the Empire.\nAs her 20th birthday approaches, she begins to have dreams about her future. She thanked the gods for this power, but then her dreams began to become increasingly strange, depicting a future not what she dreamed of.\nAs her ally, a man begins to influence Sienna’s life both in the present and in the future. As her surroundings changed, she quickly began to change as well."]},{"title":"The Business Is Closed Because of the Tyrannical Fathers","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Business Is Closed Because of the Tyrannical Fathers / 폭군 아빠들 때문에 폐업합니다","The emperor of the empire called a tyrant, the iron-blooded high priest who has said that there is no blood or tears since the temple was built, the mage lord who is said to be the strongest wizard of all time, and the dark duke who controls the underworld. Since when did there be so many idiot daughters in the world? Why do these crazy people order outrageous things every single day!","And why are those children all so esoteric? Unable to endure the rush of orders, various threats, and difficult children, I decided to close the toy studio that had been in existence for the third generation. However, the day after burning the workshop, the fifth workshop flashed before my eyes.","Why was there no mention of “you” in “If I can’t save my daughter, you’ll die too”?\nIt contains the joys and sorrows of a petit bourgeois woman who has to make perfect things on a set date due to the money of the powerful."," "]},{"title":"Between Disciple and Lover","tags":[],"disc":["The Relationship Between a Student and a Lover / Between Lover and Student / Minor Scandal / ลูกศิษย์ที่รัก / 我可以喜欢你吗？ / 제자와 연인 사이","Han Shin-woo met a female college student, Ga-yeon, at a club where he and his classmates went for a graduation party.","They met by coincidence when he helped her in getting out of a bad position, and they ended up dating.","Shin-woo looked young and naïve, and Ga-yeon is charmed by Han Shin-woo’s handsome appearance.","Then March came.","Shin-woo will be a third-year homeroom teacher at Daehan High School, where he was appointed for the first time, and the class president of class 1 in the third year is Jin Ga-yeon…?","“Could it be that you have an older sister?”","Shin-woo asked, almost like he was clutching a stick.","“…I don’t.”"]},{"title":"I got a date with the president","tags":["Comedy","Josei","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa I Got A Date With The President/  A Business Proposal / The Office Blind Date / 사내 맞선 / お見合い相手はうちのボス / 我和总裁相了个亲","Ha-ri made a deal—go on one blind date for her BFF and pretend to be a super-vixen to end all of her unwanted marriage set-ups! Unfortunately, instead of easy money, Ha-ri’s got a headache. Her date is Taemu, her company’s hot new CEO, and he’s got his own plans to get his family to back off by marrying whoever shows up on the date. Should Ha-ri accept his proposal to keep playing pretend? Nothing could go wrong with lying about your real identity while dating the boss… right??"]},{"title":"Rooftop Prince","tags":["Adventure","Comedy","Drama","Fantasy","Manhwa","Romance","Supernatural","Time travel"],"disc":["Read manhwa Rooftop Prince / 옥탑방 왕세자","When Park Ha discovers three strange men sitting on her new place, she would have never guessed one of them was the Crown Prince. As Park Ha tries to navigate her new life in Seoul, she discovers bits of her secret childhood and how she came to be separated from her family. Meanwhile, 300 years earlier, the Crown Prince is desperate to find out answers to his wife’s mysterious death. Before he does, cosmic forces intervene and he’s switched with someone who looks just like him from 300-years-later Seoul. The ultimate crossover between Joseon and Seoul fueled by mystery ensues when the two meet."]}]