[{"title":"Martial Streamer","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Martial Streamer","TaeMin was a student taking a gap year, when he ended up electrocuting himself while trying to become a Youtuber.\nHowever, he ends up being reincarnated as Zhao Ga-hui in a world of martial arts, with livestreaming abilities to boot!\nWith the special ability to access Youtube when he closes his eyes, he starts streaming his daily life in ancient China, with the goal of becoming the ultimate merchant and martial artist!"]},{"title":"Return of the Top Class Master","tags":["Action","Drama","Fantasy"],"disc":["Read manhwa Return of the Top Class Master, Return of Top Class Master, Возвращение мастера высшего класса , 탑클래스 마스터의 귀환","The star admired by all the strong, the top-class master of Haons, ‘Ray.’","Ray, on the verge of the final gateway to becoming a god, is betrayed and killed by the boss master ‘Anus.’\nRegressing to the time when he was ‘the ultimate loser Kang Tae-wook,’ trampled by the bullies and unable to protect his fiancée…","Kang Tae-wook, who once was the biggest loser, takes up the sword of revenge against those who ignored and betrayed him in the past, facing the things he couldn’t achieve in his past.","However, there was a reason he had to live through that miserable past.","As Kang Tae-wook dives into the depths of a conspiracy that only deepens as he uncovers it,\nhis second life, soaked in blood, begins anew!"]},{"title":"Oh, the Flower That Bloomed on the Wall","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa online Oh, the Flower That Bloomed on the Wall/오, 담에 핀 꽃 at manhwa website","“I found out. If you don’t know your first love, is that love?” Oh Yoon, a childhood friend of Do Dam, visits him as his daily life is interrupted by his first love who has become a stalker. Unlike the past when he followed his older sister around, he is just being awkward… . A woman who hates her first love and a man who came looking for his first love. The days he misses, his first love he misses. Who was their true love?"]},{"title":"Apollo’s Heart","tags":["Adaptation","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Apollo’s Heart / The Heart of Apollo / 아폴론의 심장","Taejoon has it all: money, power, and a beautiful fiancée. He’s finally moving on after his ex-girlfriend died under mysterious circumstances four years ago. Yuri, on the other hand, is struggling to piece together her past after a traumatic memory loss. Apparently, Yuri looks exactly like Taejoon’s ex, and he’ll do whatever it takes to get her back. How far will he go to uncover the truth, and will Yuri survive his dangerous games?"]},{"title":"What’s Our Hero Doing?","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa What’s Our Hero Doing? / 우리 용사는 뭐함?","Our main character has cleared the extremely difficult ‘Banta Black Ring’ a thousand times. He woke in the body of ‘ordinary villager A (Hans)’ at Banta Black Ring’s tutorial area.","The village is being attacked by monsters! when threatened with death, he thought of the Hero, ‘Cadiz.’ When HE thought that Cadiz would show up and defeat the monster, the hero “Cadiz” died from a single attack?","Just when he thought it was all over, he absorbed the hero’s abilities?!","He just wanted to survive comfortably beside a hero so what’s going on?"]},{"title":"The Moon On The Cliff","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read Manhwa The Moon On The Cliff / 절벽에 뜬 달","There was a man who’s been dragged down from the throne and chased out to live on the edge of a cliff on a shabby island. I dared to fall in love with him.","Sam Wol is woman who stands in for her sickly father at his post on a destitute island.\nHwan is a man who’s been dragged down from the throne and chased out to live on the edge of a cliff on a shabby island.","Some said that he committed adultery with his own mother and raped hundreds of maidens.\n“Hey child. How about we give a name to each other?”\nIn my eyes, he’s only a lonely and attentive man.","So, how could I not dare to love him."]},{"title":"Steel-Eating Player","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Steel-Eating Player, A player who eats steel, Steel-Devouring Player, Steel eater, 강철을 먹는 플레이어","Lee Hyunwook, the steel emperor, was the last savior of mankind, but died. In order to change the future, the place he regressed to was… The military?!! “Why here of all places?!” The start of Corporal Lee Hyunwook, who gets stronger in a special way, by doing a steel mukbang!"," "]},{"title":"John Loves Tite","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Tragedy"],"disc":["Read manhwa John Loves Tite / Yohan Loves Tite / 요한은 티테를 사랑한다","Tite loves John. But does John love Tite? Today, the people of Holy City were gossiping among themselves. Tite Libero, the eldest daughter of the prestigious noble family Libero. Rumor has it that the beautiful and bright Tite fell madly in love with the hope of humanity, Cardinal John."]},{"title":"What’s With the Three Kingdoms-Obsessed Male Lead?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa online What’s With the Three Kingdoms-Obsessed Male Lead? /삼국지에 집착 남주가 왜 나와요? at manhwa website","I was possessed by a parody novel of the Romance of the Three Kingdoms.\nIt’s the unification of the three kingdoms and this is a flower garden, so I just want to look at the pretty faces.\nLu Bu, known as the world’s greatest madman, appeared before my eyes.","“Don’t turn your head. When you look at someone else, whoever that is. “It will kill anyone who sets eyes on it.”","She said she had a crazy face, but she didn’t say she was really crazy…?\nThere was no mention of Yeo Bu being an obsessed man!","Moreover, the eye-wateringly beautiful Lu Bu will die in the not too distant future.","I’m busy running around trying to prevent the ending of Yeo Bu’s death,\nWas it the problem of cross-dressing or being a trickster?\nI don’t know anything about the future, but for some reason, the flowers are fighting to have me.","excuse me,\nIn this novel, wasn’t the male lead called Yubi anyway?\nWhy are you doing this to me all of a sudden?"]},{"title":"The Beast Tamed by the Evil Woman","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Beast Tamed by the Evil Woman / The Villainess Tames The Beast / The Beast Tamed by the Villainess / A besta domesticada pela vilã / La bête apprivoisée par la Vilaine / 악녀가 길들인 짐승","Novel Summary : tbc, will edit / someone else can tl the manhwa summary when it comes out The one and only real villainess in the novel took a beautiful man and tamed for the rest of his life. After pushing his fears to the limit, he’s learned how to plead from her, becoming a beast that could never escape, even if his leash was loosened. However, the beast falls in love with the woman who saves him, becomes the emperor with her by his side, and punishes the villainess to eternal restraints. Following the story, I took over the villainess’ body at the time when she was halfway through taming the male lead. ……What should I do? First, let’s undo the brainwashing bit by bit. And then… Let’s pretend that we’ve repented. “I’ve gone through so much trouble looking for you.” “I… don’t quite understand what you mean, Your Majesty.” “How can I forget your touch?” He grabbed my wrist, held my hand and gently brushed it over his cheek – just like how Illyana, the villainess in the novel, always did when she praised him. “I will tame you, like you did – a beast that can do nothing without me.” My palm was brushed over his cheek, then his lips. He planted a short kiss on it before slowly pulling my hand away."]},{"title":"How To Make A Loving Savior an Emperor","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read How To Make A Loving Savior an Emperor","Ines, betrayed and killed by her husband Joseph, Found herself back in the peaceful time of twelve years ago when she opened her eyes.","Fueled by a relentless thirst for revenge against her husband, Ines meets Carson, the man who saved her life before the regression.","“Young lady, have we perhaps met somewhere before?”"]},{"title":"Miss Makeover","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life","Sci-fi","Si-fi"],"disc":["Read manhwa Miss Makeover / My Switch Mate / 나의 스위치 메이트","Do Sulmi was so excited to start her new life as a freshman at Hanguk University, but she’s quickly discouraged after being incessantly bullied by her classmates for her looks and weight. Baek Dojoon on the other hand, has always been incredibly handsome and wildly popular amongst his peers. They’re both students in the Genetic Engineering program, which is in possession of the “Transbody,” a state-of the art machine that allows the user to change their human form into whatever they choose. After a late-night accident in the lab with the Transbody, Dojoon is left with an affliction where each night he involuntarily changes into a beautiful woman. Sulmi would do anything to escape her current body while Dojoon would do anything to return permanently to his old one. Will Sulmi and Dojoon be able to transform their fates and find a happy ending?"]},{"title":"Love You, with Death","tags":["Fantasy","Mature","Romance","Webtoons"],"disc":["Read manhwa Love You, with Death / Yakushi Olivier wa Aisuru Koushaku ni Shi wo Okuru / 薬師オリヴィエは愛する公爵に死を贈る","“We were happy until that fateful day.” Born into a clan of apothecaries, Olive is a young girl who dreams of continuing her family’s legacy. But then, one day, her hometown gets attacked. She loses her entire family, except for her older sister. They get adopted by the lord of the domain, Earl Elvert, only to be treated like livestock. Olive does everything to protect her physically disabled sister, who’s eventually taken hostage in order to coerce Olive to abuse her power. “It’s because only your family can make a ‘perfect poison’ causing instant death.” That is, an ability to refine a special kind of poison from her blood. Olive is forced to assume a false identity, marry and later poison the infamous “Murderous Duke.” However, contrary to the rumors, Duke Victor seems to be an honest and kindhearted man… “I don’t want to kill him. But as things stand, my sister…” The more love she feels from Victor, the more her anguish grows."]},{"title":"Only One Tomorrow","tags":["Drama","Josei","Mystery","Romance"],"disc":["Read manhwa Only One Tomorrow  / 내일도 온리원","She’s starring in the role of her lifetime.\nIt’s 1931, and Leewon’s brother has been framed. As she tries to escape with him, she’s knocked out and wakes up in the 21st century. When she’s then asked to play the character of On Leewon in a film, she realizes that it’s the story of her own past and resolves to find out who framed her brother."," "]},{"title":"So How Did I Die","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa So How Did I Die / 그래서 나는 죽었을까\nAfter a magical stone was stolen by a mysterious thief from a dragon’s territory, the dragon who’s property was stolen decided to morph into a noble woman that was related to said thief and go look for him in the human empire. However, what the dragon didn’t knew is that the woman that it morphed into was involved in a huge mistery where she was reported death just after her wedding 5years ago. Now after returning to the previous home of the that woman, the dragon will be trying to find the thief of his magical stone while learning more about the events that lead to the tragedy from three men that where involved in some way with her, The crown prince of the empire who was also her fiance, her faithful butler and someone directly affected by her “death”; All these enigmas may soon been resolved and put an end to the question….So, How did I died?"," "]},{"title":"The Duchess’ 50 Tea Recipes","tags":["Isekai","Manhua","Manhwa","Romance","Webtoons"],"disc":["Read The Duchess’ 50 Tea Recipes / 공작부인의 50가지티 레시피","When I opened my eyes, I had become the duchess. But something isn’t right. I went as far as becoming a character but I’m just a duchess in name that gets mistreated by the maids and ignored by her husband. What a crappy life! Gosh, I don’t know what to do anymore. I’ll just quietly enjoy my tea, was what I thought. “Can you prepare tea for me again next time?” Something’s gone wrong with my cold husband!"]},{"title":"Perfect Show Window","tags":["Adaptation","Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Perfect Show Window / 완벽한 쇼윈도","Are we allowed to be so excited? A 9pm curfew, no short skirts, no independence unless married. K-Hee-won grew up in a Confucian family and dreamed of freedom. K – Jihwan, the son of a serf, fights to keep the family name alive. Will their daring plan for freedom succeed?"]},{"title":"Requiem for the Queen","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Requiem for the Queen / 为女王而作的镇魂曲 / 여왕을 위한 진혼곡"]},{"title":"To Kill My One and Only Solace","tags":["Drama","Fantasy","Romance"],"disc":["Read manga To Kill My One and Only Solace / 愛する人を殺す時、私は何を思うだろう / 我与爱人共沉沦","It all began on the night of Erica’s fourteenth birthday. The ruthless Imperial Army launched a brutal assault led by an enigmatic armored man, killing the citizens of her kingdom. To compound the tragedy, the Armored Man took the life of the person Erica loved most in this world—her mother—right before her eyes. What should’ve been a joyous celebration turned into a nightmare, leaving Erica to grapple with the heart-wrenching loss of her mother, friends, and the familiar world she once knew. Ever since that day, Erica has vowed to avenge their deaths and kill the Armored Man. She finds solace in Raoul, a young man she meets by coincidence. As their bond deepens, Erica remains blissfully unaware that Raoul conceals a dark secret—he is the very Armored Man she seeks to destroy. This gripping tale unravels the intertwining destinies of Erica and Raoul as they navigate the tumultuous journey of growth and hardship. Will vengeance tear them apart, or will it be the force that binds them together in an unexpected twist of fate?"]},{"title":"The Outcast Returns from Another World as King of Delinquents","tags":["Action","Adventure"],"disc":["Read manga The Outcast Returns from Another World as King of Delinquents"]}]