[{"title":"The Lady Alchemist","tags":["Adaptation","Adventure","Comedy","Drama","Fantasy","Manhwa","Mystery","Romance"],"disc":["Read manhwa The Lady Alchemist","When a slip of the tongue lands her in prison, Sepha is tasked to transmute the mountains of straw around her into gold. Impossible, or so she thinks until a conniving magician appears with a deal —He’ll turn all the straw into gold, in exchange for her firstborn. With a death sentence over her, what choice does she have?"]},{"title":"The Evil Girl Karuna Has Shrunk","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga The Evil Girl Karuna Has Shrunk / The villain Karuna has become smaller / The Evil Lady Karuna Has Shrunk / The Villainess Karuna Has Become a Child / 악녀 카루 나가 작아 졌어요\nKaruna wants to make a woman named Clayen the prince’s fiancée.\nA negative crisis is coming. But the well-prepared villain – Karuna is magical.\nI took medicine, and thanks to that drug, my body became smaller and I looked younger.\nindeed, with this appearance, she lived with her breath undetected by the nobles.\nA wolf appeared out of nowhere, The wolf returned – Karuna\nGrowing up and…"]},{"title":"My Messy Marriage","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Messy Marriage","“I’ll do this marriage.” Woo So-ran, a dedicated lawyer, is the only person who’s aware about Baek Kang-ho’s contract. She agreed to marry him instead of his runaway bride. “You’ll regret it.” Well, I don’t make decisions which I’ll regret in the first place. She entered the tiger’s den with confidence. Even though her life so far was quiet and boring, a messy and secret romance begins. Will I regret this marriage?"]},{"title":"The Widowed Empress Needs Her Romance","tags":["Comedy","Fantasy","Historical","Romance","Shoujo"],"disc":["Read The Widowed Empress Needs Her Romance / Huang Tai Fei Ye Yao Tan Lian Ai / Huáng Tài Fēi Yě Yào Tán Liàn’ài / The Imperial Concubine Also Wants To Fall in Love / The Imperial Concubine Also Wants To Talk About Love / 皇太妃也要谈恋爱 / 황비(皇妃)도 연애가 필요해","Our Female Lead was forced to replace her sister’s place and become concubine to an elder Emperor. However, on her first night at the palace, the Emperor drops dead from poison, right at her feet! The Emperor’s son witnesses this and strikes a deal with her, asking her to claim that his father’s last wish was to pass the throne to him, and he will allow her the seat of Empress Dowager! Shocked and confused, our MC enters this deal with the new Emperor, and must find her own way to survive the Palace!"]},{"title":"Marry Me (Man Shen Gong Chuang)","tags":["Drama","Fantasy","Romance"],"disc":["Read manga Marry Me (Man Shen Gong Chuang) / I Married the Disabled Big Shot After My Rebirth / 重生后我嫁给了残疾大佬\nIn her previous life, Ruan Hanxing, a girl from the slums, was weak and powerless. She died silently and without a trace. After being reborn, Ruan Hanxing promised to make a strong comeback. She helped the fallen tycoon, Huo Chen, who was married to her, to get back on track with his life. The couple joined forces and embarked on a path of dominance and glory."," "]},{"title":"I bought the land, not the man","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I Bought The Land, Not The Man / What I Bought Is Land, Not a Man / 제가 산 건 땅이지 남자가 아닌데요","She envies the life of an extra in the novel who earns money easily. One day, she possessed an extra character who is the loyal maid of the heroine in a novel. All she needs to do now is to become a rich man in the land! But… can she protect it from the cunning duke who covets her abilities?","I was envious of the extra that took money more easily than the heroine of hardship, and when I imagined getting rich while looking at the land that was about to increase in value, suddenly the possessive came with a dubious voice?! Eliana, the extra loyal servant of the heroine Countess. Now all he had to do was get rich, and even the evil peacock, who was after the land where he lived, began to follow him. “Eliana. Let me do what I want.” “I do not like it!” Will he be able to protect his family from criminals who crave for his power, smile with a smart face and safely become rich?! A messy romantic comedy with a secular female lead."]},{"title":"I’m a Villainess but So Popular","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I’m Villainess But So Popular / I’m The Villainess But I’m So Popular / Aileen’s on Fire / 악역인데, 인기가 너무 많다\nI possessed an extra character as villainess in the novel.\nI tried to live a quiet life without getting involved with the main character.\n“If you run away again, I’ll tie you up and take you to the palace.”\nThe Second Prince, who only looked at the original heroine, is obsessed with me.\n“I didn’t do it for you, so don’t get me wrong.”\nMy self-proclaimed rival seems to have a crush on me.\n“Ahh! She’s so beautiful!”\n“If only I had been hit by her magic once!”\nSuddenly, there is a fan club.\n“Come, let us all pray reverently while looking at the picture of the noble Yerine.”\nMy favorite heroine became the president of the fan club.\n……Am I really the villainess?"]},{"title":"Knight of the princess","tags":["Romance"],"disc":["Read manhwa Knight of the princess","The story of Velon Alerhans, the leader of the Riddle Knights, who became a knight of Princess Zenart"]},{"title":"A Second Chance at Love","tags":["Romance"],"disc":["Read manhua A Second Chance at Love","She was a woman who got played by a man and lost her way but by the grace of god, she received a second shot a life. From today onwards, she’s not just Wang Xueqi but also Leng Yue, and she’s living for the both of them!"]},{"title":"The Crownless Queen","tags":["Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa A Queen Without Her Crown / 왕관 없는 여왕\n60-year old historian, Jung Gwinam. On the day of her retirement ceremony, she got into an accident while attempting to save her daughter, just to later wake up as the main character of a fantasy novel written by her daughter?! Of all things, she had to be reborn as an orphan peasant. But who cares? This is the start of Jung Gwinam’s second life."]},{"title":"The 99th Bride of the Duke","tags":["Action","Crime","Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Webtoon"],"disc":["Read manhwa The 99th Bride of the Duke / The Duke’s 99th Bride / Pengantin ke-99 Duke / 공작가의 99번째 신부","Grace, who lost her mother and became an orphan, was living on the street waiting for her death, was saved by Penelope Erdona and she became Grace Erdona.\nOne day, while she and Penelope were together, Penelope talked about getting married.\nThe person she must marry is none other than the Duke of Felton, the most powerful family in the world.\nThere was a rumor that all the women who got married there had disappeared or returned with a very strange mental state.\nTo protect Penelope, Grace intends to marry the Duke in her stead.\n‘I heard this is not your first time getting married, may I know how many times this is?’\n‘Let me see…you’re the 99th.’\nGrace Erdona, wake up!"]},{"title":"When a Thousand Moons Rise","tags":["Action","Drama","Mystery","Reincarnation","Romance","Supernatural"],"disc":["Read manhwa When a Thousand Moons Rise","What if you were fated to be murdered in every life? Living in a small countryside town, Nogyung Lee thinks her biggest problem is her unrequited crush on her childhood friend. But Nogyung is curseddestined to be slain by the same villagers every time she’s reborn. With no memories of her previous lives, she must unravel the mysteries of her village and the legends surrounding it in order to stay alive. Can Nogyung finally break the curse or is she fated to relive this tragedy forever?"]},{"title":"The Last Cultivator","tags":["Action","Adventure","Fantasy","Harem"],"disc":["Read The Last Cultivator\n5000 years ago, the demon god led the army to battle the cultivators. After years of battle, the demon god destroyed all the sects of the cultivation world. The entire world changed completely because of this battle. Magicians, Knights, and Healers started to appear. This world completely became a world of magic. 5000 years later, a bolt of heavenly lightning suddenly awakened a cultivator sleeping in Xuan Yuan wood. He is now the last cultivator in the world.\nThe Last Immortal Cultivator,\n最后的修仙者"]},{"title":"From The Shaking World","tags":["Fantasy","Josei","Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhwa From The Shaking World / 흔들리는 세계로부터\n“Don’t you want to switch worlds once?” The sweet request from the other ‘me’ that I’ve dreamed of. In the changed world, Eunsae’s ‘seesaw’ romance begins."]},{"title":"A Nest Of Phoenixes","tags":["Adaptation","Comedy","Drama","Fantasy","Historical","Magic","Romance","Royal family","Tragedy"],"disc":["Read manhua A Nest Of Phoenixes / 一窝凤凰 / Yī wō fènghuáng","In the ancient times, when heaven and earth were first born, all order was not yet established, the world was chaotic and the three worlds were unsettled. Fortunately, the four Immortal Monarchs, Heng Yang, Dong Yang, Ling Yang and Qing Yang, emerged from the sky to guard the four seas and the eight wastes, leading to the subservience of all the tribes and a harmonious coexistence. The sky and the earth were clear and prosperous. However, how did the Phoenix tribe come to be so different? They are jumping up and down, making a scene, disturbing the immortals, but there are people who enjoy this."," "]},{"title":"Dr. Player","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Dr. Player / 닥터 플레이어 manhwa,\nRaymond was the illegitimate son of the king.\nAfter being shamed and scorned, he ran away and became a healer… only to end up being ridiculed for getting an F rank.\nThen, one day, a miracle came upon him.\n[You have awakened as a player!]\n[Job: Surgeon (SSS-rank)]\nRaymond gained medical knowledge that had not existed in this world. The great legend of Raymond, the first surgeon, begins now!"]},{"title":"My Pet Miad","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family","Shoujo","Tragedy"],"disc":["Read manhwa My Pet Miad / The Lovable Maid / 宠物女仆 / 愛玩侍女〜ご主人様、私はペットですか？〜 / 애완 시녀 / 애완시"]},{"title":"Revenge on Your Heart","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Revenge on Your Heart / 君の心臓に復讐を/ 네 심장에 복수를","Lucretia, who lived happily as a daughter of the nobility, She was poisoned by Sabrina, whom she thought was her best friend, and wandered between life and death. She miraculously succeeded in saving her life, During the month and a half when she was unconscious, the situation had deteriorated. “Lucretia was a drug dealer, she was a drug addict herself, She committed suicide because she was afraid of being exposed to crime,” and the parents who pleaded not guilty to their daughter had their peerage and property confiscated. Din asks Lucretia, who is overwhelmed by despair, who saved her life. fight alone for the truth with everything lost or, Do you want to be a different person and take revenge?"]},{"title":"Holy Chef, Crazy Empress","tags":["Comedy","Drama","Fantasy","Historical","Manhua","Romance","Webtoons"],"disc":["Read Holy Chef, Crazy Empress / 神厨狂后\nThe top killer of the 21st century crossed time and space into the Cold Palace as a useless Empress.\nTo have a good life in the harem, you need to be good in the Royal Kitchen and excellent in the Emperor’s bed.\nThere is a super handsome and evil-minded husband and a cute baby genius – not to forget the superb Royal Kitchen system for lotteries.\nConquer this dapper man with a pot and a spoon, dominate the harem and embark on the pinnacle of life!"]},{"title":"Reversal in Chaos","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhwa Reversal in Chaos / Chongsheng Di Nv Luan Tianxia Chóngshēng Dì Nǚ Luàn Tiānxià / Reborn Princess Disordering the Whole World / Trùng Sinh Đế Nữ Loạn Thiên Hạ / 重生帝女乱天下 重生帝女亂天下","A female assassin transmigrated into the beloved princess of a nation. She expected to live her life in peace, but a split second after waking up, she was trapped in a plot of her own sister’s design. Now her fiancé – the crown prince – wants a divorce?! Fine, she’s decided to play along with these devils and seek out revenge for the body’s original owner."]}]