[{"title":"The Ugly Lady’s Secret Pouch","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Ugly Lady’s Secret Pouch / The Lady’s Secret Pouch / Dompet Rahasia Wanita Jelek / 이 영애의 시크릿 파우치 / 못난이 영애의 시크릿 파우치"]},{"title":"Beyond Walpurgis","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read Beyond Walpurgis / Jenseits von Walpurgisnight / 발푸르기스의 너머","One day, the owner of the divine universe makes a wager with Mephistopheles, a being from “the other side.” Their wager was to see whether a special soul born on earth would grow up to become a servant that follows the divine path or the wicked one. In present time, mid-19th century Prussia, Martin, an aspiring novelist meets a mysterious Elysse Wagner at a countryside inn. Together, they end up embarking on a journey to find an ominous group that claims to know a way to bring the dead back to life. Only, there is more to Elysse than Martin could’ve ever imagined…"]},{"title":"Second Life Producer","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa Second Life Producer / Produser Kehidupan Kedua / The Producer Who Lives Twice / 头号制作人 / 두 번 사는 프로듀서","Whoops, sorry. But it’s first come first serve, right?\nThe broadcasting industry is like that.”\nJoon Soo joined a broadcasting company with a dream. But for 10 years he lost everything he’s worked for because of his trashy Sunbae.\nHe regretted it deeply and grinded his teeth, but nothing could be done to correct it.\nWhen he was about to give up everything in despair, the second opportunity in his life has come when he returned to the day he joined the company with all of his memories and know-how intact. In the second life, can his dreams be achieved without repeating the despair of the past?"]},{"title":"Evil Dragon Is Reincarnated! Revenge Begins at the Age of Five!","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua Evil Dragon Is Reincarnated! Revenge Begins at the Age of Five!, 恶龙转生，复仇从五岁开始！, The Evil Dragon Has Been Reborn, His Revenge Started When He Was 5","I was once the legendary red dragon who stood at the top of the world. For thousands of years, my brethren have been murdered by humans and the desire for revenge slowly turned into my only mission in this world! However, I failed. On the day of the decisive battle against human beings, I died with hatred in my heart… if there is an afterlife, I will definitely avenge my kind. If there is an afterlife, I will make these filthy humans pay with their blood! If there is an afterlife—hmm? I was reincarnated as a weak human baby?!!"]},{"title":"Happy Sea World","tags":["Drama","Fantasy","Romance"],"disc":["Read manga Happy Sea World / Life With My Loving In-Laws / La Plus Heureuse des Fiancées / Shijousaikou no Yomeiri / 史上最幸の嫁入り / 해피 시월드","The duchy of Hikarell, the most powerful force of the empire, not inferior to the royal family.\nAlthough their power is strong, various dreadful rumors abound due to their secretive nature.\nOne day, sixteen years old Roel, who suddenly became a duchess, finds herself in the darkness…\nRoel, like a dandelion seed, is unfamiliar to her step-parents like a different species. Her future husband, Asland, who seems to have known Roel for a long time, and Roel’s hidden power gradually revealed.\nA timid girl who had shrunk back due to her stepmother’s abuse finds herself."]},{"title":"If You Can’t Kill Me, Love Me","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Yuri (GL)"],"disc":["Read manhwa If You Can’t Kill Me, Love Me / If You Can’t Kill, Love / Love Me If You Can’t Kill Me / 无法消失的人 / 죽일 수 없다면 사랑하세요","In a kingdom scarred by a historical rebellion, Penny, an assassin masquerading as a servant, aims to break free from Queen Nyla’s grasp by executing a perilous mission: the theft of the king’s ring from Princess Cher, known as the wicked Princess of Death. Yet her intentions take a turn as she slowly becomes captivated by the princess. As their destinies become entwined, Penny grapples with a dilemma, torn between her pursuit of freedom and the unexpected connections she forges with Cher."]},{"title":"I Became the Emperor’s Cat","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Emperor’s Cat / 황제의 고양이가 되었습니다","“I’ll Become Human No Matter What!”","After a sudden car accident, I woke up to find myself reincarnated as a ‘cat’ in a novel.","It’s absurd enough to be reincarnated into a book I only read three chapters of, with no knowledge of the rest of the story, but to become a cat?!","Still, this cat might be a beastman.\nBefore I lose my life at the hands of the ruthless emperor,\nI’ll do whatever it takes to become human!","But… this emperor, known as a cold-hearted tyrant, is surprisingly kind to me, a mere cat.","The story of a cat… no, a person turned into a cat, navigating the imperial palace while eating garlic and mugwort!"]},{"title":"To My Beloved Foe","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa To My Beloved Foe","On the cusp of calamity, the dead have risen! Corpses that have long grown cold return to steal warmth from the living, and the natural order dangles by a single thread of fate—a pair of lovelorn enemies tethered intrinsically by ice and fire. Together, Selena and Millard may yet salvage an era that’s torn between bitter frost and scorching flame. They must enter the enigmatic Magic Tower with only one another to rely on, knowing they may never return…"]},{"title":"An Extraordinary Guardian","tags":["Drama","Fantasy","Supernatural"],"disc":["Read manhwa An Extraordinary Guardian / Extraordinary Guardian Deity / 남다른 수호신","Kim Hashin, a low-ranking guardian god, is determined to make his town the happiest there is and get promoted to a higher rank. But his plan goes awry when Nam Dareum, a girl with an extremely low happiness level and no will to live, moves to town. Now Hashin must do everything in his power to make Dareum happy so that he can save her and everything he’s worked for. As hardships and obstacles continue to mount, will Hashin manage to help Dareum find true joy in life and put his town back on top?"," "]},{"title":"Finding My Father’s Son","tags":["Action","Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoon","Webtoons"],"disc":["Read manhwa Finding My Father’s Son / Find My Dad’s Child / Heir to the Dragon Slayer Sword / 내 아버지의 아들을 찾아서","Upon her mother’s death, Jericho Hansen learns a shocking secret. Her late father, a man she never knew, was none other than the legendary dragon slayer Ezra Mibare. Not only that, but she has inherited his Dragon Slayer Sword, a fearsomely powerful blade that also talks… a lot. But when the Dragon Slayer lets it slip that her father may have produced a secret son, Jericho becomes determined to find her long-lost brother, and the journey to discover this mighty weapon’s true heir begins!"]},{"title":"I’m NOT Afraid of Wolves! [Official]","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa I’m NOT Afraid of Wolves! [Official] / Ookami Nanka Kowakunai! / 狼なんか怖くない！","Mei Inukai, a receptionist at an IT company, is a huge dog lover. One night, during a full moon, she discovers a weakened wolf and can’t resist taking it in. But when she wakes up the next morning, she finds an unfamiliar werewolf in her bed who both attacks and kisses her! To her astonishment, the werewolf turns out to be Subaru Kageyama, the feared president of her company. With his secret exposed, Mei is unexpectedly appointed as the president’s secretary…! Dive into a supernatural and steamy office romance featuring a cold werewolf president and a dog-loving, kind-hearted secretary!"]},{"title":"Surviving As A Maid","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Surviving as a Maid / 시녀로 살아남 / Sinyeoro Saranamgi / Hizmetçi Olarak Hayatta Kalmak / 시녀로 살아남기","When I opened my eyes while cooking ramen, I woke up as the Queen’s maid who was treated coldly by the King in the BL novel where the King was gay, the concubine was gay, the knight was gay, the servant was gay, and the librarian was gay. Will she be able to survive safely after becoming an ordinary maid, Ash, who has no main character buffs? How will the maid survive!"]},{"title":"The Maid No Longer Desires her Master","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Maid No Longer Desires her Master / 하녀는 더 이상 그를 원하지 않는다","Lynn has never had an easy life. A beautiful girl with pale silver hair resembling that of the Empire’s princess, she is sold to work in the Dukedom of Ereuputh. Elizabeth, the duke’s daughter, harbors jealousy towards the princess and takes pleasure in causing Lynn to suffer. Despite enduring in silence, Lynn’s life takes a turn when Martin, the young master of the dukedom, returns. He shows her kindness and she falls for him, knowing that it will only lead to heartbreak. Unable to resist, Lynn shares a passionate night with him, unaware that Martin is not the kind boy she used to know. For he’s had a taste of her, and he will never let her go…"]},{"title":"The Monster Duke Mistook Me for His Wife","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Monster Duke Mistook Me for His Wife / Mistaken as the Monster Duke’s Wife / 怪物公爵に妻と勘違いされています / 怪物公爵误把我当成了他的妻子 / 괴물 공작이 나를 아내로 착각한다","After a year possessed as an extra, I picked up the dying mastermind.\nBut this man seems to have amnesia.\n“What kind of relationship were we?”\nAnd a strange misunderstanding!\n“Whenever I see you my heart beats violently, my head hurts like it’s going to break, and I feel dizzy.”\n“Tha, that’s…”\n“What is it if it is not love?”\nThat’s not love, it’s because I smashed the back of your head.\n***\nDillian’s misunderstanding started then grew out of control.\n“If we’re not lovers, we’re a married couple.”\n“That’s not it…”\n“I will take care of it, I will pay you for the rest of my life.”\n“…”\n“So wife, you must not leave my side.”\nHis touch reached my foot. Slowly and smoothly his hand climbed up, wrapped around my ankle.\nAs if, it’s like I got shackled.\n“Lea, what if I leave, you will kill me?”\n“How can I do that?”\nHe responded lightly with a smiling voice.\n“I’m going to kill the man who took you.”\n…I think I got caught by the wrong one."]},{"title":"Second-Time Newlyweds","tags":["Adaptation","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Second Time Newlyweds / 2回目の新婚 / Jeunes mariés depuis 6 ans / Second Newlywed / Zurück zu einer Liebesehe / 두 번째 신혼","Jung Sein believed she found true love in Seo Ihan despite only knowing him for four months. Unfortunately, he leaves on an extended business trip right after their wedding. Having only met with him once in their six years of marriage, Sein can’t help but feel hopeless about their future together. But suddenly, Ihan shows up at her workplace as executive director! Not only that, he’s even trying his best to seduce her! Six years after their wedding, will Sein finally enjoy her honeymoon?"]},{"title":"The Princess Doesn’t Want to Be Spoiled","tags":["Drama","Fantasy","Romance"],"disc":["Read manhua The Princess Doesn’t Want to Be Spoiled / 公爵小姐不想被宠坏 / The Ducal Lady Refuses to Be Pampered","As the only daughter of the dukedom, she had been spoiled since she was a child to the point talking is troublesome to her. Because of political struggles, her family sent her to a mercenary group far away in the frontier. No high-end ingredients nor unconditionally pampering servants here, in the unfamiliar place with a cold-faced and cold-voiced mercenary leader, what a ducal lady like her should do?"," "]},{"title":"Angelica: My wife has changed","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Angelica: My wife has changed / 우리 아내가 달라졌어요! / 안젤리카 : 우리 아내가 달라졌어요","“Angélica, I can’t marry anyone but you.” After a long unrequited love, Angelica married Dominic, but he always seemed indifferent and cold. After an uncle’s betrayal, mountains of debt, a disowned family and her own suicide because she couldn’t take it anymore, suddenly, Dominic appears before her, obsessed and heated. “I don’t love you anymore, Dominic.” “I love you, Angelica. I will never let you down.”"]},{"title":"The Hero is Trying to Change the Heroine","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Hero is Trying to Change the Heroine / The Male Lead Is Trying to Change the Female Lead / 남주가 여주를 바꾸려고 합니다","She transmigrated into the barely mentioned extra character ‘Luberia.’ Of all things, it had to be in the wretched novel “Becoming the Emperor,” filled with war and disasters, where the heroine sacrifices herself for the hero and everyone dies! She had planned to hide her strength and live delicately and quietly, but… The male lead, ‘Caesar,’ keeps seeking Luberia out, and even goes so far as to propose marriage, expressing a desire to keep her by his side. Luberia, not wanting to meet the same fate as the heroine, tries her best to avoid Caesar, but due to his formidable appearance and persistence, she finds herself engaged to him before she knows it. Can Luberia survive without loving Caesar until the end?"]},{"title":"I Became the Only Healer in This World","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["이세계의 유일한 힐러가 되었습니다; Isegyeui yuilhan hilleoga doeeossseubnida; Я стала единственным хилером в этом мире; この世界で唯一のヒーラーになりました"]},{"title":"The Villain’s Sister Suffers Today","tags":["Comedy","Drama","Fantasy","Josei","Manhwa","Reincarnation","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Villain’s Sister Suffers Today / The Villain’s Sister is Suffering Again Today / 악당의 누나는 오늘도 고통받고","I was killed in a car accident while trying to avoid a stalker. Is this a reward for dying a miserable death? I was reborn as a character in a novel that had, not a golden spoon, but a diamond spoon. I thought I could live my life over again. Until I found out my brother was a budding psychopath. “Sister, how about this doll? Do you want it?” “Leave it.” “What about this doll?” My younger brother ties people up so they can’t move, and insists on them being dolls. Even I am destined to be killed in the hands of my brother. ‘Let’s leave my little brother to the heroine of the novel before that day comes!’ But… my brother killed the heroine…"]}]