[{"title":"The Tyrant Princess Wants to Get Married!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Tyrant Princess Wants to Get Married! / SSS Romance Collection / The Tyrant Princess Wants to Get Married! , There is Magic in Winter in Nordfield , There is Magic in Winter in Nordfield , Embroidering Sword Master , Plowing Hero , Blackboard Graffiti , ANT STUDIO Romance Short Story , 앤트스튜디오> 로맨스 단편선 , 앤트스튜디오 로맨스 단편선 , SSS급 로맨스 단편선","Ant Studio collection of short romance stories which publish once a week. Currently 5 stories are lined up."," "]},{"title":"Chalkboard Doodle","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read Chalkboard Doodle / SSS Romance Collection / 로맨스 단편선 / ANT STUDIO Romance Short Stories / ANT STUDIO Romance Short Story / SSS급 로맨스 단편선 / 앤트스튜디오 로맨스 단편선","Antstudio brings you a collection of five stories that transcend time and space, with each one filled with more love and romance than the last. This collection takes you from a world of demons versus humans to a manor full of unexpected relationships and magical surprises. After that, it brings you to a “sew”lful grand empire and then to a humble sweet potato farm full of lonely longing. Finally, you return to the present day as you reminisce about past loves by “drawing” on happy memories."," "]},{"title":"Dawn of the Predecessor","tags":["Action","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Dawn of the Predecessor / Dawn of the Predecessor: Prelude – Dawn of the Whole Body / 전신의 새벽 – 전신의 새벽:프렐류드","In an era where myth and reality meet, gods and heroes from ancient myths such as Greece, Rome, Judea, Egypt, etc. are recreated in the 21st century real world. The protagonist Yoo Geon is gaining new senses and powers through a process called ‘awakening’. As his new senses open, Geon sees what others can’t see and realizes that the world is changing. Geon grows up experiencing curiosity about the world, awareness of the unjust reality, adolescence, and love. However, he also faces the threats and dangers that the new world brings."," "]},{"title":"Wishing For Luck","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Transmigration"],"disc":["Read manhwa Wishing For Luck / 행운을 뷰틱해 / Wish You Luck"]},{"title":"My CP Is So Sweet That I Want To Have A Love Affair","tags":["Manhua","Romance"],"disc":["Read manga My OTP / CP磕到想恋爱怎么办？/ My CP Is So Sweet That I Want To Have A Love Affair / My CP Is So Sweet That I Want to Have a Love Affair / My OTP Is So Sweet That I Want To Fall In Love","Zou Ming is a ‘chunibyo’ girl who wants to have a love affair because her CP is so sweet. Li Dong Xu is someone who is looks very honest and innocent, but is actually mischievous and sultry. Who says that STEM students are bad at romance? Who said that love at first sight does not exist? An ignorant first love, filled with a faint sour- sweetness of lemon, quietly blossoms on one random summer…"," "]},{"title":"The Devil You Know","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Psychological","Romance","Smut"],"disc":["Read manhwa The Devil You Know / Mr. Devil / The Devil You Know / 미스터 악마","After eight long years away, Eunseo finds herself back in Korea. When her best friend Mi-yo offers her a place to stay while she gets back on her feet, Eunseo only ever intends to rest for a while before getting out of her hair. The problem is, Eunseo’s demons have come looking for her much sooner than she was expecting, and she soon finds herself facing one in particular. Kang Mido may be somewhat happy that she’s back, but he sure isn’t happy about her leaving in the first place. Determined to stop her from running away again, Mido resorts to drastic measures. Eunseo is in a predicament, there’s no doubt about that, but you know what they say: better the devil you know…"]},{"title":"Villainess with a 0% Survival Rate","tags":["Drama","Isekai","Magic","Romance"],"disc":["Read manga Villainess with a 0% Survival Rate","If you make the wrong choice, you will die instantly! The worst Otome game ever with death is about to begin! One day, the protagonist receives an email from her former best friend saying, “I finished developing the game we used to make together, and I’d like for you to play it.” However, the day after playing the game, she wakes up and finds herself as “Diana,” the villainess of the game! Moreover, she has entered the “extra mode,” in which Diana is the heroine! In this mode, her favorability with the male characters starts in the negatives, all of them seem to resent Diana. Can Diana survive this game of death?"]},{"title":"MAVE: Another World","tags":["Drama","Fantasy","Manhwa","Shoujo","Showbiz"],"disc":["Read manhwa MAVE: Another World / MAVE: Dunia Baru / MAVE: もうひとつの世界 / MAVE: 另一个世界 / MAVE: 또 다른 세계"]},{"title":"Reclusive Mage","tags":["Action"],"disc":["Read manhwa Reclusive Mage","“Would you like to run away forever, or would you prefer to hide forever?”","One day, portals called “channels” opened up across the world, connecting different dimensions. As these channels opened, beings from other dimensions began to emerge on Earth, and humanity started awakening to magical abilities.","However, long before the channels opened, the protagonist Yoon Minjun could already use magic."]},{"title":"Welcome, It’s Your First Time Seeing a Cute Villainess, Isn’t It?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Welcome, It’s Your First Time Seeing a Cute Villainess, Isn’t It? / The Cutest Little Villainess / 어서 와, 귀여운 악당은 처음이지? / かわいい悪党は初めてですか？ / 恶党也会这么可爱吗?","I found out about a shocking truth after my final return to my hometown before dying.","It was that my dying self who was unable to cure my own illness due to the lack of finances was actually Sophia Herman, the youngest granddaughter of the Herman family, the greatest villain-like family of the empire!","If she hadn’t kidnapped me…!\nIf he hadn’t given up on my kidnapped self!\nDying like this, what a pathetic life…!","…Upon resenting the world and opening my eyes, I returned to when I was 9 years old.","The notorious dukedom?\nI shall use them as my financial support to cure my illness and break through this damned fate of mine!\nOnce I’m done with you, I shall leave you for good!","In the end, will Lithian, no, Sophia Herman’s third life go the way she wants?"]},{"title":"Re: Life Player","tags":["Action","Adventure","Manhwa","Post apocalyptic"],"disc":["Re: Life Player manhwa, 리라이프 플레이어, Relife Player\nNoh Eun-Ha, the < Undead >.\nI had returned from brink of death on the deepest floor of the , a Black Dungeon that was deemed impossible to clear by humanity.\nIn my previous life, I lived in order to die, and I lived because I couldn’t die.\nI had lost my family, shut off my heart, and wanted to die while burning my hatred towards the monsters.\nEven though I had desperately wanted to live, wanted to find a reason to live, I was just afraid of looking back on my life of fulfilling my empty heart by killing something.\nIt will be different in this life."]},{"title":"Prince’s Pampered Wife","tags":["Fantasy","Historical","Romance"],"disc":["Read manhua Prince’s Pampered Wife / Mad Concubine Provoking and Offending People: The Prince Unbridledly Spoils / Rě Huǒ Kuáng Fēi: Wángyé Fàngsì Chǒng / Wild Concubine Stirring up the Fire: The Prince Wantonly Pampers / 惹火狂妃：王爷放肆宠 / 惹火狂妃：王爺放肆寵","By a curse passed down from generation to generation, he was destined to live a solitary life, but then he met the evil Suliuan. “Sir, someone wants to push your wife into the water!” No hurry, throw them into the well. “Lord, someone is openly insulting her!” “Do not worry, chop him on the road.” “Sir, your wife has run away again.” “No hurry… Wait, which way?!” He had everything under control, but he is so submissive that he runs after his wife."]},{"title":"The Fake Was Thrown Away","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Fake Was Thrown Away / Fake Was Thrown Away / 가짜는 버려졌다","“[Even if they call me a fake saint, it doesn’t matter. I’ve gained the power to seek revenge with trustworthy comrades.] For a long time, I lived as an empire’s hero’s cure. I participated in countless demon subjugations, shedding blood without end. Then, one day, A woman appeared, claiming to be the real saint. “How could she deceive everyone for so long?” “I can’t believe it. Doesn’t she feel any shame?” And then, as if waiting for it, they all turned their backs on me, Pointing their fingers at me as a ‘fake.’ “I’m not doing it.” “…What?” “I said I’m not going to be a saint.” “….” So, in my anger and recklessness, I beat them all to a pulp. When I dropped the mace I was holding on the ground, The solid marble floor instantly shattered. “That’s why I told you, the ones who are doing well should stick together.”"]},{"title":"Please Throw Me Away","tags":["Drama","Fantasy","Romance","Webtoons"],"disc":["Read manhwa Please Throw Me Away / Campakkan Aku! / I Want You to Throw Me Away / Naleul Beolyeojuseyo / Please Leave Me Behind / Please Throw Me Away / 私を捨ててください / 请拋弃我 / 나를 버려주세요 / Just Leave Me Be\nAdele was adopted in replacement of a lady who died from a rare disease. She worked her entire life so she would be loved, but as soon as her younger sister was born, she was abandoned. Then on Adele’s way to an arranged marriage, she was assassinated by mysterious enemies. “…Is this a dream?” But when she opened her eyes, she returned to 3 years in the past! Since she is destined to be abandoned when her younger sister is born, this time around, she tries to live the way she wants, but things keep going wrong. “Weren’t you interested in me?” And a mysterious knight in black keeps pursuing her…"]},{"title":"The little princess","tags":["Drama","Historical","Romance","Slice of Life","Webtoons"],"disc":["Read The little princess / 君上的小公主 / His Majesty’s Little Princess / Junshang De Xiaogongzhu / Monarch’s Little Princess / Tiểu Công Chúa Của Đế Vương / Маленькая принцесса Его Величества / الأميرة الصغيرة","There are many hidden families in the world, and all major families have practiced mysterious yellow magic. As the richest country on this continent, the country of Nu zun is not only rich in resources, but the people in the palace are all talented individuals. The most important thing is that the first queen Bailuo, that is, Luo Jiujiu’s father, is the leading god of war in the Nu zun country. Not only is he talented, he is also the strongest fortune-teller. Many invading countries have been defeated by him, and many small countries in the hermit family want to marry their sons and princes to the country of Nu zun princess, to make the country of Nu Zun their ally."]},{"title":"Choose Your Real Daddy Tyrant","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Choose Your Real Daddy Tyrant / My Father is a Tyrant / Choose Your Real Daddy Tyrant / 다음의 폭군 중 친아빠를 고르시오\nDr. Jaehee Cheon, who lost her parents at early age and can’t remember their face, who has lived without a single friend, let alone a lover, reincarnated as the unlucky princess in a novel that dies at the age of twelve!\nIf we can’t find the princess’ biological father, she will die. But apparently there are four candidates??? And the bigger problem is that they are too deadly….\nWill Chun Jae-hee be able to find her real father safely and have a happy ending?\nChoose Your Real Father From the Following Tyrants"]},{"title":"A Fool and A Girl","tags":["Fantasy","Mature","Romance"],"disc":["Read manhwa A Fool and A Girl","Diha was ashamed and embarrassed to engage in a relationship with Rujin who lived under the same roof as her. But eventually, they coveted each other and allowed their instincts to lead. They never knew the feelings of love, but together, they’ll search for it."]},{"title":"WIFE OF THE WEALTHY: THE MARSHAL IS TOO DOMINEERING","tags":["Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua WIFE OF THE WEALTHY: THE MARSHAL IS TOO DOMINEERING / The wealthy wife the marshal is too domineering / Haomen Jiao Qi: Shao Shuai Tai Bàdao Háomén Jiāo Qī: Shǎo Shuài Tài Bàdào / Wife of the Wealthy: The Marshal Is Too Domineering / 豪門嬌妻：少帥太霸道 豪门娇妻：少帅太霸道","[Adapted from “Half Life Ups and Downs Just for You”, the comic has made major changes to the plot, please be merciful!] She is the daughter of a defeated army, and there is too much pain behind her marrying into a wealthy family. He is a domineering young marshal, under his cold eyes there is tenderness only for her. “Yun Jiashu, how are you going to compensate me for what you did before!” She complained to him, but Young Marshal Bingshan couldn’t help laughing, “My dear lady, is it enough to compensate you for my husband’s life."]},{"title":"Princess Herself Is the Queen of Broken Hearts","tags":["Comedy","Drama","Fantasy","Historical"],"disc":["Read manhwa The princess after she has had her way / 公主她始乱终弃后 / Gõngzhú Tã Shì Luàn Zhõng Qì Hòu / The princess after she has had her way with you / The princess after she has abandoned you / I Played with the Lord’s Feelings","What if she unknowingly abandons a powerful king? A year ago, Qiu Xingchen, a princess of the Zhou dynasty, met Yan Xuan, a young king who was on a trip to the Yeh dynasty. The king, who was not smiling and looked like a stranger, hooked his fingers and said with a cold smile: “Want to run away? It’s too late! The first thing you need to do is to pay a price for your manipulation of the king."," "]},{"title":"Keep Calm Mr Song","tags":["Manhua","Romance"],"disc":["Read Keep Calm Mr Song / Mr Song Keep Calm / Mr Song Please Calm Down / Sòng Xiānshēng Qǐng Lěngjìng / 宋先生请冷静 / Keep Calm, Mr Song","Shi Baba accidentally trapped in a book named “Lovely Wife of the CEO” and she is forced to complete tasks! Or else she will return to the beginning of this book! Shi Baba, now known as Bai Chuxiao, gets really fed up in this cliche romance with a bossy ceo so she finds herself an ally to help her. And this handsome ally is actually the most unpredicatable character in the plots…"]}]