[{"title":"The Fake Duchess In Distresss","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa The Fake Duchess In Distresss / I Was a Substitute / ニセモノ令嬢には野蛮な公爵様し かいない / 나는 대용품이었다","For all of her life, Chariet has lived a life of privilege and nobility, as the beloved daughter of the Duke and Duchess Teardrop. That is, until the real Chariet returns and usurps her identity. In an effort to restore her dignity and her life, Simponia (the “fake” Chariet) scopes out a new life of her own, traveling the harsh winter cold of the dreaded Monazart territory and becoming its Queen. Her title is both a business strategy and business contract, but with every passing day, her fondness for Blush Monazart grows."]},{"title":"Will My Doting Husband Love Me Again?","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Will My Doting Husband Love Me Again?","How do you win over your husband… while in another woman’s body? That’s precisely the task at hand for Adeline Tiaget – formally known as Charlotte Valerian. When Charlotte’s step-father’s incessant scheming leads her to be poisoned to death, she is given a chance to live on in the body of the most beautiful woman in the empire. Now, all there’s left to do is exact her revenge and make her former husband fall in love with her again"]},{"title":"Welcome to Horong Café","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Welcome to Horong Café","“Horonggak” is a very famous café that everyone wants to visit these days… the only problem is that it’s never open! But behind these café doors is a haven for stranded vagrants. Grandma Mago, a deity from Jeju Island, with the help of Woojin and Jachungbi, finds vagrants who have lost their way and brings them back to the café. But with so many of these vagrants being bad or mischievous, will Mago find a way to help them get on the right path to living in their new home in Seoul?"," "]},{"title":"Never Let Go of My Ex-Husband","tags":["Drama","Josei","Manhua","Romance"],"disc":["Read manga Never Let Go of My Ex-Husband / Never Let My Ex Go / อย่าปล่อยมือจากอดีตสามีของฉัน","Shi Weiyi, the second elder daughter of the Shi family, abandoned her husband and stepson and ran away with another wicked man, but was in the end murdered by the wicked man and her half sister. When she came to her senses again, she found herself reincarnated and had a vague memory of being locked up by a silver-masked man. Who is this silver-mask? How was she murdered in her previous life? Why couldn’t she like her stepson and who is his mother? In this life, she will figure these all out and seek her own vengence."," "]},{"title":"There is no forgiveness from the regressed lady","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa There is no forgiveness from the regressed lady / 회귀한 영애에게 용서란 없습니다"]},{"title":"What, You Dare Pretend in Front of Me, the Strongest in the Immortal World?","tags":["Action","Adventure","Fantasy"],"disc":["Read What, You Dare Pretend in Front of Me, the Strongest in the Immortal World?","The world beyond the ancient mirror and the immortal realm within were originally one entity. The true power of this world lies in the hands of the divine beast with the title “Light,” who battles against a formidable enemy, the divine beast with the title “Dark.” In order to prevent the extinction of humanity, the ancestors of Cheng Song sealed off the immortal realm from the human realm using the ancient mirror, with the assistance of the divine beast of Light. Only those with the bloodline of the Yu family can activate the bronze mirror and enter the immortal realm."]},{"title":"Like Tomorrow Too","tags":["Drama","Fantasy","Manhua","Romance","Shoujo"],"disc":["Read Like Tomorrow Too / 明天也喜欢 / Love You All Along / Mingtian Ye Xihuan","The first time Lu Jingyan met Sheng Xian was at a bar, she had no signal on her mobile phone, so she asked him to borrow the internet, and asked him what is the mobile phone hotspot WiFi? Sheng Xian said: Your birthday. Lu Jingyan felt that Sheng Xian must like her by using her birthday as a password, so she began to hook up with Sheng Xian overtly and secretly. Half a year later, she accidentally discovered that Sheng Xian’s WIFI password was…"]},{"title":"I Was the Real Owner of Elheim","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Was the Real Owner of Elheim / 진짜 가주는 나였다 / Aku sebenarnya pemilik Elheim yang Asli","Awakener of the Water Clan. I was called as the disgrace of the duke of Elheim and was used as a sacrifice for my twin. In this life, I gave up everything and left the family holding the villain’s hand. I rescued the patriarch of the villain family, the former duke, and the heir one after another. But the villains are acting weird. “Lili, do you want me to buy you the Imperial Palace?” “Liarte, Grandpa brought some candy.” “I told you this, you’re the only one for me.” Somehow everyone seems to be tamed, maybe it’s a mistake…….?"]},{"title":"Making Love in a World Where It’s Taboo","tags":["Fantasy","Romance","Shoujo"],"disc":["Read  Making Love in a World Where It’s Taboo","“You want to make a baby with me, right?” Having never made love before, The Prince and his wife are in for a steamy night. Once they get a taste, they’ll never be able to go back…"]},{"title":"My Knight in Shining Armor","tags":["Drama","Fantasy","Romance"],"disc":["Read My Knight in Shining Armor / Exclusive Dragon Maiden Knight / Exclusive Knight (Yeyue Wenhua) / 餓龍少女的專屬騎士 / 饿龙少女的专属骑士","After the loss of her mother and her own memories, all Meredith remembers is that she is a dragon trying to become a human. She’s not quite sure how to make that happen, but when she runs into a handsome knight by the name of Leon, he’s willing to teach her the ways of humanity. How to master civilized manners, how to dress…and maybe even how to fall in love."]},{"title":"Kill The Male Yandere Protagonist","tags":["Drama","Fantasy","Romance"],"disc":["Read Kill The Male Yandere Protagonist / 杀了病娇男主","I found myself empathizing with the female lead Aierfei in the novel! To escape the anguish, I emailed the author, asking them to stop the male yandere protagonist from tormenting the female lead. As soon as I opened the reply, I was transported into the novel as Aierfei! When I saw the male protagonist who had slapped me, I had only one option left. The male protagonist? Just kill him."]},{"title":"The Hero Defeats the Bullies","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Hero Defeats the Bullies","The hero who saved the world by defeating the demon king is summoned to a toilet bowl gang school?! A hero from another world summoned to the worst gang gathering place, “Suseong South High School.” Although he is a hero who does not use his power on humans, he faces the reality of bullies like “demons” and starts true education…! Can the hero defeat the bullies and return to his own world?"]},{"title":"The Betrayer","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read The Betrayer / 噬主","Alans, who is most likely to sit on the throne, was actually stabbed in the back by his most trusted subordinate Warek during the campaign, and was reduced from a high lord to Warek’s forbidden."]},{"title":"Divorce Plan","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Divorce Plan / 이혼 전략 / Divorce Strategy","One day, my friend who was like a sister to me confessed that she was pregnant with the child of my husband. “Congratulate me, Ariana.” Let alone apologizing to me, my friend shamelessly asked for my blessings. “Stop speaking nonsense. You think we can divorce?” Is what my impudent husband, a son-in-law who came to live in my home, and someone who became a count, said. Although this was a marriage of convenience to settle my family’s debt, I’ve fought so much for the sake of this married life… “There’s no doubt that divorce is the answer.” However, the issue lies in our marriage contract. The one who claims a divorce first will be charged as high as five hundred billion in compensation! The only thing I’ve inherited from my father, who spent all his money to stop our cultural assets outflowing, is the eye to appreciate beautiful things. It’s an eye that’s useful to a divorce plan which would make you speechless for many reasons! “Just you wait, Rowen, you’ll fall in ways your poor imagination could never reach.”"]},{"title":"The Cursed Prince and His Clairvoyant Maid","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Cursed Prince and His Clairvoyant Maid / 들풀을 밟지마세요","When her mother vanished 15 years ago, she told Giselle to mark her words. “Never leave the imperial palace no matter what.” Hoping that her mother would one day return, Giselle continued to work as a maid in the Moonlight Palace as a lonely outcast. One day, she was ordered to move to the Sun Palace where she would personally serve the crown prince. Giselle is concerned as Levan Klonitzsche was a fickle character known to fire his maids often. What would happen to her once she got fired? Would she have to leave the palace forever losing her chance of reunion with her mother? But much to her surprise, the crown prince,,the man whom he sees in her prophetic dreams, takes a liking to the purple-haired girl. Giselle is not only a beautiful girl who speaks her mind, but unlike the previous kowtowing maids, but her touch also magically seems to relieve his pain, a curse which has been tormenting him all his life. Will Giselle be the one to forever free him of his affliction?"]},{"title":"Phantom Thief Sapphire","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Phantom Thief Sapphire","“I want you to be my wife and the mother of this child.” One day, Sapphire comes across David, a little boy with amnesia, and she takes him into her care. Despite not being a real family, they live happily together until Duke Krist Galbraith, the police chief, appears on her doorstep, claiming to be David’s father. Upon seeing David’s reluctance to leave Sapphire, Krist proposes marriage to her. However, Sapphire harbors a secret she cannot share with anyone. If it is revealed, not only will Krist divorce her, but she could also face immediate execution!"]},{"title":"The Price of Desire","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Price of Desire"]},{"title":"My Father, the Possessive Demi-God","tags":["Drama","Fantasy","Historical","Magic","Manhwa","Romance"],"disc":["Read manga/manhwa/manhua My Father, the Possessive Demi-God / Mon père demi-dieu tombé du ciel / One Day, My Dad Showed Up / 어느 날 아빠가 나타났다","Young Claire lives with her mother and her twin sister in a humble country home. Feeling mature for her age, Claire is tired of being different from everyone she’s ever met. However, when her father suddenly appears, she realizes that she wasn’t the only “strange” one in the family. As she slowly learns about her family’s past, she understands more about herself and her destiny."]},{"title":"Legend of Star General: Side Stories","tags":["Action","Adventure","Manhua"],"disc":["Read manhua Legend of Star General: Side Stories / 星甲魂将传外传 | legend of star general side story | Legend of Star General: Spin-off"]},{"title":"I’m stuck in a crazy drama","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m stuck in a crazy drama / 막장드라마에 갇혀버렸다","The female lead, who grew up as an orphan, finally achieves the dream of owning a home after much hardship. However, her joy is short-lived as she experiences chest pain and a sudden death while watching her favorite drama. When she opens her eyes again, she finds herself inside the crazy drama that she was watching before she died! Even worse, she has reincarnated as Shin Sera, the villainess who tries to kill the female lead and is ultimately destroyed by the male leads!"," "]}]