[{"title":"Knights Restaurant","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Knights Restaurant","“Reversing the hourglass of blessings.” Blessings? At this point, isn’t it a curse? After 99 regressions, Chef Baek finally succumbed to the demon.."]},{"title":"Let’s Take a Bath, Duke!","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Let’s Take a Bath, Duke! / Shall We Bathe, Your Grace? / Duke, Let’s Take A Bath! / 공작님, 우리 목욕합시다!","I wanted to find love like the female protagonists in a romance fantasy novel.\nBut I can’t stand their hygiene! I can’t stand it!","“Nadia.”\n“Ah, please give me a moment.”\n“Is something wrong…? You suddenly look–”\n“Please stay away from me… Ah… urgh!”","But what should I do?\nI’m just a noble lady and I was just an ordinary citizen so I wouldn’t know any modern water facilities.","Meanwhile in the North, where I followed my sister, I was told the Duke had gone mad.","“Duke Claude Cartein had become strange since being seriously injured. He took a bath every day. Has he gone mad?”\n“Goodness! I’m only telling you to be careful since you are still unmarried. No matter how high your position is, your reputation will be damaged…”","That’s it.","“Even so, the former Duke and his wife are in a hurry to marry him off…”","It’s this person.","“Me! Marry me. Get married to me so you can take a bath twice every day!”\n“What did you just say?”","Love, it’s finally worth looking for."]},{"title":"I Tamed a Tyrant and Ran Away","tags":["Drama","Fantasy","Historical","Josei","Manhwa","Romance"],"disc":["Read manhwa I Tamed A Tyrant And Ran Away / The Taming of the Tyrant / 驯服暴君后逃跑 / 폭군을 길들이고 도망쳐버렸다","God gave me a chance to relive my life. Before my rebirth, I’d been used for the past 400 years as the empire’s sword. And so, I swore to destroy the empire. I found the young prince of the country and became his teacher. I taught him how to become a tyrant and asked for the country.\n“I will do as the lady wishes.”\nHe conquered the whole empire for me, and I ran away.\n“I came to take you, Charlize Ronan.” Dylan had become a perfect tyrant and searched the entire empire for me.\n“You tamed me, so why did you run away?”"]},{"title":"Let’s Meet After Work","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Let’s Meet After Work / See You After Work / Temui Aku Sepulang Kerja / 仕事終わりに会いましょう / 퇴근 후에 만나요","Three years ago in Spain, Chaewon had to break up with her boyfriend, Seongjun Han, because her father collapsed after his company went bankrupt. In order to pay the debt her father owes to his former employees and loan sharks, she decides to take part in a posthumous marriage for 200 million won. As a condition for the marriage, she’s not allowed to date anyone for 1,000 days. On her wedding day, she runs into Seongjun, who still has feelings for her, and now she has to work part-time at his company for three months."]},{"title":"Dad, did you study today?","tags":["Comedy","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Dad, did you study today?","Dad, did you study today? : Not only did Zhou Qing have no system, even the father of the original body was also a passerby, an ancient dandy! He doesn’t know how to farm and raise pigs, but he is good at eating chicken, which doesn’t fit the identity of a farmer! In order to live a prosperous life like all isekai Heroines, Zhou Qing embarked on a path of no return and urged his father to study."]},{"title":"I Know Your Secret","tags":["Drama","Horror","Josei","Psychological","Romance","Thriller","Tragedy"],"disc":["After she was nearly killed and then rescued, Ruan Ruan lost all her memories. Her savior, Ding Xiao, treated her with all the tenderness in the world; she completely let her guard down in the face of his perfect image. After figuring out the identity of her attacker, Ruan Ruan naively thought they were heading toward a happy ending. However, after discovering Ding Xiao’s secret, her world turned upside down! With danger looming on all sides, will she continue to be the prey, or will she become the hunter?","Wo Zhidao Ni De Mimi / Wǒ Zhīdào Nǐ De Mìmì / 我知道你的秘密"]},{"title":"Samwol Kim the Coffee Fox","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Samwol Kim the Coffee Fox"]},{"title":"I’m tired of Novel Transmigration","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m tired of Novel Transmigration / Tired of Living in Fiction / The Exhausting Reality of Novel Transmigration / I’m Sick of Being Transmigrated Into Books / Novel Possession Is Boring Now / Novel Transmigration Is Boring Now / 책빙의는 이제 지겹다","I’ve had enough of being transmigrated into books.","You would be tired of it too, especially if it was already your fourth time doing it. This time, I became the female lead’s villainous older sister.","‘Oh, I’m so sick of this.’","Yet again, I was sure this life wouldn’t be exciting either. I had led straightforward lives before, and then I died and moved on to the next.","But why was it that this iteration was a tad different?","‘Why can I use the abilities I had in my second transmigration?’","‘Why is the female lead bothering me so much?’","Alicia, this novel’s protagonist, was fated to have a poor, emaciated life. However, considering that she was this novel’s true heroine, I couldn’t just let her roll through the mud like this. I would do everything in my power to change her fate.","‘My younger sister, don’t become the female lead this time.’","To achieve my goal through a project hereby dubbed as the [Mob-Alicia Project], I’ve recruited the male lead’s older brother.","Cassion Carter.","He was the villain who was almost killed—no, was fated to be killed—by the male lead.","“If you want to live, promise me one thing.”","As if he was a wild beast that had been hunted and left to die alone, he breathed with incredible difficulty. I reached toward the poor man’s face and caressed his cheek, leaning down to whisper softly.","“If I save you…”","Lay down your own life on the line to protect my sister."]},{"title":"The Jangsan Tiger","tags":["Drama","Fantasy","Romance","Supernatural"],"disc":["Read manhwa The Jangsan Tiger / 神장산범","No luck in love, money or family for Hong Sia. One winter day, she picked up a cat, no, the Jangsan tiger?! Eh?! I imprinted on the Jangsan tiger, a beast with transcendent powers?!! “I decide the fate of my contractor.” A beast man, no, a life changing thrilling romance with a real beast!"]},{"title":"Senior is Bad!","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Bad Senior / 선배는 나빠요!\nLily is only attracted to bad guys and has never dated anyone in real life. While waiting for a bad guy and rejecting all the good guys who approaches her, she meets Hyun-woo, the school’s top trash senior. Lily goes straight to Hyun-woo, her ideal type for a thousand years, but Hyun-woo’s reaction is cold and painful. She experienced this all by herself and it’s rather good?!"]},{"title":"Rosalyn Bogarte","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Rosalyn Bogarte / Rosalyn Vogart","“Do you not think the husband is so beautiful his in-laws will bring him into sudden wealth?” Due to the luxurious spendings of the royal and noble families, the church and state of the Calabria Kingdom had collapsed. In order to obtain honor, the only thing they cannot obtain, being bourgeois, the Bogarte merchants try to marry off the black sheep of the family, their second daughter Rosalyn to the most beautiful person of the Calabria royal family, Crown Prince Robien… Honor bought with money, the fall of the royal family prevented with marriage… Can the two who ended up getting married embrace each other’s vulnerabilities and get closer together?"]},{"title":"The Land Lord’s Baby Retires","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Land Lord’s Baby Retires / The Little Landlady / 아기 건물주는 이만 은퇴합니다 / 赤ちゃん建築家、これにて引退させていただきます / The Baby Land Lord Is Retiring","In her third life, she was reborn as the only daughter of a villain that didn’t have blood nor tears.\nPeople lived in a house that was on the verge of collapsing, so she designed a building using her previous life’s knowledge.\nHowever, her dad caught her and—\n“We passed a bill that the building’s ownership would be given to the person who organized the building’s construction.”\nShe became the owner of a large building.\nLet’s just get some slush funds and retire!\n“The lady kept me from getting hungry!”\n“I can sleep in a warm, new house thanks to milady!”\n“Everyone’s youth employment rate rose sharply!”\nWhat did I do? Is it such a big deal that everyone had to praise me this much? To make things worse, my father found out about my plan to flee from home…….\n“What did I do wrong? I’ll fix everything, so don’t leave.”\n“T-That’s not it…….”\n“I’ll give you anything you want. Oh, right, didn’t the emperor’s son bother you? I can also cut the emperor’s neck, what do you think?”\nThen, like a bolt from the blue, he thought of starting a war.\n‘Why do I keep getting more work?’\n…C-Can I retire safely?"]},{"title":"Your Sound","tags":["Drama","Fantasy","Josei","Manhwa","Office Workers","Romance","Shoujo"],"disc":["Min Eun-hoo, general manager of JK Group. Handsome looks, wealth, and a strong future! He had everything, and at some point, the thought of an unknown woman begin to ring in his mind. while she was complaining of pain not knowing who the biggest hindrance in her life was, there was a woman she encountered like fate. The candidate who came to JK on the day of the interview to hire his assistant, Seo-yoon Ha! Director Min Eun-hoo, who can hear the sound of only one person’s heart, and Ha Seo-yoon, the owner of the sound, fall in love as if attracted to them!\n너의 소리"]},{"title":"I Was Reincarnated as a Baby Fox God","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Was Reincarnated as a Baby Fox God / I Was Reincarnated as a Beast Fox God / The Baby Divine Beast / 아기 신수로 환생했습니다"]},{"title":"My Lover’s Personality Is a Little Strange","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Lover’s Personality Is a Little Strange / 내 남자의 인성이 조금 이상하다","My lover lost his memory in an accident after falling off from a horse.\nHowever, it seems as though he has lost his sense of humanity along with his memories.\n“Stop pestering me and get out of my sight!”\nWhere has the kind man gone who would whisper sweet nothings to me, and who is this wretched man that has taken his place?\n‘A whole new level of a scumbag that will never be recorded again in Albrecht’s history’\n‘A man that is a beautiful piece of garbage that cannot even be recycled’\nWere the rumors about my lover really true?\nEven when he would hold hands or lock lips with his fiancée right before my eyes,\nI endured it all with the thought that I would beat them senseless once his memories returned, but…\n“You are pregnant.”\nHis child was growing inside me."]},{"title":"Theory of Paradise","tags":["Action","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Theory of Paradise / 낙원의 이론","The spoils of the Urban Alliance, ‘Yoo Eun-woo’ enters the Urban Alliance Central School as if kicked out of the military.\nThere, he meets ‘Seo Jae-hee’, the president of the student council, and ‘Jeong Yun-hwan’, a former member of the Urban Alliance, and there is no easy day…\nWhat about the ominous prophecy that came before these three?"]},{"title":"The Story of a Low-Rank Soldier Becoming a Monarch","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Story of a Low-Rank Soldier Becoming a Monarch, 말단병사에서 군주까지,","From the lowest foot soldier to the king:\nWhen I was 15, I lost my right hand on the battlefield. When I was 24, I mastered the skills that were necessary for my survival. But I was always told the same things, over and over: “Just quit. I’ll gray even faster if I try to teach you sōjutsu.” “But if you weren’t disabled, you could’ve learned anything you wanted, with nothing holding you back.” “Hey, let’s just collect herbs. Why are you so obsessed with swordsmanship?” “Just live like everybody else.” When I was 39, I lost my left hand and fell off a cliff. And when I swallowed the Artifact I had no knowledge about… [ Searching powers… ] – Availability for growth – Desire for knowledge – Abyssal greed – Power and tenacity – Talentless persistence -Reversing the instincts After the battle, I was reborn as a 15 year old rookie. 《Experience points increased! 》 《Experience points increased! 》 《Experience points increased! 》 《Experience points increased! 》 《Experience points increased! 》 From weather-worn mercenary Chris to young soldier Chris! It’s the story of a skillful lad that found the glory on the battlefield. It’s the story of a talentless man going beyond, overstepping the limits. It’s the story of an ordinary man becoming a knight. It’s the story of an unordinary monarch protecting his people. It’s the story of a man that returned to save his continent. 《Experience points acquired!》"]},{"title":"Angelic Lady","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Angelic Lady / 엔젤릭 레이디","Angela was my friend. I wanted to give anything to her, who I thought more precious than my own family. And I eventually turned Angela, a lowly aristocrat from the countryside, into the flower of the capital society. But it was betrayal that came back. She sold me and my family to become an imperial princess. “…did you have to go this far?” “Because I wanted you to be unhappy. I wanted to take your whole life away.” But when I thought I had died under the guillotine, I was surprisingly back in the past. “Oh, hello. My name is Angela Vito…” “You’re Angela! Nice to meet you. Everyone was waiting for you.” With a bright smile, I held her hands together again."]},{"title":"Beloved in-laws","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Beloved in-laws / 사랑받는 시집살이","Raina, the second daughter of a fallen Countess. Although she devoted herself to her family, she eventually got married to her viscount, and Reina thought that an even more miserable life awaited her. until you meet them! “Father, father, father. Which one is good to call? I like the last one… … . Absolutely no Viscount!” “You don’t have to do it if you don’t want to. If there is something you want to do, feel free to learn it.” Will Raina be happy with her new family?"]},{"title":"Overpowered Healer","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Overpowered Healer / 힐러인데 먼치킨","Summoned to another world and living as a mediocre healer, Sido, by a stroke of luck, begins to hear the voices of the gods. It turns out that the gods have been playing a long-term game with humans?!"]}]