[{"title":"I Think It Would Be Better For Me to Become King","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Think It Would Be Better For Me to Become King / 차라리 내가 왕이 되는 게 나을 것 같다","I accidentally got the game I wanted so much.\nThe moment I pressed the last option while enjoying my one-pick Cedric route,","[I dare put to death Queen Astarote, who pretended to be the blood of the previous kings!]","“You’re such a beggar, I’ll make it better than this even if I do it!”","got into the game.","“Goodbye, Astarote.”\n‘I just want you to die, Astarote.’","She broke through several routes and made her husband king, but in the\nend always death.\nI can’t. If you do this, you’ll just keep getting killed.\nNow there is only one way left for me!","“I would rather be king.”","[A new route has been unlocked.]","***","“I am going to try the test of His Majesty’s successor.”\n“… … Are you proposing to me now?”\nAll of a sudden, it’s kind of a nonsense, but this makes the conversation go faster.\n“yes. Marry me and be on my side!”\n“If your will is so, then it will be my destiny to follow.”\n“… … uh?”\nThings work out so easily.\nIt’s just weird that the papaboy Cedric makes an assertion without permission.\n“Ok, fine. I will accept your offer.”\nAt that moment, the clouds lifted and the bright moonlight illuminated the garden.\nIt wasn’t Cedric who appeared under the bright moonlight, but the Duke of Granada."]},{"title":"Bring the Love","tags":["Comedy","Drama","Historical","Romance"],"disc":["Read manhwa Bring The Love / Beuling Deo Leobeu / 브링 더 러브","Leah, the eldest daughter of the Hildebrandt family, is very popular in society for her beautiful appearance and good manners, but she has a problem she can’t tell anyone about. Her brother, Richt, who was the heir to the family, left behind a letter saying he would come back after becoming a great man. As it is not known whether Richt is dead or alive, and since her father suddenly dies, Leah decides to find a partner for a political marriage in order to support herself and retain her family’s position. However, something that starts as a mere political trick turns out to be fate!"]},{"title":"Trophy Husband","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Trophy Husband / 트로피 허즈밴드","Let me be your trophy. With her wealth, status, and godlike strength, Duke Serena has it all — everything but her heart, that is. Enter Ricardo, a charming prince who claims to know its whereabouts and proposes an alliance that would benefit them both. Is this mysterious suitor really the key to regaining her lost heart?"," "," "]},{"title":"Protect My Star","tags":["Comedy","Romance"],"disc":["Read manga Protect My Star / 保护我方大大\nLu Yan was an unknown trainee who acted cute in public, but headstrong and straightforward behind the scenes. One day, he was noticed by a popular influencer of the fandom world. She drew fanart of him and he became popular overnight. But, he wasn’t ready to accept how he became popular…"]},{"title":"A New Me at the Academy","tags":["Drama","Fantasy","Manhua","Romance","Royal family"],"disc":["Read manhua A New Me at the Academy","The Pentacle. Five handsome men. My new life at the academy. Who knew my life would take a turn?"]},{"title":"A Wish Upon A Star","tags":["Manhwa","Romance","School Life","Shoujo","Slice of Life","Super power"],"disc":["Read manhwa A Wish Upon A Star / 별이 빈 소원\nSeo Yeonji was dumped by her childhood friend. The day after she put a curse on him, she gained a strange superpower."]},{"title":"DEDES","tags":["Adaptation","Fantasy","Historical","Isekai","Mystery","Romance"],"disc":["Read manga DEDES","Isekai based on the history of Indonesia! A student suddenly wakes up in the body of Dedes, a girl who will become the mother of the Emperor of Java. However, the longer she was in Dedes’ body, she realized that the existing history was not entirely true."]},{"title":"Yeonhwajeon","tags":["Adventure","Comedy","Drama","Fantasy","Gender Bender","Historical","Romance"],"disc":["Read manhwa Yeonhwajeon / The Legend of Yeonhwa / Battle of Yeonhwa","Yeon-hwa has a special hobby; living two lives. ‘Chun-bok’, a blacksmith, during the day. ‘Baek Il-do’, a righteous man at night, with the ability to read memories by touching one’s palm! With this ability, Yeon-hwa encounters the ‘Milyeong’ cult who thought she had disappeared while searching for the reason behind her mother’s death. “Do you want to die knowing the truth, or live for long, without knowing anything?” Yeon-hwa, who has a strong body and the ability to read memories. Park Yi-hyun, who possesses outstanding martial art, but is weak in terms of intelligence. Kim Jun, with excellent brains, and an amazing writing capability."]},{"title":"Petty Relationship","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Petty Relationship / Occasional Relationship / This Flipping Relationship / This Kind of Fate / 이따위 인연"," "]},{"title":"Red Laurel Flowers to My Emperor","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":[" "]},{"title":"Your Majesty, Please Stop Now","tags":["Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Your Majesty, Please Stop Now / 폐하 이제 그만, 폐하, 이제 그만","Sharan is a pagan slave in the Valdek Empire. Every night in her dreams, she sees visions of a man wandering around, unable to sleep. The man is none other than Julian, Emperor of the Valdek Empire. He is suffering from severe insomnia caused by someone’s black magic, and Sharan wants to cure him of his insomnia in exchange for freedom from slavery. But Julian won’t let go of Sharan, who is the only thing that can save him, whether she’s a lowly pagan slave or the love of his life… Julian, the sleepless emperor. and the only one who can put him to sleep, Sharan, a pagan slave and the emperor’s shaman.Original Webtoon:"]},{"title":"Marry my husband","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marry my husband / 내 남편과 결혼해줘 / You Go And Marry With My Husband","“Please cut me some slack, okay? People who live need to live. You’re going to die anyway.….”","In front of me, who was sentenced to a time limit, my only friend cried sadly.\nI died in my husband’s hands without even meeting the time limit.","And","“Jiwon, lunch time is over!”","Ten years ago, I woke up from my company.","Another life given after death.","To change fate, someone has to enter my destiny instead.\nI chose ‘someone’ as my friend.","You wanted my husband."]},{"title":"Nightly Taming of the Werewolf Duke","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Nightly Taming of the Werewolf Duke / I Will Tame the Wolf Duke Tonight / 오늘 밤, 늑대 공작님을 조련합니다"]},{"title":"Your Majesty is a Beast","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Your Majesty is a Beast / Because Your Majesty Is A Beast / His Majesty is a Beast All of a Sudden / 폐하가 하필 짐승이라서","Bellia, the woman who saved the dying beast.\nAt that time, I didn’t know that he would change her life like this….","Khan, a man who reached out to Bellia, who was about to abandon the country and run away.\nUnlike an untamed energy, his gestures were sweet.\nHis whisper that he would change my shabby life was sweet.","“Let me heal you.”\n“Come with me.”","If you take one more step, you can hold his hand…\nMisconceptions pile up even before holding his hand.\nMeeting again, he was not an animal, but an emperor.","“Are you going to be the crown prince?”\n“Khan, I’m just…”","His question that I didn’t dare to answer. And…","“That night. You shouldn’t have saved me. You should’ve just let me die.”","It has been a long time since the appearance of a man who was endlessly sweet to repay his kindness disappeared.","“You saved the dying beast cub. You never know how the beast will bite you.”"]},{"title":"The Moment When You and I Meet","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Moment When You and I Meet / 당신과 나의 시간이 만나는 순간","Apparently I was so excited that I drank a lot and fell asleep in my room.","“Change your clothes and go down to the kitchen as soon as possible.”","What? is this real? Or am I dreaming now?","When I opened my eyes, I found myself possessed as a staff member in the kitchen of the Imperial Palace.","I did it as I would in a Korean restaurant, but it is no different in the Imperial Palace Kitchen. You can do it, Anna!","“Good. I’ll put a nice smile on that handsome face.”","She strengthened her will and began to cook seriously, successfully capturing the Emperor’s appetite.","but.\n“It tasted great at first, but I think I’ll feel it\nBored of it if it had the same taste.","This emperor seems to have a bad temper and enjoys torturing people.","“I”\n“I absolutely love it.”","Look, is it true that you like me?\n“Yes….",". “Your cooking.”\nI felt as if my heart, which was beating fast, would fall on the earth.","Hey? Is this really the case?"]},{"title":"Perhaps You’re Mine","tags":["Comedy","Drama","Fantasy","Josei","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Perhaps You’re Mine / Perhaps Mine","Mine, who has recently been fired from her workplace because of an incident, suddenly found herself a high-paying job. But as the nanny for the child of a handsome yet annoying widower! The kid is cute, but the Dad Why do I have to work with such a narcissistic boss?"]},{"title":"The Gray maid","tags":["Drama","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Gray maid / 재투성이 메이드 / Ashe: the coveted maid","There are rules that must be followed in this mansion- Never see, hear, or know the existence of the ” Secret Corridor ” and its manager. Hired in a mysterious mansion , Maid Ashe meets the hidden master of the mansion who has lived alone in the basement. The two, who were shunned around, continue to covet each other in the secret room…"]},{"title":"Soul Land iv – The Ultimate Combat","tags":["Action","Adventure","Martial Arts"],"disc":["Read manga Soul Land IV – The Ultimate Combat\nFollowing with nearly extinct Spirit Beasts and Soul Masters Joint force and archieve peace. 10,000 years have passed since the end of the battle of the Douluo plane with the Abyss plane. The abundant energy of the Abyss opened the door for soul masters and spirit beasts in the Douluo plane to reach knowledges, power, and ranks that were once impossible to achieve. The humans of Douluo Plane conquered the space and discovered the other planes."]},{"title":"The Tyrant’s Guardian is an Evil Witch","tags":["Fantasy","Historical","Isekai","Romance"],"disc":["Read manhwa The Tyrant’s Guardian is an Evil Witch / Nenek Sihir Ngasuh Brownies / 폭군의 보호자는 악역 마녀입니다","I seem to have reincarnated in the world of an r-rated romance fantasy novel. And not just as an ordinary character, but as the witch who loses her life to the crazy male lead!","Luckily there is a long 200 years until the main characters are born and grow into their roles.","Now that my life is not in imminent danger, shall we leisurely think of ways to avoid death?","However, I had not taken notice of a very important detail about the time I’d be spending ‘safe from imminent danger’. 200 years was by no means a short waiting period and by the time the younger version of the male lead appeared in front of me , I had completely forgotten the original novel’s plot!","Oh, whatever, now that it’s come to this, the only way to survive is to raise the male lead into a sane and stable adult! The first step to avoiding death by the hands of the tyrant male lead is changing this extremely frightened child’s life.","“It must be very inconvenient for you to have me suddenly show up on your doorstep, I’m sorry. You can tell me to go away, I’ll be fine.”","“Nonsense. Do I look like someone who could be inconvenienced by a little boy like you? Also, what do you mean by you’ll be fine even if told to go away? It’s not like you have anywhere to go back to, kid.”","The little boy burst into tears.","‘Oh, this is so not it.’ Was what the witch thought to herself as the little boy sobbed."]},{"title":"Dictatorship","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Dictatorship / 독재","“Friedrich Dürrenmatt once said, ‘It is only in love and murder that we still remain sincere.’ Since you’re still alive, does that mean I love you?”\nEvery single moment she’s kept alive will become his weakness.\nTo kill her or let her live? “You are very strange.” “You’re strange as well.” In his head, he had killed her many times and revived her just as many.\nHe who desires dictatorship so much to even spill blood, the Arab Sultan, Ashan Al Rujerta. And the girl who stands in front of that cruel man’s gun, Han Seoyoon.\n“This little game is over.” The girl’s favor to this frightening, honorable tyrant is as dangerous as a game of Russian Roulette. The Arab Federative Empire, Oman. The extraordinary sun of that empire, Aska. The way he laughs is so innocent and unbefitting of a country’s ruler. “Isn’t it suffocating?” “A little.” “Should we run away together?” She reached out her hand to him without thinking. If she said she was joking now, Aska would definitely chop her hands off. “Take responsibility for what you said.” That’s how Han Seoyoon kidnapped one of the greatest sultans of Oman."]}]