[{"title":"Strongest Anti M.E.T.A ( Ultimate Scheming System )","tags":["Adventure","Fantasy","Manhua","Martial Arts","Mature 3"],"disc":["Read Strongest Anti M.E.T.A  / Ultimate Scheming System\nScamming all day, every day, often venturing alone. He bluffs to get the ultimate power in this cultivation world?! world traveler Xue Que doesn’t always bluff, but he needs to."]},{"title":"The Black Haired Princess","tags":["Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Black Haired Princess / A Royal Princess With Black Hair / The Black-Haired Princess / Dark Haired Princess / Geom-eunmeoli Hwangnyeonim / La Princesa del Cabello Negro / La Princesa del Cabello Oscuro\nCrown Prince Karyuel and the neighbour country’s Princess Yurisien are married to each other but all they dream about is getting divorced as fast as they can! To make matters worse, the people around them also plot schemes to keep them apart. However, because they’ve experienced all kinds of adventures, they slowly became attracted to each other, unlike how they first met. Will the immature princess and crown prince head for a divorce like they first aimed for? Or… Will they stay with their marriage?"]},{"title":"Revenge Of The Twin Empress","tags":["Drama","Fantasy","Manhwa","Romance","Royal family","Tragedy","Villainess"],"disc":["Read manhwa Revenge Of The Twin Empress / 皇帝の殺し方","Catherine was born as one of the twins, who are believed to bring destruction to the empire. Unlike her sister Lithia, who is treated coldly and grows to despise her, bright and smart Catherine is faced with high expectations from her father. Selected as a candidate to become the Crown Prince’s consort and the future empress, Catherine falls in love with the second prince Allen during her visit to the palace. The precious moments they get to share together end abruptly when Catherine gets caught in the fire set by her sister, causing her to lose everything to Lithia.."," "]},{"title":"Rose Without Thorns","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Rose Without Thorns / Prickly Rose / Gasi Ppopin Jangmi / Mawar Tanpa Duri / Toge no nai Bara / とげのない薔薇 / 가시 뽑힌 장미","It was not easy to be the son and successor of a major hotel company. After spending his life for 16 years abroad, Yoo Seungha came back to Korea to succeed as an executive of his family’s hotel business. Seungha was an workaholic who was ignorant of love life, until he met Han Seyeon. Turns out, she is the concierge manager in the hotel owned by his family. The misunderstanding on their first meeting leads them to understanding each other. However, they come from very different family backgrounds, which eventually became the wall they have to overcome to make their relationship work. Can they overcome it?"]},{"title":"Hotel Temptation","tags":["Drama","Romance","Webtoons"],"disc":["Read manhua Hotel Temptation / 酒店的诱惑","In her past life, Liu Zihan was a cowardly girl who was bullied. After her father’s death, she was deceived by relatives and deprived of all her property. After her rebirth, she became the queen of mercenaries and turned into a female soldier from a weak woman. But in an accident, she traversed back to that weak and helpless time, but at the moment she already has good skills and knows the true side of everyone. So she decided to take revenge!"]},{"title":"Sweet Love","tags":["Action","Romance"],"disc":["In an attempt to save her senior whom she is secretly in love with, Su Mi approached Fu Yichen to seek his help. In a dramatic turn of events, Fu Yichen requested for her freedom and imprisoned her by his side in exchange for his help."]},{"title":"The Princess’ Spaceship","tags":["Adventure","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Princess’ Spaceship / 공녀님의 우주선 / The Lady’s Spaceship / Putri Luar Angkasa"]},{"title":"Memorize","tags":["Action","Adaptation","Adventure","Drama","Manhwa"],"disc":["Read manhwa Memorize / 记忆 / 메모라이즈"]},{"title":"Cat’s Bride","tags":[],"disc":["Read manhwa Cat’s Bride / Goyangiui Sinbu / La Fiancée du Chat / La novia del principe gato / 猫の花嫁猫王子的新娘 / 고양이의 신부"]},{"title":"Persistent Lover","tags":["Romance"],"disc":["Read manhua Persistent Lover / 偏执的他与落魄的我 / 사모님, 울지 마세요","Lan Youwei was diagnosed with breast cancer and her husband was cheating on her with her best friend.\nShe was kicked out of the house, and so desperate she decided to end her life, a man stopped her.\nXiang Lu has always loved Youwei in secret, but it looks like he isn’t as simple as his appearance."]},{"title":"The Library Needs A Witch","tags":["Historical","Mystery","Romance","Webtoons"],"disc":["Read manhwa The Library Needs A Witch / Librarian Witch / 도서관에는 마녀가 필요하다","A sudden arrival of letter to her one fine day.\nBy the request of the letter, the witch Bessi Ale returns to her homeland, Veyron Empire after having left it 16 years ago."]},{"title":"Once, It Was Love","tags":["Drama","Manhwa","Mature","Office Workers","Supernatural","Webtoons"],"disc":["Read manga Once, It Was Love / かつてそれは愛だった / Katsute Sore wa Aidatta / ครั้งหนึ่งเคยเป็นความรัก只有老公看不到我的世界 / C’était l’amour / Einst war es Liebe","Just like always, I made dinner and waited for my husband to come home. But when he came back, he kept ignoring me. He acted as if I wasn’t there. What’s more, after he finished dinner, he started checking his phone with a beaming face I had never seen before. It seemed like he was secretly texting with a girl. And that girl was none other than my younger sister… “Why did it have to be my sister…? She always takes away everything from me…”"]},{"title":"Irregular Empress","tags":["Action","Comedy","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Irregular Empress / Irregular Worker Empress manhwa","“Do you want to live as Estella instead of Estien?” A member of the famous Arthur family that went into ruin, Estien. Estien hid his talent and lived as a regular knight but one day the crown prince offered something weird.\nUndercover Empress, Irregular Worker Empress, Temporary Empress, Temporary Positioned Queen"]},{"title":"Transmigrating Through Every World To Be Your Black Lotus","tags":["Action","Adventure","Fantasy","Psychological","Romance"],"disc":["Read manhua Transmigrating Through Every World To Be Your Black Lotus / 穿越到每个世界成为你的黑莲花","The story between a crazy wolf-like general and a powerful black lotus female lead in an omegaverse (ABO) parallel world. She’s a cool and domineering person who transmigrated to different worlds and teach scumbags a lesson. Now in this world… is she going to fall in love? A love that might need to risk her life and get marked."]},{"title":"The Revenge of DanZhu","tags":["Action","Drama","Fantasy","Historical","Manhua"],"disc":["Reading Manhua The Revenge of DanZhu at Manhua Website","Ask Danzhu,\nTo Ask the Pellet and the Cinnabar,\nWen Dan Zhu,\nWèn Dān Zhū,\n问丹朱"]},{"title":"From an Evil Daughter to the Group’s Favorite?!","tags":["Action","Adventure","Fantasy","Historical","Martial Arts","Romance"],"disc":["Read manhua From an Evil Daughter to the Group’s Favorite?! / Vicious Daughter Becomes a Pet / 恶毒千金成团宠","While binge-watching a popular drama, Ningxuan unexpectedly transmigrated into the drama’s universe. She was the evil, arrogant fake daughter now, who relentlessly bullied the real daughter and kept causing trouble for herself. Whenever she thought of the terrible fate in store for her… “This is bad, this is a huge problem,” Ningxuan said anxiously. To avoid this fate, Ningxuan returned everything to the true daughter and even avoided conflict with the main cast at all costs to live her life in peace. And yet—”I was wrong about you. If it’s possible, can we start over?” The male lead said. Ningxuan responded, “What the heck? Bro, your true love is over there!” “Since the day you rescued me, my life has belonged to you…” The male supporting character answered. “Wake up! She’s your savior, not me!” Ningxuan retorted. The female lead exclaimed, “I know you’re the only person who treats me well in this world, so…once I get rid of all these men bothering you, you’ll be mine!”"," "]},{"title":"Please Eat Without Hesitation","tags":["Cooking","Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance","Slice of Life"],"disc":["Read manhwa Please Eat Without Hesitation / 거침없이 먹어 줘요 / Makan Tanpa Ragu / Mukbang Joseon","Hanna, a chef of a famous restaurant in London was a victim of terror bombings. When she woke up, she became Choi Songyi, the daughter of the Minister of War Affairs of the Joseon Kingdom. The Crown Prince of the Joseon kingdom, Lee Pyo has a extraordinary talent. His sense of smell and taste are very sensitive; he has never forgotten the taste and aroma of any food he’s ever eaten. What will happen if both of them meet?"]},{"title":"Obviously I’m In Love","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Obviously I’m In Love / 티 나는 사랑 / Obviously in Love","Contrary to the saying, “Love makes you beautiful,” Sa-ae has a lot of tension to show to the other person. Kim Nam-joo, a childhood friend, who gets confided in the agency after joining the company and gets treated for minor ailments. But Nam Joo doesn’t like this agent who doesn’t cherish each other… To make matters worse, Sa-ae finds out about her sloppy secret love affair from her boss, Shin."]},{"title":"Shadow Paradox","tags":["Manhua","Romance","Slice of Life"],"disc":[]},{"title":"I Woke Up 20 Years Later!","tags":["Drama","Fantasy","Isekai","Reincarnation","Romance","School Life","Villainess"],"disc":["Read I Woke Up 20 Years Later! / 起きたら20年後なんですけど! ~悪役令嬢のその後のその後~ / Okitara 20nen Nandesukedo! Akuyaku Reijo no Sono Ato no Sono Ato /  The Villainous Daughter’s Thereafter","20 years after a failed assassination attempt with poison, Fioria wakes to find she has all the memories of her past life. But the world she lives in is in fact the world of an otome game. And what’s more, she wakes up to find the story of the game is now 20 years after the original ending of the game! With her country in turmoil and the original heroine of the story turning out to be a spy, Fioria sets out to right these injustices and give payback to the ones who have wronged her! An action packed tale of justice, I Woke Up 20 Years Later! is a refreshing and exhilarating revenge fantasy story."]}]