[{"title":"Reasoning With A Beast","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Reasoning With A Beast / 맹수 사용 설명서","Secretary Seo Yujin is in charge of self proclaimed truth-finding. Once upon she receives a sudden call to her president and she hears shocking news. She is asked to take full care of the president’s younger brother and the third son of an unknown conglomerate, Jin Taeoh. What if you add something like this when you can’t shake off an eery feeling? “It’s not that difficult. You just need to keep him out of the media.” She should have run away immediately after hearing that, but blinded by the money, Seo Yujin agrees…! The first time she goes to the airport to meet him her first impression was that he’s a quite beautiful… beast? Tame the world’s just but heartless psychotic beast who doesn’t know where to go!"]},{"title":"Black Surge","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Black Surge / ブラックサージ","Nagi Kujo, a brilliant doctor who tirelessly treats patients in conflict zones, returns to his homeland, Japan, to seek treatment for his adoptive father, a benefactor who once saved him. However, upon his arrival, he discovers that his father has been murdered by an unknown assailant. Determined to uncover the truth, Nagi begins to delve into the mystery surrounding his father’s death."]},{"title":"Time Limited Elixir of the Fallen Sega","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Time Limited Elixir of the Fallen Sega / The Time-Limited Elixir of the Ruined Clan / 몰락 세가의 시한부 영약","After seven years of dormancy, “Ryeon,” the young version of Danmok Ryan who returned after witnessing his death, wakes up. Suddenly, a strange message appears before her: “Keep the life force level below 50. If this condition persists for two months or more, it will lead to death.” Unable to build her abilities, “Ryeon” must rid herself of the life force accumulating in her body. Meanwhile, “Chin Hwa Reonya,” the young future head of the Machin Temple, confronts her, wondering why he serves in her household and is two years younger than her. Additionally, the chicken turns into a hawk, and the cat into a bakho. With a series of unexpected surprises, can “Ryeon” live a happy life in this new existence?"]},{"title":"Don’t pick up the trash you threw away","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Won’t Pick Up The Trash I Threw Away Again / Don’t Pick Up What You’ve Thrown Away / Don’t Pick Up The Trash Once Thrown Away / 버린 쓰레기는 다시 줍지 않는다 / Don’t pick up the trash you threw away / Trash Will Always Be Trash","After 6 years of rushing into the battlefield, my fiance has returned. With a woman and his child. He told me that he did not want to leave her mother and child.\nAn irresponsible fiance who only knows how to impose duchess duties on me.\n“Leila, you’re not an official duchess yet.”\nA heartless word came out from his mouth. So, I decided to cancel this engagement.\n***\n“How far can I do what I want?”\nThere was a brief silence. I realized I had said something strange and hurried to explain.\n“I’m sorry, Your Majesty. I didn’t mean to ask these things, but…”\n“Whatever”. Kalian interrupted my words and spoke.\nIt was not an angry voice. Rather, I thought he was smiling.\n“Except for selling this empire, you can do anything you want. Because you’re my representative”\n…What if I really sold this empire?"]},{"title":"How Far Are You Okay With?","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa How Far Are You Okay With? / 어디까지 괜찮아","“If it’s okay with you, Noona… Do you want to do that thing I just saw with me?” Eunpyeong finds it difficult to start dating because of painful memories. Nyuk, her underclassman from the same department, approaches her but Eunpyeong finds it hard to accept him. One day, Nyuk walks Eunpyeong home because she is drunk. At her house, he makes an unexpected discovery and a bold suggestion…"]},{"title":"Confessing My Love to Him, the Treacherous One","tags":["Romance"],"disc":["Confessing My Love to Him, the Treacherous One"]},{"title":"My Obsessive Father’s Heroic Homecoming","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa My Obsessive Father’s Heroic Homecoming","Eleanor, a baronet’s daughter, is left raising her child alone after hearing of her lover Cassius’s death in the war. Unknown to her, Cassius survives by making a pact with a dragon and returns as a war hero. His sudden return upends her world, forcing them to confront hidden secrets and unresolved feelings. Together, they must navigate their complex past and an uncertain future, embarking on a journey of love, sacrifice, and resilience."]},{"title":"In This Life, the Greatest Star in the Universe","tags":["Drama","Fantasy","Manhwa","Romance","Shounen"],"disc":["Read manhwa In This Life, the Greatest Star in the Universe / I’m Going to Be a Big Star / 이번 생은 우주대스타","Sun Woo-joo, an aspiring idol with shining talent, dedication, and passion, had only one shortcoming: “dancing.” Having to give up on his lifelong dream of becoming an idol due to this one flaw, he was preparing for a different path in life when a miracle suddenly appeared! “I’ll become a superstar brighter than anyone.” His once lacking dance skills were no longer a problem. The UV Starship. Five perfectly prepared idols are finally ready with everything they need. A monstrous rookie is about to debut in the entertainment industry! Presenting ‘The New Black.’ This life, he’s destined to be a cosmic superstar!"]},{"title":"My Cards Can Be Infinitely Enhanced!","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa My Cards Can Be Infinitely Enhanced! / 我的卡牌能无限增强！","In a world where cards reign supreme, where monsters, mech-beings, and furries can all be summoned, what chance does Zeng Qiang, a poor and ordinary orphan, have to become a card master? Faced with a life-or-death crisis, Zeng Qiang discovers that his talent holds unexpected potential! Who knew cards could be played this way?! You’re asking what his special ability is? — My cards can be infinitely strengthened!"]},{"title":"I Became The Male Lead’s Female Friend","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became The Male Lead’s Female Friend / 남주의 여자사람친구가 되었다","She becomes interrupted by love, a jealousy inducer, and the female friend of the male lead.","And in addition, she even has an unrequited love with the male lead. It was ruined.","As long as this is the case, let’s just become friends!","It was nice to have the first meeting with such a young male lead…","“Hello, Bouser Youngae (Polite way for noble’s daughter)”","“Uwa!!” You were mistaken for a girl and you cried?","Fortunately, she managed to resolve the misunderstanding and become close friends. However, the male lead in his childhood is more shy and soft-hearted than I thought.","Eventually, she became attached to the male lead and decided to become a real friend.","However, due to the disturbance of the male lead father and the war broke out, we had to be separated for a long time, I thought I could barely meet him again and stay the same as before but….","“Your eyes must have dropped a lot since I didn’t see you. Princess Averine!”","What’s wrong with him again?!","It’s not just that. Rather than getting along, he keeps get into trouble when he has a chance, and most of all, he even bothers my love business!!","Aren’t we just friends?!"]},{"title":"Baby Pharmacist Princess","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Baby Pharmacist Princess / 아기 약사 황녀님","Just by clicking the wrong button, I ended up possessing the game’s princess character, “Cherise”! Yoon Che-ri, a graduate of a pharmaceutical university. Like the so-called ‘hardcore gamer’ she is, She unexpectedly appears in the VR game she plays every day. A red rabbit puts her in debt to the game, owing 10 billion gems… If she doesn’t repay the debt of 10 billion gems, she won’t be able to log out? ♡ Surprise Quest Triggered ♡ User’s ability confirmed as “Pharmaceuticals,” customized settings have been completed accordingly. Future quests will focus on “Pharmaceuticals.” [Confirm] ◀ Huh? Why do I feel excessively capable…? If things go on like this, I might be able to return soon! Will Cherise really be able to settle the 10 billion gem debt and return to her original world?"]},{"title":"Being A Wicked Woman Is Comfortable And Pleasant","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Being A Wicked Woman Is Comfortable And Pleasant / The Perks of Being a Villainess / Isn’t Being A Wicked Woman Much Better? / What’s Wrong with Being the Villainess? / 악녀라서 편하고 좋은데요?","She possessed a villainess who is known and hated for her evil acts in an unpopular novel. But because of her personality, it was extremely difficult for her to play the villainess role. But not for long…","“I’ll fix your dress according to your taste this instant!”","“My request.”","“O-Of course! As per your request, there’s only one piece available in the whole Empire.”","People around me listen to me well even if I just frown and sit still. Since I don’t have to live in difficulty, I decided to just comfortably live on as a villainess.","“Father. Is it necessary for you to solve formulas in this slow and inefficient way?”","I thought it would be good to be a rich villainess, so I used all my knowledge.","“Why don’t you give me the honor of escorting the Princess?”","I have had enough of dealing with my father, so why did an unexpected character suddenly appear? What if this person disrupts my plan?"," "]},{"title":"Walk With You","tags":["Adaptation","Childhood Friends","Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Walk With You / Walk Through the Maze / Walk Through a Maze / 미로 속을 걷다","Han Yihyeon and Oh Taeoh go way back. They were best friends throughout most of their high school years…until one day, they just weren’t. Taeoh suddenly began to hide everything from Yihyeon, and try as she might, she could never find out why. Fast forward years later, when the two are young adults. Struggling to make it in the big city, Yihyeon returns home to live with her mother when she runs into her old friend again. Isolated from the rest of the world, Taeoh has not left the town – let alone his own home – since Yihyeon left. As the two grow closer once again, will Yihyeon be able to help lead Taeoh back into reclaiming a life of his own?"]},{"title":"The Unexpectedly Strong Knight in the Elf’s Arena","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Unexpectedly Strong Knight in the Elf’s Arena / 맥주포션","Elves becomes obsessed with me. They’re not a pretty creature but a crazy creature that’s driving me crazy."]},{"title":"SSS-Class Gacha Hunter","tags":["Action","Fantasy","Manhwa"],"disc":["Read manhwa SSS-Class Gacha Hunter, Gacha Pemburu Level SSS, ガチャで強くなったSSS級ハンター, 升級之路靠手氣, 靠抽卡升级的顶级猎人, 뽑기로 강해진 SSS급 헌터","“The Change” brought dungeons filled with monsters into the world, altering reality forever. Pro-gamer Jin Jungdo, whose lifelong dream was to be a hero like the Mana Users who fight in these dungeons, is crushed when he discovers his own abilities are useless. Just then, the “real universe” gives him a set of skills that allow him to draw information from the future and heroes from the past! Now all that’s left is for him to barrel through this game of luck and become the strongest hunter ever!"," "]},{"title":"Until I Break My Husband’s Family","tags":["Romance"],"disc":["Read manga Until I Break My Husband’s Family","Kisaragi Minori, a 31-year-old wife, has been in a relationship since her school days, which led to a happy marriage blessed with a beloved husband and son.However, life doesn’t always go as one wishes. Minori’s world turns upside down after she sees a picture of her husband, Yuudai, with another woman and a child, allegedly his son.“Is this his other family?”Minori couldn’t hold back her sadness after discovering how blind she had been all these years. She decided to take her own revenge by destroying the other “family” Yuudai cherished…"]},{"title":"Top Star Sent by God","tags":["Drama","Manhwa"],"disc":["Read Top Star Sent by God /  신이 내린 탑스타","With his innate spiritual abilities, ‘Kang Yeon-woo’ was destined to become either a shaman or an entertainer.","After surviving a life-threatening event, he gains the ability to extend his life by resolving grudges.","His life takes a complete turn when he meets top star ‘Kwon Sung-hyun’ while handling a request…"]},{"title":"Trial Marriage Husband: Need to Work Hard","tags":["Comedy","Josei","Manhua","Romance"],"disc":["Read manhua Trial Marriage Husband: Need to Work Hard / Have a Trial Marriage with Husband, Demanding Extra Effort / 试婚老公，要给力","On the wedding day, her fiancé and his lover had a love affair and eloped. Her eyes were dim, she seized the man in front of the Civil Affairs Bureau.”To sum it up, your bride is not here, my groom ran off, wouldn’t it be better if we… fight together?”. Before marriage, she said, “Even on the bed, between me and you, there will not be anything!” After the marriage, he said, “Do not try, how do you know?”"]},{"title":"In the Spring Shadow","tags":["Romance"],"disc":["Read manhwa In the Spring Shadow","After leaving her hometown of Cheongna with a sense of finality, Chahui had no choice but to return. However, upon her return, she finds herself overwhelmed by the weight of poverty and unhappiness. Amid this struggle, her first love and ex-boyfriend, Wookyung, whom she hurt and parted ways with, continues to linger around her. Wookyung, who still seems to have feelings for Chahui, subtly makes advances as naturally as breathing. Although Chahuu’s heart wavers in response, she knows she must turn away despite her feelings. This is the poignant story of Chahuu’s first love."]},{"title":"My tyrant’s husband somehow became cautious","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My tyrant’s husband somehow became cautious / Ma vie empoisonnée / My Tyrant Husband Has Somehow Became Cautious / My Tyrant Husband Suddenly Became Docile / I Accidentally Tamed the Duke / Somehow, My Tyrant Husband Has Became Cautious/ 폭군 남편이 어쩐지 조신 해졌다","Eurenia, the eldest daughter of Count Vincent. It is well known that she lost her sight and voice when she saved her godfather Euclid from a fire.\nBut the truth behind it is that she self-medicated to harm her body.\nUse this as an excuse to marry the godfather’s son, duke Euclid. But in the end she was used like a puppet in the earl’s hands, then discarded and died as a side effect of the drug.\nShe thought that was the end, but no. When she opened her eyes, she was back 4 months ago. She thought that now she must divorce the duke, who was forced to marry her. Then go find a cure…\n“Is the reason you’ve been avoiding me all this time just because you’re afraid of being discovered?”\nHis purple pupils persistently carved into her body.\n“Isn’t it because you hate me?”\nSuddenly his eyes turned red.\n“Can I come near you now?”\nThe ears are also red."]}]