[{"title":"Magic Academy’s Genius Blinker","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Magic Academy’s Genius Blinker / I Became A Flashing Genius At The Magic Academy / 마법학교 앞점멸 천재가 되었다","The character with the highest difficulty and the worst performance, Baek Yuseol, was considered a trash character in-game because he could not use magic in a fantasy setting where everyone else could.\nHowever…\n[Because the wrong ending has been reached, 90% of Aether World has been destroyed.] [Please reach the “True Ending.”] Suddenly, those words echoed in my mind before I was transmigrated to the Aether World.\n[You can use the skill “Blink.”] “Just why did I possess this character?”\nBlink was the only magic skill I had.\nSurviving in Stella Academy among genius mages, I became the notorious Blink Mage."]},{"title":"The White Wolf’s Bride","tags":["Fantasy","Historical","Romance"],"disc":["Read manga The White Wolf’s Bride / Byakurou no Tsuma / Hakurou no Tsuma / 白狼の妻","Having lost both her parents in a fire at the age of fifteen, Sae was adopted by her uncle and treated like a slave. When a marriage proposal arrives for her younger sister, Chiyo, Sae is forced to take her place. The reason for this substitution is that the prospective fiance is a beastman, a race rumored to devour humans. However, upon meeting her future husband, the white wolf Souhaku, Sae finds him quite different from the man-eating beast she had anticipated…"]},{"title":"Should I Make You a Nuclear Weapon?","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Should I Make You a Nuclear Weapon? / 핵무기도 만들어 드릴까요?","“The ultimate weapon ordered from the future has arrived.Kim Joon, director of the Defense Science Research Institute.In 2024, during a terrorist attack, he protects South Korea’s military secret, the ADD chip, and meets a glorious end.However, when he regains consciousness, he is granted an unexpected second chance.He is reborn in the body of Jeon Hyun-seung, a friend who died in 1998!For some reason, the revived Kim Joon discovers that he can access future technologies using the ADD chip engraved in his new body—‘Just give me a chance… I’ll show you results within three months.’Create the ultimate weapon to overcome the IMF crisis with future technology!”"]},{"title":"I Will Steal Her, My First Love!","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa I Will Steal Her, My First Love! / 첫사랑 그녀를 뺏겠습니다!","My first love from six years ago, ‘Im Nareem,’ and my best friend of 13 years, ‘Lee Riun,’ are getting married. Everything was perfect for the groom, Lee Riun, but he suddenly leaves Nareem behind, and Taeshin and Nareem find themselves thrown back six years into the past!"]},{"title":"The Legendary Swordmaster: Only I Have the Power to Forge Swords from Monsters","tags":["Action","Adventure","Fantasy"],"disc":["Read manga The Legendary Swordmaster: Only I Have the Power to Forge Swords from Monsters","What kind of magic sword will you become…?” The protagonist, Touji Nanase, who was constantly harassed by debt collectors and bullied by his boss at a toxic job, gets sucked into a dungeon that suddenly appears and is attacked by monsters! As he teeters on the brink of death, he gains a legendary item and awakens a cheat skill called “Magic Swordsman,” allowing him to transform defeated monsters into swords. Though people mistake him for a monster due to his sinister appearance and ruthless nature, he sets out on a path of revenge against those who made his life miserable…! A classic dark fantasy of revenge and overwhelming power!"]},{"title":"Study Group","tags":["Drama","Manhwa","Martial Arts","School Life","Shounen","Webtoons"],"disc":["Read manhwa Study Group","Gamin Yoon, a 17 year old student, goes to a school known to harbor future criminals. Stuck in a carnivorous environment where only the strongest survive, he struggles to get good grades to enter a 4 year university. But, will he be able to study well enough to enter university, or will he get involved in the unending fights around the school?"]},{"title":"Elqueeness","tags":["Adventure","Fantasy","Gender Bender","Slice of Life"],"disc":["Read manhwa Elqueeness / Spirit King Elqueeness / 정령왕 엘퀴네스","Kang Ji-hoon, an ordinary high school student who died in a painful accident, finds out in the underworld that he is actually a ‘Water Spirit King mistakenly born as a human’. “Making water spirits? How do you do that?” The adventures of Elqueeness, the Water Spirit King who was mistakenly born as a human!"]},{"title":"Disastrous Necromancer","tags":["Action","Fantasy"],"disc":["Si Ling Fashi! Wo Ji Shi Tianzai, Necromancer! I Am a Disaster, NECROMANCER: King of The Scourge, Scourge Necromancer, Catastrophic Necromancer, 死灵法师！我即是天灾","The game becomes reality, the rules of the world are subverted and human beings enter the era of job changes for all. Only by becoming a Job Changer! And becoming stronger! Can one stand on top of the world! On the day of his job change, Lin Moyu became the only hidden profession, the Necromancer. From then on, since his summons will never die, Lin Moyu will also never die. “I sit high above on a throne of bones, threading the path between life and death.” “I am the Catastrophe!”"]},{"title":"Magic Emperor","tags":["Action","Adventure","Magic","Manhua"],"disc":["Read manhua Demonic Emperor / Magic Emperor / The Servant Is the Demon King?! / The Steward Demonic Emperor / امپراطور جادو / 魔皇大管家 / 마황의 귀환","Magic Emperor: The Mc is a magic emperor and the strongest man alive, only to die and reincarnate into a boy with no cultivation."]},{"title":"Heir Of Mythical Heroes","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Heir Of Mythical Heroes / Heir of a legendary hero / Successor of Mythical Heroes","Han Jungmin, who is only ‘top on in written exams’, gave up becoming an adventurer as he didn’t have the talent. After taking some time off from the adventurer academy, and as he started to write a fantasy novel… [You have been plagiarised by the world.] [Unique class – author of the story starts.] one day, the novel Jungmin wrote starts to become a reality and gets the job of being the ‘author of the story’. On top of that… [The only unique ability opens.] a special skill that nobody else has. Can Jungmin achieve his dream of becoming a dungeon adventurer?"]},{"title":"The Mysterious World’s Greatest Martial Artist Little Prince","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["The Mysterious World’s Greatest Martial Artist Little Prince / 수상한 소공자는 천하십대고수 / The Suspicious Little Prince is the World’s Greatest Teenage Master","The once-great Madorim sect has fallen on hard times after being embroiled in the Great War of the Heavens.\nThe sect’s Supreme Leader, Ju-Rin, is now faced with the return of his long-lost grandson, the son of his daughter whom he had abandoned many years ago.\nPossessing the same otherworldly beauty as his mother, he initially appears to be nothing more than a pampered scholar, unfit for the world of martial arts.\nHowever, he is in fact the King of Mount Wumian, the very same man who defeated the mighty Yellow River Dragon King, one of the Ten Great Masters of the Martial World!\nHaving returned to Madorim in order to fulfill his mother’s dying wish, Jin Murin, the Mountain King now sets his sights on reviving the sect and restoring it to its former glory"]},{"title":"Bones","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Bones / 본즈","Ji Hyun, haunted by pain and inner anger, awaits a hunter on the way with the dream of becoming invincible.\nBut cruel fate decreed otherwise, depriving him of the most precious thing – the cost of love and health.\nWallowing in despair, but not resigned to fate, Ji Hyun stood on the edge of the abyss of the place.\nHaving become a shadow of himself, he rose from the ashes and again eclipsed the heavens with his implacable resolve.\nThis is a story about the birth of a new character, embodying all the rage and determination, the likelihood of action will resonate around the world."]},{"title":"I Became The King by Scavenging","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read manhua I Became The King by Scavenging, 我靠捡垃圾上王者, Wo Kao Jian Lese Shang Wangzhe, I Became a King by Picking up Trash, I rely on picking up trash to become a king","Good news, it has been detected that your profession is a hidden profession. Bad news, your hidden profession is one in ten thousand: ‘Trash.’\nYou are about to change jobs to… ‘Scavenger.’ Ye Qing felt a white flash before his eyes upon seeing the results, all his years of effort went down the drain.\nBorrowing money at high interest rates to speculate on stocks and losing it all, thrown into a private hunting group by creditors to work off his debts in the dark.\nAfter defeating a Demonic Beast that was supposed to be impossible to kill, that instant influx of experience points allowed Ye Qing to level up from 0 to 1,\ntriggering the only job change opportunity in his life… But unexpectedly, the profession he awakened to was the globally one in ten thousand hidden profession—’Scavenger.’\nAll the talent trees are centered around the bizarre profession of ‘picking up trash."]},{"title":"Unbeatable Lv.1","tags":["Action","Fantasy"],"disc":["Read manhwa Unbeatable Lv.1 / 최강 레벨 1","The raid failed. In a desperate situation, facing the dungeon boss’s self-destruction, Lee Geonwoo is left alone in the boss room due to a teammate’s betrayal. Just when he thought everything was over, he coincidentally obtained a dagger. Afterwards, his life completely changes… He managed to save his life, but not only did his hard-earned level return to 1, -‘Mosquito’ has been caught. -Level has increased. It’s clear that the level has increased, but why does the level remain the same?"]},{"title":"Obey the Flowers","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Obey the Flowers","I possessed into the body of a criminal who was brutally killed by a male protagonist who fell into madness. The only way to survive is to tame it and connect it to the female protagonist. Can my plan succeed from a cruel and charming beast that I cannot understand? However, the devil’s eyes looked at me gradually changed. “I promise.” “When I turn into a human, you will be my woman.” My heart was also shaken by his more sincere words than before and the hard, hot chest that held me in his arms. ‘Don’t waver, Floria. This is just a contract marriage! “"]},{"title":"I Really Don’t Want to Learn Forbidden Spells","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua I Really Don’t Want to Learn Forbidden Spells,  我真不想学禁咒","I admit, when it comes to time travel, there must be some sort of cheat code. But seriously, which newbie mage only knows dark curses like “forbidden spells”? I’m human, not a dark lord! Oh well, I guess forbidden spells are pretty cool after all!"]},{"title":"Seoul Station Druid","tags":["Action","Fantasy","Manhwa","Sci-fi","Shounen","Si-fi","Webtoons"],"disc":["Read manhwa Seoul Station Druid 서울역 드루이드\nPark Sooho returned to Earth after disappearing to another world for a thousand years. During that time, Earth had changed into a world of the survival of the fittest thanks to the appearance of monsters. Druid, the king of the animals, who had managed to survive for a thousand years is now off to conquer the world."]},{"title":"Murim Salon","tags":["Action","Adventure","Fantasy"],"disc":["Read Murim Salon","In the Immortal Realm, Jinyul was renowned as the Beauty Immortal, leading fashion trends and styles as the personal barber of the Jade Emperor. However, he, who was (literally) intoxicated by his high status, behaved recklessly and caused a major accident, completely shaving off the Jade Emperor’s hair. Enraged, the Jade Emperor banished him to the Mortal Realm. After falling into the Mortal Realm, Jinyul planned to regain his prowess and return to the Immortal Realm once again. But the moment he landed, things started going awry! Can Jinyul regain his status and return to his rightful place in the Immortal Realm?"," "]},{"title":"I Will Become the Villain’s Poison Detector","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Become the Villain’s Poison Detector / I Will Become a Poison Detector in the Dark World / 흑막의 독 감별사가 되겠습니다","Before hanging, she became a villainess in a devastated novel where her life was supposed to end after being poisoned.\nHowever, what happened was that she couldn’t die of poison.\nWhat’s even more surprising was that she could tell the taste of the poison!","“I can tell the taste of poison.”\n“Really?”\n“Yes.”\n“What kind of use is that?”","Oh my. This evil woman’s past was too formidable to survive with tricks.\nSo she took out the secret card.","“Your boss will be poisoned.”","That’s right, it’s something about the villain that I know!","“I can be your poison dectector.”","So I thought I could survive well as an employee of a general store in front of the villain…\nMy boss, who I thought was just an extra in the black valley, was ranked number one?\nIt was an out-dated story that was popular before…","“…It’s not cliche, indeed.”","You’re scared of poison?\nI’ll eat it for you!"]},{"title":"A Suspicious Confession","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa A Suspicious Confession / 奇怪的告白 / 수상한 고백","Upon returning from a business trip, workaholic Ko Minhae is met with the news that her crush is engaged to her roommate. Devastated, she tries to drink away her sorrows before a horrific car accident sends Minhae into the past. With a second chance, she swears to live differently… starting by confessing to her crush! But unbeknownst to her, her plans are put in danger by a secret admirer who has his sights set on her. This time, will Minhae finally succeed in making her love come true?"]}]