[{"title":"Screw the Noble Life, I’m Going Home","tags":["Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa Screw the Noble Life, I’m Going Home / 공녀고 나발이고 집에 간다고 / Noble Lady or Whatever, I’m Going Home","After confirming that I had won the lottery, I tried to quit my job. However, as soon as I opened the door, I found myself transmigrated into the body of a Duke’s daughter in a fantasy world. I have one year to claim the prize money, so I have to return home at all costs. My 1.7 billion won, mum will be there soon. Wait for me!!! But… What’s wrong with this family?! “I love you.” But I’m not your daughter, uncle! “My little sister, you might get hurt, so I’ll carry you.” Did he say he was going to carry me? What is this guy, a giant brown bear? “If you mess around with my sister one more time, I’ll make you disappear without a trace.” He has such a pretty face for someone who speaks so crudely, “Don’t fall ill.” Don’t worry about me. Why are there so many of them?! I’m not a noble lady! Leave me alone, I wanna go home!"]},{"title":"The Regression of Great Sage Riddle","tags":["Action","Drama","Fantasy"],"disc":["Read The Regression of Great Sage Riddle","A young man named Riddle lost all his friends—and the entire world—to a mysterious organization called the Box of Malice. With no hope left, he sank into deep despair until he had one final revelation: what if he could return to a time before it all ended? After a thousand years, a deformed Riddle finally succeeds in reversing time. “This time, I’m going to stop them!” Armed with a thousand years of knowledge and experience in his young body, the Great Sage Riddle’s journey to the past begins!"," "]},{"title":"Duchess’s Lo-Fi Coffeehouse","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Duchess’s Lo-Fi Coffeehouse /  느긋한 공작부인의 악커피하우스"]},{"title":"Reborn as a Monster 2: Rise of the Beast God","tags":["Action","Adventure","Fantasy"],"disc":["Read Reborn as a Monster 2: Rise of the Beast God / Rise of the Beast God","A thousand years ago, With a blood moon hanging in the sky and spatial rifts opening up, the era of monsters descended upon the world. Countless monsters ravaged the globe! Just as humanity was on the brink of complete extinction, the birth of Beast Soul Masters brought a glimmer of hope to all of mankind! With each successive generation of Beast Soul Masters inheriting and developing their skills, humanity successfully created a new civilization to combat the invasion of the monsters! Lin Yuan, in his previous life, was a top assassin who was tragically betrayed and killed by his organization. After crossing over, he became an ordinary high school student and even his contract was the weakest E-rank."]},{"title":"The Supporting Female Is Reborn, She Will No Longer Serve This Broken Plot","tags":["Drama","Fantasy","Historical","Manhua","Reincarnation","Romance","Time travel","Transmigration"],"disc":["Read manhua The Supporting Female Is Reborn, She Will No Longer Serve This Broken Plot / 女配重生，这破剧情她不伺候了/ 조연으로 태어났지만 막장드라마에 봉사하지 않겠다","Yin Susu couldn’t believe that she was reborn again, her life was repeating again, the setting was the same, the painful things were the same. She thought that she would just become a salted fish,* living a lazy life, waiting for death, waiting for everything to end, for the female lead to die, which would mean the end of everything, but she did not want to accept her fate! “If you, the female lead, has a golden hand, then I will break that golden hand.” *salted fish: metaphor of a corpse or a person who doesn’t want to do anything."]},{"title":"First Impressions","tags":["Adult","Drama","Fantasy","Josei","Manhwa","Mature","Romance"],"disc":["Read manhwa First Impressions / Hubae Evolves / The Junior’s Evolution / The Younger Generation Evolves / 후배는 진화한다","Hyeseo and Seoha were only supposed to be tutor and tutee. But why are they becoming something more…?"]},{"title":"When Jasy Whistles","tags":["Action","Adventure","Fantasy","Shoujo","Supernatural"],"disc":["Read When Jasy Whistles","In ancient times, people believed that the forests of Paraguay were filled with gods and monsters. Growing up outside of modern Asuncion, Hela never thought much of the old stories. When her best friend disappears, apparently kidnapped by the legendary Jasy Jatere, however, she learns that the old world is not as dead as she had thought."]},{"title":"Teaching the Royal Brat a Lesson","tags":["Fantasy","Historical","Romance"],"disc":["Read manga Teaching the Royal Brat a Lesson","Elysia, the refined daughter of a duke, was meticulously raised to fulfill one singular purpose—marrying into royalty. The culmination of her upbringing arrives as she is chosen as a potential bride for the crown prince. However, her dreams shatter abruptly when a tragic accident leaves her arm severely burned, putting an end to any aspirations of a royal engagement. Reduced to a mere political pawn in her father’s eyes, Elysia finds herself abandoned to the shadows, her younger sister now the favored one. Adrift in quiet exile, she grapples with a profound sense of aimlessness. A lifetime of dutifully obeying her father’s commands has left her without a clear understanding of her own desires. Amidst this uncertainty, she crosses paths with Gilles, the king’s illegitimate son raised in the slums. Despite his lack of royal decorum, Gilles exudes an unwavering spirit that captivates Elysia. Intrigued by his determination to preserve his individuality within the constraints of royalty, she volunteers to become his tutor, hoping that being close to him might help her discover her own path in life. This is a tale of how these two opposites learn how to navigate the icy waters of a rigid social hierarchy while supporting each other to be true to themselves. Get ready for a lesson in romance in the face of adversity when love blossoms between the genteel noble’s daughter and the street-smart young prince!"]},{"title":"The Tyrant’s Tranquilizer","tags":["Drama","Fantasy","Isekai","Magic","Manhwa","Romance"],"disc":["Read manhwa The Tyrant’s Tranquilizer / 폭군의 신경안정제","Just because I criticized a novel doesn’t mean you have to make me into the supporting character Amelie, who died from the start, becoming the trauma and trigger of the heroine.\nI’m scared. I don’t want to die. I don’t want to be harassed.\nLet’s run away!\nBut just when Amelie visited her family to inform them of her departure, the Emperor (the tyrant) arrived. In order to escape, I transformed into a bird by magic.\nBut the Emperor took me with him!!!\nWhat’s going to happen to me?!"]},{"title":"The Villainous Princess Won’t Tolerate a Bad Ending","tags":["Drama","Fantasy","Isekai","MANGA","Manga","Reincarnation","Romance","Transmigration"],"disc":["Read manga The Villainous Princess Won’t Tolerate a Bad Ending / Akuyaku Koujo wa Bad End wo Yurusanai / The Evil Queen Cannot Forgive A Bad Ending / 悪役皇女はバッドエンドを許さない","In the cutthroat world of game development, genius creator Ko Sehee’s life is upended when her junior, Choi Yuri, betrays her, stealing Sehee’s game “Land of Destiny” and relegating her to ghostwriter. But fate has a twist; a fatal accident plunges them into the very game world Sehee crafted. Now, reborn as the diabolical Princess Violeta, she must navigate treacherous waters where she is the villainess, and her nemesis is the beloved heroine. Who will triumph when the creator battles her usurper in a world of their own making?"]},{"title":"Return to the Ancient Times as an Emperor","tags":["Action","Adventure","Fantasy"],"disc":["Read Return to the Ancient Times as an Emperor","A passionate young man travels back in time to become an emperor. Faced with political marriages where women are sent as brides to foreign powers, and the shame of a weakened nation, he is enraged. He creates three thousand AK-47s and builds an army of a million wolf cavalry! As he dominates the world, beauties from all over offer themselves to him, while foreign tribes grow hostile. He says only one thing: “If you dare kill one Han of mine, I will wipe out your entire tribe!”"," "]},{"title":"Marriage of Convenience","tags":["Action","Adventure","Comic","Drama","Fantasy","Full Color","Historical","Josei","Korean","Manhwa","Psychological","Reverse","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Marriage of Convenience / 결혼 장사 / The Marriage Business / The Wedding Business","Bianca de Blanchefort. The wife of Zachary de Arno, thrown out of Arno family after his death due to her self-indulgent, frivolous, and immoral behavior. She had nowhere to go, the Blanchefort family having already fallen to ruin, and was more or less kicked to a convent out in the border. A woman who ultimately met her end on a cold stone floor. A villainess with no honor: that was Bianca’s life before she went back in time. “Is this truly reality? Did I really travel back to the past?” This was neither a dream nor a hallucination. This feeling of hunger, fatigue, the vivid sense of everything around her… This was all real. If this was indeed reality… If God truly gave her one more precious chance…! ‘I’m going to carry out a business. A marriage is a business in the end. Zachary’s child will be the perfect source of financial support. I’m sure my dowry will remain safe too. I won’t have to lose the Blanchefort or Arno territories to that damned viscount either.’ Then whether it be through seduction or persuasion, she needed to give birth to her husband, Zachary’s child. “How much was my dowry exactly?” “400 calves, 900 pigs, 100 units of silverware, 300 rolls of silk, 2 crates of jewels, and a portion of a territory… Equivalent to a two-year budget for the Arno county.” “Don’t you think you should compensate for that?”"]},{"title":"Beyond Redemption","tags":["Action","Adventure","Fantasy"],"disc":["Read Beyond Redemption / 罪无可恕","After the cataclysmic fall of his homeland, Dante, a hardened demon hunter, finds himself driven by two things: cold, hard cash… and ice-cold revenge.","He joins forces with his old comrade, Valkyrie, forming an unlikely alliance to tackle the most dangerous and lucrative missions this strange new world has to offer.","Together, they must unravel bizarre and deadly supernatural mysteries, all while navigating a chaotic landscape where supernatural powers reign supreme. They’ll face down fanatical cults, monstrous creatures, and something far more insidious…","In this world, the line between sanity and power blurs. The closer one dances with madness, the greater their strength becomes! Those who dare to embrace the abyss are favored by the insidious Evil God—the one true deity—the only deity that exists in this world—but at a terrible cost. For the power they crave is a double-edged sword, threatening to consume them in the very insanity they seek…"]},{"title":"The Villain’s Daughter Plans to Run Away","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villain’s Daughter Plans to Run Away / 악역의 딸은 가출을 계획합니다","I was executed for being the daughter of a villain. ‘You bastards, I didn’t do anything!’ When I opened my eyes feeling unfair, I was back in time 14 years ago. I still needed the care of the villainous family, so I saved up my pocket money and planned to escape… “Wouldn’t it end if I kill you? Why go through such troublesome negotiations… .” “Let’s negotiate.” I trained my dad and made him a good person. Hehe. You heard it right. My dad is no longer a villain! Aha, I guess that happened while he was making sandwiches.Well then! My dad is good now!"]},{"title":"Reforming My Regretful Husband","tags":["Drama","Fantasy","Historical","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Reforming My Regretful Husband / I’ll Rewrite the Husband I Regret / 후회 남편을 고쳐 쓰겠습니다"]},{"title":"The Cook of a Perished World","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Cook of a Perished World / The Cook of a Perished World / Cooking Disease in a Ruined World / 멸망한 세계의 취사병 / Apocalyptic Chef Awakening","Apocalyptic Chef Awakening Synopsis: Shin Young-jun, a sergeant chef, was greeted by the apocalypse just days before vacation. The battalion turned into chaos in an instant, and the communication network was cut off. Then something appeared before his eyes! [Congratulations on your awakening!] [Job: Novice Chef Lv.1] If I had been a warrior or an assassin, I would have tried to stand alone… What was assigned to him was chef, which is obviously a support job. There’s nothing to be done if it’s like this. “From here on, I will feed you.”"]},{"title":"Haesi’s New Path","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Haesi’s New Path / Hash’s Shinru / Misteri Hash / Night Mirage / 亥时的蜃楼 / 亥時蜃樓 / 해시의 신루","Haeru, who was gifted with the mysterious power to foresee the future, rejects her fate and flees. One day, a peculiar scholar appears before her! A man who constantly gets lost, tells lies, and insists that fighting is done with the mind, not the body. From the moment she meets him, Haeru’s halted fate begins to move again. In 15th century Joseon, a sweet yet dangerous tale of love and war unfolds between the greatest genius king, untold by history, and a mysterious woman bound by the chains of destiny!"]},{"title":"I’m Worried that My Brother is Too Gentle","tags":["Comedy","Comic","Crime","Demons","Drama","Fantasy","Liexing","Magical","Manhwa","Monster Girls","Monsters","Mystery","One shot","Romance","Sci-fi","Shoujo","Shoujo Ai","Webtoon","Webtoons"],"disc":["Read manhwa I’m Worried that My Brother is Too Gentle / 오라버니가 너무 순해서 걱정이다 / My Brother Too Soft / Aku Khawatir Kakakku Terlalu Lembut\n“Your Highness! The papers have piled up like this……!”\nI reincarnated as Irene Weber, the younger sister of an aide who is suffering from overtime because of the prince who is in love and neglects his work.\nIrene, who was buried in work before the reincarnation and died of overwork, intends to protect her beloved brother from such a terrible thing. No overtime! No call after work! Evil boss, go away! Work less and earn more, brother! To the end, Irene tries to separate the prince from her brother. A method to win by knowing your enemy and knowing yourself. Irene scraps a little record without leaving any details, of the Prince whose face she doesn’t even know about, for the future. Somehow, her brother’s face, looking at such Irene, is dark…… “Brother, if you’re meeting the Crown Prince today, I’ll go with…..” “Absolutely not.” ‘Do you want to meet him alone so much?’ *** “Before that, Benjamin Weber, when can I meet your sister?” “Not for the rest of your life.” The most affectionate brother and sister of the continent. Will the day come when these two siblings can resolve their growing misunderstanding? [Taken from Novel Updates]"]},{"title":"Welcome to the red witches mansion","tags":["Action","Comedy","Manhwa","Webtoons"],"disc":[]},{"title":"The Demon Prince goes to the Academy","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Demon Prince goes to the Academy\nI died while I was reading hate comments on my novel. I was already in shock over my death, but some ‘Grim Reaper’ appeared and told me that being a bad writer was a sin. To atone and make it into heaven, I was told I needed to survive past the ending in one of my novels. And so, I entered the novel … “Damn it all!! Why did this have to happen to me?!” By all misfortune, the character I possesed was the Demon Prince, a character with no combat abilities—who dies at the very start of the story!!"]}]