[{"title":"Perfect Surgeon","tags":["Action","Adventure","Manhwa"],"disc":["Read manhwa Perfect Surgeon / 퍼펙트 써전 / PFS","When he was a child, his father was said to have died from a car accident. But what actually caused his death was ‘Medical Negligence’. Ever since that, his dream was to become a ‘Perfect Doctor’ that would never deny or mistreat a patient. However, reality was harsh. His mother was inflicted with an incurable disease, which required a lot of money. He quit his university hospital internship and became a sell-out dermatologist. While he had stopped in his tracks due to the harshness of reality, a state-of-the-art Artificial Intelligence, ‘A.I. – Ronnie’, came to him. And thus, his journey to become a perfect doctor started once again."]},{"title":"My Little Bookstore","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa My Little Bookstore / My Small Bookstore / 나의 작은 서점"]},{"title":"Hyper Luck","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Hyper Luck  /  운빨\nThe luck that was missing from my life, came all at once before quitting the game.\nLee Ki-Ho, who tried to turn his life around in the world’s first virtual reality game -1, claimed the rare item not one in 4 billion players ever came across!\n“He really went from rags to riches!”"]},{"title":"I’ll Be a Villain in This Life","tags":["Action","Fantasy","Martial Arts"],"disc":["Read manhwa I’ll Be a Villain in This Life, 이번 생은 빌런이다, Will be a villain in this life, In this life i’m the villain, This life’s villain,","Lee Joohyuk, and undercover detective, has spent 15 years infiltrating the corporate-style gang ‘DG Group’. He was planning on revealing the evildoings of the DG Group to everyone in the world, toppling them… “Have a nice trip.” His identity was uncovered, and he was kicked out of the organisation. Just as the life faded from his eyes, an apparition of his father, a former hero, appeared. “Son, return here only after achieving the dream you so desire.” Joohyuk was sent back to the year 2005. “This time! Certainly, I’ll bring you down with my own two hands!” In an era where scoundrels and scum run rampant, I will become a villain, in order to eliminate all evil."]},{"title":"Grim Reaper: Master of the Underworld","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Grim Reaper: Master of the Underworld / 저승사자:제령무사","Jia Gang, the greatest swordsman of Joseon, fails to avenge his master and dies, descending to the underworld. Possessing a special soul, Jiagang is promised a chance for revenge by the King of the Underworld and takes on the path of a Grim Reaper who captures evil spirits."]},{"title":"The Beginning After The End: Side Story – Jasmine: Wind-Borne","tags":["Drama","Fantasy","Manhwa","Webtoons"],"disc":["Read manhwa The Beginning After The End: Side Story – Jasmine: Wind-Borne / TBATE – Jasmine: Wind-Borne; Jasmine: Wind-Borne","Full-length side story featuring Jasmine and her past before she joins the Twin Horns.This is never before seen content separate from the novel but entirely canon."," "]},{"title":"The Goddess’s Guide to Farming","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Goddess’s Guide to Farming / God’s Straight Talk on Farming / Goddess’ Straight Talk on Farming / Goddess’s Straight Talk on Farming / Straightforward to the God Farming / 神農事直說 / 신 농사직설","How far would you go to convince your billionaire father that you deserve the keys to his kingdom? Smart, ambitious Seol would do just about anything, including hard labor on a farm for three months. Of course, it helps that her new boss, Bongsu, is easy on the eyes. Will Seol prove to the hot farmer that she has what it takes? Will she win the respect of her family? Most importantly, how will she keep from falling in love with Bongsu?"]},{"title":"My Dear Aster","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Dear Aster / 마이 디어 아스터"]},{"title":"Webtoon Character Na Kang Lim","tags":["Action","Comedy","Fantasy","Manhwa"],"disc":["Read manhwa Webtoon Character Na Kang Lim / 수요웹툰의 나강림","Na Kang-Lim, a high school student who usually enjoys webtoons. One day, experiences something bizzare, a female protagonist from a webtoon he usually reads appeared before him. The incidents in the webtoon puts her into a crisis, but the problem is there’s no protagonist to save her from those events! He then becomes the protagonist and goes over time to save her."," "]},{"title":"Dominant Castle","tags":["Drama","Fantasy","Manhwa","Mature","Romance"],"disc":["Read manhwa Dominant Castle / 도미넌트 캐슬","The door to the old castle that had been closed for a long time was opened.\nJeyeon goes to study the numerous works of art hidden there and experiences something strange.\nThe owner of the old castle appears at the moment when the beautiful castle appears to be a miserable ruin.\nFor some reason, he shows a strange interest in Je-yeon…"]},{"title":"Fusion Fantasy: My Life Can Be Simulated Infinitely","tags":["Action","Adventure","Fantasy"],"disc":["Read Fusion Fantasy: My Life Can Be Simulated Infinitely / Xuanhuan: Wo De Rensheng Keyi Wuxian Moni / Fusion Fantasy: My Life Can Be Simulated Infinitely / Xuánhuàn: Wǒ De Rénshēng Kěyǐ Wúxiàn Mónǐ / 玄幻：我的人生可以无限模拟"]},{"title":"My Daughter is a Dragon!","tags":["Manhwa"],"disc":["Read manhwa My Daughter is a Dragon! / 俺の娘はドラゴン！ / 女儿的超能力是把我变帅！ / 내 딸은 드래곤!","Jihoon was leading a draining life due to his demanding professor, when one day, his daughter fell out of thin air!","Thanks to Chaerin, who was as smart and pretty as an elf, things started to look up for him. His skin started to get better, his eyesight and intelligence improved, and he even got taller and more handsome.","This was all according to his daughter Chaerin’s plans!","Jihoon, who used to be an ordinary science and engineering university student, became a researcher leading the Fourth Industrial Revolution, AI!"]},{"title":"Scarlet Temptation","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Office Workers","Romance","Smut"],"disc":["Read manhwa Scarlet Temptation / Bright Red Temptation / 새빨간 유혹","[Mature Audiences Only] Shy and timid Yoo Seoyeong is desperate to get back at Min Jooyeon for ruining her life in high school, no matter how petty the revenge is. So when she sees Seo Jaeha, the gorgeous new department manager of her company and Jooyeon’s fiance, she grabs the chance to seduce him into spending a steamy night with her. But what should’ve been a one-night stand becomes much more tangled as both Seoyeong’s body and heart burns for Jaeha’s affection. Will she walk out of her revenge plot unscathed? Or will she be scorched by the very fire she started?"]},{"title":"The Greatest Table For Two","tags":["Drama","Romance"],"disc":["The Greatest Table For Two / A Great Table for Two / The Great Sickness / 위대한 겸상"]},{"title":"Green Plum Island","tags":["Drama","Romance","Shounen Ai"],"disc":["Read manhua Green Plum Island / Qīng Méi Yǔ / 青梅屿 / 青梅嶼","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","Fan translation by Strawberry Moon Scans When I was ten, I fell from a tree and hit my head. When I woke up, the world around me had changed. I could see people’s emotions in the form of numbers and colours—pink for love, red for anger, green for awkwardness, blue for sorrow, yellow for desire… I met Yan Kongshan the summer after college entrance exams on Green Plum Island. Mysterious and handsome, with a tinge of melancholy, he was the ideal man of every woman on the island. And mine. I wanted him to turn pink for me, but one day, he suddenly turned yellow. Despite that, he seemed ever so nonchalant when facing me. Love is like lemon soda water. Sour and sweet, filled with energy. You never know how a person’s heart beats for you, hidden in its cage beneath their flesh."]},{"title":"Olgami","tags":["Drama","Fantasy","Manhwa","Mystery","Romance","Survival","Thriller","Vampire","Violence","Webtoons"],"disc":["Read manhwa Olgami / Trapped / Loop / 올가미","Taxi driver Chaeah once saw her acquaintance from the church, Park Yoonsoo, walking through the city streets with a girl, but she could not even think that this would lead to the burying of evidence of murder, persecution, and a complete change in her daily lifestyle."]},{"title":"Clothing Bin of Love","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhwa Love’s Clothing Collection Bin / Old Clothes Collection Bin of Love / 사랑의 헌옷수거함","Enough one-sided love! The hottest gossip in Going High School, if you go to the used clothing box, give it money and shout the name of the person you like, then it will tell you the feelings of that person..!\nSong Aram, who’s only interested in grades and money, is not wavered by that rumor.\nIn that daily life, the school’s popular boy, Jung Jinwoo suddenly comes into her life. What should she do about this rascal who might run off to who knows where?"]},{"title":"Can’t Go Too Far with the Unrelenting Duke","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Can’t Go Too Far with the Unrelenting Duke\nHow can her one-night stand become a guardian for her students?\nAmelie escapes her life as an abused maid and becomes the youngest professor at the Royal Academy.\nWhen a prophecy reveals that the person she is marrying will die at an untimely death, she decides to spend a passionate night with a handsome stranger before succumbing to her fate.\nHowever, she was shocked to face her one-night stand again, as he was not only her student’s guardian, but he was a tenacious duke who would not stop at anything to win her over.\nWill the star-crossed lovers defeat fate and find happiness forever?"]},{"title":"I Became the Wife of a Tragedy’s Main Lead","tags":["Fantasy","Isekai","Romance"],"disc":["Read manhwa I Became the Wife of a Tragedy’s Main Lead / Rewriting My Husband’s Tragic Ending / Aku Menjadi Istri Tokoh Utama Novel Tragedi / I Got Married in a Hardboiled Fiction / Me Convertí en la Esposa del Protagonista Principal de Una Tragedia / 成为废物男主的妻子 / 피폐물 주인공의 부인이 되었습니다"]},{"title":"Protected by My Dragon Knight","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manga Protected by My Dragon Knight / 사랑스러운 드래곤, 널 지켜줄게 / 聖女は竜騎士様にまもられて / 圣女被龙骑士保护着 / 龍騎士與轉生聖女 / สตรีศักดิ์สิทธิ์กับอัศวินมังกรผู้พิทักษ์ / Beschütze mich, mein Drachenkrieger / Mon chevalier dragon / Seijo wa Ryuukishi-sama ni Mamorarete","Ichiru Futaba is just an ordinary office woman working in a stressful job.\nOne day, when she was pushed to her limit and couldn’t get home in time to save her fluffy little dog, she fell to the floor unconscious. When she wakes up, she realizes that she..\nShe died and was reborn! In a new world where magical creatures and humans coexist, and where a rain of sand from the sky harms these magical creatures, Ichiru struggles to form relationships due to the past. her darkness.\nOne day, when she finds a dragon on the verge of death, Ichiru summons a power she never knew she had. Like a bright light coming from her palm, hope is reborn! Will she be able to use her only healing ability to save these furry mystical creatures?"]}]