[{"title":"Heavenly Blood Star","tags":["Action","Adventure","Fantasy"],"disc":["The Blood Star Damned by Heaven, The Heaven-Condemning Star of Blood,天死血星,천사혈성, Heavenly Blood Star"," "]},{"title":"He’s Not for Sharing","tags":["Fantasy","Romance"],"disc":["Read He’s Not for Sharing","Aran is a young and successful businesswoman who firmly established herself as an indispensable member of “USWork”, a company that provides shared office space. That is until the love of her life who became a distant memory comes back into her life as a tenant of her office space. Both seem to remember how the sudden romance abroad ended abruptly, but agree to pretend to be a couple at work for convenience’s sake. There are other residents of the building that create complex love triangles that add to the drama and tribulations at work"]},{"title":"Begrudgingly Yours","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Begrudgingly Yours / 악연인지 인연인지 [선공개]","Enya Valencia, dreaded master of the enchanted Hexenkeep of Morgenda, has a new enemy – the celebrated knight of radiance, Helios. The hatred is mutual, but so is their fate of certain death… unless they meet one condition: they must sleep with each other. “…Shall we start by kissing, hexenkeeper?” So begins their spiteful romance at the pinnacle of carnal affection."," "]},{"title":"A Love that Melts Away a Poisonous Heart","tags":["Romance","Webtoons"],"disc":["Read manhwa A Love that Melts Away a Poisonous Heart / Ikenie Hime no Doku wa Yuusha no Ai ni Tokasarete / 生贄姫の毒は勇者の愛に溶かされて","Princess Angie endures a childhood of torment and abuse, all in preparation for the day she would be sacrificed to the Great Serpent that threatened the kingdom. On her 18th birthday, she approaches the Great Serpent, preparing for her imminent demise. However, much to her astonishment, Arbel, a young Margrave of Andalivia, intervenes and saves her life, declaring, ‘As promised, I’ve come to save you.’ Angie, having lost her sole purpose, feels devastated. Yet, with his gentle gaze, Arbel offers her a hand in her time of greatest need. Thus begins the bittersweet love story between a girl destined for death and the man who pledges to be her savior. “I want to stay by your side. I want to see you smile. Even if you forget me, even if I can never touch you.”"]},{"title":"The Duke’s Hidden Baby: BOGO!","tags":["Manhua","Romance","Shoujo","Webtoons"],"disc":["Read manga The Duke’s Hidden Baby: BOGO! / The Duke’s Hidden Baby: Buy 1 Get 1! / Pregnant Wife, One Plus One / Marry One Get One Free","He is an absolute bigwig who is decisive, cold, and callous. However, he just can’t stop tangling up with her, always eager to give her all his love. On their first encounter, he questioned:”Was that you 6 years ago?” The second time they met, he was holding a paternity test report. “You’re still gonna deny he is my son?” After multiple encounters, she asked: “His Excellency the Duke, are we done?” The man broke a charming smile: “Of course not. We are expecting a second baby.”"]},{"title":"Janice","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga Janice / Zenith on MANHWACLAN","Top Agent Janice, abandoned by the organization,\nI thought I would finally die peacefully\nBecame the Count’s beloved daughter!\nLife is pain, all that remains is betrayal. Filled with human distrust, she enters the battlefield of the social world, Highium.\nGirls with a fever of love and a mysterious death! I’m nervous about playing with fire and risking my life.\n“If you want, I’ll let you have it.\nSo, what do you do with those hazy eyes?”\nJanice, who is troublesome all over the world, begins to meddle!​"]},{"title":"Young Love","tags":["Drama","Josei","Romance"],"disc":["Read manhwa Youth Romance / 青春ロマンス / 청춘로맨스 / 청춘로맨스 [단행본 외전 포함]","At an age when everything is uncertain but exciting, a group of university students find themselves dealing with the ups and downs of life, love, and friendship. Popular freshman Yootae is learning how to take his first steps into romance, while shy senior Somin recovers her confidence after her failed first love. Meanwhile, campus beauty Hyeri just wants to avoid being the target of rumors when cool and confident Hwawoon enters her life. Can they all find love amidst the turbulence of youth?"]},{"title":"Recording Hall","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Recording Hall / The Viridescent Crown, Recording Hall ; 녹음의 관 / Crown of the Deep Green\nAn ordinary graduate student reincarnated into the novel “Eternal Love”, written by her at the age of 15. However, instead of arriving when the original story began, she reincarnated seven years in the past. She became Ran Romea de Lachia, the daughter of the male lead’s stepmother – a character that she didn’t even know the name of before reincarnating. The Stepmother tormented the male lead, Yustav, so much that he began to mistrust other women. Ran tries to change the events that are going to happen, yet their parents and little brother still die. With Yustav away in the Academy and his uncle in control of the family house, Ran has to work as a housekeeper for two years and begins working on the “Male Lead Happiness Plan” where she will join him with the female protagonist and let him have his chance at happiness."]},{"title":"I Desire You","tags":["Adult","College life","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa I Desire You / 가지고 싶어","Affectionate eye contact, gentle fingertips, and even a sturdy body. Sunbae Yoo Siwan was the perfect man who fulfilled all of Han Saei’s ideals. However, with Si-wan’s employment, the time they spend together decreased, And Tae Ji-ho, a sophomore who has returned to school, comforts Sae-i, who feels lonely. Tanned skin and firm muscles. A subtle gaze that makes one nervous. Skinship that seems like a mistake but makes you desire more. “If it was me, I wouldn’t leave you so lonely,”said Ji-ho. Despite understanding the meaning of it , Sae-i felt like playing dumb. What should I do? I desire both of them."]},{"title":"That Fishery, I’ll take it","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa That Fishery, I’ll take it / 그 어장, 내가 가져보겠다 / I’ll Take Those You Play The Field With","The first life was as So-yeon, an illegitimate child of a Chaebol family, where I would break my nose even if I fell backwards, the second life was one where I lived unfairly as the illegitimate child of a martial arts sect leader, the third life… I was in a romance novel I read in my first life, the illegitimate daughter of the evil supporting family! The third life is also as an illegitimate child… This is too unfair! Damn destiny, this time I’ll live how I want to","I only have to keep 3 things in mind this time!","1. Goodbye to the indifferent dad who doesn’t love me in the original story, I don’t love you either","2. Don’t put a mad dog-like male lead who barks around near the female lead","3. Run away from the villain who will cause the family to collapse","“Hehe, hello Belis. Im your older sister”","…huh, my sister turned out more lovely than I thought? Those sweet cheeks… I’m not supposed to get involved…","Yeah, at least this life won’t be a problem as long as I’m not involved with the male leads","Before running away from the disasters that will soon come, I will only take care of my villain sister","Except… there are accidental contact with the male leads","“What the hell are you doing kid?”","Why is the future prince of the noble family in the back alley","“What do you know!”","The rude little boy who picked a fight with me using words, why do you stick to me like a gum?","“Let me live for your sake”","Look, I just helped you a little, but if you are willing to give away your life like this, it’s a bit scary….","My third life was supposed to be a solid road… just why did this happen?"]},{"title":"Hate Me, Your Majesty","tags":["Drama","Fantasy","Romance"],"disc":["Read Hate Me, Your Majesty / 正ヒロインは愛する陛下に嫌われたい / Sei Heroine wa Aisuru Heika ni Kirawaretai","Today, I’m up to no good again! It was all part of my grand scheme to retire from the Heroine gig. So, why is the king still infatuated with me?!"]},{"title":"My Favorite Idol","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Favorite Idol / 사 생 돌","The bodies of the top idol and a school outcast are switched?! A school outcast who is always bullied everyday, Hong Jooa. A top idol who is loved by the whole nation, Go Yohan. Jooa, who envies the life of her beloved idol, and Yohan, who envies the simple and free life of an ordinary person. While they yearned for each other’s lives, their bodies were switched one day!? A spectacular body-switch romance, My Favorite Idol!"]},{"title":"Hybrid","tags":["Action","Adventure","Demons","Fantasy","Manhwa","overpower"],"disc":["Read manhwa Hybrid / 사기캐","A creature born between an angel and a devil. Among them, the creature with the best bloodline becomes a being called a “Hybrid” and is said to have enough power to blow up the universe the moment they are awakened. Contrary to the wishes of Jae-ik, who only wanted a simple ordinary life, angels and devils are finally seeking out Jae-ik, the ultimate hybrid, and developing strategies to get him on their side. Will Jaeik be awakened as an angel or a devil?"]},{"title":"You Are So Cute","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa You Are So Cute / You’re So Cute / Oh My God! You’re so Cute / You’re So Cute What Should I Do / Too Cute to Handle / 귀여운 걸 어떡해","Roni, an orphan who grew up misunderstood as a boy. One day, she is chosen by a high-ranking nobleman who comes to the orphanage. To pretend to be a male young master. The moment they found out that I was a woman, I would be sent back to the orphanage. I promised myself that I would be careful and survive. “You… Are you a girl?” It was caught in one day! The truth was revealed as I stood in front of the Duke. “No way” Was I going to be kicked out like this, or was I going to be severely punished for deceiving a noble? I was so scared that I begged and admitted my mistake. “Oh, you look like a doll!” “You! Be my little sister, not my playmate!” Instead, they greeted me kindly…? “I can’t because you’re too cute!” The story of Roni’s life in the Duke’s castle, who was forced to stay because of her cuteness!"," "]},{"title":"Kidnapped Bride","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Kidnapped Bride / Predatory Bride / Menjarah Pengantin / The Looting Bride / The Looted Bride","A once in a lifetime opportunity comes to Lucina, the illegitimate daughter of Lord Berek. Hakkan, the great conqueror who rules the dragon lands of Tayer, gives Lucina the opportunity to be his kidnapped bride. Desperate for any kind of freedom, Lucina agrees and steps into the unknown world."]},{"title":"A Noble Lady’s Chamber Life","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Noble Lady’s Chamber Life / 귀족 영애의 방구석 라이프","We had planned to celebrate our big success by treating ourselves to some Korean beef with my friend, but the novel turned out to be a dismal failure, and naturally, our plans for the beef went up in smoke.","And then, something happened to me… I possessed the supporting character, Adeline Macefrill, in that novel!","Who is Adeline? She is the ultimate sidekick who wholeheartedly assists the protagonist, Rianna. She has a wide network, poking her nose into everything, gathering all sorts of news and information! I’m an extremely introverted person, so it’s absurd that I ended up possessing such an outgoing character like Adeline!!","To make matters worse, the novel’s settings and reality differ. The supposedly well-behaved protagonist, Rianna, shows tremendous jealousy, and even the knight commander, Estian, who had a crush on Rianna, seems to take a liking to me?!","Can’t I just quietly enjoy my life in the corner, please?"]},{"title":"Seoul Station’s Necromancer","tags":["Action","Manhwa"],"disc":["Read Seoul Station’s Necromancer manhwa, 서울역 네크로맨서\nYou have entered the dungeon at Gwachun Station’s 1st Exit.]\n“What is this?”\nA necromancer had returned to earth after 20 years, and the subway station… No, it had become a dungeon.\nBow down to the majesty of this one man army as I begin to seize the world."]},{"title":"Purely Yours","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Purely Yours / I’ll Give You My Purity / My Love For You / My Virginity For You / Purity to You / พรหมจรรย์ ฉันให้เธอ / 只為你純潔 / 순결을 그대에게","Despite the barriers between them as servant and master, Dean and Lady Sarah have always been close, and lately, their relationship has been warming up even more. But everything is disrupted when Sarah’s family pushes her into an engagement with the wealthy and chauvinistic Count Van Der Sar, who only wants an innocent virgin for a wife. Sarah is determined to do whatever it takes to dissuade him from marrying her. Unfortunately, the ensuing love affair threatens to bring about not only her own ruin, but that of everyone she holds dear."]},{"title":"11336","tags":["Adaptation","Comedy","Fantasy","Manhwa","Romance"],"disc":["Read manhwa 11336 / 일일삼삼육\nLong straight hair drenched by the rain, a white dress, his first love. He had fainted due to that vague"]},{"title":"Secret Lady","tags":["Adaptation","Fantasy","Isekai","Manhwa","Mystery","Romance","Shoujo","Webtoons"],"disc":["Read manhwa  Secret Lady / The Lady’s Secret / 시크릿레이디","A child who has the ability to see ghosts, Yoon Seol-woo. Has reincarnated into Rosantine, a princess who could see ghosts. I’ve managed to fake not being able to see ghosts somehow but… “Leave my sibling’s body this instant!” I cried out to the spirit who’s possessed my one and only little (brother/sister)’s. However, only the death penalty awaited for me if my ability were to be found out. Then, there’s only one way. “You’re planning to kill Prince Chartus, right?” I will save the Empire’s second prince, Prince Chartus with this ability! “I’ll bet my life on Your Highness.”"]}]