[{"title":"Is This Hero for Real?","tags":["Action","Comedy","Fantasy","Isekai","Manhwa","Shounen"],"disc":["Read manhwa Is This Hero for Real? / 이 용사 실화냐?","Until now, no hero like this has existed. Is this a hero, or a demon?\nKang Han Soo was summoned to another world along with his classmates. They are amazed by the magic and the otherworld, but Han Soo just wants to go home as soon as possible. Why would he go on an adventure in another world and leave behind his comfortable and warm house…?\nThe goddess that summoned him promised to send him back to his original world if he didn’t have the will to help, and she teleports him somewhere…\nWhen he opened his eyes, it’s still the other world! His friends are gone and there are monsters all around!!\n“The goddess deceived me…?\n“How will I get back home…??\n“How will I survive here in the first place…???”\nA tear-jerker survival story of the hero (for now) Kang Han Soo!"]},{"title":"Is Everyday Life Possible?","tags":["Comedy","Drama","Romance","Slice of Life"],"disc":["Read What’s Wrong With Your Online Life? / Is Everyday Life Possible? / 日常生活可能ですか？ / 일상생활 가능하세요? (화진)","Yoo-il Hotel’s representative director is Lee Hojin. He not only possesses an outstanding appearance and background, but he is also competent, modest, and well-mannered! The natural enemy of such a man is Lee Youngjun, his cousin. In order to screw over the devious last boss who takes everything away from him, even the attention and spotlight meant for others, Hojin is trying to obtain an art piece that Youngjun couldn’t get. In order to do so, he needs to become the husband of Han Seojung, the youngest daughter of the art piece’s owner… This webtoon has been adapted from a web novel, written by Jeong Gyeong Yun of “What’s Wrong With Secretary Kim?”"]},{"title":"The Newlywed Life of a Witch and a Dragon","tags":["Fantasy","Historical","Romance","Webtoons"],"disc":["Read manga The Newlywed Life of a Witch and a Dragon / 마녀와 용의 신혼일기\nThe sweet newlywed life of a genius witch who entangled her life with a dragon by mistake!\nWhen I opened my eyes, I saw that I was lying with my sister. As soon as rumors spread that I had attacked the new recruits of the Magic Tower, my position and reputation that I had worked so hard to build would disappear like a mirage in the desert. I could see Master’s disdainful gaze. You may not believe it when I said that I would do anything in exchange for this secret, my junior became beautiful.\nSpeak with a smile. “Please marry me.” But you, you didn’t say you were a dragon! Isn’t this a fraudulent marriage?"]},{"title":"I tried to run away after eating the male lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Tried To Eat With The Male Lead and Ran Away / I tried to run away after eating the male lead / 먹고 튀려 했습니다만","I was starving and went to the temple to beg.\nSuddenly, the temple began to collapse.\nAs I was about to go out in a hurry, but a candy that seemed to smell sweet rolled around.\nWhen I picked it up and opened my eyes again,\nThere was a man called a demon without blood or tears in front of me.","“If you ate it, you should take responsibility, right?””","I have to give it back somehow before this crazy guy cuts my belly.","“The most effective way of exchanging strong power between humans is through physical contact.\nThe representative and most effective way is to sleep… … to-?”","The end her voice automatically slipped.\nWith a slow smile, he stretches out his hand, and becomes confused.","“This is true. I can’t help it.”\n“What? What?””\n“You read it yourself. A Solution.”\n“…Yes?”\n“Step by step, shall we try?””","Enchanted by his beautiful face and deep eyes\nI couldn’t even ask how to try step by step.","Are you… are you a villain who destroys the world with your beauty?"]},{"title":"I Will Try to End the Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Try to End the Male Lead / I Will Kill the Male Protagonist / 남주를 죽여보겠습니다","I, Kwon Jinha, began feeling sick after reading a romance novel. I became connected to all the emotions and sensations of the female lead, Elvi. I even went to the hospital due to severe pain and sorrow but the result said there’s nothing wrong with my body. So, I ended up sending an email to the novel’s author, begging for the male lead to stop tormenting the female lead. But instead, all i got was a happy reply, “Do your job properly, Elvi”. I found myself possessed in Elvi’s body in the novel. I got slapped by the male lead as soon as I possessed Elvi’s body, upon that, I had only one thought, “The male lead? It’s over if I kill him, right?”"]},{"title":"It’s Not Easy Being the Ice Emperor’s Daughter","tags":["Fantasy","Isekai","Romance"],"disc":["Read manga It’s Not Easy Being the Ice Emperor’s Daughter / 氷の皇帝の娘はラクじゃない / Before My Father Kills Me"]},{"title":"Falling In Love With Disgrace","tags":["Drama","Fantasy","Manga","MANGA","Romance","Webtoons"],"disc":["Read manga Falling In Love With Disgrace / The Abandoned Young Lady is Doted Upon by the Demon King / Suterareta Reijou wa Maou-sama ni Dekiaisareru / 捨てられた令嬢は魔王様に溺愛される","Despite being born into a noble family, Claudia faced severe adversity. She was confined to a shed and taunted as a “Demon Child” because her eyes were two different colors. In an effort to secure her a chance at becoming the Crown Princess, her father devised a scheme. Claudia remained determined to prove her worth through the demanding training. However, her dreams are shattered when the Crown Prince abruptly cancels their engagement to marry the new incarnation of the “Maiden Light,” the legendary figure that once saved the world. Prince Arwin, derisively mocking Claudia, almost drives her to take her own life. At that moment, Claudia is saved by the mysterious Margrave Graham, who not only asks for her hand in marriage but also brings her to his castle. However, as night falls, Graham’s dreadful curse begins to manifest… “Did she see me in such a disgusting state..?!” This marks the beginning of an ill-fated noblewoman and the cursed aristocrat’s Cinderella story!"]},{"title":"Secret Happiness","tags":["Drama","Manhua","Romance"],"disc":["Read manhua Secret Happiness, Forbidden Love, Tou Huan, 偷欢"," "]},{"title":"The Prince of Myolyeong","tags":["Action","Adventure","Fantasy","Historical","Manhwa","Shounen"],"disc":["Read The Prince of Myolyeong / Crown Prince of Myolyeong / Crown Prince of the Clever Spirit / Crown Prince of the Mystic / Le Prince Mystique / Mystic Prince / The Prince of Myolyeong / องค์ชายผู้เลอโฉม / 妙龄皇子 / 묘령의 황자","Jeokyeon, the Fourth Prince who willingly took a path that contradicted to the fixed fate, participated in a contest held for the throne to become an immortal god. Twenty princes and one throne. Amid the sharp confrontation, an old conspiracy slowly unveils itself, contrary to what is known to the public, the gaze of the watching enemy are gradually becoming prominent and deeper. A love-hate epic that blooms splendidly around the prince of Myolyeong."]},{"title":"Disobey the Duke if You Dare","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Disobey the Duke if You Dare / Cilukba! Ku Lihat Bojo / Desobedece al duque si te atreves / If I Disobey the Duke / Jangan tutup mataku, bang / 공작님의 말씀을 거역하면","You must never see the duke’s face. After her second husband’s death, Lily is forced into a third marriage by her father. Her new husband is rumored to be a monstrous warmonger, but to Lily’s surprise, the Duke turns out to be a kind man and husband. There’s just one catch… she must never see his face."]},{"title":"Shadowless Night","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Shadowless Night / 그림자 없는 밤 / A Night Without Shadow","[If you enter the deep forest, you will be eaten by the shadows.","The shadows of the forest move when a person is not looking.","There is a shadow that mimics people in the deep forest.","The shadow of the forest speaks.]","Rosaline, of the Knights of the White Night, had gone missing after being attacked by enemy forces during a hunting contest.","However, she was found unconscious, badly injured, and lying beneath the cliff.","Rosaline, who woke up a few days later, seemed to have severe memory loss. It was difficult for her to speak even simple words.","She was found walking barefoot, in her pajamas, talking informally here and there. She would even pick up food off the floor!","She’s a strange girl no matter how you look at her. Is that really Rosaline?"]},{"title":"How to Live at the Max Level","tags":["Action","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How to Live at the Max Level / The Max Level Heroine / 만렙으로 사는 법\nEven a graze from her is a Critical Hit! The tormented goddess who can’t land a weak hit has descended!\nA stress-free fantasy adventure romance between a girl who fell into a world inside a game and a mysterious and virtuous man!\nShe was summoned to the Otherworld after she mistakenly clicked a quest window of , a game that provided a reality-like fantasy. Nicknamed ‘Chaos Demon King’, Ju Sae-Young fell into the Otherworld ‘Arcadia’.\nHer confusion was only momentary, and clearing the Otherworld was easy as pie for a max-leveled user like her.\nShe collected cute party members, destroyed dungeons to obtain treasures, and even got to date the dreamy and virtuous man, ‘Callad’.\nBut the Quest of the ‘Supreme God’ that would grant her a return to her original world entangles Sae-Young and her comrades into a grand and dark conspiracy!\nAnd to clear the quest, she has no choice but to sacrifice Callad…?"]},{"title":"The White Lion’s Secret Bride","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The White Lion’s Secret Bride / 하얀 사자의 비밀 신부 / The Secret Bride Of The White Lion / Ryan Black / Violet Lancaster","He is a dark beast worthy of his name who’ll do anything for money. This is what Isabella Barret is told about Lion Black, the man she must marry while in disguise as his actual fiancée, Violet Lancaster. As dangerous as this gamble is, if Isabella manages to fool Lion until their one-year marriage contract is over, she’ll be freed of yet another contract that has kept her shackled for the past five years. But to Isabella’s surprise, she isn’t the only one putting up a fake act in the relationship, as Lion’s heart might not be as cruel as his reputation suggests. And what’s more, the longer Isabella looks at him, the more she begins to see in him a precious old friend who presumably died years ago…"]},{"title":"Invincible at the Start","tags":["Action","Manhua"],"disc":["Read Invincible at the Start Already Invincible at the Beginning","“Ding, the host has opened the invincible field! As long as the host is invincible in the field…!” As a nerd, Chen Changan travels through the fantasy world, facing countless monsters and ghosts from the outside world, Chen Changan decided not to leave his invincible field before becoming immortal. When he is bored, he occasionally raises a few cute and sweet apprentices, and accidentally cultivated them to become leaders in the spiritual world, which turned the world upside down."]},{"title":"Sponte Dei","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Sponte Day / 스폰테 데이\nSponte Dei Without knowing the reason, I became a maid in a rural village in my novel. While trying to find a way to go back home somehow, I met the dark villain “Radael Craino” in the original novel. After many twists and turns, I hear that there is a way to return to the original world. I thought I could finally go back to the world… “If I choose, the story here that God created who you don’t even know will be a story for you.”"]},{"title":"Mansion Wing Chunhua: Parachute Blouse","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Mansion Wing Chunhua: Parachute Blouse / 저택 영춘화:낙하산지 블라우스","In 1940, a man builds a mansion on a remote island for his wife. After her death, the mansion falls into oblivion until a mysterious manager turns it into a place of lodging, inviting people who must find love. Among the guests are Choi Baek-tan and Yang Suzy, who discover a mother-of-pearl cabinet on the second floor and have a passionate encounter wearing antique clothes. However, after this encounter, she notices her partner behaving strangely, leading her to wonder about the identity of another being who seems to have been waiting for her there for a long time."]},{"title":"Soul Slayer Chronicles","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Soul Slayer Chronicles","Jiang Xiaobai, a sickly youth, ventures into the mountains in search of medicine. Through a series of twists and turns, he unexpectedly becomes a menial servant in an immortal sect. Accidentally acquiring a mysterious black sword, he carves out a unique path of cultivation. By slaying demons, he refines their souls, swallowing mountains and rivers, yet tainted by their allure. By slaying alchemy cultivators, he concocts pills in sacred cauldrons, possessing the miraculous ability to restore life. By slaying scholars, he crafts talismans with his hands, transcending the ordinary. By slaying Buddhas, he purifies heaven and earth, untouched by worldly dust. From then on, Jiang Xiaobai soars to the skies, even the forbidden zone’s great demons willingly acknowledge his dominance. Even the sect’s venerable ancestors, humbling themselves, bow to him as their master…"]},{"title":"The Archmage’s Daughter","tags":["Adventure","Drama","Fantasy","Magic","Webtoons"],"disc":["Read manhwa The Archmage’s Daughter / 마법사의 딸 , Daughter of the Archmage , Putri Penyihir Agung ,The Magician’s Daughter ,魔法师的女儿 ,대마법사의 딸","Maybelle had lived a life of abuse under her parents. Upon discovery that these ‘parents’ aren’t her true biological parents and that somewhere, her father exists, with a sad heart, Maybelle sets off in search of him."," "]},{"title":"Evangeline’s Sword","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Evangeline’s Sword / 에반젤린의 검\n“I want to bring it back… Our original form, our original Michael… .”\nEvangeline and Michael grew up together on the island since childhood.\nHowever, her friend Michael left the island to become a knight and lost contact with him.\nWhen was it wrong? Five years later, Michael met again and became a cursed magician who burns the continent.\n“Me… I can’t remember anything, Eve.”\n“What do you mean?”\n“I… I’ve been cursed by a demon dragon.”\nThe evil dragon’s curse turned the boy with the angel’s name into a slaughter-crazed demon. The boy’s most precious person, Evangeline, makes a decision.\n“I will choose you this time. Mika.”\nThe story of Michael, who became a magician under the curse of a demon dragon, and Evangeline, who tries to save Michael."]},{"title":"What I Decided to Die For","tags":["Drama","Josei","Manhwa","Psychological","Romance","School Life","Yuri"],"disc":["Read manhwa What I Decided to Die For / The Reason I Decided to Die / My Reason to Die / 내가 죽기로 결심한 것은","Ji Oh, a senior in high school who was injured ahead of the National Taekwondo Competiton, is facing late puberty. Cha Gyeol, who met Ji Oh while having all sort of bad thoughts, is completely swoon over by Ji Oh with her dazzling smile. However, the people around Cha Gyeol are somehow dangerous for her to go head over heels with him. Her mind knows that she should be wary of him but she could not stop her interest towards Gyeol. Is it alright for her…to like him?"]}]