[{"title":"Sea God’s Law of Love","tags":["Fantasy","Historical","Isekai","Romance"],"disc":["Read manga Sea God’s Law of Love / 海王的恋爱法则 / Hǎiwáng De Liàn’ài Fǎzé","After transmigrating to the modern age and being an idol for 3 years, Ophelia, the Princess of the Nariel Empire, wakes up and finds that she has returned to her original world, but she has become a player Sea God! The gentle and lovely Holy Saint, the healthy and bright Paladin, and even the rich second generation playboy have all become a fish in her fish pond! She didn’t even let go of her own second brother! However, her first love, Holst, is distancing from her, and it seems that her transmigration may very well be a well-designed conspiracy…"]},{"title":"A Silent Garden","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Tragedy","Webtoons"],"disc":["Read manhwa A Silent Garden / Garden of Silence / 침묵의 정원","It wasn’t until I lost my husband and daughter that I realized my world was warped. The second life that came like a miracle is going to be useful for me now."]},{"title":"My Snapping Fox Lord","tags":["Demons","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua My Snapping Fox Lord / This Fox Fairy Is a Bit Fierce / Zhège Hú Xiān Yǒudiǎn Xiōng / 这个狐仙有点凶","The human girl Yan Xiaoqi accidentally breaks the seal of Li Xiu, a fox immortal who is handsome but flirtatious! She has been forced to embark on a journey with him to find the Horcrux. Subscribe our comics to enjoy the sweet love between them~"]},{"title":"Falling for the Enemy","tags":["Action","Drama","Fantasy","Magic","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Falling for the Enemy manhwa, 원수를 사랑하게 된 이유에 대하여\nHow could I love the enemy? After her parents’ death, Lia versed herself in swordsmanship to protect her family. But as the Empire’s only female Commander of a knights’ battalion, she can’t seem to catch a break because of the meddling Duke Edgar! But wait… Why does this “enemy” blush whenever he looks her way?!"]},{"title":"This Life, The Way I Want","tags":["Comedy","Drama","Harem","Manhwa","Romance","Shoujo"],"disc":["This Time I’ll Live as I Wish / Eu vou viver minha vida como eu quiser / I Will Live My Life as I Wish / I Will Live This Life According to My Will / I Will Live This Life as I Wish / This Time I Will Live as I Wish / 今度は悪女だなんて呼ばせません！ / 魔女今生要随心所欲 / 이번 생은 내 뜻대로 살겠다\nWhen Erina gets adopted by Marquess Sinor because of her magic abilities, she didn’t realize her life was only about to get much worse. After years of abuse and torment from the Marquess, Erina is on the verge of breaking down. Just when she decides to end it all, Erina is visited by her past self: Marystella, the powerful witch who once ruled the entire kingdom. Marystella asks Erina if she could help her reveal the truth behind her death. In return, she promises Erina to make her the greatest sorcerer that the world has ever seen. No more suffering, no more pain; Erina is about to do whatever she pleases with her newfound power!"]},{"title":"Follow The Bread Crumbs","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa Follow The Bread Crumbs / Follow the Breadcrumbs / Raised And Eaten / รักหมดใจ ยัยแม่มด / 키워서 잡아먹혔다","I’m the Gingerbread House witch! I possessed Yielle Frank, the witch from Hansel and Gretel! I didn’t want to die like in the original story, so I took good care of the children and sent them off. But ten years later, Hansel returns, all grown up… “Am I still just a kid to you? Please don’t run away.”"]},{"title":"Dubious Moon","tags":["Josei","Romance","Webtoons"],"disc":["Read manhwa Dubious Moon / Susanghan Mungwajang / 可疑的文科长 / 수상한 문과장","A cheeky office romance that erupts out of a slip of the tongue. ​Shiwon finds herself still reeling from the shock of being dumped by boyfriend number four. Her pride is on the floor from having to deal with the consistently emotionless and nitpicking manager Mr. Moon at the office. During a night out with her co-workers, she drunkenly calls him out. She ends up confessing her feelings and asking him out when all she had planned to do was apologize. Surprised by Mr. Moon’s acceptance of her invitation to go on a date…a secret office romance is ignited."]},{"title":"I Changed My Life By Signing In","tags":["Action","Adventure","Fantasy","Manhua","Martial Arts"],"disc":["Read manhua I Changed My Life By Signing In / 我靠签到逆天改命\nAfter the male protagonist crossed, he was mistakenly taken in by the Jade Female Sect, which was full of female disciples, and became a nursing home to watch the gate. Favoured by the god-level check-in system, he obtained a magical physique that had never been seen in ancient times: the Spring Heart Divine Body. It is necessary to constantly adjust the girls to obtain welfare stimuli and convert the excitement points into cultivation. The Jade Girl Sect is surrounded by strong enemies and is in danger. In order to protect his own En (NV) people, the male protagonist relies on the super god sign-in system, fights the same way, kills the demon Xiu, fights the alien race, and zhen eight."]},{"title":"I don’t want to be Empress!","tags":["Fantasy","Manhwa","Romance","Slice of Life","Webtoons"],"disc":["Read manhwa I Don’T Want To Be Empress / Empress? Empress! / Keep Alive to the End / 황비님? 황비님! / 反派皇妃求保命\nI don’t want to be the empress! Serena, the daughter of a noble is full of intelligence, status and appearance. But the truth is that she said that in her past life she was aware of the tragedies that could occur in the future. It will be that Serena can escape from this tragedy!"]},{"title":"A Witch’s Hopeless Wish","tags":["Drama","Historical","Josei","Manhwa","Mystery","Romance","Shoujo","Webtoons"],"disc":["Read manhwa A Witch’s Hopeless Wish / A Witch’s Hope That Can’t Be Fulfilled / A Witch’s Hope That Can’t Come True / The Hopeless Desire of a Witch / 이뤄질 수 없는 마녀의 소망 / 이뤄질수없는마녀의소망 / 无望的魔愿","“If I had died then…” Caidel lost everything in a fire. With no home or family, Caidel ended up alone in an orphanage. Unfortunately, he was ostracized and had a hard time. Then one day, the Earl who knew the origins of the fire, came and asked to adopt him… “Won’t you search for the white-haired woman with me?” The only clue to the arsonist was that she was a white-haired girl. She took everything from Caidel and the Earl. The truth of the incident is being unveiled… but what if the truth takes everything from me again? What should I do?\nThe Hopeless Desire of a Witch / A Witch’s Hope That Can’t Be Fulfilled / A Witch’s Hope That Can’t Come True / I’rweojil Su Eobsneun Ma’nyeo’eui So’mang / 이뤄질 수 없는 마녀의 소망"]},{"title":"Related to Love","tags":["Comedy","Romance","Webtoons"],"disc":["Read manga Related to Love","Regarding an office romance in the city, in a druken state, Xiao Ai Ai “shared a bed” with the high school Council President, and he’s also the General Manager of a company who constantly helped her in the dark. A romance story full of twists of a strong two faced president and a simple stubborn office worker."]},{"title":"The Stereotypical Life of a Reincarnated Lady","tags":["Fantasy","Manhwa","Reincarnation","Romance","Shoujo"],"disc":["Stereotypical life of Valerie’s iron wall romance! , 흔한 환생녀의 사정The Stereotypical Life of a Reincarnated Lady","Valerie thought she’d be a genius mage in this world. But when her magic can’t get past basic and her teacher shares a prophecy of a tiger coming to attack(!!), she opts to enjoy an ordinary life. Everything’s fine until she’s engaged to none other than Duke Kylus Dwello. It’s just one thing after another—the mysterious Serena, the servants who ship the duke and Serena, a prince who doesn’t understand boundaries, and even the duke looming over her bed! Can she get back to her nice, quiet life?"]},{"title":"Lord, Let Me Be the Devil!","tags":["Comedy","School Life","Supernatural"],"disc":["Read Lord Let Me Be The Devil / Lord, Please Turn Me Back Into a Devil! / God, Please Make Me a Demon!","Baek Moran, the witch of the hardships in life. Her true identity is a devil, but she is punished to be always reborn as a human. To escape the endless cycle of being reborn as a human, she is determined to live life as a good Samaritan this time, unlike in her previous lives. However, with her true evil nature and the world working against her efforts to live peacefully, will Moran be able to turn back into the devil she once was in this life?"," "]},{"title":"My Vampire Master","tags":["Action","Romance","Slice of Life"],"disc":["Read manhua My Vampire Master","Members of the mysterious association”Blood-moon Religion”are in fact all vampires. After a sleep, Su Liyin has become the blood servant for Qin Jiu, the third master of the association. Would she obey to be a portable blood pack or fight against her master? What would she do as it is tough to be teased and her blood to be sucked by such an ancient vampire every day?"]},{"title":"My Heart Within Yours","tags":["Fantasy","Historical","Romance","Shounen Ai"],"disc":["“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","The only male of the Siyou clan has finally found another partner to call his own. They settle together in their own home, learning to manage the household and care for their child. A love story filled with intimacy that also focuses on the responsibility that comes with romance.","山有木兮悦君心; Trees Live on Mountains and My Heart Lives on Yours"]},{"title":"Killing Me","tags":["Drama","Josei","Romance"],"disc":["‘Mina’, a fan of a dying idol group, and ‘Ryeonha’, who has no interest in idols at all. Despite their opposite tendencies, the two are the only friends in the world and have the best of both worlds. However, while at an autograph session, Mina falls into a coma due to an unfortunate accident. She finds her friend Ryeonha resenting her favorite mandol group center, “Douie”. On the other hand, Douie, whose group is in danger of being disbanded, tries to prevent the group from being disbanded, but it is not enough. An inexplicable, supernatural phenomenon occurs to three people in such a crisis! Will the three of them be able to stand up against adversity?","킬링 미"]},{"title":"Have Mercy, Your Ladyship!","tags":["Liexing","Ping Ping Jun","Romance"],"disc":["Read manga Have Mercy, Your Ladyship!","Fok Tianxin was drowned in her last life. She found that the one she cherished and respected wronged her in her last breath! In this life, she will never be a weak lady at the mercy of others! “Shen ruoqiu, i will not spare you this time!” However, having solved Shen rouqiu’s tricks, she found that she was sunk in another trap and it is even harder to get out…"]},{"title":"Abandoned wife has a new husband","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Tragedy"],"disc":["Read manhwa Abandoned wife has a new husband / New Suitor for the Abandoned Wife / 버려진 아내에게 새남편이 생겼습니다","“It’s a wife sale.”","Chloe is eventually abandoned by her coercive and violent husband. It is also a disgraceful ‘selling wife’.","When Chloe is in danger of being sold for three hundred yuan in front of a shabby, cramped bar and men who are no less than a bar.","A mysterious man named Ash Brinicle appears."," "]},{"title":"Is This True Love?","tags":["Drama","Josei","Romance"],"disc":["Read manga Is This True Love?\nFrom Mangaupdates: It feels like Seo Ahjin has been cursed: After five times dating men, all of them are jerks. Even the last one was cheating on her! Unfortunately, he was the niece of her boss. She decided to resign from her job and move to her sister’s house. On her first day moving in, she drink out to relieve her stress with her friend. She was very drunk that she didn’t realize she entered the wrong house. It was the house of Nam Yoojun, the popular actor whom once she met in her childhood. Ahjin has only one wish: to find a sincere love. Will it come true?\nLove From the Sky / Haneul-i Naelin Yeon-ae / Kekasih dari Langit / ??? ?? ??"]},{"title":"Taming the Lady","tags":["Fantasy","Isekai","Romance"],"disc":["Read manhwa Taming The Lady / 길들이는 공녀님길들이는 공녀님 / The Lady Tames The Sword Master","Istina was just an ordinary high school girl until she got struck by lightning. Upon opening her eyes, she realizes that she has woken up inside her favorite novel. At first, she’s ecstatic that she’ll get to meet her favorite character, Laon, but her excitement quickly dies down when she gets a look at her reflection in a mirror. The beautiful little girl looking back at her, with red hair and purple eyes, is the bully who torments Laon relentlessly and makes his childhood a living hell. But mending her relationship with Laon isn’t the only thing Istina has to worry about. Laon is fated to die while protecting the female lead, but Istina isn’t about to let that happen, even if it means that she’ll have to get her hands dirty. Will Istina be able to tame the prickly swordmaster and change his ending at the same time?"]}]