[{"title":"Desperately Wanted: Someone to Love Me","tags":["Drama","Fantasy","Manga","Romance"],"disc":["Read manga Desperately Wanted: Someone to Love Me / 王室皇女は性的に見られたい","Princess Beatrice was deeply traumatized when she discovered her fiancé in bed with another woman. Determined to move on, she decides to attend a ball at her academy in hopes of finding a man who desires her. There, she meets the handsome Prince Franz, a new transfer student. Prince Franz is eager to shed his reputation for promiscuity, while Princess Beatrice is desperate for his affection. Will these two royals manage to find their way into each other’s arms?"]},{"title":"True Education","tags":["Action","Drama","Manhwa","Seinen"],"disc":["Read manhwa True Education / Get Schooled / 참교육","Na Hwa-jin, a member of the Education Protection Bureau, begins ‘true education’ to protect the collapsed school authority!"]},{"title":"I Want to Stop Killing","tags":["Drama","Fantasy","Mature","Romance"],"disc":["Read manhwa I Want to Stop Killing /  I Want to Stop the Murders","Sarin, an art student who wants to hide her past as a psychopathic killer, encounters Sarang, the son of a past victim. As more incidents unfold, the pursuit of the truth leads to a shocking revelation…"," "]},{"title":"The Princess Wants to Die Comfortably","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Princess Wants to Die Comfortably / The Princess Wishes To Die Peacefully! /황녀님은 편히 죽고 싶어! / Sang Putri Ingin Mati Dengan Damai","I now possess the body of Ophelia, the villainess in the story ‘The Crown Prince Returns’.","And just like the protagonists in the other reincarnated novels, I thought I would fare well.","I died by getting guillotined the first time, the second time was getting my limbs torn apart, third was suicide by poison, and by the fourth time, I was struck with arrows atop the throne.","And by the fifth restart, even if I tried to stray from the original storyline, I would still be doomed to die.","“Concoct a poison for me. Not one that’s painful, but one that’ll kill me slowly.”","Therefore, this time, with all my heart and soul, I wished to die properly for once.","“After I ascend the throne, are you leaving me behind?”","“I sincerely hope that her highness survives, no matter what.”","“Your Highness, I wish to get to know you better.”","All these people surrounding aren’t letting me die off easily!"]},{"title":"I Am Living an Unmarried Life With a Terminally Ill Lover","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Royal family"],"disc":["Read manhwa I Am Living an Unmarried Life With a Terminally Ill Lover / 시한부 연인과 비혼 생활 중입니다 / I’m Unmarried With A Time-Limited Lover / In the Midst of an Intended Marriage With My Time-Limited Lover / Living Unmarried With My Time Bound Lover [Official]","“While starting my investment journey, I realized something. With a lot of money, living alone is the best.”"]},{"title":"While You’re In Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa While You’re In Love / 당신이 사랑하는 동안에","Synopsis While You’re In Love I actually knew the truth. «I didn’t marry my wife because I loved her.» So it’s not his fault. It was all my fault to have false expectations. «I just signed a contract with her based on needs.» Three years as his wife. I tried hard to be the right woman for him, but I couldn’t get a piece of his heart. «I didn’t know it would last this long. It’s annoying.» I was nothing to him to the extent that I was thrown away as soon as the heroine appeared. In the end, the main character was the main character and the extra was the extra. No matter how hard I try, I’m just an annoying extra. The role hasn’t changed. So it’s right for me to leave. «I’m sorry I’ve been bothering you all this time. Please be happy with her.»"]},{"title":"I Raised the Nine – Tailed Fox Wrongly","tags":["Fantasy","Romance"],"disc":["Read manhwa I Raised the Nine – Tailed Fox Wrongly / I Raised a Nine Tailed Fox Wrongly / 구미호를 잘못 키웠다","A noble holy knight of the West, Scylima.","During the slaughter of smuggled monsters, a fox went to visit a new girl from the East because of her unusual energy.","And it’s a nasty nine-tailed fox.","If I didn’t want to see it become the devil of hell, I had to raise it myself and take it to the East.","…","I’m more of a spirit than an animal. You know that, right?","Don’t worry. You raised me well, I won’t do anything dangerous."]},{"title":"I Became A Squirrel Saving The Villain","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became A Squirrel Saving The Villain / I Became A Squirrel Seeking For The Villain / 악당을 구하는 다람쥐가 되었다","Wait, am I… a squirrel? How, when, why?!” I opened my eyes and found myself… as a squirrel. Not just any squirrel, but a divine beast known as the “Sacred Squirrel,” treasured for its ability to soothe a wizard’s magical power. But hold on—I was human! To return to my human form, I need to steadily accumulate magical energy."]},{"title":"Ghost Story Club (Remake)","tags":["Action","Drama","Fantasy","Horror","Manhwa","Mystery","Romance","School Life","Supernatural"],"disc":["Read manhwa Ghost Story Club / 괴담 동아리","Lee Joon was an ordinary high school student. During the entrance ceremony, he was caught up in a strange phenomenon and died. [You have died.] [Restarting from checkpoint.] [Loading…] But then, a message appeared before his eyes. 『Congratulations on your acceptance at Nakseong Highschool, the school of secrets and mysteries. Uncover the shady secrets hidden within the school, or fight against the legends and ghost stories of the campus in order to earn points to unlock special abilities. Additionally, you must gather comrades to prevent the resurrection of the Demon King before graduation. The world is in your hands.』"]},{"title":"Meet in The Middle","tags":["Manhwa","Romance","Webtoons"],"disc":["Read manhwa Meet in The Middle / 중간에서 만나","“I can make it fun.” A mysterious young man who one day appears in front of Yeoreum, who is 30 years old and lives an unemployed life! Even if the way he walks straight without looking back is funny, somewhere strong and somewhere obsessive? What do you want from me?! A thrilling two-sided scam romance comedy!"," "]},{"title":"The Thorn Flower’s Gambit","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Thorn Flower’s Gambit / 花荊の復讐婚","For the sake of placing her beloved Arendt on the throne, Juna secretly engaged in wicked deeds. When she had vanquished all her enemies, she was betrayed by Arendt and her stepsister Elena, and sent to the guillotine. However, she awoke as her 10-year-old self, vowing to make them pay! Using the natural magic she had concealed for revenge, she visited Arendt’s brother, Clavis, and proposed marriage. But Arendt was the one who, through cunning and manipulation, ensured her demise. Now, her desire for retribution collides with the remnants of her past affection. Can she reconcile the love she once felt with the burning desire for vengeance? Or will her thirst for justice consume her, leaving her with nothing but ashes?"]},{"title":"Revelation Of Youth","tags":["Comedy","Josei","Romance","School Life","Slice of Life"],"disc":["Read manhwa Revelation Of Youth / Apocalypse of Youth / 청춘계시록","A close and dangerous cohabitation with the cult leader’s son has begun! Chungah was swindled by her uncle who she trusted and her parents disappeared, saying they are chasing their missing uncle, and Chungah suddenly lives alone in an empty house. But it wasn’t just Chungah’s family that was scammed! The biggest cult in the autonomous district, “Millennium Adventist,” was also deceived by her uncle. And “Yohan,” the son of the cult leader came to Chung-ah’s house. He’s dragging his luggage in…! God, is this cohabitation gonna be okay?"," "]},{"title":"A Rogue Guard in a Medieval Fantasy","tags":["Action","Adventure","Fantasy"],"disc":["Read A Rogue Guard in a Medieval Fantasy","In a brutal, lawless medieval world where war and poverty reign,\nand twisted magic defies all reason,\nthe captain of the guards grinds through another grueling day,\npushing his battered body to the limit in a land where survival itself is a merciless test."]},{"title":"The Villainess Has Changed","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villainess Has Changed / 우리 악녀님이 달라졌어요 / Our Villainess Has Changed","Growing up as an orphan, she worked part-time to death and died from overwork.","She was possessed by Annette Ethelred, the princess of a ruined country who was adopted by the heroine of a duke’s family in a 19+ romance fantasy novel she was reading just before she died, and a villainess with a broken personality who tried to kill the heroine.","She was briefly happy about living the wealthy life of a duke’s family, but she was kicked out without a single penny as the original sin for Annette’s evil deeds in the original work!\nIt was too early to give up. With the survival skills she had gained from working part-time, she got a job as a maid at a temple.","“In this life, let’s make a lot of money and date a handsome man!\n…By the way, aren’t the men here normal?!”"]},{"title":"Brood Parasitism","tags":["Adult","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Brood Parasitism / 탁란","After 12 years, Julia returns to Blackfort and encounters Benjamin, who has now become the count. Lonely from her time in the convent, she feels an intense attraction to the charming Benjamin. Then, late one night, he visits her room and says, “If you would allow me… I’m coming in….” Can Julia escape the seductive whispers of this sweet devil?"," "]},{"title":"Time To Dedicate Your Death","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Time To Dedicate Your Death / It’s time to sacrifice your death / Duke Richard’s Haven / あなたの死を捧げる時 / 为你的生命所献的时间 / 당신의 죽음을 바칠 시간","When a forty year old Illian opened his eyes, the first thing he saw was a small hand. An old mercenary, who went back 10 years in past and turned into a twelve year old child, Haven Winter! First of all the family that is falling apart must be re-established, Now that he is back in the past, he must protect the thing he couldn’t protect in his previous life. However…the guy who bothered him in the previous life is getting in his way in this life too. “ Because you’re not Illian Heinrich.” What the hell was my past self to you?"]},{"title":"I Spent the Night with My Soon-to-be Ex-Husband","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa I Spent the Night with My Soon-to-be Ex-Husband","“That night, it was a mistake.” I was the ill-fated duchess, killed by my husband, the final villain and mastermind in the novel. A weak duchess who couldn’t even do her job properly. I planned to divorce him after playing the role of a business-like, show-window couple, but I ended up making a mistake with my soon-to-be ex-husband. “Do you not remember?” But from that day on, the Duke started acting even stranger..? “If you think it was a mistake, let’s check. Do it again.” When I came to my senses, I was already in my husband’s arms. And when I realized that his embrace, which I thought was always cold, was actually warm, it was too late to turn back in our relationship. …Husband, why are you so obsessed when we agreed to divorce?"]},{"title":"Since I Don’t Remember Anything About It, Shall We Break Up, Your Majesty?","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Since I Don’t Remember Anything About It, Shall We Break Up, Your Majesty? / 저는 모르는 일이니 헤어질까요, 폐하? / I Don’t Know, Shall We break Up Your Majesty?","Due to a carriage accident, Lumiere suffers from amnesia. While searching for her memories, she discovers a warning in her diary. [Do not fall for him.] At that time, a man claiming to be her lover appears. “I know everything about you, even the parts you don’t know yourself.” This man, who doesn’t exist in her memories. But she finds herself increasingly attracted to him… …Were we really lovers? Why did we break up? Is approaching the truth really the right thing for me?"]},{"title":"Do You Need Salvation?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Do You Need Salvation?","It seems I’ve meddled with dreams I shouldn’t have touched. The protagonist, born with the ability to interfere with others’ dreams. This time, I thought I’d live an easy life as a beloved count’s daughter… “Miss Miena, it seems you won’t survive this winter.” Once again, a terminal life like my past one. To make matters worse, my family is on the verge of bankruptcy after spending a fortune to save me. “I’ll pay off the squandered fortune and debts before I go!” I only intended to use my abilities to gather information and wealth to live out my remaining days… “Who’s there?” “You look a bit too… something close to an angel.” “How audacious of you to barge into my dream without fear.” It seems I’ve meddled with dreams I shouldn’t have touched."," "]},{"title":"Ungracefully Grace","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Ungracefully Grace / When Misfortune Knocks on the Door / 불행이 문을 두드리면","Wealth, beauty, power… Grace had everything in her hands from the day she was born. Then she got herself banished for single-handedly fighting against 17 nobles. After her yearlong exile, Grace returns to find trouble has found its way into her home her mother had been driven out of the family, and her father now has a new wife and daughter. But to make the dysfunctional family even worse, Grace’s new stepsister frames her, and the servants openly defy her. “I’ll show them why I got banished in the first place!” Can Grace use her wild antics to slam the door shut when trouble comes knocking?"]}]