[{"title":"Love Behind the Scenes","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Love Behind the Scenes / Why Are the Actors Confessing to Me? / 어째서 출연자들이 내게 고백하는 건데!","Director Na Eunseo just needs the third season of her reality dating show Housemate to do well. Then she can finally direct the program of her dreams! However, when the icy former child star Ha Sewon is added last-minute to the cast, he causes incident after incident and threatens to ruin her plans. At least Eunseo has her sweet, shy friend Ahn Jaehee in the cast to help her out. But why are no sparks flying this season? And why do the two male contestants only seem to be looking at Eunseo?"]},{"title":"Masked Knight Will Never Deceive The Villainess","tags":["Comedy","Manga","Romance","Shoujo","Villainess"],"disc":["Read manga Masked Knight Will Never Deceive The Villainess / Akujo wa Kamen no Kishi ni Damasarenai / 悪女は仮面の騎士に騙されない","Can the ex-otaku villainess resist the perilous temptation coming from her beloved character, who happens to be her own killer?!"]},{"title":"Author, In This Life I’m The Protagonist","tags":["Adaptation","Comedy","Drama","Fantasy","Isekai","Manhwa","Romance","Transmigration","Webtoons"],"disc":["Read manhwa Author, In This Life I’m The Protagonist / Author, I’m the Heroine Of This Life / 弃坑作者被迫当女主 / 작가님, 이번 생은 여주인공입니다","“The writer seems to have a hard time writing by hand, so I think it would be better to try writing with your feet this time.”\nI was drawn into the hand of a God who calls Himself my fan, and possessed it as a supporting role in a novel that I had been working on all year round.","“Make sure to complete it with the determination to die, or the determination to survive.”","While I was working hard at God’s threat of death if I couldn’t finish the novel, the female protagonist died right in front of me?!","He grabbed the crotch of the indignant God and hung it.","“… If I can even play a pinch hitter, I can.”\n“Dae-Tara… . Do you think the writer wants to become a female protagonist?”\n“Why, where can’t you? I am a writer, a writer!”","She received the Buffalo buff and succeeded in joining the adventures of the man.","“Young-ae’s help, I will never forget. One day I will surely repay this favor.”","There is no reason to fall in love with the man I made.","have.\nHe’s tough and tough, but he’s so handsome and handsome.\nWhat about those red auricles?","Past life is a writer, current life is a female protagonist.","Adventure, romance, and desperate struggles unfolding by the writer who rolls over as a female lead in a year-round work?!"]},{"title":"The Dark Mage’s Return to Enlistment","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Dark Mage’s Return to Enlistment","Minjun Kim, an ordinary high school senior in Korea, was suddenly summoned to another world, where he became a dark mage.","Determined to return home, he overcame all sorts of hardships and saved the other world with black magic before leaving all his wealth and glory as a hero behind to return to Earth.","However, before he could fully enjoy his life, a problem arose. A dungeon break had occured and monsters came pouring out, threatening his comfortable days.","Therefore, Minjun, who had just returned to earth, had no choice but to… enlist on the very next day!!!"]},{"title":"The Two-Faced Princess","tags":["Fantasy","Historical","Romance","Shoujo"],"disc":["Read manhwa The Two-Faced Princess / Two Sides of the Princess / 두 얼굴의 황녀 / 皇女には二つの顔がある / 双面皇女\n“Your Majesty, please break-off my marriage with Her Highness the Imperial Princess. I fell in love with Lady Adriane Reese.”\n“Six engagements, Six break-ups.” The princess’s fiancé always had an affair with the maids! “I don’t want to marry the crown prince, I want to live with my father forever…” “Such a useless being. Begone!” The princess who is known to be weak and s*upid, Apollonia. But she has another hidden face…\n“It’s because the throne is hard to obtain, my father also spent 10 years on trying to kill my mother, the empress.” As Apollonia grinned, her red eyes shone intensely. Usurpation of the throne. Her goal was clear. She was never shaken. ‘I want to live my life with my father.’\nTo be exact, I want to live my life where my father is seated. Please wait, father. Your daughter is on her way. To take back everything that was stolen from me."]},{"title":"Life on the Flower Road of the Grand Duchess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Life on the Flower Road of the Grand Duchess / Lady Isabella’s Path To Happiness / The Flower Road Life of the Grand Duchess at the End of Time / La Vida en el Camino de las Flores de la Gran Duquesa / Life on the Flower Road of the Grand Duchess at the End of Time / The Terminally-Ill Grand Duchess’ Life on the Flower Road / Time-limited Life on the Flower Road of the Grand Duchess / Гүнгийн авхайн цэцгэн зам дээрх хязгаарлагдмал амьдрал / 余生は薔薇色新婚ライフ / 大公夫人的花路人生 / 大公夫人的花路生活 / 限時大公夫人的花路人生 / 시한부 대공자비의 꽃길 라이프","She was born to received the curse, to disappear. So, she accepted the marriage proposal to be free from her family before she dies but… the hospitality and affection she received from her in-laws are endless and her husband’s obsession is mysterious… A flower path unfolds in front of her, who was a time limit!","* * *\nIsabella, who was born to receive the curse, was the time to disappear.\n“That marriage, I’ll do it.”\nAs long as she died, she wanted to be free from them.\nWaiting for Isabella at the place where she went to find her death spot…\n“Ha… She’s a goddess…”\n“Isabella, can you call me Daddy?”\nIt was the hospitality and endless affection of the in-laws.\nAnd,\n“Even if you die, I won’t let you go.”\nThe unknown obsession of the prospective husband!","“Isabella, you are the light of our North.”\nA flower road unfolds in front of Isabella, who was dead."]},{"title":"Julieta’s Dress-Up","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Julieta’s Dress-Up / Julieta’s Dress Up / 쥴리에타의 드레스 업 / The Reason Why The Beautiful Lady is in Disguise"]},{"title":"THE Runway","tags":["Comedy","Drama","Manhwa","Romance"],"disc":["Read manhwa The Runway / THE 런웨이","I had a one-night stand with my boss?! Jian Yoo is an editor at a fashion magazine. She frantically ran to Paris after hearing that her boyfriend is two-timing. Not knowing better, she made a rash decision to sleep with a stranger she had just met there… Three months later, the editor-in-chief of Jian’s company flew in from their headquarters in France. However, that man…. turned out to be the one Jian spent the night with!!"]},{"title":"Second Life of Dongfang Bubai","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Second Life of Dongfang Bubai, 동방불패, 东方不败,The Invincible Of The East","A match for ten thousand enemies, The Heavenly Enlightened Warrior, The Sacred Saint of Sun and Moon Cult, The Invincible of the East!\nWhile unifying the Jianghu, the Soul Splitting Grand Art went out of control and mistakenly transferred his soul into the body of the 14-year-old son of his target, Mount Hua’s Shadowless Sword Warrior…\nTsk, What can I do with this miserable body…\nStill, I am the Invincible of the East, and all the martial arts in the world are in my head.\nI will unify the Jianghu once again!"]},{"title":"Pure Heart Of A Monster","tags":["Action","Murim","Romance","Seinen"],"disc":["Read manhwa Pure Heart Of A Monster / 괴물의 순결한 심장","There lies a country called Sea Land somewhere in the deep sea, beyond the abyss. The king of White Sea Land, ‘TaeRang’ born without a heart, must steal the heart of a woman who loves him.","However, due to a curse, TaeRang cannot come into contact with any woman. He had given up on life until one day, ‘Solu’ appeared, a woman who didn’t cause harm to his skin when contacted! A self-reliant loner, Taerang’s story of embracing an unexpected woman’s heart begins!!"]},{"title":"The Song of Theodor","tags":["Fantasy","Manhua","Romance","Webtoons"],"disc":["Read The Lady and the Lion / Di Ao Duo Zhi Ge / The Lady and the Lion / The Song of Theodore / 狄奥多之歌","During her childhood years, Sienna, the vivacious Princess of the Western Empire, and Latio, the Prince of the Northern Kingdom who was sent over as a political hostage, had a fateful encounter. The two gradually opened their hearts to each other, while the young King Nyah of the Eastern Empire observed them from the shadows… Alas, the tranquil peace between the three kingdoms was but a mere facade, soon to be shattered at the drop of a hat. As war broke out, the past childhood sweethearts are now faced with impossible choices that pit love against duty: battle and bloodshed, smoke and tears, sincerity and betrayal— riddled with turmoil, the two must come together to compose a song, a song of a boy and girl — the “Song of Theodor”."," "]},{"title":"The Rebirth of an 8th-Circled Mage","tags":["Action","Adventure","Fantasy","Magic","Manhwa","Martial Arts","Reincarnation"],"disc":["read The Rebirth of an 8th-Circled Mage Henry Maurice was an 8-circled archmage who was a legend- one of the founding fathers who helped his friend become the king of a unified empire. After the son took over the throne, Henry was executed with the false accusation of leading a rebellion against the empire. He then wakes up in the body of young Henry Morris, the eldest of a baronet family, who also happened to have the same name. Henry turns his life around by again relearning magic and also swordsmanship in order to become the first magic swordsman, all for the sake of revenge."]},{"title":"Demonas","tags":["Drama","Fantasy","Manhwa","Romance","Supernatural","Tragedy"],"disc":["Read manhwa Demonas / 데모나스","A noble knight who roams the battlefield, ‘Altear Chernobog’. Under the emperor’s orders, she went to war to kill her companion and beloved Ain Estarot, the ‘Son of the Demon’, and in the end she was killed by him. “Ah, I’m sorry. I wanted to protect you as far as my hand could reach.” Just as she was about to break through the memory fragments and go to the underworld, she opened her eyes and saw her father, who had died years ago, standing before her?! Altear, who returned to his childhood as if it were a lie, and thinks. ‘The only chance to save Ain, who has been oppressed by humans all her life."]},{"title":"0-kill Assassine","tags":["Action","Adventure","Fantasy","Historical","Manhwa","Supernatural"],"disc":["Read manhwa 0-kill Assassine / 0-kill Assassin / 0-kill 暗杀者 / 0-kill 暗殺者 / 0-Kill 暗殺者 /アサシン- / 0-kill 암살자 / Sát Thủ Cuồng Loạn / Zero Kill Assassin","The legendary ‘Treasure of the Extraordinary People’ has descended, and the demons in Huaguo are rampant, causing great suffering to the people. At this time, the ‘Black Ghost Squad’ appeared, whose mission was to defend humanity and exterminate demons. Xiao Tian, the leader of the seventh assassination group of the ‘Black Ghost Squad’, originally wanted to serve the country with all his heart, but he discovered that the organization had another hidden agenda behind the scenes, and he was betrayed by his teammates, falling into a desperate situation…"]},{"title":"The Twin Siblings’ New Life","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Twin Siblings New Life / The Twin Siblings’ New Life /Kehidupan Baru Si Saudara Kembar / La nouvelle vie de les jameaux / La nueva vida de los gemelos / 双子兄妹のニューライフ / 双胞胎兄妹的父皇是宠娃狂魔 / 쌍둥이 남매의 뉴라이프","“Your names will be Arjen and Arien.” We were just like any normal twins going to high school, but then we lost our lives to a sudden accident and our second life as twins began! And so we live inside an abandoned palace along with an abusive mother and a cold-hearted emperor as a father. But on our 5th birthday… The king suddenly wants to see his children. “Why so suddenly?” We can only trust ourselves! Initiate the twins’ Project Survive the Palace! A tale about siblings who were reincarnated together at the palace. The siblings are the main characters, and though they cherish one another very much, there are no incestuous elements."]},{"title":"I Will Rewrite the Dead End Novel","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Rewrite the Dead End Novel / I’m Going to Rewrite the Devastating Novel / Aku Akan Menulis Ulang Novel Yang Hancur Ini / 막장 피폐 소설을 고쳐 써보겠습니다 / My Alternate Ending","[Let’s get rid of this psychopath before that]","Yes, I possessed someone.","But who I was in my previous life.\nI can’t remember at all.","All I remember is,\njust this guy’s face that filled my eyes.","The day I woke up for the first time as a wizard’s experiment,\nwe were together.","Strangely enough, about my previous life,\nthis guy seems to know better about it than I do.","In a dead-end novel,\nyou are the only one you can trust and rely on…","In order to live,\nI have to run away from this guy.","In the future, he will kill the female lead’s entire family.\nIt’s because he’s a psychopath whose view on the world is final darkness.","After a while…","Finally, out of his grasp,\nI thought I could live a peaceful life─","“You cruelly abandoned me.”","This guy, he finally found me.","“Did you enjoy playing with me?”","Now, he can’t even be compared to his past self.\nHe went completely mad."]},{"title":"It’s my first time getting married","tags":["Drama","Romance"],"disc":["Read manhwa It’s my first time getting married / 저도 결혼은 처음이라서요","“Ahn Do-woon. Will you marry me?” Yeon-Bora, the CEO of the popular wedding shop Violet. Propose to national actor Ahn Do-woon! Bora was abused and discriminated against at home because of her parents wrong marriage. By chance, she ran into Dowoon, the opponent of her cousin Jiyoung, who was the target of discrimination. I’m having a one-to-one accident. “I’m sorry. I was short on my thoughts. So it’s all about nothing…” “Yeon Bo-ra. I will accept the proposal .” This man immediately accepts the proposal he received while meeting for the first time. What is it…? Bora, who wants to cancel the proposal, and Dowoon, who wants to lead the marriage. Will Bora be able to get this proposal back?"]},{"title":"Tales to Tell","tags":["Drama","Fantasy","Romance"],"disc":["Read Tales to Tell","A mysterious girl who is believed to be the inhabitant of the illusion forest, invites those who get lost to listening to the story, the story of the princess of a fairyland. What kind of story she will bring?"]},{"title":"Dear First Love","tags":["Manhwa","Romance","School Life","Shoujo","Slice of Life"],"disc":["Read manhwa Dear First Love / 첫사랑에게","After her grandmother, the only family member she has, passed away. Jisoo started living in Hajin’s house as a guest.\nEven though she lost her whole family at such an early age, she didn’t show any signs of hardship.\nThat’s why Hajin’s gaze is always on her…!","The story of Jisoo and Hajin’s blooming first love under the same roof.","“You know, it’s really amazing.”\n“What is?”\n“That I came to like a guy who I was sure I would never like.”"]},{"title":"The Stars And I","tags":["Manhua","Romance","School Life","Slice of Life","Webtoons"],"disc":["Read manga My Lucky Star / My Star (Quanyi) / Stars to Me / The Star and I / The Stars and I / Under The Starlight / Xīngchén Yú Wǒ / 星辰于我 / 星辰於我 / 별빛 아래 우리","Mu Zixing met a beautiful boy, Sinan, when she was five years old. He became her childhood friend. During their first meeting, Zixing was rejected by Sinan while she played with mud. Zixing grew to believe that she was hated, but did not know that Sinan, who was enraptured by her infectious cheerfulness and smile, had slowly fallen in love with her. And this love only grew deeper and deeper with time."]}]