[{"title":"The Villainess Captured The Grand Duke","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villainess Captured The Grand Duke / 악녀는 대공을 사로잡았다","My favorite novel character died. After being abandoned by the heroine, he lost his emotions and could no longer use his abilities. While he was weakened, the North collapsed. The novel depicts a happily ever after for the main characters, without even bothering to confirm the location of his body. I’ve possessed the villainess, Scheuer, and decided that I’d rather he gets his emotions back before meeting the heroine, so I headed North. “Duke, would you hold my hand? Or perhaps give me an autograph. I promise to keep it as an heirloom.” “If you want my autograph, then the Lady should also sign here.” “What’s this?” “A marriage registration form.” Pardon? “Just like right now… the Lady’s behavior makes me feel nervous.” …Do I possibly have a chance?"]},{"title":"Beneath the Peach Tree","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Beneath the Peach Tree / Under the Peach Tree / 도화나무 아래서","Being with you is a risk I’m willing to take. On New Year’s Eve, Doa, the daughter of an aristocrat, spends a romantic night with the nobleman who saved her life. However, he disappears the next day, and Doa fears she’ll never see him again… That is until she sees him working in a butcher shop! Is the man Doa fell for not who she thought he was?"]},{"title":"Dragon-Devouring Mage","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read manhwa Dragon-Devouring Mage, 용을삼킨마법사\n[By the studio that brought you Talent-Swallowing Magician!]","[You will be the cornerstone of a new mythology. For the sake of that mythology, I will grant you another chance.] The last successor of a fallen founding contributor family and cursed third-rate mage, Russel Raymond. He hoped to revive his family’s societal status, but was expelled from the academy. All he could do was work as a mercenary third-rate mage. One day, on his way to his temporary job, his mother’s memento ring, the “Dragon’s Heart,” reacts, and Russel is given an unexpected chance. He “regresses” back to his days in the academy. [You have received a mana stone (consumable) as a mission reward.] That is how Russel begins soaring in life. Like a dragon who never got to spread his wings. He crosses the waves called fate that had pressed down on him and flies into the bright world he was previously banned from."]},{"title":"Under the Oak Tree","tags":["Drama","Fantasy","Historical","Magic","Romance"],"disc":["Read manhwa Under the Oak Tree / Di Bawah Pohon Ek / Debaixo do carvalho /상수리나무 아래","“Warning: Mature content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nThe daughter of a duke, the stuttering Maximilian, married a knight of lowly status at her father’s coercion. After their first night, her husband departed for an expedition without another word. He comes back three years later, this time as a famous knight in the whole continent. How would Maximilian face him on his return? “The more I think of you, the more lonely and lonely I become. I don’t know why I can’t quit even though it’s so painful.”"]},{"title":"Libera Me","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Libera Me / 나를 구원하소서 / 私を愛さなくても結構です","The victim of an atrocious war, Shurielle grew up in a temple as an orphan. One day, she finds herself being adopted by Duchess Luke and is excited at the prospect of a prosperous new life. But soon she finds out her fate – i.e. to merely be a puppet that would help the Lune family expand their authority when she marries the Emperor. Not only that, she has to dress up as the Emperor’s previous love, Charlotte, and win his second heart, the Elixia. Shurielle frantically does all she can to survive, but when Charlotte returns, the Emperor turns a cold shoulder to her. It was only when she faces her fifth rebirth that she realizes she would no longer succumb to such a past but forge a new life. But the mad, vicious Emperor seems unable to let go of her. Will Shurielle, once again, be a victim of the Dragon Emperor? Or will she take the hand of the strange man she meets in her new life?"]},{"title":"The Villainess Tames the Crazed Devil","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villainess Tames the Crazed Devil / 흑막 악녀는 미친 악마를 길들인다","Making a deal with a demon is a small price to pay for a chance to enact revenge on the man who accuses you of having been seduced by one. This is the choice Isabella makes when her father unjustly has her and her mother burned at the stake for being witches. After returning three years into the past, Isabella starts fulfilling her half of the bargain: freeing the demon queen’s tragically beautiful son, Kaiden, and unleashing his inner demon. Isabella has one year to avenge her mother’s honor, and she’ll definitely make good use of her new demon husband."]},{"title":"Black Chain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Black Chain / Dark Chain / 검은 사슬","Emperor of the ‘Lupel’ Empire, the black dragon Achelans.\nHasolan fell in love with Achelans at first sight and devoted herself to him for 14 years, but in the end was sadly abandoned without receiving anything in return.\nLamenting about his past life, he hanged himself with silk given to him by the emperor, but he woke up on a carriage headed to Yongyeon, where he first met a dragon 14 years ago.","No matter what he does, Hasolan Odair keeps returning to ‘that day’ 14 years ago.\nIn the end, she had to face the man who sadly abandoned her.\nHowever, the black dragon that awakened Achelans was not someone he knew.","“You are my companion.”\n“If you don’t like it, you won’t become emperor either.”","The emperor, who was so cold and calm, now flashed his golden eyes and refused to let her go."]},{"title":"Romantic Pitch","tags":["Comedy","Drama","Fantasy","Romance"],"disc":["Read manhwa Romantic Pitch","Hyejin has always dreamed of being a journalist, but the school newspaper is about to be shut down, and she must find a way to stop it! Her only chance comes in the form of a not-so-friendly but handsome rugby team captain. Will Hyejin be able to get an interview with him and save the paper?"]},{"title":"To Have an Affair With Someone","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa To Have an Affair With Someone / 맞바람을 핀다는 건","Scarlett, who grew up to be an obedient daughter all her life. She had gone to the capital to marry Duke Huntington on her father’s orders. But his fiancé already had a mistress, and Scarlett was only chosen as a cover to hide between the two. The day before the wedding, Scarlett heard her husband’s soothing words to her lover. “She is just a tool for pregnancy.” Scarlett, who finds out that her father sold her to her husband even though she knows all of this. the night before the wedding. Scarlett tore off her wedding dress and vows. “I believe that if I live as well as I am told, I will receive love in return. I will no longer be deceived by such lies.” In order to escape from her husband and find freedom, Scarlett begins lengthy preparations. I will fight tooth for tooth, and I will avenge my husband by using the men who approach me! But why are the men approaching… The handsome knight, the royal family who has the highest throne, and my husband’s best friend…?! Revenge and freedom, which is better?!"]},{"title":"The S-Class Dungeon Owner","tags":["Adaptation","Adventure","Comedy","Drama","Fantasy","Manhwa","Reverse harem","Romance"],"disc":["Read manhwa The S-Class Dungeon Owner / Mistress of an S-Class Dungeon / Mistress of an S-Rank Dungeon / S-Class Dungeon Hostess / S-Class Dungeon’s Mistress / S급 던전의 여주인","Being the owner of a dungeon is the best dream a demon could have. So when Succubus Adelaide inherits one from an unknown grandfather, she believes she’s set for life. Unfortunately, her inheritance comes with an enormous amount of debt, and she’ll have to raise the dungeon’s rank from F-class to S-class if she has any hope of paying it back. But all that hard work will be worth it because Adelaide will soon be owning much more than just a dungeon as the mistress of three men who beg for the succubus’s attention…!"]},{"title":"How to Choose Your Knight","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa How to Choose Your Knight/ 기사를 선택하는 법","When Jade Browen wakes up inside a dark cabin, she thinks her enemies have finally defeated her. After all, a talented young fire mage is bound to be targeted. And ever since her parents’ death, Jade’s family members have had their sights set on her claim to House Browen’s title as well as her life. Now that she’s been abandoned in a remote forest that nullifies all magic, she’s forced to rely on her mysterious rescuer, Axel. But as she tries to escape her predicament, the forest starts to unravel some dark past secrets…"]},{"title":"That Villain’s Life, I’ll Live It Once","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa That Villain’s Life, I’ll Live It Once / I Will Live the Life of a Villainess / 그 악녀 인생, 제가 한번 살아 볼게요","On her way home, the protagonist, Jung Yuna, gets into a traffic accident.\nAnd just when she thought she had died… she opens her eyes to find herself in a splendid bedroom?!\nObserving for about a week, she realizes that the person she has possessed was the notorious villainess from the novel she had read before her death, “The Lady of the White Rose.”\nNot only that, but she was the ultimate villainess who only did wicked things to the heroine and ended up dying at the hands of the male lead!\nCan Elena successfully avoid her novel’s fate?"]},{"title":"I Grabbed The Leash Of The Blind Beast","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Grabbed The Leash Of The Blind Beast / 눈먼 짐승의 목줄을 쥐었다","Unexpectedly, I grabbed the collar of the blind beast.Grand Duke Eléon Clevent fell into the abyss from the Empire’s Greatest Knight. Rona succeeded in making Eléon, who is obsessed with anger and frustration, into a human being again.Soon after, Rona found her family and left his side.… When the Grand Duke’s eyes were healed, he was desperately searching for her through the entire empire.“Young Lady, have we met somewhere?”“It’s my first time meeting you, Your Highness.”"]},{"title":"So Close Yet So Far [Official]","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa So Close Yet So Far","Let me hold your hand once more. Jiwoo can see the future of those she holds hands with. Yet when she holds Haesung’s hand, she can see her own! Hoping to know her fate in the upcoming art contest, Jiwoo tries to hold Haesung’s hand again, but he refuses. What trauma lies in his past? Can the two pull each other back to the present?"]},{"title":"Level Up with Skills","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Level Up with Skills / 스킬빨로 레벨업 / Leveling Up With Skills","In the year 2020, humanity faces a crisis as Earth is attacked by unidentified monsters. Players prepare for the attack by challenging the Labyrinth that appeared. They can choose four options:","Easy Mode, where anyone can survive; Normal Mode, where you must work to survive; Hard Mode, where only 1% could survive; and Solo Mode, the harshest difficulty.","Kang TaeSan, the strongest Easy Mode player cleared the Labyrinth using an unconventional approach and acquired skills others could not: [ Addition, Multiplication, Attack Nullification, Ultimate Judgement…].","But because he chose Easy Mode, his power was lacking. Unable to prevent the extinction of humanity, he lay dying. A miraculous chance appears.","“This time I’ll definitely become stronger.”","Challenging the Labyrinth again, this is Skill-based Player Kang TaeSan’s Solo Mode Attack Record!"]},{"title":"I’m the strongest boss","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua I’m the strongest boss / Wǒ, Zuì Qiáng BOSS / 我！最强Boss! / 我，最强BOSS","The end of the world is coming, and human beings have awakened their superpowers and fought against the monsters in the towers. However, there is a strongest BOSS sitting at the highest point of the tower – Demon King Jiu Ming. He is an insurmountable barrier for humans. One after another, the brave men always thought that they were the protagonists in the story, but the halo of the protagonists never came to them. When the protagonists lose their protagonist aura, they no longer are the protagonists."]},{"title":"The Baby Dragon and the Rabbit Spirit","tags":["Comedy","Historical","Romance","Shounen Ai","Supernatural"],"disc":["Read manhwa The Baby Dragon and the Rabbit Spirit / 밀토담, 새끼용과 토끼신령","Rabbit spirit, Bi-yeon, who has nothing to do except take care of rabbits, picks up a cute little dragon that was badly injured one day. From that day onwards, he starts dreaming of his past life. Among the divine beasts, the rabbit spirit ‘Biyeon’ is on the lowest level. Although he is the highest level of divine beast, ‘Do-ryu’ was born with a prophecy that he would destroy the country. Their meeting, disguised as chance, and his other self from his previous life, start opening his eyes to new things."]},{"title":"Genius Hitter Hits Fastball","tags":["Drama","Romance"],"disc":["Read manhwa Genius Hitter Hits Fastball","Even he, Kang Geon-woo, a genius major leaguer who gained wealth, fame, and everything, could not continue a happy married life with his wife. He, who felt regretful about his wife’s absence, returned to the past with the power of a mysterious ring. As a high school student in the midst of a fresh romance, will he be able to find love this time?"]},{"title":"It’s voice phishing, but it’s a life reversal","tags":["Action","Adventure","Fantasy"],"disc":["Read It’s voice phishing, but it’s a life reversal / Life Changer Voice Phishing, Voice Phishing Turns Your Life Around /  보이스피싱인데 인생역전","I’ll change your future!” A chance to turn your life around, a guaranteed service promised by a voice phishing scam! “Kang Juhyuk,” a once beloved national actor who has fallen from grace and into poverty, lives in a dark, single-room apartment in misery.","One day, an unidentified smartphone is sent to Juhyuk, leading to a series of events that will completely change his life. “The voice phishing calls I’m getting… are they selling the future?”"]},{"title":"Another Typical Fantasy Romance","tags":["Action","Drama","Fantasy","Magic","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Another Typical Fantasy Romance / Bukan sekedar manhwa fantasi romantis biasa / Another typical fantasy romance / 아무튼 로판 맞습니다","After the gods dropped her in the world of her favorite fantasy romance novel, Lithera was quick to realize that happily-ever-afters were never easy to get. Given another shot at happiness, she is now determined to avoid the mistakes of her previous life, starting by meeting the sweet and caring Grand Duke she spent years exchanging letters with…\nAnother typical female lead, with another typical Duke, promised to Wed. Will this story go the typical path we all expect?"]}]