[{"title":"I’m the Master of this Life","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m the Master of this Life / I Am the Master in This Life / Helena: Master of the Guardian Stone / In This Life, I’m the Master /이번 생은 내가 주인입니다\nThe guardian stone of the family appeared to me. To me, the illegitimate child, not my half-sister who is the enemy. Since then, the treatment of me has changed. It really felt like they were part of their family. However, as he died, he realized that it was all an illusion at the hands of his fiancée. That everything he did for me was a scheme by my half-sister to take the guardian stone.\n[Don’t you want to take revenge on those who thoroughly deceived and killed you?]\nI decided to accept the devilishly sweet offer. This time, I will definitely get the guardian stone and become the head of the household. I will give you back as much or more than what you suffered. Until then, no one will believe. But…\n“From now on, no matter what happens, you must never stop and run.”\nThe image of him trying to save me, his eyes running in despair, couldn’t be erased from my mind. The fiance I loved is looking at me as I am dying, but why are you running to me with those eyes, who you thought was her sister’s person… … . wanted to know what your sincerity is."]},{"title":"Golden-Eyed Bari","tags":["Action","Drama","Fantasy","Historical","Magic","Manhwa","Martial Arts"],"disc":["Read manhwa Golden-Eyed Bari / 금안의 바리","A thousand years ago, a war erupted between humans, backed by “Lifespans,” and the gods. In this war, there was one god who fought on the side of humans, her name was “Ogu.” The defeated “Lifespans” were divided into ten thousand insects and scattered across the world, while Ogu, the god, found herself caught in the cycle of reincarnation. After a thousand years, Ogu is reborn in the body of a young girl named “Bari,” and the “Lifespans” show signs of resurrection as well. Two horrific wars must not happen again! Bari and Ogu embark on a journey to thwart the plans of the “Lifespans” and find the divine beings. Will Bari be able to save humanity and prove her existence on this journey?"]},{"title":"The Mist Of Summer’s End","tags":["Drama","Manhua","Romance"],"disc":["Manhua to read The Mist Of Summer’s End / 尽夏之烟 at manhua website","Some say that the God of Love disappeared a hundred years ago, his consciousness seperated into countless pieces and fell into the world, then time repeats in a loop – Suomei is someone who likes to read these thrilling stories. During the summer after graduation from law school, Suomei went to an old studio to kill some time, but was approached by YeFeng with a box of strawberries, she initially thought he was just a ordinary boy, but his identity is not so simple. “This time, are you going to love her…or kill her?”"]},{"title":"Unscrupuous Consort: the Evil Dotor","tags":["Action","Drama","Fantasy","Historical","Manhua","Romance","Webtoons"],"disc":["Read manga Unscrupuous Consort: the Evil Dotor","When she met him for the first time, she just wanted to escape from him. From then on, however, she gradually got used to his company. He is the god of death to everyone else, but he will always give the barest hint of a smile to her. Whenever there was a danger, he would always help her like a real god fallen from the heaven, mocking her at the same time. With the lapse of time, her feelings for him was more than just dependence. If she doesn’t love him, she wouldn’t let him stay by her; If not, how would she feel so different…"]},{"title":"The Best of Tomorrow","tags":["Drama","Fantasy","Manhwa","Romance","School Life","Slice of Life","Webtoon"],"disc":["Read manhwa The Best of Tomorrow","Im-sol is an ordinary student who is about to graduate from college. Hiding the fact that she is a fan of Ryu Seonjae, the fifth member of the Idol group “Kamjajeon”, she is living an empty life. <BREAKING NEWS> Ryu Seonjae, a member of the Idol group “Kamjajeon”, is dead! Then one day, because of an accident, Ryu Seonjae died and Im-Sol, who washing her sorrow away with a pack of soju, accidentally picked up a pocket watch and made a time leap to the"]},{"title":"Playing With The Hot Gangster","tags":["Manhwa","Romance"],"disc":["Read manhwa Playing With The Hot Gangster","“I laid the man I met for the first time!” Eunha, a creator of the unpopular children’s channel, ‘Minionni’, injures a man by accident during cleaning work. He has an enormous height, a gigantic muscular body, a fierce expression and a scar! Eunha scared, runs away. Meanwhile, at the hospital, scary man (?) Jihwan wakes up and says: “Find her and bring her in politely.” He seems to know something about Eunha…?"]},{"title":"My 1.5-Billion-Won Item (Official)","tags":["Action","Adventure","Fantasy","Manhwa","Virtual Reality"],"disc":["Read manhwa My 1.5-Billion-Won Item / Back Then, I Didn’t Realize It Was a Big Win / I Didn’t Know It Was a Prize at the Time / I Don’t Know Its Worth Then / 育ててみたらレアキャラでした / 그땐 득템인 줄 몰랐다","In the VR game Legend World, people earn money by selling items in the real world, but ordinary player Yak wants more than just making ends meet. Then one day he gets a mysterious reward, Gigantes Dark, a pet-class item worth 1.5 billion won! Finally thinking he’s made it, Yak is dismayed to learn that, as a pet, Dark can’t be sold. However, as there’s no limit to how powerful Dark can become, Yak decides to raise him. Can Yak be a good parent for Dark and rise to the top of the Legend World?"]},{"title":"Surviving as an Obsessive Servant","tags":["Drama","Fantasy","Historical","Isekai","Magic","Manhwa","Romance"],"disc":["Read manhwa Surviving as an Obsessive Servant / Surviving as an Obsessed Servant / 집착 시종으로 살아남기","I’ve died of the same rare disease 3 times in the world of a BL novel. I can’t die like this anymore. So I took special measures. ‘Let’s just put a spoon on the well-prepared medicine table!’ Young master, I won’t miss a single drop of medicine or even a breath! I disguised myself as a servant to serve the sick young master. Even the spirit power from his breath would heal me, so what could be better than this! But serving the said individual was not easy… “Get out! I said get out! I’ve had enough of this!!! …Wait. What are you doing on your knees right now?” “Young master, if you’re going to throw it away, please throw it in my mouth.” I told him in a panic while pulling his arm back to stop him from throwing the vial. “I don’t care if you spray it on my face…” For a moment, his pupils dilated wildly. *** I’m a do-if-you-must kind of girl. While I was at it, I took good care of my master, who was my lifesaver. As well as serving him, I hugged him, carried him, and became his legs. I wonder if he recognized my true value as the heir of a prestigious dukedom. The young master would occasionally glare at me, but he didn’t kick me out. Now, I have recovered and repaid my gratitude. It was time to figure out my escape plan… But something was off about the young master. “You said you liked me so much, so where are you trying to run off to?” “…” “You said you’d die without me.” Gradually, he began to have the look of a hungry predator."]},{"title":"The Tyrant’s Family Lasts Thanks To Her Inner Voice","tags":["Manhua","Romance"],"disc":["Manhua to read The Tyrant’s Family Lasts Thanks To Her Inner Voice at manhua website","After being hit to death by someone who fell from the sky, Jiu Jiu caused a scence at the King of Hell’s palace. In order to settle things, the King of Hell let her entering the dimension of a book and becoming the princess. However, she was a princess in a cold palace.\nAt the beginning, because of the heroine’s slander, her father who was the tyrant wanted to grant her the death. Jiu Jiu was speechless in her heart: “No wonder the Xi Chu country collapses 10 years later. With such an indiscriminate tyrant, this country survives for all of 10 years is already a mercy from god.”\nOnce hearing this inner voice of hers, the tyrant suddenly stopped killing people indiscriminately."]},{"title":"When the Strange Gods Cause Chaos, I Turn My Hand and Slay Them","tags":["Action","Adaptation","Adventure","Fantasy","Manhua"],"disc":["Read manhua When the Strange Gods Cause Chaos, I Turn My Hand and Slay Them","Young Lu Yu traverses to a different world and acquires the “No Rush, Take Your Time Lottery System.” In this new world, peculiar gods, buddhas, and demons are worshipped everywhere, giving rise to various sects. The followers fervently desire their deities to descend and either rule or destroy the world. Consequently, the imperial court establishes the “Demon Suppression Command,” a special agency dedicated to investigating such events…"]},{"title":"Marriage? No Thanks!","tags":["Manhwa","Romance"],"disc":["Read manhwa Marriage? No Thanks! / I Refuse to Marry You / 我只心动不结婚 / 結婚なんてお断りよ / 결혼은 사양합니다"]},{"title":"The Devil Was Taunted","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua The Devil Was Taunted / The Devil Wears Suit & Tie / Daily Rent Devil Is Always Teased / El Diablo Fue Coqueteado / O Diabo Foi Flertado / Ri Zu E Mo Zong Bei Liao / Rì Zū È Mó Zǒng Bèi Liāo / The Daily Rent Devil Is Always Teased / Ác Ma Bị Trêu Ghẹo","The female lead, Su Mingxue, was framed and kidnapped. After struggling miserably, she and the male lead, who was also kidnapped, escaped and began a wild life full of hardships until they were rescued. But she never thought, nor dared to think, that the man with whom she shared hardships for so many days was the heir of a famous corporation, and he even asked her to become his secretary!! !"]},{"title":"I’m living with my Mother-in-law!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m living with my Mother-in-law! / 왜 이러세요 시어머니?","It’s well-known that living with one’s mother-in-law is basically hell. So marrying a poor merchant with no family should be an easy way to avoid that mess, right? Well, that was Elaen’s plan until she realizes that her husband, Ahen, lied to her, and is actually the son of the empire’s ferocious Grand Wizard, Kanessis Corenea, who she’ll have to live with at her palace! Though intimidated at first, Elaen realizes that Kanessis is nothing like the figures in mother-in-law horror stories, and becomes enamored with her charisma and unexpected kindness. If anything, the problem here is Ahen’s ulterior motives for marrying Elaen, which she only discovered after the fact. But with Kanessis by her side, Elaen is ready to face any and all challenges in her marriage. Perhaps living with her mother-in-law was the best thing to ever happen to her after all!"]},{"title":"Werewolves Going Crazy over Me","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Supernatural"],"disc":["Read manhwa Werewolves Going Crazy over Me / 웨어울프 : 향기에 이끌린 늑대들","A dangerous love affair with a werewolf. Single mother Olivia finds Damian dying on the streets and takes him home. Before long, the two are sharing a passionate kiss. Damian soon realizes the side effects of the drug suppressing his werewolf instincts vanish when he is with her. Now he must find a way to keep her around, no matter the cost."]},{"title":"For My Lost Love","tags":["Drama","Fantasy","Historical","Isekai","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manhwa For My Abandoned Love / For My Forsaken Beloved / For My Derelict Favorite / For My Abandoned Favorite / 버려진 나의 최애를 위하여","I entered my favorite romantic fantasy novel! I may be a commoner, but I’m rich beyond belief. I quietly watched the romance of the main characters in the original novel, assuming I would go back to reality after reaching the novel’s ending… However, even after the ending, I am still stuck in this world! As a result, I learned the behind-the-scenes stories that I didn’t want to know. My favorite second male lead, Kaelus, died. Living in poverty without him, I eventually became ill and died as well. I thought I would return to reality, but I went back in time instead. This is definitely… This means I have to save my beloved, right?"]},{"title":"The Secret Life of a Certain Count’s Lady","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Secret Life of a Certain Count’s Lady / Her Ladyship’s Double Life / The Double Life of a Count’s Lady / 어느 백작 영애의 이중생활","“Lirian, the forces of evil are ravaging this world. We need a strong knight to destroy the spirit of evil that is approaching us. A righteous and strong knight! And the knight that’s you, Lirian.”\nWow, that’s ridiculous.\nI just want to live a normal life. I have a dream to marry a handsome man. Then will enjoy life as a cottage like the house of a count. I never thought about doing justice or protecting world peace. But God chose me!\nPower? Sharp sword? Why give me? Why me!\n“Liri, would you like to come with me to the capital? Isn’t it better to go with a guy like me compared to going alone?”\n“um…I was joking just now. It’s a bit…”\n“Hmm, that makes sense. I’m Aheros Arman, the 3rd prince of the Arman Empire.”\n“Wow, emperor, prince!”"]},{"title":"Secret Outing","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Secret Outing / Wheat Fortune/ 밀행","The story of a child who was abandoned by the roadside, grows up and meets a mysterious man. Who is this mysterious man, and what will happen to their relationship?"]},{"title":"Attacking the Demon King of Girls’ Dormitory","tags":["Adaptation","Drama","Fantasy","Romance","Shoujo Ai"],"disc":["Read manhua Attacking the Girls’s Dormitory of Demon King / Gōnglüè Mówáng De Nǚshēng Qǐnshì / 攻略魔王的女生寝室"]},{"title":"Return Of The Shattered Constellation","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Return Of The Shattered Constellation / Return of the Broken Constellation / 부서진 성좌의 회귀"]},{"title":"The Bondservant","tags":["Adaptation","Fantasy","Romance","Webtoons"],"disc":["Read manhwa The Bondservant / 집착은 다정하고 집요하게","When a near-accident involving her father and a servant boy brings a new face into the Evegen jya home, the last thing Sioanna is expecting is for a new servant in her ranks, let alone a friend. Étienne has learned the hard way to be quiet and reserved, but as his relationship with Sioanna blooms, the two begin to form a bond of affection, care…and obsession. Despite the deep hurt in both their lives, their ability to treat one another with gentleness and kindness proves to be just the remedy they both needed. But will it be enough to conquer the countless obstacles that stand in their way?"]}]