[{"title":"The Method Acting Princess","tags":["Romance"],"disc":["Read manhwa The Method Acting Princess / 偽り姫のメゾット","“In a twist of fate, a nameless stage actor is thrust into the world of The Cursed Princess and the Shining Knight” Transformed into Sylvia Burrows, the play’s leading actress, she is faced with the task of becoming a body double for Princess Michelle. However, she is aware of Sylvia’s tragic fate—an execution at the hands of the merciless Crown Prince Oscar—and that’s the one thing she absolutely refuses to sign up for! Yet, somehow, the Oscar in this alternate world begins to show interest in Sylvia… Could there be glimmer of hope for a better conclusion for her?"]},{"title":"Princess Tigress Reborn: Hug Me General!","tags":["Action","Adventure","Drama","Fantasy","Historical","Romance"],"disc":["Read manhua Princess Tigress Reborn: Hug Me General! / Rebirth of the Cute Tiger: Great General wants to Hug","Princess Tigress Reborn Hug Me General at The white tiger of the General died on the battlefield because of a subordinate’s betrayal. Unexpectedly, she was reborn and went back to three years ago as a human. Wait? She is the one who is supposed to marry the General?"," "]},{"title":"My Sweet Demon Boss","tags":["Comedy","Drama","Josei","Romance","School Life","Shoujo"],"disc":["Read manga My Sweet Demon Boss / 鬼神課長は甘さでできている。","All of a sudden, my parents decided to play matchmaker and set me up with another man. I don’t have a boyfriend and I thought it wouldn’t hurt to meet the guy, but it turned out to be my manager, a.k.a. The Demon Boss! Moe is frightened when her parents force her and the Demon Boss to live together on the premise of marriage. But, to her surprise, the manager seems like a totally different person at home…? A sweet slapstick office romance between a Demon Boss and his klutzy subordinate."]},{"title":"Heavenly Sword’s Grand Saga","tags":["Action","Adventure","Martial Arts"],"disc":["Read manhwa Heavenly Sword’s Grand Saga","There are people in the world that thinks they are the ‘chosen’ of the heavens. It’s been decades since chaos and strife among heroes ensued because of those people. A certain disciple who has six masters has been entrusted with the fate of the central plains. “If you guys are the heavens, then I’m the sword that’ll pierce the heavens.” That was what he’d resolved to do… No one mentioned he was a fatty, though! In any case, now that he’s here, he’ll need to save the… world… Damn it, lose some weight first."]},{"title":"In a passionate relationship","tags":["Comedy","Drama","Josei","Office Workers","Romance"],"disc":["Read manhwa In a passionate relationship / How to Win the Secretary’s Heart / Extraordinary Dating / In a Passionate Relationship / In Love with Admiration / In Love with Rave Reviews / 절찬 연애중 / 절찬연애중","At the young age of 34, there was a man who rose to the position of head of production for an advertisement company. ‘ Kim Yoon’ is a perfect man who has not only abilities but also an appearance that can beat celebrities but he had one flaw…” Secretary Yang “. Seo Yu’s lips trembled, this man is starting again. However she answered politely without a sign of annoyance on her face, ” Yes general manager…I’ll tell you the truth from now on “. A fierce battle"]},{"title":"Miss Divine Doctor: Conquer The Demon King","tags":["Drama","Historical","Romance"],"disc":["Read manga Miss Divine Doctor: Conquer The Demon King","Jun Jiu, the divine doctor, was killed by her competitor and time travelled to another world. She breaks into a sealed altar, and a mysterious man snatches her chin and forces her… Who’s this arrogant demon?! MangaToon got authorization from iReader to publish this content, the content is the author’s own point of view, and does not represent the stand of MangaToon."]},{"title":"Teach Me, Mr. Sadistic Butler","tags":["Drama","Josei","Mature","Romance"],"disc":["Read manhwa Teach Me, Mr. Sadistic Butler / ドS執事に花嫁調教されてます","“Warning: Mature content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","“My lady, it is time for your lesson on night companionship,” the new, mysterious, and super sadistic butler announced. Layla Yanase dreams about marrying Fujigaya, her fiance, who she has never met. “All of your flowery, happy-go-lucky thoughts… will be mowed out by me.” Fujiwara, the butler, leads Layla through brutal bridal training, which includes lessons on “night companionship.” With his verbal teasing and stunning technique, Layla is melted down to the core. But just who could this Fujiwara truly be…?"]},{"title":"Can I Cancel The Confession?","tags":["Comedy","Josei","Romance","School Life","Slice of Life"],"disc":["Read Can I Cancel The Confession? / 고백 취구도 되나? / Can I Take It Back?","Hayan, a high school student, finally gathers the courage to confess to her crush. But somehow her confession ends up in the hands of another student named Bakha, who is rumored to be a bully and a womanizer. Hayan desperately tries to hide that she confessed to the wrong person because she is terrified by the rumors. Meanwhile, Bakha starts to take an interest in her, and opens up to her in his own way. Will Hayan be able to escape him and confess to the right person this time?"]},{"title":"Death When Separated","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Death When Separated / 헤어지면 죽음","The life of a perfect influencer. Dating a girl I like. The last thing that I need to do is date her, but I’m trapped in a life-threatening incident?! “This isn’t an obsession, seriously!” But, if we break up, we’ll die!"]},{"title":"A male protagonist is blocking my way","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Hero is Standing in My Way / A male protagonist is blocking my way / The Main Protagonist Block My Path /  남자 주인공이 내 앞길을 가로막는다","I reincarnated into a novel that I’d read in my past life.","I’m destined to be the fiancé of the villain in the not-too-distant future, but that’s… Doesn’t it depend on how I live?","“My ideal type is 190 centimeters tall, handsome, rich and doesn’t get fat when he gets older!”","And then I saved the life of the young male protagonist before I even started looking for him?","My plan to have a smooth, carefree life has been ruined ever since!","“I’m sorry, but Ariel said ‘I can’t take my eyes off the prettiest and handsomest people in the world.’ ”","“What? Me?”","“I’m – I’m sorry, I’ve been very rude. Please forget my proposal!”","“Wait! No! Please Wait!”","As he watched me feel increasingly guilty towards him, a supposedly broken-hearted person, he raised the corner of his mouth.","20 chapters will be updated at harimanga. Thank you for always supporting us."," "]},{"title":"Emperor And The Female Knight","tags":["Action","Drama","Fantasy","Historical","Josei","Manhwa","Romance","Webtoon"],"disc":["Read manhwa Emperor And The Female Knight / The Knight and Her Emperor / Hwangjewa Yeogisa / Kaisar dan Kesatria Wanita / Koutei to Onna Kishi / L’armure et la couronne / The King and His Knight / 皇帝と女騎士 / 皇帝與女騎士 / 황제와 여기사","Pauliana has been defeated and captured by the army of the enemy nation, Acrea. She has been desperately trying to survive in men’s society, but it was all in vain. Acrea’s young king, Lucius, sees her struggle and makes an unexpected offer. He dreams to continue the war and be the first emperor to conquer the South continent and it’s sea. Pauliana, swears a life-long allegiance to Lucius for acknowledging her. However, in the end, Lucius is just an emperor on the battlefield that had awakened his love for Pauliana!"]},{"title":"Her Highness, The Princess of Divine Punishment","tags":["Drama","Fantasy","Historical","Romance","Shoujo"],"disc":["Read Her Highness the Princess of Deific Punishment / Her Highness, the Princess of Divine Punishment / Shén Chéng De Gōng Zhǔ Diàn Xià / The Princess Of Punishment / 神惩的公主殿下","A princess cursed by God for a lifetime! My king, why did you stab me with your sword? If I do it again, can my knight still guard me till the end? Even if… Even if I am punished by God, my destiny is doomed to death. But I still love the world, love the sunshine, love this dessert, love my king, love my little skirt, and love the knight."," "]},{"title":"Heaven’s Sympathy : Reborn","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manga Heaven’s Sympathy : Reborn / 天恸璃泽殇","Amid the turmoils of the three worlds, deity Yun Ze was seriously wounded while putting an end to a rebellion, causing him to lose a soul. That very soul then fell into the reincarnation pool, forcing Yun Ze to be born in the mortal world. Yun Ze became a mortal because his 3 spiritual and 7 physical souls were incomplete. Because he’s living with a mild cognitive impairment and has slow reactions, fairy Liu Li was sent to the mortal world to help Yun Ze find his missing soul. When Liu Li went into the mortal world, she discovered that deities are different from what she thought. Didn’t they say that deities are arrogant and cold? Why is the deity she bumped into foolish and cute…"]},{"title":"Brother’s Sick Love","tags":["Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read manhua Brother’S Sick Love / 忽如一夜病娇来\nYu Xiang unfortunately transmigrates into a merchant’s daughter, who was mistakenly taken to the marquis manor at birth. She is immediately disabled, and carries the nickname of ‘disaster star’. Helpless, she can only cling to her older brother, the marquis, in hopes of surviving, and wait for the true master to return so she can give way. Years later, when the true master returns to the manor, yu xiang prepares to leave. however, she finds out her clinging technique is too good, that her marquis brother won’t let her leave!"]},{"title":"Farewell, My First Love","tags":["Drama","Manhwa","Romance","School Life","Tragedy"],"disc":["Read manhwa Farewell, My First Love / 너는 누군가의 첫사랑이었다","Seventeen-year-old Eun-ha has battled a weak heart since birth but has managed to live a normal life following surgery. However, her world shatters when her doctor reveals that she has just one year left to live. On the very same day, Ha-yoon, her classmate, is admitted to the hospital due to a devastating car accident that claims the lives of his entire family. Overwhelmed by grief, Ha-yoon contemplates ending his own life, while Eun-ha is determined to embrace the remainder of her days for the sake of her loved ones. Although their circumstances differ greatly, Eun-ha senses a shared connection with Ha-yoon and tries her best to become his friend. With the clock ticking on their time together, are they doomed to say farewell forever?."]},{"title":"If Winter Meets Sunshine","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua If Winter Meets Sunshine / If There Is the Cold Winter Encountering the Warm Sun / 若有寒冬遇暖阳","Wu Weiwei avenged her mother and made a deal with him on the condition of secret information about Ye Jiliang’s mother. She wanted to become his nominal fiancée and gave him the information. She thought that the two of them would owe each other nothing after the end. Unexpectedly, what she thought was too simple."," "]},{"title":"A Fake Princess’s Survival Diary","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Fake Princess’s Survival Diary / 가짜 공주로 살아남기 / Surviving as a Fake Princess","Many people imagine living the life of a hero/heroine within their favorite fantasy novels. However, what if you wake up in the body of the main villain/villainess instead? Our main character goes through a seemingly fatal air crash and wakes up in the body of Letisha de Arcadia, the main villainess within her favorite fantasy novel. What’s even worse is that she already knows how this story is going to end: Letisha’s beheading after her identity as fake princess gets revealed. To evade her tragic fate, our character must continue living as a fake princess while attempting to forge an amicable relationship with the original protagonists of the novel, Amelita and Sighard. This is a story of survival."]},{"title":"My Wife is a Demon Queen","tags":["Adventure","Fantasy","Manhua","Romance"],"disc":["Read manhua My Wife is a Demon Queen, 我老婆是魔王大人\nListen up folks! I’m living my life with the demon queen! My Wife is a Demon Queen"]},{"title":"The Script","tags":["Drama","Fantasy","Josei","Supernatural"],"disc":["The Barrier / 위어\nRevenge 13 years in the making. To reverse a curse put on her and her brother, Yeju has been searching for the shaman responsible for 13 long years. When the heir to the Tiger Clan, Heewu, sets Yeju up in order to steal her sword, the two realize that they have the same objective. But is this new man friend or foe?"]},{"title":"My Younger Brother Wants to be a Husband","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa My Younger Brother Wants to be a Husband / 남이 된 남동생이 남편이 되려 한다","My mother remarried and I had a younger brother.","With a happy heart, I tried to be a family with my younger brother, Millian. No matter how hard he behaved, it didn’t matter.","Did my effort shine?","I’m relieved that we’ve gotten quite close. Millian left a letter and went to war.","It’s been 5 years since Millian went to war.","[Millian, I’m going to see you this time.] Who knew my letter would end the five-year-long war?"," ","“Now i’m not your brother anymore.”","Millian fluttered a document that he had been expelled from the family.","“Sister, don’t laugh at other men. Only if you don’t want to make me a murderer.”","Millian Edmore Rachel. No, now it’s Millian Taylor.","My younger brother returned as a man.","It’s sad that he’s a someone else right now, but what?","He’s going to be a husband?","….But why am I so nervous?","i shouldn’t do this."]}]