[{"title":"How to Get My Husband on My Side","tags":["Drama","Fantasy","Historical","Magic","Manhwa","Psychological","Romance","Webtoon","Webtoons"],"disc":["Read manhwa How to Get My Husband on My Side / How to Make My Husband on My Side / How to Win My Husband Over / 남편을 내 편으로 만드는 방법","I became ‘Rudbeckia,’ a supporting character in a fantasy novel, a villainess who dies at the hands of her husband. The world’s most damned father has found me another partner for a political marriage. The problem is, that person is the husband who will kill me! First, I need to find a way to live. I need to appear as harmless as possible to the people of the North and protect my husband’s little sister whom I killed in the original novel. Wouldn’t I be able to save my life if I pretended to be in love with my husband? “I fell in love with you!” So please, spare me!"]},{"title":"Divine Urban God","tags":["Action","Adventure","Drama","Fantasy"],"disc":["Read manga Divine Urban God / 都市极品医神","“Five years ago, the Ye family was wiped out and the useless trash Ye Chen mysteriously disappeared. Five years later, that trash of the Ye family has returned! Back with cultivation powers that could bring down the gods and shake the earth! This time, Ye Chen will make the heavens tremble in awe! The earth will tremble in his fear! He will reign over everything and ascend to the top of the world!”"," "]},{"title":"I refuse this kind of reliance","tags":["Romance"],"disc":["I refuse this kind of reliance / 이런 빙의 사절하겠습니다 / こんな憑依、お断りします"]},{"title":"Let’s go to work tommorow!","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Let’s go to work tommorow! / Back to Work! / 내일도 출근!","Jiyoon Cha is just trying to live her best life in spite of feeling unfulfilled by her corporate job and disillusioned with love. But what’s a woman in her 30s to do when the pressure to marry is high, her prospects are either her aloof supervisor or her juvenile, artist ex-boyfriend, and not even her perfect work friend can hold it together? Can a girl just have her chicken and beer in peace, or is that just a pipe dream?"]},{"title":"I’ve Probably Made a Mistake in Getting Married","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’ve Probably Made a Mistake in Getting Married / I Think My Marriage Was A Mistake / I Think I Married the Wrong Guy / この結婚、どこかおかしいです! / この結婚、どこかおかしいです！ / 总觉得这婚没结好 / 아무래도 결혼을 잘못한 것 같다"]},{"title":"Wanna Join Me for X?","tags":["Drama","Fantasy","Josei","Manhwa","Romance"],"disc":["Read manhwa Wanna Join Me for X? / Want to X With Me? / Wanna Do X With Me? / X กับฉันไหม? / 要跟我X嗎？ / 要跟我一起吗 / 나랑X할래?"]},{"title":"Return of the Genius Player","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Return of the Genius Player / 천재 플레이어의 귀환"]},{"title":"A Villainess’ Revenge Is Sweeter Than Honey","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Villainess’ Revenge Is Sweeter Than Honey /복수는 꿀보다 달콤하다 / 復讐は蜜より甘い / Balas Dendam lebih Manis dari Madu","“In your sweetest moment, I will give you Hell.” Alexandra was a wicked woman who did not mind staining her hands with blood in order to make her husband the emperor. However, he repaid her unconditional devotion with betrayal, an extramarital affair, and a gruesome death. Just before Alexandra died, she had one thought in her head: “If I could go back into the past, I would be willing to be his wife again. Then I can show him how painful it is to be betrayed by the one you loved the most!” Miraculously, Alexandra returned to the day of her wedding with her husband. She decided to become the empress once again to exact the most delightful and brutal revenge she can…"," "]},{"title":"Love Thy Enemy","tags":["Fantasy","Romance"],"disc":["Read manga Love Thy Enemy","“You were the most worthy opponent I had… Farewell, Beatrice.”\nSierratica Tiar Yerphinen, my sworn enemy.\nI died by his sword… until I didn’t?!","Beatrice Shelle Marcean wakes up five years after the day of her death in a new kingdom—a new body, in a new family. She has gone from duchess to princess—and the man from her past, Sierratica Yerphinen, barges into her land to offer a treaty. He is now an emperor, seeking a bride from her new bloodline! Now living as princess Shroina, our female lead must do whatever it takes to push away from his pull. She won’t repeat the same mistake twice."]},{"title":"Love Master","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Love Master"]},{"title":"Back-to-School Boss","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Back-to-School Boss / Boss Go to School / CEO Boss Goes to School / CEO. Boss Goes to School / The Boss Goes to School / The Boss is Back in School / The CEO Goes to School / ボスの担任になりました / 학교로 간 보스","Joo Sihyeon, a successful 33-year-old CEO, has decided to return to high school to get his diploma. As Sihyeon tries to find a way to balance school and work, Eun Haim is worried about her new job as the older student’s homeroom teacher. Haim soon realizes that’s the least of her worries, as it turns out Sihyeon is the same man she had a one-night stand with in Canada just months ago! The two thought they would never see each other again, but who knew they would meet in a classroom like this?"]},{"title":"The Villain’s Precious Daughter","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Villain’s Precious Daughter / The Villain’s Beloved Daughter / 악당의 소중한 따님 / 悪党公爵の愛娘 / 惡徒的寶貝女兒 / 恶人奶爸的宝贝女儿 / บุตรสาวผู้ล้ำค่าของวายร้าย / The Villain Daughter is Too Precious and Happy to Push Today / The Villainess’ Bias Is So Precious, Today Is Bliss As Well / 悪役令嬢は推しが尊すぎて今日も幸せ","It’s already unfair that I suffered greatly because I closely resembled the Saintess but why did the villain kill me without any mercy at all?","No, actually, it said in the book that I was really bound to die.","‘My life is already ruined. Of all things, why do I have to be the one to die a ridiculous death?’","There’s still hope! I haven’t met any of the characters yet so I’ll just run away!","But why did the villain collapse in front of me……?","With a lot of effort, I barely saved the life of the villain who was on the brink of death.","But now he’s saying that he wanted to adopt me as his daughter and raise me to be a Saintess?!","Just like that, I decided to become his daughter for a few days before leaving quietly.","“My daughter is a genius. There’s no child that is more angelic in this world other than my daughter.”","……I think I have coaxed my dad too well.","Even the guys who originally followed the real Saintess started to pay attention to me.","What went wrong? Aren’t you guys supposed to hate me?!"]},{"title":"Run Away, From Me","tags":["Drama","Fantasy","Mature","Romance"],"disc":["Read Run Away, From Me / I Can’t Escape, He Won’t Let Me Go /  Run Away From Me /  逃げられない、逃がさない /  달아나 봐, 내게서","The man before whom everyone bowed down. The killer who ruined my life. Daphne is the daughter of the emperor’s mistress. She spent her childhood in unimaginable luxury, but one day she drew the emperor’s wrath. Even though she was a princess, she was treated coldly, like a servant. The only one who showed kindness to Daphne was Crown Prince Ashrad, who hoped that one day they would become a family. Ashrad was irresistible. Everyone was enchanted by him; everyone obeyed him. He ruled over all, including Daphne. He was her god… and also the one who shattered her entire world. Daphne is trying to escape from the killer who trampled her life, but…"]},{"title":"Kill the Villainess","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Kill The Villainess / Elimina a la Dama Villana / Mata a la Mujer Malvada / Mata a la Villana / Убить злодейку / 悪女を殺して / 杀死恶女 / 除掉那个恶女 / 악녀를 죽여 줘","I reincarnated in a novel inside the body of a villainess named Elise who poisoned herself when her fiancé, the prince, married her childhood friend, the maid Helena. From the moment I realized this, I had only one goal. Escape from the world in this novel. Even after death, I tried to get out of this world but the ‘world’ did not allow it. However, after rejecting the path of “Elise” in the original novel, the men who had persecuted and ignored Eris began to beg for her interest and affection. “Who are you?” the priest who revived Helena asked. “You… are you really Elise?” even the warrior who pledged eternal loyalty to Helena asked. “You have changed,” said the prince who rejected Elise in order to marry Helena. It was strange. No one was interested in Elise before. “I don’t want to get affectionate even as time passes.” She has no confidence in loving this world."]},{"title":"Tales of Greed Deep","tags":["Action","School Life"],"disc":["Read manhwa Tales of Greed Deep / Desire Diary Deep / 욕망일기Deep / Diary of Desire Deep","“Tales of Greed” is back with an even deeper story! What if the desires that every human can have become a reality? Will the outcome ultimately lead to happiness or bring about destruction?"]},{"title":"CTRL X","tags":["Drama","Fantasy","Manhwa","Mystery","Romance"],"disc":["Read manhwa CTRL X / 컨트롤X / CONTROL X / ctrlX","My ex-boyfriend of ten years, Daniel, married my best friend, Olivia, on Christmas, which is also my birthday! To add to the drama, world-renowned singer-songwriter Chris made a surprise appearance at their wedding, transforming it into a concert venue as a form of sweet revenge. However, the following morning, Chris receives some shocking news. Will she be able to reclaim her lost love, friendship, and fame?"]},{"title":"One Day I Found a Husband","tags":["Manhwa","Romance"],"disc":["Read manhwa One Day I Found a Husband / 어느 날 남편이 생겼다","“Sharing a Bed as a Married Couple”\n“Is Kissing Allowed?”","I’ve got a caring, handsome, and wealthy husband now. The catch is, he’s my sworn enemy, the detestable ‘Kang Sihu.’ They say we were meant to have a happy newlywed life. Impossible!…"]},{"title":"Sleepless Nights Of A Maid","tags":["Drama","Fantasy","Historical","Josei","Romance"],"disc":["Read manhwa Sleepless Nights Of A Maid / 侍女艾芙的不眠之夜 / 잠 못 드는 시녀의 밤 / Sleepless Maid’s Night","Eva Massies, once a daughter of a noble family, now lives in a house of acquaintances as a maid. She met him for the first time when her life was at rock bottom. Her handsome, strong, and dazzling former fiancée, Crown Prince Edward.","“Why are you crying, hm?”","Edward asked worriedly as he took her hurt foot.","“…It’s embarrassing. Hic–”","Perhaps it was because of how affectionate his voice was. A voice that had been suppressed all this time brazenly slipped out. To top it off, being soaked wet in water, wearing a pair of worn-out, patched socks, hitting rock bottom, all of these were shameful.","“Are you feeling ashamed because you’re hurt? Your foot is still beautiful even like this.”","He said those words like it wasn’t something to be concerned about.","“There’s no need to be ashamed. For whatever reason, you did nothing wrong, Eva.”","He soothed her fear by calling her name. Only when he’d left did she realize. That man who stayed only for a moment, that man who would be deeply engraved in her heart, was her first love.","* * *","Once again she met Edward after going through a rough time.","After defeating numerous nobles’ daughters and becoming a lady-in-waiting.","After her heart grew stronger.","After she no longer thought about him.","“It’s the lady of the bedchamber’s job to make sure that everything is sufficient and provide anything that Your Highness needs before sleep. That’s why, if you wish to hold hands, do as you wish.”","“Have I ever acted as I pleased in front of a lady even once?”","His voice was cold, drastically different from before. He held her, his glaring eyes felt very intimidating to her.","“If I knew you’d come to the imperial palace, I wouldn’t have let you go that day.”","Edward, who had his face close to her, warned in a low voice,","“So this time, I was thinking of doing anything however I wished.”","侍女艾芙的不眠之夜\n잠 못 드는 시녀의 밤\nSleepless Maid’s Night"]},{"title":"An Unwholesome Proposal","tags":["Drama","Romance"],"disc":["Read manhwa An Unwholesome Proposal","Believing in his fantastic acting skills, Moon Jian stuck with Yoon Kangjae as his manager through thick and thin. But after eight years of constantly cleaning up after the mess Kangjae’s picky personality made, Jian thinks it’s time to focus on herself and quit her job. As soon as Kangjae hears, he cleans up his act, sticks to her like glue, and ponders how to make her stay. He’s determined to keep Jian by his side, but can he come up with a proposal good enough for her before it’s too late?"]},{"title":"My Pet Snake Is Playing Me Again","tags":["Comedy","Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua My Pet Snake Is Playing Me Again / 我家蛇宠又在演我","Feng Wuyou raised a snake. Everyone said that snakes were treacherous and cunning, and were the lowest of the monsters, and were not worthy of being pets! Feng Wuyou stroked his pet snake and said with a smile: “Little snakes have no hair, and little snakes are the cutest!” Chu Feichi believed it. During the day, he kept his true form and was willing to please. At night, he turned into a human form, waiting for an opportunity to take revenge. After his revenge failed for the Nth time… Chu Feichi was done with it! Who said Feng Wuyou was innocent, cute, and had no scheming!"]}]