[{"title":"A World Without Dragons","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A World Without Dragons / 용이 없는 세상","The “merciful dragon” dragon died. The imperial dragon, the symbol of the empire, has died. But it was something everyone knew. Jaha was an old dragon and everyone knew that his life would soon end. Moreover, the imperial family had a young dragon to carry on the next contract, so no one was confused. Jinyoung Kilis, a knight from the Imperial Palace Safety Planning Department, was tasked with protecting the dragon who lost the dragon. Outwardly…"]},{"title":"David’s Portrait","tags":["Manhwa","Romance","Webtoons"],"disc":["Read manga David’s Portrait / Portrait of David\nPainter Joseph was a man of great skill but was not recognized for his lack of creative skills. He tries to make an extreme choice, and can’t get over his sense of shame.\nAnd there was a woman who secretly helped him, Rene.\nJoseph’s heart fluttered when she asked him to paint a picture for her, and together they went to the artist’s city, Delmmo.\nHowever, after arriving at Delmmo, he receives a completely different mission from his expectations…"]},{"title":"Love of Flourishing Age","tags":["Manhua","Romance"],"disc":["Read manga Love of Flourishing Age / Shengshi Li Hua Dian / Revenge of the Prince / The Prosperity of Li Hua Palace / Thịnh Thế Lê Hoa Điện / Shengshi Li Hua Dian / 盛世梨花殿 성세이화전","Taking down the heartless man and making her enemies pay, the Crown Princess is returning for a second life in full force!","Naning’s last life ended in murder. In this life, she vows to make everyone who wronged her pay for what they did to her and more. Time and time again, she finds herself caught up in dangerous situations and surprisingly candid conversations. Love, hate, war, chaos and regime changes all turn out to be far more complicated than she could have ever imagined. After recovering her lost memory, she finally sees things clearly for the first time: he was never a part of the plot against her. As fate would have it, their paths cross again as strangers. Will they be able to put the past behind them and fall for each other again?"]},{"title":"The Golden Haired Elementalist","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read The Golden-Haired Summoner, 금발의 정령사 / The Golden-Haired Wizard / The Golden-Haired Elementalist / La chica rubia que controla los elementos / La magicienne aux cheveux d’or / 金发精灵师之天才的烦恼","I thought I was dead, but when I woke up, I was reincarnated as a nobleman’s daughter?! The only thing I did in the seventeen years of my first life was studying. Now that I’m alive again, I won’t live just to study! The second life of an ordinary middle school girl with a slightly strange personality, Jean, begins an unstoppable journey on this continent!"]},{"title":"Delicious Scandal","tags":["Drama","Manhua","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa Delicious Scandal","Kim Ro Sa has long dreamed of being a singer and finally her dream came true. However, her career did not go as smoothly as expected. Until one day, she met Chef Ian, who turned out to be a judge of the survival cooking event she had attended. Can Ro Sa survive on the event? Moreover, there is Roy, the boyband member who sucks."]},{"title":"Spring’s Espresso","tags":["Romance","Slice of Life"],"disc":["Read manhwa Spring’s Espresso / Espresso Of Spring / Spring Espresso / 봄의 에스프레소","Bom Sol, owner of ‘Cafe Spring,’ is now on a job search after closing it down. Though good looking and skilled, she came to work under the world renowned (but also prickly) barista Jake K. For some reason, he looks familiar? This is Bom Sol’s first experience working in a company. Can she get through this smoothly? “Isn’t it time you remembered? Cafe Spring, frequent customer, high schooler.”"]},{"title":"When You’re Targeted by the Bully","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa When You’re Targeted by the Bully / When You’re Targeted By The Bullies / 일진에게찍혔을때 / When You’re Targeted by the Bully, Marked By King Bs\nHigh school is hard enough without a target on your back, but that’s exactly the situation Annie finds herself in when she crosses a group of the most popular kids in school.\nMarked by the king bee himself, the notorious Ashton Griffin, Annie becomes his newest fixation–and he is determined to make her life miserable. Now at his beck and call, Annie must stay on Ashton’s good side to maintain her peaceful life and avoid becoming a social pariah. As she navigates her way through alienating social cliques, persistent old crushes, and the hot upstairs neighbor who never puts a shirt on, Annie will soon learn that there’s more to being popular than meets the eye. She just wanted to live a normal life, but maybe there’s no escaping these king bees. An official comic adaptation based on the hit dating-sim game."]},{"title":"Miss Time","tags":["Drama","Romance","School Life","Slice of Life","Webtoons"],"disc":["Miss Gold Lee Gaon made a successful career as a personal trainer and is in a rival-like relationship against the famous romance novelist, Jiho, famous for his notorious badmouthing. * Miss Gold in South Korea is an unmarried woman with high socioeconomic background. Gaon went to her frenemy Sera’s wedding ceremony and somehow ended up helping her escape. And her groom? It was Jiho, the man who slung towards her mouthfuls of criticisms and insults one after another. They realize they were from the same highschool class… While Jiho was on his way to meet Gaon, the two were transported twelve years into the past… “That soft boy was that badass delinquent in highschool?! And he liked me as well?!"]},{"title":"Fatal Oxygen","tags":["Romance","Shoujo Ai","Webtoons","Yaoi"],"disc":["Read manga Fatal Scents / Fatal Oxygen / Oxigênio Fatal / Zhi Ming Yang Qi / 致命氧气","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nWill you become my Alpha? Become the oxygen I rely on to survive… I don’t care if you’re fatal… I will still be perfectly happy to rely on you. Xia Shao Ying’s newest work “Fatal Oxygen”. Stay tuned!"," "]},{"title":"Unequal Treaty of Adoration","tags":["Manhua","Romance"],"disc":["Read manhua Unequal Treaty of Adoration","A scheming CEO vs. a vengeful rich girl. A marriage contract turns into a chance for love.","When she was betrayed by her fiancé and sister, she was so grief-stricken that she agreed to a blind CEO’s unexpected love confession. She became his babysitter before realizing she wasn’t privy to the full picture. He needs someone to feed him, dress him, bring him his towel when he forgets them in the shower, and cuddle him at night. Thus begins a marriage on unequal terms…"]},{"title":"Miss 180","tags":["Comedy","Drama","Romance","School Life","Slice of Life","Webtoons"],"disc":["Read manhwa Miss 180 / 180少女 / Girl 180 / Sonyeo 180 / 少女180 / 소녀 180","184 cm tall and known by the titles of “flower boy beauty” and all-around male fashion model is actually— a girl!"]},{"title":"Marilyn Likes Lariensa Too Much!","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo"],"disc":[]},{"title":"Godly Pet Has Opened Up for Me Again","tags":["Action","Adventure","Drama","Fantasy","Shounen"],"disc":["Three years ago, three beasts fell from the sky. King Qin of the Western Hill made a contract with one of them and swept through the six kingdoms to unify the Western Hill. Wu Jiu of the Southern Desert made a contract with the other and then he swept through the nineteen sects of the Southern Desert, reaching the peak. Sun Changming also made a contract with one of them, yet three years passed without any change. However, he will soon discover that the little toothed fish he caught three years ago is the greatest blessing of his life! Unstoppable!","Godly Pet Has Opened Up for Me Again\nShén Chǒng Yòu Gěi Wǒ Kāi Guà Le\n神宠又给我开挂了"]},{"title":"Love by the Book","tags":["Drama","Romance"],"disc":["Read manhwa Love by the Book","Life was never easy for Finn. After her dad left and her mom passed away, she raised herself and her little brother on her own. And when her beloved boss is hospitalized, she takes responsibility for the bookstore she calls home. But the return of the owner’s estranged son throws a wrench in the works. Finn’s opposite, Cormac is rough where she’s sweet, and he knows how to push all of her buttons. But even as the two clash, there’s more to Cormac than meets eye… is this the change Finn needs in her life?"]},{"title":"The Fate of Undesirable Saintess","tags":["Fantasy","Romance"],"disc":["Read manga The Fate of Undesirable Saintess / Koukina Seijo ga Arawaretanode, Minashigo Agari no Seijo wa Iranaku Narimashita? / ธิดาเทพสูงศักดิ์จะสู้รักของธิดาเทพกำพร้า? / 高貴な聖女が現われたので、孤児あがりの聖女はいらなくなりました？","At the orphanage, Emilia has developed her power and has been awakened as a saintess. That’s when she meets her crush from the novel she used to read in her previous life?! However, her crush, Prince Sion, was supposed to be married to the daughter of the duchess, Mystia… Still doubting her abilities and how the story will unfold, Emilia continues to grow closer to Prince Sion, only to encounter…"]},{"title":"Icy Upper God Please Let Me Go","tags":["Drama","Fantasy","Martial Arts","Romance"],"disc":["Read Icy Upper God Please Let Me Go / Bingshan Shang Shen Qiu Fangguo/Iceberg Upper God Is Begging to Let Things Slip by/ 冰山上神求放过","Jian ZhiXi enjoys assigning fates to other immortals but never would she have thought that one day she’d become entangled with the upper god Cangling! Him of all people?! After successfully escaping the first few times, she was eventually caught. Upper god Cangling, please let me go, I’m just a little immortal…Wait, this thousand-year-old ice cube actually melted? What is he going to do to me now…"," "]},{"title":"The Demon King Arrives","tags":["Action","Adventure","Comedy","Fantasy"],"disc":["In this world, there is a legend that has existed for many years: One day, the demon king will appear in the world, and under his command, there are seven terrifying demons that will unleash darkness and despair upon the world.","Devil’s Advent"]},{"title":"Mommy Run Away: Daddy Is Chasing After You","tags":["Drama","Manhua","Romance","Webtoons"],"disc":["Read manga Mommy Run Away: Daddy Is Chasing After You","She was pushed to a mysterious man and choose to run away. 6 years later, she brought back a little boy! The little boy is looking for a perfect man for his little fairy mommy : tall, 6 packs muscles and richest man! “Mommy, how is this man?” The little boy pointed his finger to his magnified version of himself. Bo Qingyue : “Woman, you ran away with my genes for so long, it’s time to admit you were wrong!” Man domineering! Luo Waner has not only robbed his child but even stole his heart ! Mommy Run Away Daddy Is Chasing After You"]},{"title":"Becoming an Empress is Hard","tags":["Manhua","Romance","Shoujo"],"disc":["Read manhua Becoming an Empress is Hard / 帝国皇妃不好当","Clara is a renowned romance witch. When the crown prince fell into a perpetual sleep, people speculated that she casted a spell on him because of bitterness borne out of infatuation with him. But it was the crown prince who fell in love with her at first sight when she snuck into the palace, and insisted on marrying her! So one day, the crown prince led his troops into the forest: “Clara, I’m here to take you home.”"]},{"title":"Dangerous Fiancee","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Webtoons"],"disc":["Read manga Dangerous Fiancee / The Dangerous Wife / Fiance in Crisis / 위험한 피앙세\nA beautiful castle, a loving husband and a peaceful time.\nMarianne was having a beautiful life… Until she was killed by her own husband.\nBorn as the daughter of a duke, she has lost everything at the age of 23 by the ways of Marquis Chester.\nBut the world is mysterious and she gains a second chance at life.\nShe wakes up from the pain and it is 2 days before her 21st birthday.\nMarianne meets her father who had left the world in her previous life.\nShe cries as she steels herself.\nTo never repeat the mistakes of the past again.\n“I have come to report of a Coup”\nBut the King, Ekarter, does not believe her and forces her to become his fiance and work as a spy.\n“So, you want to make me your queen? Just so I can be your prisoner?”"]}]