[{"title":"The Witch’s Daily Life","tags":["Action","Comedy","Fantasy","Isekai","Romance"],"disc":["Read manga The Witch’s Daily Life / 女巫不想日常","A witch marrying a knight was certainly an act of rebellion in the eyes of the old and the rigid in the Church. However, the Church failed to discover the truth that, a useless and corrupt witch shamelessly relied on her husband, a righteous and trustworthy knight, to live. And speaking of their married life… obviously it won’t be a peaceful life"]},{"title":"Beast With Flowers","tags":[],"disc":[]},{"title":"Fighting Again For A Lifetime","tags":["Action","Adventure","Manhua"],"disc":["Fighting Again For A Lifetime manhua, Return of the Youngest Grandmaster , Second Fight Against The Heavens\nWu Xinghe, the youngest grandmaster in the history of ancient Chinese martial arts, was hunted down by the organization of Blood-Eating Rose and died. However, it is a spirit that is not ignorant, and the soul is reborn on the body of a low-level noble boy in a different world, once again opening the road to the peak of his pursuit of martial arts."]},{"title":"Mister Wolf’s Miss Rabbit","tags":["Comedy","Drama","Romance"],"disc":["Read manga Mister Wolf’s Miss Rabbit / 狼总裁的兔小姐\n“For the sake of her brother, who was born with a heart condition, Yun Yao’s parents sell her to a rich man”. Yun Yao seems to agree to the marriage and she wants to. get rid of it after her brother is sent abroad for treatment.\nNot wanting to compromise the arrangement, she decided to go to a male brothel, thinking she would get a divorce sooner if she were no longer a virgin. She accidentally runs into a handsome escort and gives away for the first time.\nAt first, she planned to just have a one-night stand, but unexpectedly, the handsome male model turned out to be a rich director she had never met!"]},{"title":"The Failed Heiress","tags":["Comedy","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa The Failed Heiress","Na Seulgi, a girl who can see the life force of others, has a kind grandmother who passed away. Her grandmother secretly gave her an apartment address that has Seulgi’s inheritance hidden inside. However, the apartment is occupied by a cold but handsome guy whose life force is fading away…"]},{"title":"The Cat Whisperer","tags":["Comedy","Drama","Fantasy","Manhua","Yaoi"],"disc":["The Cat Whisperer, Precious Resources to Tame Big Cats in the Early Stage, 早期驯服大猫的珍贵资料","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","Wen Haoxue was arranged on a blind date by his family to a Cat demon Earl. Wen Haoxue valued good looks, and he immediately fell in love. Not only that, but the big cat also found it hard to resist"]},{"title":"Lightning Degree","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Lightning Degree Lightning Sword 비뢰도 Masters of Lightning Knives\nRyu-Yeon lost his father to a disease when he was only 10 years old. With the skill he learned from his father, he could carve wood into wonderfully intricate sculptures. One day, after completing the sculptures of his parents, Ryu-Yeon was greeted by an elderly man who was impressed by his sculptures. The old man saw promise in Ryu-Yeon and asked him if he would like to become his disciple. As Ryu-Yeon had nowhere to go and wanted to make the most of his life, he accepted the old man’s offer."]},{"title":"Garden of the Dead Flowers","tags":["Psychological","Thriller","Time travel"],"disc":["Read manga Garden of the Dead Flowers\nWhen Mila woke up, she suddenly returns to the past in Batavia during the Dutch colonial period. She accidentally saw her grandfather at a young age, kill a girl! Her grandfather, who she thought was nice, actually killed girls in his garden and planted them into flowers."]},{"title":"Overnourished","tags":["Drama","Fantasy","Romance","Shounen Ai","Yaoi"],"disc":["The Nutrition is Too Good, Too Well-Nourished, Yíng Yǎng Guò Liáng\n“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”\nZhong Yi came across a young man eating in the restroom, his name is Rong Mian, and he’s another male lead in his upcoming new drama. Rong Mian is a cool black-haired beautiful boy. But now he’s holding a spoon and eating cat canned food? A story about a narcissistic but reliable person and a cat shapeshifter, who enjoys eating cat canned food. (From CodeT.D Scans)"]},{"title":"The Bride of a Monster","tags":["Comedy","Fantasy","Manhua","Romance","Slice of Life","Supernatural"],"disc":["Read manhwa The Bride of a Monster / Bride of a Monster / Monster Bride / 괴물신부","I, Ohae Na, am dirt poor, and my father is a complete irresponsible jackass. To make matters worse, different men are coming up to me asking to be their wife–wait what?! But, it turns out that they are holding a great secret…\nJust what are they?\nThe Monster’s Bride"]},{"title":"Another Love","tags":["Drama","Josei","Romance"],"disc":["Read manhwa Another Love / Just Another Love / 또 다른 사랑","Happiness with love seems ordinary but what if in just a moment it turned into despair and a traumatic memory in an instant. In order to escaped the nightmare she experienced and engraved on her, she must achieve her own happiness and reveal the truth, in the moment Jay tried to move forward, an exotic and true love approaches her…!"]},{"title":"A Spoonful Of Your Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Spoonful Of Your Love / 그대 마음 한 스푼","A secret office romance between the son of the CEO of a huge conglomerate and his newbie secretary slash perpetual liar!","Yeonju gave up her career in order to chase after love, but only found herself left with scars and pain. After getting a position at a huge company as a secretary, she finds herself face-to-face with her new boss, Jaehyun, who also happens to be a former classmate of Yeonju’s.","Jaehyun’s serious good looks and short temper earned him the nickname among his employees, “the S.H.B.”, or the “super, handsome bastard”. After a series of humiliating situations, Jaehyun admits that he no longer just wants to be friends, and would rather date. Yeonju, who had her mind set on never dating ever again, finds herself interested despite how hard she tries not to fall for him!"]},{"title":"The Double Agent","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manhwa The Double Agent / 이중첩자","Sasha becomes a spy after losing everything in the war. She was found by John, the leader of the war and a demon officer with the face of an angel, but…! The spy is caught by the enemy country and becomes a double agent!"]},{"title":"The Grand Duke’s Little Lady","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Grand Duke’s Little Lady / 대공가의 아기 마님","",""]},{"title":"For My Hero","tags":["Drama","Fantasy","Historical","Isekai","Magic","Manhwa","Romance","Royal family"],"disc":["Read manhwa For My Hero / 나의 영웅을 위하여","“Noah, open your eyes! This can’t be your last. Please…!”\nI was summoned to this world just because I was holding a novel, “The Heart of a Dragon, and I became the second lead character in the novel. And you, the master of the sword and my husband.","Our meeting was so fateful. So I didn’t believe your love. Because I thought you loved the heroine, not me.\nUnlike the novel, I realized only after you died in vain. I’m a coward. I loved you, but I refused it because I was afraid I would lose you. Now… it’s time to settle the debt owed by the Dragon.\nThe day I came back from the first meeting with you, I decided. I’m not going to let you die this time.\n“I’ll protect you no matter what. Trust me!”\nEven if you’re the strongest hero in the world who doesn’t need help"]},{"title":"The Predatory Marriage Between the King and the Paladin","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Predatory Marriage Between the King and the Paladin / The King and the Paladin / 国王与圣骑士的掠夺婚姻 / 국왕과 성기사의 약탈혼","Ezekiel is a gentle and noble paladin who commands the Order of Silver Knights in Panroem City. But when the new ruthless tyrant of Alfensiad, King Calliope, orders him to join Duke Heilich’s family as his successor, he has no choice but to comply in order to save his powerless city-state. Little does he know that what he thought was a diplomatic mission would lead him into a forced marriage with “The Bloody Calliope” herself! It’s even more of a shock when Ezekiel discovers that Calliope is actually someone he knew in the past… and with the grudge she holds against him, it looks like he’s in for a tense marriage. Can the unlikely couple clear up the misunderstandings between them and make something of their relationship, despite its rocky beginnings?"]},{"title":"Lady’s Tea Contains Poison","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo"],"disc":["Read manhwa  Lady’s Tea Contains Poison / 레이디의 홍차에는 독이 들어 있다","I possessed the novel with three people who were my counterparts. Among them, I became the prince’s fiancee and a villain youngae who ended her life with the guillotine ending. “I’m happy though. We are all female protagonists in novels, so we can spare our lives.” … Were all female protagonists? I rolled my eyes awkwardly and finally opened my mouth. “Ah… , I will soon be the guillotine.” * * * It caused inconvenience to everyone. I thought the best thing I could do for everyone was to break up… … . “We are breaking up.” “Belly, what have I done to you? If you have a reason, tell me.” You catch me asking for a breakup. “Belly. I have no intention of giving up on you.” “If you can escape, run away. Even if it were death, I would gladly follow you.” Apparently, the keyword of the novel was affectionate man. When did the keyword change to obsessive? Will I be able to see the ending safely?"]},{"title":"I Gave Birth to the Tyrant’s Child","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Gave Birth to the Tyrant’s Child , / I Gave Birth to the Tyrant’s Child / 폭군의 아이를 가졌습니다 / I Got Pregnant with the Tyrant’s Child","The night of the annual festival.\nWhen Ilran opens her eyes, she finds the emperor, notorious for his cruelty, sleeping next to her. She runs away immediately, but…\n“I’m pregnant.”\nShe unexpectedly conceives a tyrant’s baby in a single night.\nIlran decides to hide this fact after hearing that the emperor detests women who approach him. Yet Cairat keeps testing her resolve.\nWill Ilran ever get away from Cairat?"]},{"title":"The Wizard is Poor","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Wizard is Poor / 마법사는 가난해","Elena, an A level wizard who makes money and has a full level of ability. However she has a fatal drawback. “There’s a degree to which this bloody magic discriminates against people.” The drawback was that her magic could only be used with the help of jewels. Because of that, she carries a lot of jewelry for self-defense and not for decoration. One day, an offer comes in. “Will you be with us, wizard?” It was the position of the exclusive wizard of Duke Mayfield, the best in the empire. Elena accepts the position without much consideration, thinking about how to pay off her debt. However, it wasn’t as light of a job as she thought it would be… It’s okay. I’ll kill you all! With the power of jewels!"," "]},{"title":"This Girl Is A Little Wild","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa This Girl Is A Little Wild / Wild girl / 这个小姐有点野 / 칼과 드레스","About This Girl is a Little Wild Manhwa. After he was defeated, the Demon King used the last of his strength to trap the captain of the Holy Knights into the body of a weak girl. However, the Captain was a girl to begin with, so, tired of her former life and unable to return to her former body, she decides to live a luxurious life instead in the body of the noble daughter she’s trapped in. However, her new family puts her in danger, so she tries to go to the church to prove her identity. In order to do so, she ultimately becomes engaged to the captain of the special task force. Will she be able to prove her identity and still live an ordinary life? What will happen to her relationship with her fiancé? And, is there something more to this new life she’s received?"]}]