[{"title":"Let Me Fall Be Brilliant","tags":["Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Webtoon","Webtoons"],"disc":["Read manhwa Let Me Fall Be Brilliant /My Dazzling Downfall / Let My Downfall Be Glorious / Let My Fall Be Brilliant / May My Fall Be Brilliant / So That My Downfall Will Be Glorious / 나의 추락이 찬란하도록"]},{"title":"Wake Up, Warrior","tags":["Adventure","Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Wake Up, Warrior","I became the warriors’ benefactor…? One day, the five heroes from the legends appeared in my front yard. The antidote I made without thinking worked?! Really? I hate saving lives, but I’ve lost the will to say no. ‘Let’s just treat them as soon as possible and let them go.’ However, the atmosphere that surrounded the warriors was very strange. “Ms. Kacana, no one here will send you off alone. ” “Why don’t you warm up? The most important thing is your body.” “Why are you hiding so many secrets, Kacana?” “Do you like my scent that much?” “I’m a bit of a freak in bed.” ‘I’m not accidentally leading them on, am I?’"]},{"title":"It Looks Like I’ve Fallen into the World of a Reverse Harem Game","tags":["Drama","Fantasy","Isekai","Romance"],"disc":["Read manhwa I Fell Into a Reverse Harem Game! / It Looks Like I’ve Fallen into the World of a Reverse Harem Game / It Seems Like I Fell Into a Reverse Harem Game / Estou dentro de um jogo de harém inverso / Terjatuh ke Permainan Harem / Yeok Harem Game Sogeuro Tteoreojin Moyangimnida / 역하렘 게임 속으로 떨어진 모양입니다","When I opened my eyes, I was in a different world. I had become the game’s villainous princess who was feared by all. Not to mention… Completely naked men I didn’t even know were approaching me left and right! “Are you cold? Shall I warm you up with a hug?” “Oh? Have you not had enough yet?” Seriously, what’s up with this situation? And just how the hell am I going to get out of this freaking game?!"]},{"title":"I Raised an Obsessive Servant","tags":["Action","Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","One shot","Romance","Shoujo"],"disc":["Read manhwa I Raised an Obsessive Servant / My Ray of Hope /Aku Merawat Pelayan Yandere / Crié a un sirviente obsesivo / I Raised an Obsessive Second Male Lead / The Rise of an Obsessive Servant / Я вырастила навязчивого слугу / 养了个偏执狂男二 / 养了个偏执男配 / 私を溺愛する2番手男キャラを育てました / 집착 서브 남주를 키웠습니다","I was fighting with the heroine for the Empress’ seat. I, Yurina Cartia, the villainess of this novel, die at the hands of a second male lead. Before the heroine meets him, I planned to find the young second male lead in the orphanage and sponsor him to get him to be on my side. “Carion, I want you to remember what I’ve done for you today. And later on, when a situation arises and I end up in danger, you have to save me just like how I saved you today.” I only have one goal. To avoid death and survive by winning his favor. But then… “Remember, Yurina. I’m the only one who can save you and kill you. You have to stay by my side forever.” The child, whom I thought I raised like an obedient cat, has grown up to be an obsessive man!"]},{"title":"Collector","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Collector / 컬렉터","Kang Seung-won, CEO of SU Construction, is the name of the man who proposed sponsorship to Sojin. He was a person who caught my attention even at the event where I first met him, but I was planning on rejecting his unpleasant offer. If only those who had insulted her and her mother had not caught their attention. Sojin accepted his offer for personal revenge, and Seungwon knew it, but he was used by her. So the two become entangled in a deep spawn relationship…"]},{"title":"Exclusive Pleasure","tags":["Adaptation","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Exclusive Pleasure / 독점쾌락","In a web of secrets and danger, Eugene, a young woman posing as Derick’s male secretary, hides from a tragic and dangerous past. But when a lethal assassin targets Eugene, and other sketchy figures target Derick for his riches, their world crumbles. Bound by a secret, passionate love and a shared history, their fight for survival intensifies as peril looms ever closer. Unfortunately, Derick’s ability to guard Eugene continues to slip. Soon, they will have to confront an agonizing question… What does it mean to truly protect the one you love most?"]},{"title":"The Blackened Second Male Lead’s Wife Series","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Blackened Second Male Lead’s Wife Series / 흑화하는 서브 남주의 아내랍니다 / I’m the Wife of the Yandere Second Male Lead / I’m the Corrupted Side Character’s Wife","Lucian Kardien.","He was the hero who led the war to victory.","He was the second male lead who loved the female lead so much that he turned yandere.","And I’m the fiance who will be killed by his hand,","Of all things, why did I have to transmigrate here! I must somehow increase his likability to prevent a “surprise” ending.","With a toothy grin and my clapping hands of approval, I’ll help him connect with the female lead!","But what is this reaction?","“Lady Pernia…. please don’t provoke me anymore.”","…….Why is it still a scary ending!"]},{"title":"I’ll Retire After Saving the World","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I’ll Retire After Saving the World / I Will Save the World And Then Retire / 세상만 구하고 은퇴하겠습니다","Year 2044.\nRight before the global explosion of dungeons—the end of the world. And…\nwhen I opened my eyes again, it was twenty years before the end. I, Woo Hwijae,\nmust stop the apocalypse to secure my retirement plan!"]},{"title":"The Chaebeol’s Youngest Son","tags":["Drama","Shounen"],"disc":["Read manhwa The Chaebeol’s Youngest Son / The Youngest Son of Sunyang / The Youngest Son of a Conglomerate / 재벌집 막내아들 / Reborn Rich: The Youngest Son of a Conglomerate","To get back 13 years of hard work! Yoon Hyunwoo, who lived like a servant and abandoned, thought it was all over. But when he was killed he woke up in the young body of Jin Dojun, the grandson of Soonyang Group’s Chairman, Jin Yangcheol! However, Jin Dojun, the youngest son of the chaebol family, is far from the right to inherit the group. Will he be able to become the final winner in this family political drama? Yoon Hyunwoo’s exhilarating revenge drama to swallow up the Soonyang group begins!"]},{"title":"Sam Plays the Game","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Sam Plays the Game / 삼이는 재생한다 / Sami Plays the Game","‘SAM’, who escaped from a life where everything seemed perfect only to find himself living in extreme poverty, becomes acquainted with ‘Kim Ki Joon’, who presents a cold exterior but harbours a warm heart, and ‘Yoo Chan’, who secretly admires such authenticity. A peculiar love triangle ensues, bringing chaos to their school lives."]},{"title":"The Princess in The Henhouse","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Princess in The Henhouse / 닭장 속 공주님","Princess Soria has been cursed to live in her dilapidated kingdom as a chicken for the last century. Her curse can only be broken through true love with her Prince Charming. Unfortunately, the only fitting candidate for her comes in the form of Emperor Lenok, who doesn’t know a thing about romance! He also needs her help to save his empire from a long-term drought, a problem that can only be solved by breaking her curse and restoring her kingdom. But how is a poultry princess supposed to fall for such an unattractive ruler?!"]},{"title":"Summoners War: Cross","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Summoners War: Cross / Cross (JI Changgeun) / Cross (Jungle Studio) / クロス -CROSS- / 魔靈召喚：Cross / 서머너즈 워 : 크로스, 크로스","Durand and his best friend Elheil continue to train to become a summoner in a village in Eteca, where peace has been precariously kept during the Hundred Years’ War. One day, Durand loses his father to the shadow organization, chasing the ancient relic ‘Shelkrino’, and Durand pursues the shadow organization in his own way to get revenge and Elheil pursues to uncover the identity of Shelkrino. Elheil and his crew who became Durand’s family worry about Durand who wakens his summoner’s ability due to Shelkrino but also is being eaten away by it. Will they succeed in avenging Tomas and stop the shadow organization from threatening the entire Alea?"," "]},{"title":"Reincarnation Path of The Underworld King","tags":["Action","Fantasy","Martial Arts"],"disc":["Read manhwa Reincarnation Path of The Underworld King / 염라강림","The underworld has collapsed. In the barren land where blood should flow, now clear water flows, and the cauldron that used to boil the souls has long since gone cold. The retired King of Underworld, in pursuit of his own happiness, seeks the path of reincarnation. However, due to the chaos in Underworld and the disappearance of his successor, he is unable to walk the path of reincarnation. To become a god in the human world and to track down the missing successor, The King of Underworld descends to the human world. But the human world is in chaos due to the escape of the deceased from Hell, orchestrated by his successor’s masterful plan. The King of Underworld joins forces with the ‘Guardians of the Life’ who protect humans, using the power of the Hell’s ledger, in a struggle to capture his successor and restore the world to its original state. Will King of Underworld be able to safely walk the path of reincarnation?"," "]},{"title":"The Duke And Duchess Divorce Circumstances","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Duke And Duchess Divorce Circumstances / I Will Divorce the Duke / Divorce Circumstances of the Duke and Duchess / The Duke and Duchess’ Divorce / The Duke and Duchess’s Divorce Circumstances / 공작 부부의 이혼 사정","In the conservative realm of Ridam, it is inconceivable for a woman of prime age not to marry. Ray Alexis Leanello, the gentle eldest daughter of the wealthiest family in Ridam’s capital, Laviden, is transported to another world by some accident—right to South Korea! However, after 10 years, just as suddenly as she arrived, she finds herself back in Ridam. Having undergone a complete transformation in values due to her decade-long life in South Korea, Ray brushes aside her stifling surroundings and dream s"]},{"title":"The Princess Pretends To Be Crazy","tags":["Drama","Fantasy","Historical","Magic","Manhwa","Romance","Shoujo","Survival","Time travel"],"disc":["Read manhwa The Princess Pretends to Be Crazy / Crazy Like a Fox / Putri yang pura-pura gila /왕녀는 미친 척을 한다","“On the Moonlight Garden-!” “White evening primroses are in full bloom -!” It was a strange succession ceremony in which the strongest member of the royal family succeeds the throne. After being poisoned, she returned five years into the past, and played the part of a crazy b*tch in order to survive. Seriously, was surviving by simply looking like the weakest not enough? The crazy princess, with no power or backing, was about to die, but a suspicious wizard suddenly appeared before her. “What should I do to get your kiss?” “A deal. If you help me, I’ll kiss you.” “Good. I have no intention of letting you die in the hands of anyone besides me.” I feel like I entered the tiger’s den while trying to escape the wolves… Is it really okay if I make this deal? A fiery battle and romance between a woman walking towards life with all her might, and a man who lives for death."]},{"title":"The Return of the Ex-Wife","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Return of the Ex-Wife","Annis, a knight, married Marquis Devon Pizetra out of respect for her late mother’s wish. As the lady of the house, she brought wealth to the family by successfully managing the finances. However, the incapable husband Devon spends her hard-earned money on his ex-wife, who is pregnant with his child. Devon asks Annis for a divorce but forces her to stay on the estate and continue to manage family businesses. When Annis was broken by her husband’s betrayal, she encounters Rowan, an old acquaintance and fellow knight who seems to have feelings for her that’s been kept hidden for a long time."]},{"title":"Forced to Become the Villainous Son-in-law","tags":["Action","Adventure","Fantasy","Isekai","Manhua","Reincarnation"],"disc":["Read manga Forced to Become the Villainous Son-in-law on manhwaclan\nA third-rate writer that is destined to go to hell because of it’s novel bad ending, got reincarnated in his own novel instead, reborn as the villainous son-in-law – Li Yu Guo. The battle of wits and courage between him and the original protagonist begins now…"]},{"title":"The Great War","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Great War","Im Dajun, who was abandoned by his family and now lives as the leader of a runaway group, one day brings Yeonwoo home by chance.\nYeonwoo then commits a violent rampage in Incheon. Standing in the way of Yeonwoo, who was trying to kill a chaebol chairman for revenge, is Yoon Gamin, a top student hopeful.\nMeanwhile, Nahwajin of the School Authority Protection Bureau watches the situation with interest…","The first crossover in the Blue String Universe! A massive showdown featuring the main characters from [True Education], [Study Group], and [How to Fight].\nThis is a record of an intense battle not covered in their own stories."]},{"title":"Living as the Villain’s Stepmother","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Living as the Villain’s Stepmother / It’s So Easy To Avoid Death by Being A Stepmother / 계모인데, 죽음을 피하는 게 너무 쉽다","The oven exploded while I was baking bread, and I faced death with my abusive father, who had come seeking me. Then I woke up in a novel I was reading.\n“I-I’m sorry, Mo..ther. I’m not hurt.”\nIn the body of the villainous stepmother “Leila”, who abused the male protagonist “Hirua” when she was young, but was eventually executed by Hirua when he returned as emperor!\nIn order to help Hirua leave the stepmother’s wraith and live happily, I encounter the Marquis “Lacias Huppert”, who played a crucial role in the original, proposing a contractual marriage…\n“Can we have a real marriage instead of a contractual one?”\n“Oh, can I sleep with Mother too?”\nContrary to the plan to leave only the two of us after a year, it seems both the Marquis and Hirua start becoming attached to me in an unexpected way…!"]},{"title":"I’m the Emperor’s Lost Daughter","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m the Emperor’s Lost Daughter / I Am the Emperor’s Lost Daughter / 나는 황제의 잃어버린 딸","Embodying the culture that I experienced in my previous life,\nA ‘reincarnator’ with the ability to make the empire flourish.\nRossite is able to use her unique ability, the power of implementation.\nBeing bullied by the reincarnator Karina she was even accused of attempting to murder the Duke of Identino, which lead to her execution.\nAt that moment, I recalled the memories of my past life as a paramedic,\nRossite realizes that she is the real reincarnator and regresses in the brink of death.\nThe first thing Rossite saw after her regression was Duke Identino, saying he has come to find the ‘Emperor’s lost daughter.’\nRossite goes to the imperial capital with him, but even there, Karina slanders Rossite by spreading rumors that she is a fake princess…\nThe emperor, paying no mind to her words, called her the real daughter.\nI feel even more drawn to Rossite, who is called the fake princess.\n‘Why is it that being with this child is as comfortable and enjoyable as being with the Empress?’\nCould I really be the emperor’s lost daughter?"]}]