[{"title":"Wasn’t the Male Lead a Female?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Wasn’t the Male Lead a Female? / The Heroine Is a Man / I Told You I Was a Man Dressed as a Woman! / I Told You I Was a Man Disguised as a Woman! / I told you to dress up as a mistress! /남장여주라고 했잖아요!","Ainne lived for eight years without even knowing which novel she was trapped in. Then one day, a knight came looking for me and she realised which novel she was in. Actually, this guy is a woman?! The heroine who’s dressing up as a man, taking the place of her brother?! If that’s the case, she’ll become friends with the heroine and live a comfortable life! But she felt that the heroine was acting a little strangely… She didn’t know that the heroine was actually truly a man! She’s already too deep into the friendship, what should she do now? “Do I really look like a woman?”"]},{"title":"A Blade at a Time","tags":["Action","Adventure","Fantasy","Manhwa","Shounen"],"disc":["Read manhwa A Blade at a Time / 一忽刀 / 일홀도"," "]},{"title":"Young Boss","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Young Boss","Kang Sihyun, an ordinary office worker on the verge of marriage after a dull romance. In front of her appeared Yoon Taeha, the boy she used to take care of when she was young. He was now their Division Director, in other words, her superior. “You can’t do this to me. Even if you’re the last man on earth, we can’t be together!” The boy who used to be so cute now gazes at her with a man’s eyes as he speaks. “Marry me instead.”"]},{"title":"She came back and opened a dessert shop","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa She came back and opened a dessert shop / Abella’s Dessert Cafe / The Lady Who Has Returned, Opened a Dessert Shop / The Returner Lady Opens a Dessert Shop / 회귀한 영애는 디저트 가게를 연다","A office worker who was reborn as a noble lady, and died again in a carriage accident, after discovering that her husband was a playboy. In her third life, she went back to the wedding day and this time, she ruined the wedding and opened a dessert shop!"," "]},{"title":"Chords of Affection: The Icy Monarch’s Love","tags":["Fantasy","Romance","Webtoons"],"disc":["Read manga Chords of Affection: The Icy Monarch’s Love / Reiketsu Kunshu wa Chouai wa Utahime no Tame ni / 冷血君主の寵愛は歌姫のために","Ayesha, the princess of a border kingdom, loses her divine singing voice after falling into the clutches of ruthless. bandits who ravage her homeland. As hope for her survival dwindles, salvation emerges in the form of Grand Duke Victor, the monarch of the most powerful country. While Ayesha is touched by Victor’s compassion despite his fearsome reputation, she is also heartbroken by the realities of war. Determined to heal the wounds inflicted by conflict and pave the way for a harmonious future, she seeks to rediscover her lost voice. This is the tale of a songstress who abhors violence and a stoic monarch skilled in battle, both striving for a future of peace together."]},{"title":"Existence","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Existence","One day, it was a herd of ants, and another day, it was a large dinosaur.\nThis was the last reincarnation of a being that had experienced tens of thousands of reincarnations and lives.\nHe was born as a human with the power of every single lifeform he had ever been.\nWhy did he have such an ability?\nLee Jain finally came to understand.\n“I exist to eradicate mankind.”"]},{"title":"Moonlight Ball","tags":["Fantasy","Historical","Magic","Romance","Shoujo"],"disc":["Read manhwa Moonlight Ball","Iris is the great wizard’s greatest disciple, but has severe social phobia. To overcome this problem, she runs a workshop alone under the orders of her teacher, Elaine. One day, her life is threatened by a mysterious woman who visits her. However, just as she is about to be killed, Iris becomes possessed by the woman’s body. however… The owner of her possessed body is the queen of the empire? She has the Sword Master King as her husband!?"]},{"title":"MOUNT HUA SECT’S GREATEST GENIUS","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa MOUNT HUA SECT’S GREATEST GENIUS / 화산파 역대급 천재","Baek Un-ho, a third-generation disciple from a respectable family but lacking inner strength, may be expelled from the Mount Hua sect. However, one day he stumbles upon a fateful encounter with Mong Won-kyung and emerges as an unparalleled prodigy of the Mount Hua sect. Just how powerful will Baek Un-ho become?!"]},{"title":"Fake Humans","tags":["Drama","Fantasy","Horror","Manhwa","Psychological","Romance"],"disc":["Read manhwa Fake Humans / Fake World (kim-badak) / 假面人类 / 假面人間 / 가짜 인간","Having escaped her abusive mother, twenty-year-old Ji-a lives a modest life with her little sister, Su-a. When Su-a does not return from her field trip under sinister circumstances, Ji-a vows to do anything she can to get her sister back. As she and her high school friend Wonseung delve further into the mystery, they find that there might be a larger conspiracy under the surface — a tangled web that includes a cult, a mystery, and powerful figures that might shake South Korea to its core."]},{"title":"When The Demon Gets Tempted","tags":["Demons","Manhua","Shounen Ai","Supernatural","Yaoi"],"disc":["Read manhua When The Demon Gets Tempted  / 当恶魔动心时 / When the Devil Is Tempted / Dāng Èmó Dòngxīn Shí","Xia Yang is a college student that’s a sucker for people with good looking faces and has been a fan of the idol, Jiang Zhengze, for many years. He is obsessed with idols, crazy about idols, and would do anything for his idols. But one day, the idol he longed for turned into a demon who wants to eat him up, constantly pushing him to the edge of his sanity. Thus his agonizing and turbulent cohabitation life begins…"]},{"title":"Summer Bloom","tags":["Romance","Shoujo"],"disc":["Read manga Summer Bloom At The Corner of The Street / Sunflower House of the Street Corner / Summer Bloom / 街角的向阳花屋","The 18-year-old He You is an incoming college freshman who just moved to her college city, where she had an unpleasant encounter with a strange guy on her very first day. Upset, she wandered to a fragrant flower shop at a street corner, where she was welcomed in by its beautiful and warm-hearted shopkeeper. Little did she expect that she’d find the same kind of magical flower from her childhood… as well as the unpleasant strange guy! Is he the “magical” boy who helped her in her childhood?"," "]},{"title":"World of Ten Billion","tags":["Action","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa World of Ten Billion, 10 Billion World ,Ten Billion Worlds ,백억세계","Haven, endowed with innate talent, beauty, and special abilities, was the pride of the Siren royal family, garnering great expectations. One day, due to a sudden turn of events, Haven had to endure a significant event involving the destruction of her family and race at the hands of a fairy. Avoiding the fairies who might still be searching for her, Haven disguises herself by cross-dressing, concealing her identity as an ordinary human herbalist. While everyone dreams of the resurrection and revenge of the royal family, Haven’s thoughts seem to diverge a bit."]},{"title":"Once More","tags":["Comedy","Romance"],"disc":["Read manga Once More / Again With You / Zai Du Yu Ni / 再度与你","In senior high, they missed each other because of a misunderstanding and after graduating, they return to their alma mater as teachers. The male lead can’t recognize the female lead because seven years have passed!? An insensitive cold female PE teacher, and a two-faced smiley male math teacher, meeting once again. Things remaining the same but people changing, can the feelings that once died come back again? Meanwhile, the secret from senior high is slowly revealing itself…"]},{"title":"King of Drama","tags":["Action","Comedy","Manhwa","Slice of Life"],"disc":["King of Drama,\n“If I were to be reborn, I’d want to make a crazy drama” Just before I died, I had a wish that passed by like a flash of lightning An unknown “system” accepted this vague wish. Lee Hyunseok goes back to his PD days to make a crazy drama. A ghost master director, and uprising great actress Iseol And the producer of “Crazy Drama” that risked Hyunseok’s life Dramas aimed at the end of the year are becoming more and more popular around the world!"]},{"title":"When the Broken Saintess Touches Love","tags":["Drama","Fantasy","MANGA","Manga","Romance","Tragedy"],"disc":["Read manhwa When the Broken Saintess Touches Love / Junketsu wo Ushinatta Seijo ga Ai ni Furetara / 失去貞潔的聖女遇上愛 / 純潔を失った聖女が愛に触れたら","In a world where saints have the power to protect their country, Lelia’s powers as a saint awakened when she was twelve and moved to the royal palace from her poor viscount family home. She spent happy days praying daily with the sole purpose of saving people and got engaged to the second prince, Evan. One day, Angèle, another woman whose powers as a saint awakened, came to the palace. They promised to help each other since having two saints in the same generation was rare. However, one night, Lelia was kidnapped and assaulted after her prayers. That night, she lost more than her virginity: remaining pure for life was an unbreakable condition for being a saint. When Evan broke off their engagement, Lelia realized that the assault had been a plot by him and Angèle. Lelia became a servant for the two, now engaged, and endured constant abuse at their hands until one day, a black-haired man appeared by her side…"]},{"title":"Golden Mage","tags":["Action","Adaptation","Fantasy","Manhwa"],"disc":["Read manhwa Golden Mage","I lived a life repaying my parents’ debt and died unjustly.","“It’s unfair that I died after living a lonely and poor life!”","But after opening my eyes in place I’ve never seen before, I became Ell. In order to protect his family in this life, Ell needs power and money.","“I’m going to become the best mage and obtain both.”","Ell will obtain everything in this life by using his management skills as a pro-gamer from his past life and his genius-level mathematics !"]},{"title":"Baked by the Baroness","tags":["Drama","Fantasy","Historical","Manhua","Romance","Shoujo","Villainess"],"disc":["Read manhua Baked by the Baroness"," "," "]},{"title":"The King’s Beloved Daughter","tags":["Isekai","Manhua","Romance"],"disc":["Read manga The King’s Beloved Daughter / 帝国第一团宠皇女","As a daughter of calamity/misfortune, she chose to marry into the Duke’s Family, to get rid of her tragic fate in her kingdom. Unexpectedly, her scum of a man husband deals a fatal blow to her head. His mistress contributes to her unexpected death. She is given an unexpected chance of rebirth… opening her eyes again, she returned to her childhood, facing the faithful maid, the indifferent father and the unidentified teenager, how can she change the fate of her previous life…"," "]},{"title":"Ningen Desuga Maou Totsugu Koto Ni Narimashita","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Ningen Desuga Maou Totsugu Koto Ni Narimashita / Satan’s Bride / 왕의 공녀 / Wangui Gongnyeo / The King’s Concubine / ニンゲンですが魔王に嫁ぐことになりました / La Promise du Roi Démon / Gadis Untuk Sang Raja"]},{"title":"High and Mighty","tags":["Action","Adaptation","Adventure","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa High and Mighty / 안하무인 / Ahn Ha Muin","Yong Cheonsang, the young lord of the great House Yongcheon, is a free soul. His main joy in life is exploring the world. As such, when his father tries to marry him off to supposedly the most beautiful woman in Bukgyeong area, he’s not interested in settling down in the least. He steals everything he can carry from the carriage transporting the wedding gifts meant for his bride and sets out on another adventure. Little does he know that out of the gifts he steals, there is a certain item that is the key to reviving the demonic sect. Will Cheonsang be able to vanquish the dark forces pursuing him and thwart their plans of rising to power once again?"]}]