[{"title":"Contrast Game","tags":["Comedy","Romance"],"disc":["Read manga Contrast Game / 反差游戏\nAi Yuanyuan and Qin Shu happened to like each other although their personalities and appearances are the total opposite from when they are in the game. When Yuanyuan failed to confess her feelings in the game, she decided to guide Qin Shu on how he can pursue the person he has a crush on in real life… Little did the two know that Qin Shu is actually trying to pursue Yuanyuan herself."]},{"title":"Holy Idol","tags":["Comedy","Drama","Fantasy","Isekai","Romance"],"disc":["Read manhwa Holy Idol","Rembrary, the deputy of God loved by all and the holy high priest. When I woke up while fighting against the Demon King who invaded my world, I woke up as an underrated idol in Korea..! Will he be able to safely adjust to the idol life and return to his original world?"]},{"title":"Marriage Contract With Two Husbands","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Marriage Contract With Two Husbands / 두 남편과의 결혼계약 / A Marriage Contract With My Two Husbands","Roselyn was married to Archduke Melchior, the first knight of the Empire.","“You don’t know me.”\n“I want to save you.”","A man who saved her life, saved her family, paid off her debts, and even wants to get married.\nThere is no such thing as a favor without a reason, why would you do this to someone you don’t know?","“You look like someone I know.”","Melchior’s first love, said to look just like Roselyn.\nWhen she was depressed thinking that she was just a second love for his first love, she took in Julian, who looked exactly like her husband’s childhood, as a disciple… .","“Divorce the man and marry me, Roselyn.”","What if I marry both husbands?"]},{"title":"My Daughter is a Music Genius","tags":["Comedy","Drama","Loli","Manhwa","Shoujo","Slice of Life"],"disc":["Read manhwa My Daughter is a Music Genius, 내 딸은 음악천재\nI was crazy about music and dedicated my entire life to it, but I neglected my daughter. I soon started to regret that for the rest of my pathetic life. Just like that, I died, but when I opened my eyes, it was 10 years ago. This time, I vowed to be a good father. By the way, I think my daughter is a musical genius."]},{"title":"Choose your husband Carefully","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Choose your husband Carefully / Be Careful When Choosing A Husband / 남편을 고를 때는 신중하게","After her mother’s death, Elrose is left alone in a monastery, while her father is stripped of his fortune. When news of his passing reaches her, she must flee the monastery and marry within hours to claim her rightful inheritance and title.","Desperate, she prays for a husband and fate brings a man to her feet. Little does she know, he is Lachsann, the man who stole her money.","Despite her mother’s warning to “choose a husband carefully,” she can’t do so in this situation. Elrose proposes to Lachsann, a man who stole her money.","“Do you have no intention of repaying me, except for your body?”","Unbeknownst to her, Lachsann isn’t just any man but the emperor’s brother and the king of mercenaries, Harkhan."]},{"title":"Plenus","tags":["Fantasy","Romance"],"disc":["Read manhwa Plenus / 플레누스","“I’ve kept your memory alive because it’s the only way this world can continue. You’re the only one who can save it, Emo.”","The war is won, but the wheat farming is ruined! The empire of Lipolka is plagued by famine, a curse cast by a demon who lost a battle to a warrior just before he died. I, Eudemonia Plenus, was born to this land with the knowledge of my previous life, with the historical mission of improving the food culture of the continent!\nPeople are starving to death for lack of food, yet they eat no potatoes, no sweet potatoes, no tomatoes… The little lord’s continental version of the ‘three meals a day’ project!","What can I do when my mind is an adult from a previous life, but my body is a baby? Ouch, big trouble!"]},{"title":"Since My Time is Limited, I’m Entering A Contract Marriage","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Since My Time is Limited, I’m Entering A Contract Marriage / Contract Marrying Because I Am Terminally Ill / 시한부니까 계약 결혼 합니다","Please be my husband for just one year! ‘I only have one year left to live.’ The way she chose to escape from her vicious family was marriage. “You have a secret lover, right? I’m going to die anyway. I’ll be your air-like wife to fill that empty space.” It was nice to escape the house by proposing to Duke Kaiyen, the Grand Duke of the North and a war hero known for being cruel… “Gwama disease is not an incurable disease. It shouldn’t be.” The duke is so kind to me that it’s melting my heart! Duke, I tgought you have a lover…?"]},{"title":"Notes on Cherry Blossom","tags":["Drama","Fantasy","Manhua","Romance","School Life"],"disc":["Read manhua Notes on Cherry Blossom / 櫻花札記","The 16-year-old girl, He Xi, followed her mother from the mainland to live in the Central and Western District of Hong Kong. They lived in ordinary accommodation and experienced poverty. He Xi’s mother relied on a porridge stall to make a living. He Xi originally thought that life would go on like this. Until that summer, her encounter with the mysterious neighbor boy made her life no longer lonely. He taught her to speak Cantonese, encouraged her to be brave, and taught her to grow."]},{"title":"I will live as a supporting role in this life","tags":["Drama","Fantasy","Historical","Isekai","Josei","Manhwa","Romance","Shoujo"],"disc":["Read manhwa I will live as a supporting role in this life / 이번 생은 조연으로 살겠습니다 / I will live this life as a supporting actor / I Will Live This Life as a Supporting role","In the memory of my previous life, when I lived like a decorative doll for someone other than myself, I wanted to live without being swayed by anyone in this life.\nTo do so, I went to the academy to save money to spend the rest of my life comfortably in a quiet place.\n…but why is everyone doing this to me?"]},{"title":"Something is Wrong with His Majesty","tags":["Action","Comedy","Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Something is Wrong with His Majesty / 这个陛下不对劲","When I became this good-for-nothing emperor, I had to follow a scripted trail. It’s over now, the trail instructed me to bring the beautiful General into the palace to humiliate him?! This… This is not good… (rubbing hands in conflict)"]},{"title":"Circumstances of Switching Bodies","tags":["Fantasy","Gender Bender","Isekai","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Circumstances of Changing Bodies / Becoming You / 몸이 바뀌는 사정","The prince was cursed of switching bodies with the woman he spent the night with, and I became the daughter of the duke who could not solve the curse.","Tempted to solve the curse, I seduced him indifferently and spent the night with him. I gave him the antidote, so I stopped paying attention to him…","“Princess, you’re leaving me because you weren’t satisfied that night.”","“…”","“Once more. I’ll satisfy you this time.”","To make matters worse, the curse had not been lifted and our bodies have switched frequently without notice.","There’s only one way back to our original bodies, which is to desire each other’s bodies, but-","“Your Highness, why did you rush all the way here?”","“You said you didn’t like being rained on.”","“I told you it was a lie to lure you in.”","The changed man covered me with his jacket and said softly,","“I hate myself for letting you get rained on.”"]},{"title":"I Became the Lousy Side Top","tags":["Adaptation","Comedy","Drama","Isekai","Reincarnation","Romance","Shounen Ai","Slice of Life"],"disc":["Read I Became the Lousy Side Top / I Become a Boring Supporting Top Character / I  Become the Boring Second Male Lead / 찌질한 서브공이 되었습니다 / 찌질한 서브공이 되었습니다","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”","Seo Jaewoo wakes up to find himself in the world of a BL novel. But he isn’t just any random person. He’s actually the lousy side top character who’s meant to torment the main bottom, Yoo Hyeonjin. What’s worse is that by the novel’s conclusion, all of Jaewoo’s despicable actions catch up to him, and he is killed by the story’s crazy main top and Hyeonjin’s love interest, Choi Mujin. In order to avoid his death, Jaewoo decides to change his original role and get on Hyeonjin’s good side. His method: lure him in with food, of course! While his tactic proves effective and he slowly befriends Hyeonjin, that doesn’t become the only major change to the plot. After an unexpected encounter with Mujin, Jaewoo’s position as the “lousy side top” gets completely flipped upside down…"]},{"title":"The Beauty Ran Away with The Hedgehog","tags":["Comedy","Romance","School Life","Shoujo"],"disc":["Read manhua The Beauty Ran Away With The Hedgehog / 花和刺猬逃跑了","Rich girl Hua Manman is forced by her father to study hard in a normal university without exposing her identity. There, she meets a commoner schoolmate— the handsome, cold, and slightly scheming Xiao Ye. The two of them come from different worlds with different values, and during their clashes, they find another…adorable side other than that of the cold hedgehog/foolish rich daughter. _(Synopsis : GS)"]},{"title":"Fragrance Princess","tags":["Drama","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read manga Fragrance Princess / Fragrance Harmonizing Princess / Princess Diaoxiang / 调香王妃","After transmigrating into a dynasty and before being able to get used to her new identity, it was time for her to get married. What? She must marry the lame and blind Third Prince?! And she was plotted against on her journey there?! She is an independent and strong masculine woman. Arguing with concubines, lecturing servants and messing around with her handsome husband as she pleased. Living a life during ancient times can be this prosperous."]},{"title":"Which Wizard Will Kill Me","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Which Wizard Will Kill Me","Life at Papilon, the elite magic school, is full of hardships for Rhea who’s failing in every possible way. One day, when her hidden friendship with the top-student and her childhood friend Sion gets discovered by the mysterious transfer student, Joon, Rhea can’t help but notice the energy of death surrounding him… Who will be the wizard to kill her?!"]},{"title":"20-Year-Old College Jocks","tags":["Adaptation","Josei","Mature","Office Workers","Romance"],"disc":["Read manhwa 20-Year-Old College Jocks / Twenty Years Old, Physical Education Students / 20 Years Old, PE Students / 20-Year-Old College Jockstudents / 스무살, 체대생들","After breaking up with an irredeemable trash of an ex-boyfriend, the only thing Hyemin is lacking is sex. Normally, she wouldn’t even look at a dating app, but the younger guy she met there brought a friend to their meeting place. “‘Is it okay if we do it with the three of us, noona?’ “Isn’t that only possible in videos? …I don’t know, let’s just go for it like I’ve won the lottery!”"]},{"title":"I Regressed to My Ruined Family","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":[]},{"title":"I Became the Sultan’s Precious Cat","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Sultan’s Precious Cat / 술탄의 귀한 고양이가 되었습니다 / MENJADI PELIHARAAN SULTAN","After my sudden death, I was reincarnated in a strange world with a sultan and his harem, but not as a person, but as a kitten who can’t talk! I can only become human by kissing a prince who is worthy of the sultan… After mistaking me for an assassin and treating me coldly, Prince Soliman says, “……It’s soft, it’s warm, can we stay here for a while?” as he approached me. Prince Theron, who I thought was a sweetheart, seduces me by whispering, “Choose me over my brother, and I will give you everything you want.” “I will give you everything you want,” he whispered, seducing me. I can’t stay human unless I kiss one of them. “Nyaaong!” (Headache!) How do I survive in this royal palace?"]},{"title":"The Duke’s Villainous Daughter Is Depressed","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Duke’s Villainous Daughter Is Depressed / 사악한 공작 영애의 우울 / The Dukes Villainous Daughter is Depressed","Irene Song had transmigrated inside a novel and became the villainous daughter of a duke. However, the Duke, who was unaware of this fact, simply thought she had amnesia and send her off to marry the second prince of Rennes Empire.\nLittle did she know that the second prince was cursed by an evil wizard and turned him into a dog during the day and could only turn back to a human at night.\nWhat’s worse, she even named it “tofu” after she found it wandering in the Imperial Palace.\nWho would have known it was her own husband!"]},{"title":"Empress of the Ashes","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Empress of the Ashes / The Empress of Ashes"]}]