[{"title":"Legendary Youngest Son of the Marquis House","tags":["Action","Fantasy","Shounen"],"disc":["Jack Be Invincible [Official] / Legendary Youngest Son of the Marquis House / The Margravial Household’s Phenomenal Youngest Son / The Marquess’s Youngest Son / The Youngest Son of a Marquis / 侯爵家の歴代最強の末息子 / 후작가의 역대급 막내아들","I came here with only the goal of revenge.\nI overthrew the Tulkan Empire, a single nation that dominated the continent.\nI had always succeeded in gaining victory. I had accomplished all I needed to and was satisfied.\nThat’s why I accepted my approaching death. I no longer had a reason to live.\nAnd so my heart stopped beating.\nI definitely felt it stop.\nHowever, what in the world happened?\n“It’s not black magic and it doesn’t seem like an illusion either.”\nA boy with short, black hair was reflected in the mirror.\nI looked exactly like when I was 14, which was 20 years ago. A young boy, who hasn’t lost his baby fat yet, patted his cheeks and murmured, “How is this possible?”.\nI had returned.\nTo the time filled with my regrets."]},{"title":"Immortal Maestro","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Time travel"],"disc":["Read manhwa Immortal Maestro / 불멸의 마에스트로 / Maestro Abadi","Choi Kang-in, the world’s number one ranked player in the AOS game League of Infinity, is known as the ‘Demon of the Battlefield’. However, after experiencing a slump due to a car accident and being abandoned by everyone, Choi kang-in is approached by a man in a golden mask who makes a proposal. “If you can go back in time, can you become the winner of the world championship?” Returning to the past, Choi Kang-in becomes the strongest maestro commanding the battlefield, showcasing unprecedented plays as he navigates between Earth and otherworldly planets, showcasing unprecedented gameplay."]},{"title":"The Strongest Sect of All Times","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua 我的宗门亿点强, Wo De Zang Men Yi Dian Qiang, My Sect is 100 Million Points Stronger, The Strongest Sect of All Times","Wang Feng finds himself transmigrated to the Xian Lan Continent. With the help of a powerful system, he summons mighty individuals to crush all opposition, leading his Immortal Sect to unparalleled glory."," "]},{"title":"The Problematic Prince","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Problematic Prince / 问题性王子 / 문제적 왕자님","Is the Royal poisonous mushroom all right?","The prodigal son of the Royal family, once a beloved Prince of Kingdom Lechen,\nhad to put down the crown in exchange for being the principle figure of an unparalleled scandal.\nThe Royal mushroom,","Björn Denyster.","As a property to the Hardy family,\nshe was scammed and destroyed,\nand thrown to be sold into the marriage market. She was","Erna Hardy.","–","Today, when she was going to be sold as a wife\nto either a drunkard or an irredeemable garbage,","the problematic prince, Björn Denyster\nappears to be the savior.","You’re just a token, Miss Erna.\nDon’t try to consume the poisonous mushroom.","Or you’ll die."]},{"title":"I’m Really Not The Demon God’s Lackey","tags":["Action","Adventure","Fantasy","Manhua","Supernatural"],"disc":["Read manhua 我真不是邪神走狗 , I’m Really Not the Evil God’s Lackey manhua ,I’m Really Not The Demon God’s Lackey\nLin Jie is an otherworlder who manages a bookstore. He’s kind and always recommends soul-healing books for his dejected customers. Sometimes he’d even share his own works too. As time goes on, these customers start to respect him a lot. They bring simple local products every day to show their gratitude and ask for book recommendations. They even start telling tales of this ordinary shopkeeper. His respectful and cordial titles include “Hyena of the Evil God”, “Herald of the Flesh Gospel”, “Author of Cultes des Goules” and “Shepherd of the Stars”???"]},{"title":"Cryptid","tags":["Action","Adventure","Fantasy"],"disc":["Read Cryptid / 크립티드","Robin, an ordinary high school student in South Korea. On his usual way home from school, an air raid siren blares across the city, and an unidentified ‘thing’ completely shatters Robin’s normal life. Robin gets caught up in a battle between the long-forgotten ‘Cryptids’ and the ‘Nameless Corps’ who protect humanity… Wait, this is scary!!!"," "]},{"title":"Rookie but One-in-a-Million Actor","tags":["Adaptation","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Rookie but One-in-a-Million Actor / Even Though He’s a Rookie, He’s an Actor With 10+ Million Views / A Rookie, Also an Actor With 10+ Million Viewers / 신인인데 천만배우","Mooyoung spent his childhood under his stepfather’s oppressive rule, a life that felt like living in hell. A mysterious voice in the living hell showed him the way to survive. “Live someone else’s life instead of yours.” That’s how his acting journey began… Was it a survival instinct? Even when he did well, he excelled too much. Through acting, Mooyoung gained a new life. This is the story of Mooyoung, the overwhelming acting genius, embarking on a challenge in the entertainment industry!"]},{"title":"My Younger Sister Was a Genius","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Slice of Life"],"disc":["Read manhwa My Younger Sister Was a Genius / 동생이 천재였다","Yoon Hajoon, who struggled to pursue his musical career despite his iffy talents and ended up sacrificing his own family along the way, ” If only I could turn back time…! ” One day, after living with regrets and alcohol for a while, he woke up and found himself had returned to the past. Just then, it dawned on him. The fact that my younger sister is a musical genius…! Now is the time to turn my life around, that is by producing my younger sister into becoming the best singer!"]},{"title":"Madam and Her Daily Online Face-Slapping","tags":["Drama","Romance"],"disc":["Read Madam and Her Daily Online Face-Slapping / Fūrén Měitiān Dū Zàixiàn Dǎ Liǎn / 夫人每天都在线打脸","When Gu family, the ruler of the Extreme Continent, is assassinated and the family is torn apart, the young head of the family, Gu Mang, takes her brother, Gu Juan, to temporarily put on an ordinary human form and recover her power, smack the villain, take revenge for the family and gain glory, and pick up the top handsome president, Lu Chengzhou, as her husband on the way."," "]},{"title":"Dungeon Odyssey","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Dungeon Odyssey / Records of Dungeon Travel / 던전 견문록 manhwa,","The descendants of mankind, born in the labyrinth and raised on the milk of monsters, possessed special strength and strong bodies. When they returned to earth, mankind referred to them as dungeon babies. Among them, Kim Jinwoo was born in the deepest labyrinth.\n“I never tried to become strong, I just wanted to live.”\nFrom the lowliest excavator to the king of the labyrinth, his life story is now unfolding."]},{"title":"It Was Love at First Sight, Mr. Villain!","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa It Was Love at First Sight, Mr. Villain! / 흑막님, 저도 살아야 해서요!","Duke Adler, referred to as the greatest man of the Asgard Empire, is as handsome as a sculpture. However, he is also a serial killer, playing the role of the villain in a novel. On top of that, Princess Charlotte, who was politically married to him, was fated to be murdered on their first night together. The predicament is that I am the princess fated to die at his hands on that night. “It’s a political marriage, and it’s not as if we want to see each other anyway, so let’s just meet on our wedding day.” It was evident that the villain was displeased with the idea of marrying me. Hence, I made a decision. “It was love at first sight. So, please go out with me!” With only six months left until the wedding, I resolved to carry out an undercover investigation by pretending to date him. People wouldn’t believe my words, so I had no choice but to gather evidence myself. Even though she had planned to reveal the fact that he was a serial killer by hovering around him… *** “You said you fell in love with me at first sight, so what were you doing here with another man?” A cold voice flowed into my ears. “W-What do you mean? I was just dancing to ensure there were no disruptions at the banquet…” The nape of my neck heated up from the hot breath brushing against the outer edges of my ear. The contrast between his warm touches and the cool tone of his voice intoxicated me even more. “You called his name so affectionately, as he held you tightly in his arms.” “Gasp.” Unable to escape the strong scent that clouded my senses, I held my breath. My whole body tingled from the strange sensation spreading from my neck to the rest of my body. He tilted his head and said… “If there’s someone else’s scent coming from you… I’ll have an urge to kill.”"]},{"title":"Bakha","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Bakha / Park Ha Mansion / 박하","“Looking pretty. Want a smoke? Or maybe suck on this instead?” At the start of the summer monsoon, I met him at . Yoon Seoh, who had just finished serving 5 years and 10 months, from a total of 6 years, after a failed attempt at murder, ends up staying at with the help of Minyoung, a friend from prison. One day, a man suddenly shows up at her door. It was the neighbor Minyoung had warned her about. “There’s a guy who does nothing but seduce women and sleep around. Be careful.” The man, who shamelessly displays his desires, becomes Seoh’s only escape and the one person who helps her forget her nightmarish past. “Should we keep hooking up?” “Why?” “You said you only feel alive when you feel someone else’s warmth.” “…” “I’m just trying to keep my pretty girl alive. What do you think?” “Do whatever you want.” Seoh’s damp and lifeless existence slowly begins to be filled by him… But something about this man seems suspicious."]},{"title":"The Evil Ring","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read The Evil Ring / 恶之环"]},{"title":"Records of the Swordsman Scholar","tags":["Action","Adventure","Drama","Fantasy","Historical","Manhwa","Martial Arts","Romance"],"disc":["Read manhwa Records of the Swordsman Scholar / Legends of the Swordsman Scholar / 학사검전 / 學士劍傳","[From the studio of Omniscient Reader’s Viewpoint and The World After the Fall] Scholar Woon Hyun enters the palace after passing the Imperial Examination. Though he soon comes to lament his poor and miserable life of having to deal with the Crown Prince’s hobbies, Despite that, he doesn’t give up and tries his best to learn martial arts. But Woon Hyun suddenly picks up his brush to conquer the Murim?! The hidden story of the scholar who passed the Imperial Examination at a young age begins."]},{"title":"Magical Realm Shopkeeper","tags":["Comedy","Fantasy"],"disc":["Read manhwa Magical Realm Shopkeeper / Convenience Store Worker From Another World / Isekai Convenience Store Worker / 이세계 편돌이","The protagonist Chan, who was looking for a part-time job after his previous company went bankrupt, coincidentally discovers a convenience store. Lured by the very high hourly wage, he decides to become a part-timer from that day. But the customers who come in seem a bit strange. Vampires, kobolds, and even succubi??"]},{"title":"The Hero Went Crazy Even Though I’m the One Who Died","tags":["Comedy","Drama","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Hero Went Crazy Even Though I’m the One Who Died / I’m Dead, But The Hero Went Crazy / I’m the One Who Died, but the Hero Went Crazy / 죽은 건 난데 용사님이 미쳐 버렸다","As the hero’s comrade, I died after blocking him from the evil dragon’s breath. Well, it’s fine. The Hero Elkinas was the only friend I trusted to have my back. I’ll go out with a bang, I guess, so the hero can marry a pretty woman and live the rest of his life.","…Is what I thought would happen, but after 80 years passed, I came back to life in a completely different body. And… “It’s regrettable, Arlene. Elkinas went insane. Completely insane.” That was the first thing I heard.","What else could I do? I need to help my close friend who seems to have not been able to accept my death, so I decided to stay by his side while hiding my identity. This way he could completely accept the past and become happy, which is why I died for him. But… I think he recognized me. “You… You’re Arlene, aren’t you?”\nI touched my face. I definitely don’t look like Arlene. Shouldn’t there be no way he could know who I was?\n“I won’t ever let you go… Ever,” Elkinas said with shining eyes."]},{"title":"I Shall Conquer the Unruly Beasts","tags":["Drama","Fantasy","Historical","Romance"],"disc":["Read manga I Shall Conquer the Unruly Beasts","When Sione was married off to the Emperor of Belfator, 16 years her senior, she didn’t think things could get any worse. But then, the unthinkable… His Majesty was murdered! Could one of his loyal beasts have done this? Can she tame the three cursed men before her? However, before long, they each make a proposal: Marry me. Now left to protect a young stepdaughter, Sione must choose. Will she marry the Dog, the Snake, or the Eagle?"]},{"title":"As a Reincarnated Villainess and a Single Mother, I’ve Secured the Love Route!","tags":["Drama","Fantasy","Manhwa","Reincarnation","Romance","Royal family","Villainess"],"disc":["Read manhwa As a Reincarnated Villainess and a Single Mother, I’ve Secured the Love Route! / シングルマザーの転生悪女ですが、溺愛ルートつかみました！","If only I could live the way I wanted… With that wish in mind, I reincarnated as the villainess Sophia from the novel Serenade of Condemnation. Luckily, I arrived before her fall into darkness, and her adorable son, Adam, is still only 3 years old. If I don’t do anything, the future where both mother and son are condemned by the hero awaits us…! To avoid the bad ending, Sophia decides to leave her awful husband, flee from her married life, and raise her son as a single mother. ‘My family is super rich, so returning home will make me much happier!’ she thought. However, when she gets home, a stranger has already taken up residence—!? In her past life, Sophia bottled up everything she wanted to say, but now, surrounded by a bright family, her mysterious son Adam, and the prickly duke knight Leo, she enjoys a fresh start in life. This exhilarating and love-filled romantic fantasy follows her new journey."]},{"title":"Outside Relationship","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Outside Relationship / 사외 연애","After experiencing the bitter taste of love during her university days, Yeon Haru had stayed far away from romance. But now, two perfect men—Oh Seungwon, the top star at her company, who is flawless in appearance, education, and work skills, and Seo Jungwoo, the CEO of a neighboring company, SJW Tech, who also possesses looks, abilities, and wealth—are pursuing her. “How can two perfect men get involved with someone like me, who’s been distant from romance all my life?!” Thus begins the fierce flirting competition between Seo Jungwoo and Oh Seungwon, each determined to win Yeon Haru’s heart."]},{"title":"My Body Has Been Possessed By Someone","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Body Has Been Possessed By Someone / Someone possessed my body for 10 years / 누군가 내 몸에 빙의했다"]}]