[{"title":"Hello! Veterinarian!","tags":["Drama","Manhwa","Shounen","Supernatural"],"disc":["Read manhwa Hello! Veterinarian! / 수의사님! 안녕하세요?"]},{"title":"Trapped in a Cursed Game, but now with NPCs","tags":["Drama","Fantasy","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Trapped in a Cursed Game, but now with NPCs / Trapped in A Cursed Game As an NPC /망겜 속에 갇혔다 근데 이제 NPC를 곁들인"]},{"title":"My Wife Is Actually the Empress?","tags":["Action","Comedy","Fantasy","Isekai","Manhua","Romance"],"disc":["My Wife Is Actually The Emperor / My Wife Is Actually The Empress manhua","With my wife’s breathtaking beauty, not even the newly enthroned empress can match her! With my wife’s marvelous culinary skills, not even the empress’s royal chefs can match her! My wife loves me and cares about me very very much, and I wouldn’t trade her for even the empress! Wait, what? My wife is the empress?!"," "]},{"title":"The King of Winter and the Kiss of Fire","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The King of Winter and the Kiss of Fire / 冬の王と炎のキスを","Eileen lived peacefully in a village dedicated to the Winter King. However, her tranquil life was suddenly shattered by Queen Elsia. After enduring unreasonable torture from Queen Elsia, Eileen prayed to the Winter King as she faced her final moments. Hearing her plea, the Winter King’s power caused her to reincarnate into modern society."]},{"title":"The Truth Behind the Sadistic Prince","tags":["Fantasy","Romance"],"disc":["Read manhwa The Truth Behind the Sadistic Prince","Natalia, a Count’s daughter, can’t bear the thought of marriage. The reason is that she can see people’s emotions as colors of their aura. Her maids, while smiling, seethe red with hatred, and her gentle teachers bristle with the color of anger. Unable to trust others, Natalia botches her debutante ball and becomes a recluse. Concerned for Natalia, her younger brother Julian drags her to a ball hosted by a member of the royal family. But the overpowering mix of colors and auras makes Natalia feel sick. Suddenly, an aura flaring with red anger and black hatred appears! She’s never seen an aura so dense that it completely obscures the person emitting it. Natalia freezes, trembling as the figure approaches her. But as he draws nearer, she recognizes him as His Highness, Prince Ludwig…?!"]},{"title":"A Torn Heart between Cold King, Cruel King","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Torn Heart between Cold King, Cruel King","Unable to put a stop to her husband Cornelius’s tyrannical rule as king and his further despotism, Queen Amelia of Selerion is falsely accused of his crimes and executed. The next time Amelia opens her eyes, she finds that she is once again nineteen years old, and her engagement to Prince Cornelius has not yet been announced to the public. Determined to use this opportunity to prevent the tragic fate awaiting her, she reaches out to King Luke of the neighboring kingdom of Folteria. She finds, however, that King Luke’s cold-hearted reputation precedes him…"]},{"title":"The Two-Faced Prince in Training","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Two-Faced Prince in Training","As if it weren’t enough to be born as the bastard child of a noble, Valenti meets her final demise by starving to death after being sold as a slave by her very own father in her bankrupt country. But when she wakes up again, time has been rewound to right before she was sold as a slave. From then on, Valenti vows to become the lady in waiting to the so-called monster prince, to escape her horrendous past life’s fate, and to hold up the prince as the nation’s true emperor for her beloved country. After graduating summa cum laude as a lady in training, she chooses not to accept the prized fate of becoming an attendant to the empress, but to the one individual nobody would want to support. But her plans become mixed up when her position as lady in waiting is challenged by… love?!"]},{"title":"Talent-Swallowing Magician","tags":["Action","Drama","Fantasy","Webtoons"],"disc":["Read manhwa Talent-Swallowing Magician, 재능 삼키는 마술사, jaeneung samkineun masulsa, The Mage Who Absorbs Abilities, 능력을 흡수하는 마법사, neunglyeog-eul heubsuhaneun mabeobsa","Elric Melvinger.\nThe sole heir of the prestigious magic family.\nThough he possessed innate talent, he had too much talent, and as such, could not learn magic. However, he then received a blessing left by his ancestors!\n[Eat demons.]\n[Swallow demons.]\n[Drink demons.]","[Continue to keep accumulating demons within yourself, and achieve new magic!]","Reach high.\nReach a height so high that no one will ever reach me.\nThe Mage Who Absorbs Abilities"]},{"title":"I Became the Hero’s Mom","tags":["Drama","Isekai","Romance"],"disc":["Read I Married the Male Lead’s Dad / I Became the Hero’s Mom / Namjuui eommaga doeeobeolyeossda / Я стала матерью главного героя / 남주의 엄마가 되어버렸다 ","I’ve been a fan of the male lead for 3 years. A fool for his son, I was caught by the Tyrant Duke of Hades, Louvermont. “Following me around and giving me a lot of expensive gifts. I don’t know whether you value your life or not, coming all the way to the North by yourself….” “I am sorry. I have nothing to say.” “Okay, I lose. I have a generous heart, so I will pretend I don’t know anything.” “….Really? I think that didn’t have that much sincerity.” “It’s been quite a while since I had a woman following me around. I’ve never seen anyone as persistent as Milady. It’s amazing. Let’s do it, marriage. As soon as possible.” “Sigh….” “….” “Yes, you will accept it.” “….” “I mean, what?! What did you just say?” What does this mean? I must have heard it wrong, right? However, the Duke only looked at my blank face then smirked, and properly confirmed it by threatening to kill me. “I’ll do it. I’ll marry you.” Oh my God. The male-lead’s father’s excessive self-consciousness is quite high."]},{"title":"Fake Wife","tags":["Adaptation","Drama","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Fake Wife / 가짜 아내"]},{"title":"The Lone SSS-Class Summoner","tags":["Action","Drama","Fantasy"],"disc":["Read The Lone SSS-Class Summoner, Only I Can Use Summoning, SSS-Rank Lone Summoner, 只有我能用召唤术","Zhang Ze crosses over to a parallel world where people rely on the Magic Domain to fight monsters and become stronger to resist the invasion of demons from the Devil’s Cave. For the sake of his sister, Zhang Ze enters the magic realm under the name of Asura, and then he unexpectedly awakens the strongest SSS-level talent summoning ability! The higher the level of the summoning art, the more monsters you can summon, and the more you can upgrade, it’s simply heaven-defying!"]},{"title":"The Supporting Duck Waiting for the Breakup","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Supporting Duck Waiting for the Breakup / 조연 오리는 파혼만을 기다립니다 / The Supporting Character Ori Waits For The Breakup of The Engagement / A Supporting Duck Waits for a Broken Heart / Supporting Duck Wait For a Breakup / This Duck Wants to Fly Solo"]},{"title":"Survival Methods of the Cannon Fodder Daughter","tags":["Comedy","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhwa Survival Methods of the Cannon Fodder Daughter / Cannon Fodder Girl’s Way To Survive / Surviving as a Tyrant’s Daughter / Paohui Guinv De Shengcun Fangshi / Pàohuī Guīnǚ De Shēngcún Fāngshì / Survival Mode of The Cannon Fodder Maiden / 炮灰闺女的生存方式","Ye Qiqi transmigrated and became the five years old disliked daughter of the tyrannical emperor. To survive, she did everything she could to stay away from him. Yet, fate pushed her to the tyrannical emperor time after time. She even became his treasure accidentally? But the palace fights and the battle over the position as successor had just begun…"," "]},{"title":"The Imperial Woman Can’t Take It Anymore!","tags":["Drama","Fantasy","Historical","Manhua","Mystery","Romance","Time travel","Webtoons"],"disc":["Read manga The Imperial Woman Can’t Take It Anymore! / 皇女人设绷不住啦！","Due to accidents, modern forensic doctors have crossed into the seven-year-old unfavored four emperors in the world of Western women. Not only is she weak and sick, but she also loses her mind. How can she get out of trouble? With cute appearance, reap the love of male match after crop, and grow into a group pet?"]},{"title":"A Blessed Villainess, or a Cursed Heroine?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Blessed Villainess, or a Cursed Heroine?","Lady Sophia was supposed to marry her beloved prince, Alfred, and live the rest of her life blessed with happiness. However, when the villainess of the story, Rosalie, places a terrible curse on her, their souls exchange bodies! Her once-happy life descends into absolute despair when Sophia–now Rosalie–is accused of a crime she didn’t commit and is exiled from the palace. “This isn’t me! I want to go back to my old body!” As she wanders away from the capital, she meets a merchant named Raul. With his help, Sophia sets off to change her fate and return to her rightful body!"]},{"title":"My Unwanted Engagement with the Final Boss Prince","tags":["Fantasy","Romance"],"disc":["Read manga My Unwanted Engagement with the Final Boss Prince","Orianna, a regular office worker, dies in an accident due to exhaustion and is reincarnated as a villainess pursued by the antagonist in a romance novel. To evade the tragic fate the malevolent prince has planned for her, she resolves to change her ways and establish herself as a distinguished lady in high society. However, despite her transformation, Orianna is betrayed by her fiancé, Reuben, framed for conspiracy, and condemned. Her unexpected savior from this dire situation turns out to be none other than her nemesis, Prince Dylan. Even though their alliance in the novel originally led to the worst possible outcome, he is now her only hope. Despite being wary of Dylan’s persistent overtures, circumstances force her into a pretend marriage with him."]},{"title":"[Immoral Anthology] Repentance of the Immoral Paladin","tags":["Drama","Manhwa","Mature","Romance"],"disc":["Read [Immoral Anthology] Repentance of the Immoral Paladin","Saintess Violet comes to the prison to save the Holy Knight ‘Lahart’ who has been eroded by demonic energy. Violet decides to save Lahart using the only healing method found in the old book. Lahart regains his senses with her help, but neither of them can easily extinguish their desire for each other…"]},{"title":"The Not-so-mad Princess","tags":["Fantasy","Romance","Shoujo","Supernatural"],"disc":["Read The Not-so-mad Princess","A skilled medical examiner finds herself in a royal twist of fate, waking up as Yancy Lisbeth, the overlooked fourth princess of Edelweiss Kingdom. In the shadow of her sinister sister Christie’s relentless attempts on her life, Yancy must use her sharp intellect from her previous life to turn the tables. As she gains the queen’s attention with her seemingly “newfound” resourcefulness, the palace becomes a chessboard where Yancy’s clever moves could secure her safety or lead to a checkmate by Christie’s hand. Will her wits let her stay in the queen’s good graces and out of harm’s way?"]},{"title":"My Daughter is the Final Boss","tags":["Action","Adventure","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My Daughter is the Final Boss / 내 딸은 최종 보스","My daughter destroyed the world.\nAt the the end of the crossroad, I ended up dying helplessly. However, when I woke up, I saw my five-year-old daughter in front of me.\nPrevent Seol-Ah’s Five Misfortunes. (0/5)\nI was given another chance. If I fail in raising her well, the world will be destroyed."]},{"title":"Gorgeous Robe","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Gorgeous Robe"]}]