[{"title":"Catching Up With Luke Bischel","tags":["Comedy","Drama","Fantasy","Manhwa","Royal family","Villainess"],"disc":["Read manhwa Catching Up With Luke Bischel / 루크 비셸 따라잡기\nCatching Up With Luke Bischel: The most well-known lout of the duke’s family ‘bastian effenberg’ declares that he’ll get married to his complete opposite, the kingdom’s greatest monster hunter, ‘luke bicelle’! Everyone opposes their marriage… will everything go by smoothly?"]},{"title":"Foreigner on the Periphery (Remake)","tags":["Action","Adventure","Drama","Fantasy","Manhwa","Shounen","Si-fi","Supernatural"],"disc":["Read manhwa Foreigner on the Periphery (Remake) / Foreigner on the Periphery / Foreigner on the Periphery 2023 / 변방의 외노자"]},{"title":"Puppet Queen Redo","tags":["Fantasy","Romance"],"disc":["Read Puppet Queen Redo / 这傀儡女皇我不当了！","The queen puppet lived a lewd life, and before she died, she discovered that she had been a pawn for the rest of her life. When I was reborn as a little princess, I wanted to be a good queen in my life!"]},{"title":"The Bad Ending of an Otome","tags":["Drama","Fantasy","Manhwa","Romance","Webtoon","Webtoons"],"disc":["Read manhwa The Bad Ending of an Otome / The Otome Game’s Bad Ending / 그 오토메 게임의 배드엔딩","I was reincarnated into the otome game I had played in my previous life.","Ophelia, a beautiful female protagonist like a goddess, is loved by numerous nobles while Emilia, the character I reincarnated as, has a supporting role of a villain and she follows around the male leads after Ophelia’s death, only to be destroyed by them.","A few years after Ophelia dies due to an incurable disease, the player (default name Elodi) who resembles Ophelia appears.","The male love targets, who were heartbroken from the loss of Ophelia, becomes obsessed with Elodi.","I, who reincarnated into the story and became Emilia, decided to abandon that kind of plot. So, I decided to quietly leave the place I had lived at for 10 years on the day of Ophelia’s funeral.","Nobody expected her to leave, and they were shocked. They kept looking for her, who had disappeared without a single word, but couldn’t find her.","Two years later, an accidental encounter leads them to find her."]},{"title":"Individualistic Love","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Individualistic Love / Individualistic Love Affair / Individualistic Romance / The Egoistic Courtship / 개인주의적 연애","As the last of the divine beasts who protected the land, Lionel Milliard was coveted by women for his power and influence. But after an accident with an ancient relic binds him to an inn worker named Hanna, he finally finds one woman with no interest in him! Lionel, intrigued by Hanna’s rejection, convinces her to go on a journey with him to free them of the relic’s power. Hanna reluctantly agrees, but will she be able to fend off Lionel’s advances, or will this beast devour yet another woman?"]},{"title":"At the End of the Hidden Greenery","tags":["Manhwa","Romance"],"disc":["Read manhwa online At The End Of The Hidden Greenery, At the End of the Hidden Spring, 숨은 신록 끝에서 at manhwa website","She dedicated five years of her life serving as the Akarna of the temple while she was the crown prince’s lover.","“Do you not understand? If you cannot give birth to an heir, then you can’t become the empress. It’s just… It’s just a political marriage. But you must understand that I love only you.”","And yet, it’s as if he gave her something that’s perhaps nothing more than alms—the position of a concubine.","‘Are you telling me that you’re going to marry another woman and make me a concubine? And you’re expecting me to just accept that?’","When the carriage she was riding in rushed towards a cliff, she impulsively let herself fall. And when she opened her eyes again, she found herself at that place.","The forest where the empire’s most despised species lived."]},{"title":"Bastian","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Bastian / 바스티안"]},{"title":"Joseon Night Novel","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Joseon Night Novel / 조선야설"]},{"title":"Through the Strong Winds","tags":["Drama","Fantasy","Historical","Manhua","Romance"],"disc":["Read manhua Through the Strong Winds / 长风渡"]},{"title":"The Lover Of Despot","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua The Lover Of Despot / Baojun Airen / Bàojūn Àirén / The Lover Of Despot / Tyrant Lover / 暴君爱人","Content: Xia Shengge has lived and worked in her sister’s shadow, so she takes blame for her sister. Then she was dismembered by Qi Ming. Only after she had died did she know that she was being taken advantage of during her childhood till now. She was unwilling to die. God doesn’t betray sincerity. She revivaled in the time 5 years ago. Her life repeats. She can forcefully change her life to a new page."]},{"title":"My Exotic Beast Is Just a Little Bit Strong","tags":["Action"],"disc":["Read My Exotic Beast Is Just a Little Bit Strong","Si Yang, a young man who lives with his sister,, was attacked by a monstrous creature while delivering food. Miraculously resurrected, he awakens to a hidden power and unexpectedly tames the fearsome beast, Qiongqi, rising to fame as the city’s newest and most sought-after monster master. Beneath the city’s tranquil facade, dark forces are at play, threatening the fragile harmony between humans and monsters. Si Yang’s extraordinary power and his sister’s divine beauty become the keys to unraveling a sinister plot."]},{"title":"Lover Of Green Midnight","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Lover Of Green Midnight","A mansion of a Viscount in the 19th century, and Edgar and June, two servants and lovers who live there. One day, while they thought they would spend their lives together in love, everything starts to go wrong with the sudden appearance of Cameron, the Viscount’s illegitimate son…"]},{"title":"My Younger Sister Chooses Me Tonight","tags":["Comedy","Drama","Fantasy","Manhwa"],"disc":["Read manhwa My Younger Sister Chooses Me Tonight / 여동생은 오늘 밤 나를 간택한다","Arin, the adopted daughter of a chaebol family, harbours a twisted affection for her stepmother. After she becomes an adult, Arin accidentally realises that she has unusual abilities. She tries to use her abilities to attract her stepmother’s attention, but her stepbrothers, not her stepmother, want Arin… A dangerous adopted daughter who shakes up the conglomerate ‘Rare Moon’ family. Her twisted red romance!"]},{"title":"I Hated It Even More","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Hated It Even More / No More of This / The Last Straw / 全てを奪われても大公子様だけは譲れません / 我不喜欢了 / 更加讨厌 / 더는 싫었다","My seventeenth summer, three months before I went into isolation. The first daughter of Marquis Renarty, the girl who was called my “sister” had returned. Everyone in the mansion loved only her, but I didn’t care. However… Sometimes, the self-proclaimed lesser spirit I occasionally meet tells unexpected stories, and the woman called my “sister” tries to protect me, while the Duke I contracted with in a mutual agreement claims to be at a loss. And it seems that my affectionate childhood friend and I no longer have a simple friendship."]},{"title":"Dark and Light Martial Emperor","tags":["Action","Fantasy","Historical","Manhwa"],"disc":["Read manhwa Dark and Light Martial Emperor / 흑백무제"]},{"title":"My Little Brother Is The Academy’s Hotshot","tags":["Action","Adventure","Fantasy"],"disc":["Read My Little Brother Is The Academy’s Hotshot /  Synopsis The Little Brother Is The Academy’s Hotshot / The Hero’s Younger Brother Is a Deceased Person in the Academy / 용사 동생은 아카데미 고인물","In the last battle with the king of the dragon race that killed countless humans, Rudd Denatos loses his comrades and biological elder brother, Aesir Denatos.\nThe moment he slays an unidentified dragon that appears before him, he returns to his days as an academy cadet.\nHowever, his brother, Aesir, a genius warrior doesn’t exist in the past world Rudd has regressed into.\nTrying to fill in the empty spot of Aesir, Rudd tries to prepare as much as possible before the strongest dragon king, the Seventh Dragon, appears.","Will Rudd be able to find his older brother and avenge his parents?"]},{"title":"Demon King’s Doll Butler","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Supernatural","Webtoons"],"disc":["Read manhwa Demon King’s Doll Butler / 魔王的玩偶管家 / 마왕님의 인형 집사 / 마왕님의 인형집사","After experiencing death as the first human sacrifice in history, I vowed to never reincarnate and roamed the spirit realm for centuries.","But when I opened my eyes, I suddenly found myself in a physical body!","The damned mages summoned my spirit against my will and sealed me inside a doll!","As I took down the mages and reminisced about my days in the spirit realm, the passing Demon Lord made an unexpected proposal.","The Demon Lord will grant me permission to enter the afterlife if I become the butler for his son until he comes of age…?","I will be in your service, Demon Lord!","But when I first met the Demon Lord’s son, he was beyond feisty and fought me tooth and nail simply for touching his hair.","While the savage instinct to destroy was short-lived, the young master began to follow me around.","Just when I thought I was set on the death route I longed for, my young master’s powers awakened, and he began to become obsessed with me. “Perry, I don’t want you to touch other men. You’re supposed to be my butler.”","Hold on, what the hell does that mean?! A doll butler’s peculiar! Catastrophic! Problematic parenting in the guise of romance!","Will Perry get to return to the spirit realm as planned?"]},{"title":"One Step Forward to the Flower Path","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Web Comic","Webtoons"],"disc":["Read manhwa One Step Forward to the Flower Path / Take A Step Forward To A Flowery Path / Jangan baca nanti nangis / 꽃길까지 앞으로 한 걸음","I lived my whole life being used by other people and died at the age of 16.\nI thought it would be over like that, but when I opened my eyes again, I was back in the past.\nI thought I’d die while living the rest of my life in pain one more time.\nBut suddenly, a father who I had never seen before appeared before me. My dad, who I didn’t even know existed.","“When are you going to take away my powers?”","Dante’s eyes shook greatly at Ivanna’s words.","“Everyone did. You, when will you take it?”\n“…I won’t.”\n“Why?”","Ivanna couldn’t understand. Everyone coveted her power. Everyone wanted it, saying she was a sacrifice sent by God for humans.","So why does he refuse?","“No one will take your power now. No one will bother you. I’ll protect you.”\n“You’re trying to take my power.”\n“I’m not.”\n“Everyone said that and stole my power from me. They locked me up in prison.”\nIt was too cruel for a mere five-year-old to say. But the young Ivanna’s face had no emotion as if what she said was natural.\nDante’s heart eventually collapsed when he saw his daughter completely shattered."]},{"title":"Deadly Nightshade (r18+)","tags":["Drama","Fantasy","Historical","Mature","Romance"],"disc":["Read manhwa Deadly Nightshade","Once a queen, now an assassin. Burned and cursed, she rose from the ashes of her fallen kingdom to exact revenge on those who betrayed her. No one was spared, not even the former allies who had turned their backs on her in her time of need. But her quest for vengeance isn’t over yet. With just one target left—the powerful Lord of the Winter Court—she faces her most dangerous adversary yet. He is handsome, charismatic, and cunning, and she finds herself drawn to him despite her burning hatred. Will she be able to resist his seductive charms and complete her mission, or will her blackened heart be conquered by the very man she seeks to destroy?"]},{"title":"Global Profession: All My Skills Are Forbidden spells","tags":["Action","Adventure","Fantasy"],"disc":["Read Global Profession: All My Skills Are Forbidden spells / Job Transfer For All: My Skills Are All Forbidden Spellsm / 全民转职：我的技能全是禁咒","Crossing to the other world with his soul, Lin Han arrived in an era where games and reality merged. There are countless dungeons, forbidden lands, and hidden realms where mighty monsters reign supreme!","On the day of his class profession, Lin Han missed the opportunity to become a warrior, the class of his dreams! Unexpectedly, he awakened the unique hidden profession – Life Sacrificer – at a critical moment!","[Ding! Ten Thousandfold Amplification System Awakening!]","Lin Han’s attributes increased by ten thousand times, and his basic skills all reached forbidden curses!","In the name of a close-combat healer, during the moment of unlimited forbidden curse devastation!"]}]