[{"title":"I’m The Only One With Genius DNA","tags":["Adventure","Manhwa","Medical","Si-fi"],"disc":["I’m The Only One With Genius DNA, 나혼자 천재 DNA:\nA status window appeared in front of Ryu Young-jun, a researcher at a pharmaceutical company.\nRosalin’s status window, an artificial cell that knows everything about biology."]},{"title":"Pharaoh’s First Favorite Queen","tags":["Fantasy","Romance","Shoujo"],"disc":["Read Pharaoh’s First Favorite Queen / Captive of Love","In order to study the history of ancient Egypt, Mi Hiyao, the future beast trainer, returned to 3100 BC, and it replaced the identity of the future wife of Pharaoh. Butterfly effect, a little change, everything in the future may no longer exist, how should Mi Xiyao choose? There is also Pharaoh, who knows she is a fake, why is he so spoiled?"]},{"title":"I Am Carrying Gold From The Post-Apocalyptic World","tags":["Adventure","Comedy","Manhua","Zombies"],"disc":["Reading I Am Carrying Gold From The Post-Apocalyptic World at manhwaclan\nHigh risk comes with high reward, carrying gold by himself from the post-apocalyptic world, and become rich? No? Wang Bin has a smarter way to get even richer, find an ally to help him carry more gold from the post-apocalyptic world, after one trip he can become a billionaire! Even so, it is dangerous, the post-apocalyptic world is filled with zombies, and the survivors there can be scarier than the zombies because, for the sake of living, they can do anything, they are 100 times scarier than a zombie!"]},{"title":"Descendant of Tarot","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Descendant of Tarot / A Descendant of Taro / The Final Witch / Zuìhòu De Mónǚ / 最后的魔女"]},{"title":"Royal brother, away with the sword","tags":["Action","Adventure","Drama","Fantasy","Historical"],"disc":["Read manga Royal brother, away with the sword","Song Qing Chen died a regrettable death after being killed with a sword by Song Huai Chen. She wakes up in fiery after awaking to her younger self. The reborn Song Qing Chen only wants to avenge those who have looked down upon her, but she never knew that it was so hard to kill the youth Song Huai Chen…."]},{"title":"To Match a Villainess: Love Hunting Rhapsody","tags":["Romance","Shounen"],"disc":["In her past life, everyone knew her as the villainess of Nan City, but they didn’t know that she was just a reckless support-character. After she was set up, lost all her reputation, and died in the streets, she returned through reincarnation. In this lifetime, she decided to embrace the identity of the villainess that they believed her to be. She would not let the real villains get off scot-free!"]},{"title":"The Distance Between The Stars","tags":["Manhua","Romance","School Life"],"disc":["Read manhua The Distance Between The Stars","Private Yao Yang High School, although she is as dazzling as a legend, there is a very real problem the students here are very difficult to manage and no one wants to do the hard work of a guidance teacher. And this hard job was picked up by an unlucky girl, Miss Yan Xing Chen, and even more unlucky . she met Yan Xing Chen. A bad boy wolfie x a cool and beautiful school female teacher, love and hate each other, their school life has begun.Notes from mangabuddyAll our manhua content is protected under copyrighted law.manhwaclan never gives anyone authorization or permission to publish our content on another website/app. If you’re publishing our content on your website/app, it means that you’re infringing the copyright of our works. Therefore stop stealing n our work or else we will take legal action against you."]},{"title":"The Immortal Emperor Luo Wuji Has Returned","tags":["Action","Manhua","Martial Arts","Reincarnation"],"disc":["仙尊洛无极, The Immortal Emperor Luo Wuji Has Returned, Immortal Emperor Luo Wuji\nThe Reverent Saint died, just like that. He was betrayed by his disciple and brothers. Though his mortal body may be dead, his soul spirit lives on. With the [Emperor’s Scripture], a precious treasure, he aims to get revenge. Luo Wuji has returned to Earth ready to bring slaughter upon his foes and rebuild his godhood! In this life, the name “Wuji” shall surpass pass the moon sun, and even the whole universe!"]},{"title":"Help! I Had Transmigrated and My Snake Husband Pampered Me Too Much","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhua Help! I Had Transmigrated and My Snake Husband Pampered Me Too Much / 救命！穿越兽世蛇夫超宠我！"]},{"title":"Dark Moon: The Blood Altar","tags":["Action","Drama","Fantasy","Romance","School Life","Shoujo"],"disc":["Read manhwa Dark Moon: The Blood Altar / 黒の月: 月の祭壇","Welcome to Riverfield, where the most popular boys at two rival schools happen to be vampires and werewolves. When a mysterious new student, Sooha, transfers to Riverfield, the rivals find themselves inexplicably drawn to her. As horrible incidents start to shake the town, the boys’ forgotten pasts slowly start to unravel… and their world turns upside down."]},{"title":"The Cold-blooded Duke’s Attack Strategies","tags":["Fantasy","Harem","Romance","Shoujo"],"disc":["Read The Cold-blooded Duke’s Attack Strategies / Lengxue Gongjue Gonglve Jihua / Lěngxuè Gōngjué Gōnglüè Jìhuà / The Cold-blooded Duke’s Strategy Plan / 冷血公爵攻略计划\nI only made a wish on my 25th birthday. Why did it woke up to be the princess and wife of the blood tribe? This awesome man is saying he is my fiance?\nLengxue Gongjue Gonglve Jihua / Lěngxuè Gōngjué Gōnglüè Jìhuà / The Cold-blooded Duke’s Strategy Plan / 冷血公爵攻略计划\nMoreover, these handsome men in front of them all say that they are my fiancé, who should I choose? Ho La Boi I decided to have all, single dogs from the womb, through becoming the queen of the blood race, possessing a beautiful array of enchanting harem…"]},{"title":"This wild mouse has taken Cinderella","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa This wild mouse has taken Cinderella / 신데렐라는 이 멧밭쥐가 데려갑니다 / Cinderella is taken away by this wild mouse","Cinderella married a Prince. But I had no idea that the vow of eternal love would last only 10 years. This is because the prince fell in love with a young lady at first sight, took her as his mistress, and even proposed to her. ‘Damn you!’ Cinderella was drying up day by day and could do nothing for Cinderella. Because I, “Snap!” Because it was a rato! The field rat is the smallest of all rats and is at the bottom of the pecking order to be chased around. ‘Fairy grandmother’ I’m just a disgusting rat. Cinderella was a child who embraced me like that. What I wish for… … ‘I hope Cinderella can smile again.’ So she thought she was dead. She woke up again and found herself back in time. She goes back to Cinderella’s childhood when she was mistreated by her stepmother and her older sisters. She said, “I have come at the request of the Ratson family.” But I was actually not an ordinary rat, but a beast from the Wild Rat family? Her family is desperately looking for me? Then Cinderella, run away with me! Prince, before that thing comes looking for you with the glass slipper, I will take it away!"]},{"title":"Love with Intention","tags":["Drama","Fantasy","Manhua","Psychological","Romance"],"disc":["Read manhua Love with Intention / Premeditated Heartbeat / Xùyì Xīndòng / Xuyi Xindong / 致命热恋 / 蓄意心动","Experience the compelling tale of Antong, a girl battling emotional turmoil, and Rong Shen, a refined and enigmatic psychological therapist. Antong’s life takes a tumultuous turn as she grapples with family upheaval and the burden of emotional disorders, frequently falling victim to severe emotional detachment. Enter Rong Shen, a renowned heir from an opulent and mysterious family in Hong Kong. In a twist of fate, Antong mistakenly identifies Rong Shen as her therapist, setting the stage for several months of therapeutic sessions. As time unfolds, an unexpected bond forms, leading to an unusual agreement: they decide to get married. Don’t miss out on this exclusive and captivating story that delves into themes of mental health, romance, and intricate character dynamics. Join Antong on her journey to confront her emotional demons, and discover the role Rong Shen plays in her life."]},{"title":"Roelin Walks the Future","tags":["Crime","Demons","Drama","Fantasy","Historical","Horror","Isekai","Liexing","Manhwa","Philosophical","Ping Ping Jun","Psychological","Reincarnation","Romance","Shoujo","Shoujo Ai","Shounen Ai","Superhero"],"disc":["Read manhwa Roelin Walks the Future\nRoelin Deaz is the daughter of Count Deaz. Her family is in debt, because of the failure of her father’s business. She is working hard to support her family.\nOne day, while trying to feed her family, Roelin had an accident that nearly killed her.\nBut as this becomes an opportunity, she recalls her past as the high priest of the temple of darkness (Now gone). And she received the power of her past life, which is the power to foresee the future through dreams-!\nRoelin uses his past life experience and abilities to work hard to raise his family.\nThen one day, in a dream, she saw someone dead. That person was the protector of the empire, Duke Dante Van Benerite, who was known as the Brilliant Knight!?\nRoelin learns of his miserable future and becomes conflicted…! What will Roelin do?"]},{"title":"My oc is fine","tags":["Drama","Fantasy","Manhua","Romance","School Life"],"disc":["Read manhua My oc is fine / 我的oc成精了 / My oc is Real"]},{"title":"Best Of Luck, Warrior!","tags":["Comedy","Drama","Fantasy","Gender Bender","Isekai","Manhwa","Mystery","Reincarnation","Romance","Survival"],"disc":["Read manhwa Best Of Luck, Warrior! / Good Luck, Warrior! / Good Luck, Soldier! / 행운을 빌어요, 용사님! / Good Luck, Hero!","The Devil King whom I defeated in my past life is now my boss in the office?! Baek Young-woong (meaning hero in korean), an ordinary office worker reborn with the memories of his past life as a warrior who defeated the devil king! The memories were only useful when he used to write webnovels as a child. Young-woong regrets having useless memories of his past life and gets a job in the executive secretarial office of Daeryong ENT, a big company. However, after meeting the CEO, Do Yeon-hwa, for the first time, I feel the trauma from my past life experience…? It’s like, you’re facing a really strong and big devil…! Read the terribly intertwined romance of the devil king, the CEO and the warrior, the newest secretary!"]},{"title":"I’m Not the Villain’s White Moonlight!","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read manhwa I’m Not the Villain’s White Moonlight! / I’m Not the Villain’s White Moonlight! / What Caused This to Happen..?! / Wǒ Cái Bù Zuò Fǎn Pài De Bái Yuè Guāng! / 我才不做反派的白月光！","Belle opens her eyes to find herself a noble within a romance novel on a mission to seduce the main character – Duke Arges, known as “The Beast” – to change the course of the story, Adhering to the principle of “staying away from the main character” and hating the behavior of the nobles, Bell draws the attention of Duke Agnes, will Bell be able to carry out this task?"," "]},{"title":"Deliberate Scandal","tags":["Adaptation","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Deliberate Scandal / An Intentional Scandal / เจตนาท้ารัก / 意図的なスキャンダル / 고의적 스캔들","In an office full of complicated romances, Lee Jaehee’s work life has been hell. It doesn’t help when her good-looking best friend, the former pro gamer Shin Seonjae, starts working on her team and earns a lot of unwanted attention. As rumors about him abound, ghosts from Seonjae’s past come back to haunt him, and Jaehee is eager to help him. But there’s only so much she can do against stalkers and gossip! Besides, she already has her hands full dealing with her growing feelings for Seonjae."]},{"title":"Did you sleep with me?","tags":["Drama","Mystery","Romance"],"disc":["Read manhwa Did you sleep with me? / 너 나랑 잤니? / Memento Bori","An erotic mystery romance that takes place when three men who clearly remember that night approach a woman who can’t remember their one-night partner"," "]},{"title":"The Villainess is Worshipped","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villainess is Worshipped / The Villainess Is Worshipped by the Family / Angnyeoneun Paemilliui Sungbaereul Batgo / The Villainess Is Worshipped by the Mafia? / 악녀는 패밀리의 숭배를 받고\nBlanche, the female lead, is timid and nice. But she is despised by her family. She can’t overcome her family’s disdain and tries to commit suicide. When I opened my eyes, I was in the game world that I created! If I want to survive in this world, I need to bring Ricardo, the villain to my side. But Ricardo is being weird?!"]}]