[{"title":"My Girlfriend Is a Nine-Tailed Fox","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa My Girlfriend Is a Nine-Tailed Fox / My Girlfriend Is a Gumiho"]},{"title":"Revenge Against the Immoral","tags":["Drama","Josei","Psychological"],"disc":["Read Revenge Against the Immoral / Inmoraru ni Fukushū o / Revenge Against the Immoral / Take Revenge On Those Immorals / インモラルに復讐を /制裁背叛的鐵鎚","This suspense manga tells the story of a betrayed wife’s revenge, cracking down on her unfaithful husband and his homewrecking mistress!\nShiho Tachibana (31) got married five years ago. She and her husband swore eternal love to each other, but recently they have stopped having sex even though she wishes to have children. Every day, people around her torment her by asking when she’s going to have a baby, but her marriage has grown cold.\nAs she starts wondering what she means to her husband, she notices hints of a woman being around him! Could it be he’s cheating on her?!"," "]},{"title":"I’m Engaged to an Obsessive Male Lead","tags":["Adventure","Comedy","Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa I’m Engaged to an Obsessive Male Lead / 집착남주의 계약직 약혼자입니다 / Aku Bertunangan dengan Pemeran Utama Pria yang Obsesif","One day, Veillyn Orlando comes to the realization that she’s been living the last 21 years as a side character in a BL novel and is fated to die in one year! In light of this, Veillyn decides to escape her abusive family and live out the rest of her days in peace. However, her only way out is getting engaged to the male lead of the novel, Jellard Lieseltein. He seems like the perfect candidate for a contractual engagement because he’s into men, meaning there’s no risk of them actually falling in love with each other… But as the two spend more time together, Jellard seems to be falling for Veillyn. Will Veillyn be able to navigate her growing feelings for Jellard while keeping her inevitable death a secret?"]},{"title":"Death to the white ferret weasel","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa Death To The White Ferret Weasel /  Death to Lady White Ferret / Death to the Ferret Sheep / Death to the White Ferret / Death to the White Ferret Weasel Sheep! / 흰 족제비 양에게 죽음을!","For a thousand years I was imprisoned in the body of a weasel for destroying the country.\nOne day, a beautiful guy fell down in front of me, not understanding what he was saying.\nThe guy announced that I was his first love and started flirting.\nShe took advantage of it and prayed for the end of her millennial life,\n“I decided to die again… … .”","A great adventure to break the curse of a weasel princess!\n***\nSoaz’s hand put the ferret on the floor.\nI started rummaging through the backpack I was carrying on my shoulder.\nJust for one night, why are you packing so much?\nA truly excellent preparation.\n‘What else should you do?’\n“I’ll go get a blanket.”\n‘No, you mean you have all that?’\nSoaz increased the opening of the bag. He pulled out the brown blanket.\nSilhouette of a housekeeper finishing getting ready for bed.\nsure… … .\n‘It’s a bit expensive to give to others… … . ‘\n“Yes?”\n‘Oh no. Keep doing what you’re doing. ‘"]},{"title":"Between Two Lips","tags":["Drama","Fantasy","Historical","Manhua","Romance","Webtoons"],"disc":["Read manga Between Two Lips / Between Us","The brave princess attacks the sexy king? The princess marries off to a royal family from a far-away country, and then notices that her fiancé is a savage pervert?! Not only does she have to resist against the ruthless prince, but also has to hide from an evil assassination! Meanwhile, the king shows off his compassionate side to the princess…"]},{"title":"Take Your Mommy Home","tags":["Drama","Romance","School Life","Slice of Life"],"disc":["Take Your Mommy Home– Why? Five years ago, it’s were you who slept me?，And why after five years, it’s you again?\nBai Chu Xiao was angry and held Jiang Cheng Yu’s collar and said, “I’ve been through hard time so much, how do you plan to compensate me?” The evil charm of Jiang Cheng Yu’s smile, he hugged her and said,\n“Is it enough with two babie plus my lifetime to compensate you”?"]},{"title":"Marshal Is Jealous Everyday","tags":["Drama","Manhua","Time travel"],"disc":["Read Marshal Is Jealous Everyday / The Jealous Governor Ling / 少帅每天都在吃醋","An arrogant and stubborn lady is dead, a revived 21st-century medical genius into her body. Medicine is excellent, the heart is pure. Facing her parents-in-law is unfriendly, her husband is not in love, and has a jealous look of concubines. Based only on a small scalpel, she won the concubine, defeated the tricky trick, and she always won. Marshal, her husband inherently despised her, but now, her husband climbed the window, crawled into her bed every night, and he wanted to be a happy couple forever."]},{"title":"Inappropriate Activity Has Been Detected","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Inappropriate Activity Has Been Detected / 부적절한 플레이가 감지되었습니다"]},{"title":"My Sweet Dark Hero","tags":["Drama","Fantasy","Josei","Manhwa","Mystery","Psychological","Romance"],"disc":["Read manhwa My Sweet Dark Hero / Sweet Psycho / My Sweet Psycho / Милый Псих / 달콤한 사이코","Oyoung Ji is a survivor! Growing up as an orphan, life wasn’t easy for her. To make matters worse, she narrowly escaped a brutal attack at her orphanage. The only reason Oyoung’s life was spared was that she was saved by a mysterious man. Years later, she is barely scraping a living as a hospital custodian. So when she is offered a job as a live-in assistant for Logan Lee, one of the most prestigious (and handsome!) surgeons at the hospital, she gladly accepts! Little does she know… her new boss is her savior from the orphanage!"," "]},{"title":"Pendant Of The Elemental","tags":["Fantasy","Manhwa","Mystery","School Life","Shounen","Webtoons"],"disc":["Read manhwa Pendant of the Elemental / Pendant of the Nymph / 정령의 펜던트","Being the new kid at school is tough. Bayul’s a target for gossip, arrogant bullies, and strict teachers… and he’s also burdened with being the son of a famed war hero and dealing with a chronic illness. Life just isn’t easy for him at Carringston Academy, but luckily, he has a few steadfast friends watching his back! He’ll need them and all the help he can get as he learns that his late mother’s pendant may lead to a power and a past he never knew he had. Can this be the path to a destiny greater than he could have ever imagined?"]},{"title":"Leave Me Alone, Duke","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Leave it Alone, Duke / Please Let Me Go, Duke / Leave Me Alone, Duke / The Vanished Duchess / 이만 놓아주세요 공작님","The fiancee who disappeared five years ago appeared with a child.\n“This child, is it my child?”\n“We are no longer in a relationship.”\nBut somehow, her fiancee rejected him, and he was frustrated because he didn’t know, but it didn’t matter.\n“There is plenty of time. So take it slow.”\n“… … .”\n“There was no other woman but you in my life, in the past, now and in the future .” It was meant to seduce him again and make him fall in love with him.","[That woman, Mabel]","She returned after five years of leaving the royal castle. She took his child. “Do you not love me anymore?”\n“Yeah. I do not love you.”\n“… … lie.” As she tried to kill her, she hated this man for her brazen approach, pretending to know nothing of her.\n“I am not impulsive now. It’s not about burning the atmosphere.”\n“… … .”\n“I love you. a lot.” But why does the heart start beating again in front of it, resentful?"]},{"title":"There Is Magic in the Winter of Nordfield","tags":["Comedy","Drama","Romance"],"disc":["Elite butler from the capital and his love story with maid Dana in the Nordfield Mansion.","노드필드의 겨울엔 마법이 있다"]},{"title":"Unladylike","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance"],"disc":["Read manhwa Unladylike","Sophia is living her dream as a distinguished writer. With failed dating experience and no prospect suitor in sight, she busied herself with her career and brushed off romance in her life. She thinks she is a strong, independent woman until she’s mysteriously transported back to the prim and proper Victorian era. Will she be able to survive this period as a modern woman?"]},{"title":"The Blue Snake and the Red Moon","tags":["Drama","Historical","Manhwa","Romance","Supernatural"],"disc":["Read manhwa The Blue Snake And The Red Moon / Blue Snake’s Red Moon / Puleunbaemui Bulgeundal / Ular Biru Bulan Merah / Красная луна синей змеи / 푸른뱀의 붉은달","Leerang has had a lot of bad luck, but getting tricked into being buried alive as the bride of a ghost might really take the cake. Leerang is tied to the ghost by a red string of fate, and somewhere between the world of the living and the dead, she’s slowly dying. Just then a blue snake appears and tells her that she can return to the living if she ties herself to him instead. But there’s a reason Tajin has been sealed beneath the earth for the past three hundred years, and now she has no choice but to find out why."]},{"title":"Odor Solver","tags":["Comedy","Drama","Webtoons"],"disc":["Read manhwa Odor Solver / 악취해결사"]},{"title":"Interview with the Crazy Rich","tags":["Comedy","Drama","Romance","Slice of Life"],"disc":["Read manhwa Interview with the Crazy Rich / Interview a Chaebol / Interview a Rich Heir / 재벌과의 인터뷰","Yang Seojun, director of Taeyang Solar, finds himself caught in a life-threatening storm during a vacation hike in Sweden. As he takes shelter, he meets a pretty writer named Ji Eun who offers him the last of her food as they await rescue. But when he’s back home, he just can’t forget her, so he concocts a company-funded writing contest to find her. It won’t be easy… even his assistant has her reasons to prevent their reunion. Will Seojun find Ji Eun again, or will she be lost to him forever?"]},{"title":"The Lovely Geum Bokhee","tags":["Drama","Romance","School Life","Shoujo","Slice of Life"],"disc":["Geum Bokhee’s first love, Yoon Geonwoo, was someone who could never return her feelings. But she held on to her one-sided crush for seven years. But everything seems to change when she encounters Kim Geonyi, a grumpy classmate whose name is similar to Geonwoo’s. Though she takes an interest in him, he doesn’t share her sentiments… or so it seems. Will this new relationship finally end Bokhee’s unrequited love, or steer her toward an ending she doesn’t expect?","Loving BokQi\nLovely Bokhee\nLovely Bokhee-ssi\nLovely Bokhwi-ssi\nThe Lovely Geum Bokhee\nเลิฟสตอรีของกึมบ๊กฮี\n扑倒那只傲娇\n親愛的福熙小姐\n사랑스러운 복희씨"]},{"title":"A Rain-Kissed Secret","tags":["Manhwa","Romance"],"disc":["Read manhwa A Rain-Kissed Secret / Rainy Day Time / 비오는 날의 시간","Joo Yeokyung, the heiress of a corporate empire and the youngest executive in a leading domestic conglomerate, carries an enigmatic secret despite her seemingly perfect life. Nestled within her flawless façade lies an astonishing truth – her age changes with the falling rain. Bound by the confines of a genetic condition passed down through generations, Yeokyung has navigated a life burdened with limitations. The weight of her inherited syndrome has made her existence a delicate dance. As a prolonged monsoon season blankets the city, Yeokyung’s life takes an unexpected turn. One fateful day, a mysterious man steps into her world, becoming the catalyst for a series of events that will unravel the layers of secrecy she has meticulously maintained. In the face of this unforeseen connection, Yeokyung must confront her hidden truths, and both she and the stranger must navigate the complexities of love, identity, and the uncharted waters of a life touched by a rain-kissed secret."]},{"title":"The Author I Stole","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Author I Stole / 내가 훔친 작가님","Angela, who was born in a completely different world while retaining memories of her past life, embarks on her second life. She wants to widely spread Andersen’s stories, her favourites from her past life. Angela establishes a publishing company and successfully publishes his fairy tales, thriving in her endeavors. However… “It doesn’t make sense…” “What do you mean by ‘It doesn’t make sense’?” To her surprise, there is also an Andersen in this world! And not just any Andersen, but a sharp and handsome one. Angela jumps at the opportunity to recruit the writer for the first time in her life. Although he leads a stable life as a knight from a noble family, she possesses a jewel-like talent of her own. “Author, please (eternally) contract with me!” A romance fantasy even more enchanting than a fairy tale, .”"]},{"title":"Cheese in the Trap : Newlywed Edition","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Cheese in the Trap : Newlywed Edition / 치즈인더트랩 : 신혼편","The newlywed life of Yu Jung and Hong Seol. Released on “Monthly Bespoke Newsletter” from April to December 2022."]}]