[{"title":"The Banished Villainess’ Husband","tags":["Drama","Fantasy","Romance"],"disc":["The Banished Villainess’ Husband manga, 追放悪役令嬢の旦那様 Tsuihou Akuyaku Reijou no Danna-sama\n“I” had the luck of being the one who reached out towards the young lady whose engagement was annulled by Prince Alephaldo, Elana. The day after the annulment, I was banished with her and married even though we dated for exactly 0 days. Well, it’s just a slow country lifestyle of banishment in the neighboring country! Or so I thought, but…? This is my story about becoming a banished daughter’s husband."]},{"title":"Mokrin","tags":["Adaptation","Comedy","Drama","Historical","Manhwa","Romance"],"disc":["Read manhwa Mokrin / 목린","Can love transcend all boundaries? The 200-year long peace in Mokrin’s island tribe is broken when the warlike Fiendbloods arrive to demand open borders. What’s more, Eonyeong, the son of their chieftess, falls hopelessly in love with Mokrin. Now it’s up to her — will she spurn his affection or marry him for the sake of her people?"," "]},{"title":"My Beloved Ninita","tags":["Drama","Fantasy","Historical","Manhua","Romance","Shoujo"],"disc":["Read My Beloved Ninita manhua, 亲爱的妮妮塔 , 天才侯爵令嬢の夫はオオカミ王⁉","This story takes place in the Alstrauss Empire, where humans and demons are sworn enemies, ever at war with each other. The protagonist, Ninita, is the daughter of the land’s ruler, Lord Hunt. An innocent girl with outstanding magical talents, the people hope she will become the Saint Priestess, a powerful human guardian the likes of which haven’t been seen for a millennium. However, she ended up falling in love with Jeff, a wolf demon, and next in line to become king of his people."]},{"title":"I’m Your Guardian Angel","tags":["Comedy","Fantasy","Romance"],"disc":["Read manhwa I’m Your Guardian Angel / I’ll Make You Happy! / 내가 널 행복하게 해줄 건데!","But I’m supposed to make you happy! Dove has always been the black sheep among his fellow Angels-in-waiting. To finally come into his own as an official Angel, he must make his designated human happy. But his assignment, Yena Jang, is a girl who already has it all except love. Will Dove be able to fulfill her wishes?"]},{"title":"The Villainess’s 18 Year Old Attack Story","tags":["Action","Adventure","Comedy","Drama","Fantasy","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Villainess’s 18 Year Old Attack Story / 악녀 18세 공략기","OMG a reverse isekai??!\nOur MC is a villainess in a webtoon and she was suddenly reincarnated as an 18 year old webtoon writer in the modern world. Her character as the villainess in the webtoon will meet a tragic death, but she has now the chance to change the ending after getting reincarnated as a webtoon writer.\nThe Villainess’s 18 Year Old Attack Story"]},{"title":"A Country Life With A Sexy King","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa A Country Life With A Sexy King / 섹시한 폐하와 함께하는 전원생활"]},{"title":"Villainess’ Reprisal Boutique","tags":["Drama","Fantasy","Historical","Isekai","Reincarnation","Reverse","Romance","School Life","Villainess"],"disc":["Read manhwa Villainess’ Reprisal Boutique","After a car accident, fashion designer Madison wakes up inside her favorite fairy tale as Allena, the daughter of the villainess Irene! For years Irene and Allena have lived in banishment. But there is an untold story—the truth is Irene was never a real villainess. She was framed! Using her fashion skills, Allena enters the noble finishing school, Versailles Academy, swearing to earn the prestigious title of First Lady of Versailles so she can clear Irene’s name and find her own happy ending."]},{"title":"On Her 94th Reincarnation This Villainess Became the Heroine!","tags":["Action","Comedy","Fantasy","Reincarnation","Romance","Shoujo"],"disc":["On Her 94th Reincarnation This Villainess Became the Heroine! manga , Akuyaku Reijou, 94 Yonkaime no Tensei wa Heroine Rashii. – Chara Guild no Haken Staff wa Tensei ga Oshigoto Desu!, By the 94th Reincarnation, the Villainess Is More Like the Heroine: The Staff From the Character Guild Are in Charge of Reincarnation\n“I’m the ace of the Evil Noblewoman’s Guild…and I have to play the heroine now? But I’ve only ever played a perfect villain!” An evil villainess heads toward her happy ending. Madeline is the ace of the Evil Noblewoman’s Guild, having starred in 93 different stories to date. For her next reincarnation, she had hoped to get an easy assignment that would help her score a promotion…but finds herself the heroine in a School Life Romance Novel! But with her pride on the line, Madeline is not one to run away from a challenge. With the help of guild Navigator Leold playing a handsome instructor, can Madeline successfully become a heroine and find her happy ending? Find out in this villainess-turned-heroine romantic comedy!\n悪役令嬢、94回目の転生はヒロインらしい。 ～キャラギルドの派遣スタッフは転生がお仕事です！～"]},{"title":"The Isolated King and the Imprisoned Princess","tags":["Drama","Fantasy","Josei","Romance"],"disc":["Read manga The Isolated King and the Imprisoned Princess / 孤高の王は囚われの姫から愛を知る","Born to be a princess, Fine was raised in a tower with a blindfold on because of her golden eyes, which are said to be unlucky. Though she believed her parents loved her, it all turned out to be a lie when her father decides to offer her to the god to end the kingdom’s long-standing drought. But right before Fine is pushed into the spring, the king of the powerful kingdom Stichtite, Sieghart rescues her. “I want to make Fine my wife.” Fine is utterly confused by both the relief of having her life saved and his sudden request. Why did he save Fine and ask her to marry him when they’ve never … More…"," "]},{"title":"I Became a Dead Character in a Prison for Wastes","tags":["Manhwa","One shot","Romance"],"disc":["Read manhwa I Became a Dead Character in a Prison for Wastes / 피폐물 감방의 고인물이 되었다 / I Became a Leader in a Wretched Prison","I was reincarnated into this novel… Wait, no! I was reincarnated 10 years before the events of the novel took place? The setting of the novel is a prison that’s even worse than hell itself. This and that happened, and ten years flew by. I’m now the top dog of this prison. * “Hey, Mint. I’ve got a job for you. Get working.” “You’re saying all this stuff, but I don’t know what you mean.” Despite being the top dog, I pretend to be an idiot. But I’m fine with that. It’s one of the plus sides of being dead. “Pretend to be dead on paper. In exchange, I’ll do something for you.” “I don’t know what you’re talking about.” Then an opportunity crept up like a sweet, sweet lie. “If you help me, I’ll release you from this prison.” “What shall I do for you, Master?” “….” With those words, the prison warden was able to order around the prison idiot. “There’s a new inmate that’s being brought in. Make him the new top dog of the prison.” This place is called a prison, but within these walls is total anarchy. As long as I can make this guy the new top dog, I’ll be free of this place at last. “But you’re going to have to go over to the men’s prison.” “…Eh? Do you really think I’ve got the parts for the job?” “You’ll be in disguise, a disguise!” But alas! The new inmate is the male lead of the novel."]},{"title":"The Devilish Duke Can’t Sleep","tags":["Action","Adventure","Drama","Fantasy","Gender Bender","Harem","Isekai","Josei","Manhwa","Romance","Shoujo","Supernatural","Villainess","Webtoon"],"disc":["Read manga The Devilish Duke Can’t Sleep on manhwaclan\nDuke Kahel Luave, the unlucky duke, who cannot keep one servant by his side because of the devilish nature that charms men and women of all ages.\nMeet Lena, a maid with a rare constitution where devilish charms don’t work.\n***\nIf the devilish energy emanating from him was a scent, now this room would be filled with a dizzyingly strong scent.\nHowever, there were no other positive emotions in Lena’s eyes except worry and fear.\nKahel decided to take another approach.\nHis appearance was also so seductive that it was rumored to be the best in the kingdom, so no matter how much he suppressed his devilish nature, he could not stop people from falling for him.\nRecalling that troublesome past, Kahel gave Lena a strange smile.\nThis kind of service was not given to anyone.\nBut…….\n“Sa, save me, please… … .”\nLena, who was barely holding back her tears, began to cry and beg for her life.\nIt was the moment when the law of ‘even the gods will fall in love’ on his smile faded away.\n‘It’s not normal. As expected, it’s suspicious.’"]},{"title":"Reborn into a World of Yanderes?!","tags":["Adaptation","Drama","Fantasy","Game","Historical","Isekai","Reincarnation","Romance","Villainess"],"disc":["Read manga Reborn into a World of Yanderes\nIn a crazy turn of events, the Lycoris family has been targeted and reborn into the world of a yandere otome game. They can try to use their knowledge of their past lives to go straight to the ending of the game, but they have to watch out for the “bad ending”… Drama ensues and relationships form…maybe even a little too fast. Enter a world full of mystery and romance that’s sure to take you on a wild ride! / Yandere-kei Otomege no Sekai ni Tensei Shite Shimatta Youdesu"]},{"title":"Handmade","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo"],"disc":["Read manhwa Handmade / The Handmade Tales of the Handmaid / 핸드메이드","In Korea, an 89-year-old grandmother thought she would enjoy a heavenly rest in this world and relax in a good place without pain, but?! “Get up quickly, get dressed, and work!” 15-year-old grandmother, no, Hami, who returned as a maid of Winston’s own family. With her outstanding dexterity, all the writers become her fans! The handsome and cute young master, Cassian, has been bothering her, but in the eyes of Hami, who is 89 years old, he is just like a grandson and cute, and she hears the secret of her return from a fortune teller. Munchkin maid’s chaotic handmade life where you can make anything with threads and needles! 핸드메이드 / Handmade"]},{"title":"I was summoned to be the Saint, but I was robbed the position, apparently","tags":["Action","Comedy","Fantasy","Isekai","Magic","Manga","Reincarnation","Reverse harem","Romance","Seinen","Slice of Life"],"disc":["I was summoned to be the Saint, but I was robbed the position apparently manga, Seijo no Hazu ga, Douyara Nottoraremashita 聖女のはずが、どうやら乗っ取られました\nAnise suddenly gets a message on her phone one day asking whether she’d be willing to lend her their aid. As if responding to her thoughts, it chooses for her and she finds herself suddenly summoned into the world of an otome game. While Anise is dumbfounded at her situation, Hime, the girl who is summoned with her declares, “I’m the Saintess!” As a result, Anise is treated as useless and driven out.\nIf things were to continue to go on like this, then the general of the neighboring country will die, Hime, as the saint, will take over, and a tragic ending will be met. To avoid that and take her life into her own hands, Anise resolves to save the general, change the scenario, and just settle down somewhere. That was what she planned, however…"]},{"title":"Is It a Fortune or Is It a Woe?","tags":["Drama","Fantasy","Isekai","Romance"],"disc":["Read manhwa Is It a Fortune or Is It a Woe? / For Better or For Worse / Dahaeng Inji Bulhaeng Inji / Is It Fortune or Is It Woe? / Keberuntungan atau kemalangan / Weal or Woe? / 幸运还是不幸 / 다행인지 불행인지","Somehow, before the appearance of the female lead, I became the male lead’s temporary wife. Since things had already turned out this way, I decided to try my very best. However… “It’s so fortunate that someone like you became Cedric’s partner.” “… I’ll admit it. It’s a fortune that you were the one to become his wife, Dylan.” “It’s such a fortunate chance that you were the one to become the Lady of the Brighton House.” … I think I did too much of a good job. When Cedric’s destined partner arrives, I will have to leave. What should I do? To someone like that, Cedric had said this. “Would you have ever thought that the one I would fall in love with would be you?” …Would you still say the same to me after the real female lead, Adeline, makes her appearance?\nFor Better or For Worse"]},{"title":"The Rotten Lady Rosa Wants to Watch Over Love from the Shadows","tags":["Comedy","Fantasy","Historical","Isekai","Romance","Shoujo"],"disc":["The Rotten Lady Rosa Wants to Watch Over Love from the Shadows manga, 貴腐人ローザは陰から愛を見守りたい, kifunin’ rozawa kagekara aio mimamoritai\nThe daughter of the Earl, Rosa, was known for her beauty and compassion. But in reality, she was a rotten lady who pursued her ‘moe’ by making delusions of ‘rose love’, the romance between men.\nHer dream was to become a nun and write down a ‘bible’, spreading the rose love throughout the continent.\nAs the preparation of entering the priesthood, she donated to the monastery (as a bribe), strived to improve literacy (to prepare for her missionary work), and made humus for her territory (as the symbol of rottenness). One day, she met her half-brother, Bernard, a fourteen years old boy.\nConcluding that Bernard was the ideal ‘uke’, a talented person that only appeared once every a thousand years, Rose devoted herself to ‘Bell-tan’s Harem Plan’. However, her rotten behavior was mistaken for noble deeds. The princes, princesses, and even the foreign princes started to get involved, and she began to spread her influence all over the country…?\nThis was the story of Rosa von Langheim, nicknamed the “Rose Angel” as the symbol of her nobility and charity, who was the most rotten lady of all."]},{"title":"The One Within the Villainess","tags":["Drama","Fantasy","Isekai","Magic","Reincarnation","Shoujo","Villainess"],"disc":["The One Within the Villainess ,Akuyaku Reijou no Naka no Hito ~Danzai sareta Tenseisha no Tame Usotsuki Heroine ni Fukushuu Itashimasu~, Akuyaku Reijou no Naka no Hito 悪役令嬢の中の人〜断罪された転生者のため嘘つきヒロインに復讐いたします〜\nIn order to clear the name of ‘Emi,’ a girl who had reincarnated as Remilia, the villainess of an otome game, the real Remilia who had been watching all along inside awakens.\nNow it’s time for the true villainess’ revenge to begin!"]},{"title":"Answer Me, My Prince","tags":["Comedy","Drama","Fantasy","Historical","Magic","Manhwa","Mystery","Romance","Shoujo","Time travel","Webtoons"],"disc":["Please Answer Me My Prince , 답장을 주세요 왕자님 , Answer Me My Prince manhwa:\nShe wrote a letter there, at an antique storage box of books that I got by a mere chance, and a reply came back.\nFrom the handsome playboy Prince, Archie Albert , the pathetic supporting character in “The Princess and the Knight,”\nCordelia had a dream that she had a conversation with the main character in the novel.\nPrince Archie desperately needs the advice of Cordelia, who knows the future of his world.\nThe letters they send and receive through the storage box of books continue without knowing that they are staying up late at summer nights..….\n—\nTo Archie,\nHave you ever done that?\nI was walking with someone, and there was a flower blooming on the road.\n—\nSo you did it with that man?\n—\nTo the low-life Archie,\nYou are really indecent, Prince.\nI am afraid that I am a ‘woman’ who thinks too much about sleeping with a man whom I met for the first time.\n—\nSleeping? I was talking about kissing."]},{"title":"Ways to Break Up with the Male Lead","tags":["Action","Adventure","Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manga Ways to Break Up with the Male Lead","Lee Young-Ah, a layoff expert at global company Rigveda, immerses herself in a love simulation game with her favorite character! But all the male lead targets are in a relationship with her, and her favorite character is far from being a fling. Unintentionally, Young-Ah comes up with an idea. Making use of the ability of a lay-off expert to break up with the male leads. Will Young-ah be able to make a safe separation and get her hands on her favorite character,"]},{"title":"Golden Forest","tags":["Drama","Romance"],"disc":["Read manga Golden Forest on manhwaclan"]}]