[{"title":"I Became the Tyrant’t Dying Wife","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Became the Tyrant’t Dying Wife / 폭군의 시한부 아내가 되었는데/ I Became the Tyrant’s Chambermaid/ I Became a Tyrant’s Maid/ 暴君の寝室担当侍女になりました/ 폭군의 침방 시녀가 되었다 / I Became The Tyrant’s Time-limited Wife","When Lee Chaerin kicks the bucket, she’s whisked into a dark fantasy novel as Rose Estania, a chambermaid at the mercy of the tyrant crown prince, Kalix Forsman. Armed with nothing but her real-world hotelier skills and a diary from the real Rose full of cryptic hints but no escape route, she’s forced to navigate a dangerous world teeming with Kalix’s enemies. Can she keep his wrath in check, evade death, and find her way back to reality before it’s too late?"," "]},{"title":"Solo Reincarnation","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read Solo Reincarnation","Unique Ability: Resurrection\n“What is this? This ridiculously OP, game-breaking skill?”\nBut Kang Hyun didn’t know.\nWhat it truly means to never die, even if you want to…\nA man who became the most infamous hunter on Earth with an immortal body!\nFor the survival of humanity, or rather, for humanity that has already perished, today again,\nI resurrect alone!"," "]},{"title":"I’m Sorry for Being an Unqualified Empress","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m Sorry for Being an Unqualified Empress / I’m Sorry I’m Not Qualified to Be Empress / 자격 미달 황후라 죄송합니다 / Maaf aku gak memenuhi syarat jadi ratu","After an unhappy marriage, Rose Etoile dies miserably at the hands of her husband, the Emperor of the Solstern Empire. Somehow, she goes back to the day before the emperor’s marriage proposal to her, and at the rate she’s going, it looks like she’ll have to marry that bastard again.","“I’ll go to Hellavant instead of Lady Muriel, the Marquis’s daughter!”","Rose escapes from the madman to the Helavant Empire, but must live with a brute instead. And so she decides. She would tame this beast in order to take revenge on the Emperor of Solstern."]},{"title":"The Princess’s Double Life","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Princess’s Double Life / 공녀님의 이중생활 on MANHWACLAN\nA genius disguiser. A master of escape. One day, Grand Duke Hexen, the known tyrant of the battlefield, came to visit the genius swindler and death-row prisoner, Viper, who had stirred the Empire. “Hey, I need you to help me a little.” “How can I help you?” “I want to try to become the Emperor.” “…Huh? You?” Someone known as the disgrace of the Imperial Family. The crazy northern dog. The tyrant of the battlefield. What am I supposed to do with someone who has muscles for a brain? “You must find a way for me to become the emperor. Or else there will be death.”"]},{"title":"Torn Between Alphas","tags":["Adaptation","Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Torn Between Alphas","Caliana Hart, in desperate need of money to treat her mother’s illness, finally succumbs to her friend and tries compensated dating. What could possibly go wrong? As it turns out, quite a bit. Her date, Xavier, is not only hung up on his ex but also harbors a secret—he’s a werewolf struggling to control his ability to shift. As wolven shadows close in and hidden truths emerge, Caliana finds herself caught in a web of danger and desire, irresistibly drawn to the enigmatic Xavier."]},{"title":"I Corrupted the Good Male Lead","tags":["Comedy","Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read  manhwa I Corrupted the Good Male Lead / I Corrupted the Good Male Protagonist / 善良な主人公を闇落ちさせました / 선량한 남자 주인공을 타락시켰다"]},{"title":"The 24th Fiancée is the Charm","tags":["Fantasy","Romance"],"disc":["Read The 24th Fiancée is the Charm","Adonis, the only son of a marquess, is blessed with a handsome face, exceptional intellect, and a respectable family. However, his terrible personality has caused 23 noble ladies to break off their engagements with him so far. In a desperate attempt to find someone who won’t end the engagement, his mother chooses Ophelia, the daughter of a poor country noble, as his 24th fiancée. But Ophelia’s bright personality and honesty soon melt the hearts of everyone in the marquessate, including Adonis himself…"]},{"title":"Empress Wi Mokhwa","tags":["Drama","Historical","Romance","Webtoons"],"disc":["Read manhwa Empress Wi Mokhwa / Queen’s Revenge / 황후 위목화","Wi Mokhwa was given another chance at life. Her first life had been worse than hell, therefore, at her untimely death, life came flowing back into her. At fifteen, she fell in love easily and believed Lee Gajun to be her destiny. There wouldn’t have been anything more perfect for eternity. However, facing death, Wi Mokhwa had to accept her cruel end. Her life at fifteen had been futile and was where her misery started. Regretting her life, she was given another chance. This time she has Lee Jejun’s sincere feelings to protect her and stand by her side. He was willing to be her light even inside a dark world. This life was not doomed to fail. Revenge, salvation, and a miracle. This is her true life, the second life where it all begins again."]},{"title":"Mercenary Enrollment","tags":["Action","Adventure","Drama","Manhwa","Romance","Sci-fi","Webtoons"],"disc":["Read manhwa Mercenary Enrollment / 입학용병 / Teenage Mercenary","Yu Ijin was the sole survivor of a plane crash when he was little. After becoming a mercenary to survive for 10 years, he returns to his family in his hometown."]},{"title":"The Last Adventurer","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Last Adventurer / Maplestory: The Last Adventurer","[By the studio that brought you <Solo Leveling> and <Revenge of the Iron-Blooded Sword Hound, The World After The End and many more!\nThe gate opened and the era of adventure began. It was a time when everything fell apart, bringing forth the period of dread, desperation, and misery. It became an era when everyone gave up trying to fight back. However, there was one adventurer who pushed on till the end. “You are the only one left, El Paume. You are the last adventurer.” The moment the era of adventure came to an end, the last adventurer brought the whole story back to its starting point."]},{"title":"Juliet, You’re Not In Kansas Anymore!","tags":["Adaptation","Comedy","Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Juliet, You’re Not In Kansas Anymore! / Juliet, This Isn’t Kansas! / 줄리엣, 여긴 캔자스가 아니야!","Why did Shakespeare give the FL of his story the name Juliet? If he’d instead given that extremely tragic story the name <Romeo and Brittney> my life would be so much better! A highschooler in Kansas, Juliet Holiday had some minor inconveniences as her first name was very well known, but her days were relatively normal. Or it was- before a student named Romeo transferred over. “HI, it’s great that I was able to meet you like this. My name is Romeo.” From the eccentric bearer of that fateful name, Romeo Buchanan, to American football quarterback Grey Holt, and childhood friend Luke Theobald… Due to the ever changing relantionships between her and these people, her school life quickly becomes more and more of a mess."]},{"title":"One Regret Is Enough","tags":["Fantasy","Romance","Shoujo"],"disc":["Read manhwa One Regret is Enough / 후회는 한 번이면 족하다","Cornelia, who was born with the power of an Indian, was in a maze of boundaries. One day she meets the warriors who have left to quell the crazy dragon “Acktail” and joins their adventure. But Cornelia was not recognized as a warrior because she was a commoner. Debaron’s cold attitude led the servants of the mansion to despise Cornelia day by day. The day my grandmother died, Cornelia decided to leave Debaron. I will leave you to live. It’s not coming back. One regret is enough. And a year later, I came to Cornelia, who had been hiding herself as a teacher in the village of Mobelto. It was none other than Debaron…"," "]},{"title":"Foam of the Waves","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Foam of the Waves / Foam of the Sea / 파도의포말","Despite the war raging between the North and South, Margaret is a northerner who holds an unwavering love for her southern lover, Squall… until he cruelly betrays her and pushes her off a seaside cliff. Just when she’s about to drown, the voice of a mysterious witch offers her a second chance at life. However, this chance only comes to her seven years later, when she rises from the ocean in a new body without a voice. Although Margaret receives help from a local apothecary named Jack, the other southern villagers aren’t as eager to let an outsider into their fold…"]},{"title":"Die Melusine","tags":["Drama","Fantasy","Historical","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa Die Melusine / 디에 멜루시네","My serenade, my Kieron. During one of his conquests, the heartless Archduke Kieron discovers Melusine, a mermaid in captivity. Their bond deepens, but according to legend, mermaids must kill their lovers to return to the sea. Melusine cannot bear to harm Kieron and leaves instead. What cruel fate awaits the lovers?"]},{"title":"The Hero Returns","tags":["Action","Adventure","Fantasy","Manhwa","Supernatural"],"disc":["Read The Hero Returns manhwa,\nThe strongest hero of humanity, Kim Sung Bin. He threw everything on the line and fought… but he still couldn’t prevent the destruction of the world. However, his legend has just begun as he returns 20 years into the past. “I’ll definitely… kill it this time. ” Now fully equipped with overwhelming power and experience, the hero’s raid isn’t over yet!\nThe hero returns novel"]},{"title":"Margrave’s Bastard Son was The Emperor","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Margrave’s Bastard Son was The Emperor / El hijo bastardo del marqués era el emperador / The Margrave’s Bastard Used to be the Emperor / 辺境伯家の落ちこぼれは皇帝だった / 변경백 서자는 황제였다","“An emperor who died unjustly becomes a wretched bastard son!” Ian, a wizard of the Bariel Empire, became emperor at a young age, but was imprisoned due to his nephew’s rebellion. However, he was saved by the wizard Naum using forbidden space-time magic. This magic leads Emperor Ian 100 years into the past, where he possesses Bastard Ian, the illegitimate son of the Margrave family that went extinct 100 years ago. Bastard Ian is about to be taken hostage by the barbarians! Ian is about to get caught up in a bloody conspiracy!!!"]},{"title":"Regressor Instruction Manual","tags":["Action","Adventure","Drama","Fantasy","Isekai","Manhwa","Psychological"],"disc":["Read manhwa Regressor Instruction Manual, HSS , hwegwija sayongsolmyongso ,RIM , 회귀자 사용설명서\nOne day, I was summoned to this world.\nBeasts poured out, and an incredible crisis came.\nMy talents couldn’t have been worse.\n[The player’s talent level is at rock bottom.] [Almost all the numbers are hopeless.]\nWhether you have to become a warrior or a wizard.\nWhether you’ve gone back in time.\nYou have to take advantage of everything in order to survive.\n“What about it?”\n“I’ll use everything I have to survive!”"]},{"title":"I’m In Trouble Because The Emperor Thinks I’m Terminally Ill","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I’m In Trouble Because The Emperor Thinks I’m Terminally Ill / Problematic That The Emperor Thinks I’m Terminally Ill / 황제가 나를 시한부라고 생각해서 곤란하다","Well, this is a rom-com (maybe) between the Emperor and his knight who allegedly terminally ill (but we’ll see)"]},{"title":"Swordmaster’s Youngest Son","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Swordmaster’s Youngest Son manhwa, Youngest Son of the Renowned Swordsmanship Clan, 검술명가 막내아들\nJin Runcandel was the youngest son of Runcandel, the land’s most prestigious swordsman family… And the biggest failure in Runcandel history. He, who was kicked out miserably and came to a meaningless end, was given another chance. “How do you want to use this power?” “I want to use it for myself.” Memories of his past life, overwhelming talent, and a contract with God… The preparations to become the greatest are complete."]},{"title":"I Lost the Leash of the Yandere Male Lead","tags":["Cooking","Drama","Fantasy","Harem","Isekai","Manhwa","Romance","Villainess","Webtoons"],"disc":["Read manhwa I Lost the Leash of the Yandere Male Lead  / Villains Behind the Curtains / 흑막의 목줄을 놓쳐버렸다 / 没抓住黑幕的命脉 / 错失了抓住幕后黑手的缰绳 / 无法抵抗的，来自恶女的诱惑 / 黒幕の首輪を外したら","I transmigrated into a novel and became the villainess, Serina who comes from the noble Ducal Melford family. As a well-to-do character, I tried to mind my own business, but the story had other ideas. A self-proclaimed mother brought back a boy – the duke’s heir and a genius wizard – intent on brainwashing and blackening him. The contents of brainwashing are two things: 1. Obey our family. 2. And fall in love with Serina. Thanks to that, the brainwashed twisted yandere is obsessed with me… I can’t do this. I have to undo the twisted character’s brainwashing! By the way, what’s this situation? “Now that the brainwashing is gone, I’ll do as I please. So Serina, please, let’s do our best.” I’ve solved his brainwashing… but why does he seem even crazier than before— Did I make a mistake?"]}]