[{"title":"Infinite Mage","tags":["Action","Adventure","Fantasy","Supernatural"],"disc":["Read manhwa Infinite Mage / Infinite Wizard / 무한의 마법사"]},{"title":"My Harem Is Entirely Female Demon Villains","tags":["Action","Adventure","Comedy","Fantasy","Harem","Manhua"],"disc":["Read manhua My Harem Is Entirely Female Demon Villains / 我的后宫全是反派魔女\nAdapted from the novel [After Being Proposed To By The Villain]. A human being from another world, crossed over as a hero… into the bed of the female demon villain?! If I hadn’t established marriage contracts with all the villains in the game before crossing over into its word, I’d be a dead man. Now the villains are pestering me, making me assist them in dominating the world, contending for my hand in marriage, what should I do?! Stuck in the game… emergency!!!"]},{"title":"Emilone’s Temptation Labyrinth","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Emilone’s Temptation Labyrinth / 에밀로네의 유혹 미궁"]},{"title":"The Redemption of Earl Nottingham","tags":["Drama","Fantasy","Historical","Josei","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Redemption of Earl Nottingham / 구원 방정식","Is my cursed husband’s fate up to me?","Madelyn’s husband Ian was left broken after the war, and in turn, made her life a living hell. Fleeing her doomed marriage, she meets a tragic end. But when she opens her eyes, she finds herself at 17 again. The war has yet to start, and Madelyn can still change her fate. But what about Ian?"]},{"title":"Lantern Of The Dawn","tags":["Action","Drama","Fantasy"],"disc":["Read manhwa Lantern Of The Dawn / Beacon of Dawn / 여명의 등불","“Bucky,” a sergeant belonging to the “Empire of the Sun’s” war heroes. He is admired by the soldiers of the empire for his unwavering loyalty to the emperor and his exceptional martial arts skills. However, his ultimate goal is to overthrow the empire and seek revenge against the emperor. Can Bucky succeed in exacting his revenge against the mighty empire?"]},{"title":"Mending the Barbaric Prince’s Wounds","tags":["Drama","Fantasy","Manga","MANGA","Romance"],"disc":["Read manga Mending the Barbaric Prince’s Wounds / Ima Reta Ouji no Saiai Seijo / The Hated Prince’s Beloved Saintess / 忌まれた王子の最愛聖女\nA former nurse reincarnated I was doted when I saved the hated prince… The nurse who was committed to her job because she regretted letting her sick brother die alone After overworking, she reborn as Primera, a noblewoman in a small country. I’m also saying, ‘I want to save people as long as I can reach them.’ And Primera, who showed her nursing skills He married Astor, the first prince of the Great Kingdom of Adid. Astor is detested as a cruel and sinister prince. Primera arrives in Adid, and Astor says, “We don’t need fiancees.” They tell you Primera felt solitude and kindness behind his eyes: “I want to save him.” Feeling I will give you the allowance for the injury he was hiding. Astor’s fiancee begins, but Primera begins to notice. Astor is detested and degraded because of his magnificent malice in the royal palace…"]},{"title":"I Acted As the Adopted Daughter Too Well","tags":["Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Acted As the Adopted Daughter Too Well / I Played The Role of the Adopted Daughter Too Well / The Unintentionally Ideal Adopted Daughter / 입양딸 역할을 지나치게 잘해버렸다","When I first came into the book, my goal was just to survive.","‘I have to live longer! And be happy!’ So I did my best.","I am going to walk on my own flower path.","“Wherever I go, the seat next to you is mine. You promised to pat my head for the rest of your life, isn’t that right?” The strongest male character, who was stabbed to death in the original novel, stared at me with obsessive eyes.","If I say no, he will destroy the world.","“Yes, I’ll kill him. Then you’ll be happy, too, right?” The fifth brother looked a bit crazy.","“This is my land from here to here. And yours, too. I’m glad to be able to breathe with your grandest dreams.” The fourth oldest sister, who became the richest woman on the continent, opened the map and said that.","If I say I don’t have such a grand dream like her, I think a catastrophe will happen.","“I’m looking forward to the Winter Solstice that you’ll rule completely.” Laughter rose on the face of the butler who served me.","“If you don’t connect to Verratoux, my heart will stop tomorrow morning. Are you sure you’re okay with that?” My first sister, who was supposed to be the original successor, threatened me with her life.","And this is the biggest problem. Somehow, a faint smile raised my father’s mouth, which became stronger than the original father he was. “Independence? Try it then. I won’t even let a single ant live on this land.”","“Did you think you could leave my arms and stand on your own…” He then stared at me obsessively.","They are all acting weird.","Everything went wrong.","I only did my very best."]},{"title":"Me, The Heavenly Destined Villain","tags":["Action","Adventure","Drama","Historical","Martial Arts","Psychological","Royal family","Supernatural","Time travel"],"disc":["Reading I Am The Fated Villain / The Villain Of Destiny , Villain Is Here , I Am The Fated Villain / I Am the Fated Villain manhua / 我！天命大反派","Gu Zhangge was transmigrated into Xuanhuan World. The moment he was transmigrated, he saw many models surrounding the Lucky Male Protagonist and he really show hate him. Even the Female Protagonist was hugging him which lead to many jealousy among the VIP guest who witness it. Since I am more powerful and higher in status than him, destroying him would be very easy, but wait, there is a system here which allow me to receive some of his luck. Gu Zhangge smile to himself, it looks like I will be derailling from the path of the Heavenly Destined Villain more and more!"," "]},{"title":"I Will Divorce the Female Lead’s Siscon Brother","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Divorce the Female Lead’s Siscon Brother / I Will Divorce the Female Lead’s Older Brother / 여주의 시스콤 오빠와 이혼하겠습니다","“We’re getting a divorce.” Ethel, who reincarnated into her favorite novel, has married the female lead’s brother Liena. She thought her marriage life was genuine, but soon enough she became tired of a husband who cared only for his sister and whose attention was always centered on Liena, yet was cold to her, so she filed for divorce.”Divorce? Absolutely not!”However, her opponent is a powerful duke, so she turns to Terrence, the villain of the original story to be her assistant for a smooth divorce.”The only person I want to have by my side is you, Ethel.”…But this man’s fate is to be hurt by Liena.But the more she knew about Terrence, the more he seemed attractive to her?Original Webtoon:"]},{"title":"I Pick Up Trash in the Apocalypse","tags":["Action","Adventure","Fantasy"],"disc":["Read I Pick Up Trash in the Apocalypse, 我在末世捡垃圾","The male antagonist is a Demon Sovereign with the power to destroy the heavens and the earth. If he conquers the final city, the entire continent will fall under his control. The heroine of this final city is just as formidable, having also reached the brink of godhood.","On this fateful day, their battle shook the heavens and the earth. But suddenly, countless thunderbolts descended from the sky. In an instant, the entire continent—and even the entire planet—was reduced to a post-apocalyptic wasteland.","When the male lead awakens, he discovers that his cultivation has been halved, dropping him to the Foundation Establishment stage. Left with no choice, he embarks on a journey of scavenging in the ruins, slowly rebuilding his strength step by step."]},{"title":"I Became the Younger Sister of a Regretful Obsessive Male Lead","tags":["Drama","Fantasy","Isekai","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Younger Sister of a Regretful Obsessive Male Lead / Reforming the Obsessive Male Lead /후회 광공의 여동생이 되었다"]},{"title":"To Hell With Being A Saint I’m A Doctor","tags":["Adventure","Fantasy","Isekai","Manhwa","Reincarnation"],"disc":["Read To Hell With Being A Saint I’m A Doctor / Saint Is Bullshit Comparing to the Power of Modern Medicine / To Hell With Being a Saint, I’m a Doctor / 圣子是什么狗屁，这是现代医学的力量 / 転生したら医者から聖者になりました / 성자는 개뿔, 현대의학의 힘이다","Yusung is a genius doctor famous in the medical world. He, who spent his whole life in an operation room, died in a traffic accident, and when he woke up, he was in another world. But…a saintess? A holy empire? Healing magic? “I put so much effort into learning medicine, but now all I need to do is touch someone and they’re healed? Seriously, I think I’ve gone crazy.”"]},{"title":"Monster in the Greenhouse","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Monster in the Greenhouse / Monstruos en el invernadero / Monstro na Estufa / 온실 속 괴물","Julia Lappier, the so-called flower of society and envied by everyone. She had a lover for 10 years, and he was the illegitimate son of a baron who had nothing. For him, Julia gives everything she has, making her a greenhouse, but… “Julia is a girl who has nothing but a pretty face and a family.” “But she is the only child of the Marquis.” “Let’s see. I’ll make you the hostess of the Marquis, if I just marry that bitch.” For him, Julia was nothing more than a valuable tool with benefits of use. Upon realizing all the truth, Julia decides to take revenge and separates herself if her hidden life, and finds herself… The truth hidden in the splendor, the story of a monster that blooms in the greenhouse."]},{"title":"Reincarnation of the Swordmaster","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Reincarnation of the Swordmaster","At the threshold of life, a radiant white aura emerges. And… death! Yet, in a twist of fate, the man is once again granted a new life. With a newfound purpose, he sets out to complete his existence as an unfinished “Swordmaster” from his previous life."]},{"title":"I randomly have a new career every week","tags":["Action","Comedy","Manhua","Martial Arts"],"disc":["Read manga I randomly have a new career every week /  我每周随机一个新职业\nxperience the Didi driver and reward Pagani Zonda with one.\nExperience university teachers and reward ten buildings.\nExperience the charter company, reward one billion.\nExperience…"]},{"title":"The Namgung Clan’s Youngest Daughter","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Namgung Clan’s Youngest Daughter / 무림최강 남궁세가 막내딸입니다 / I Am the Youngest Daughter of Murim’s Strongest, the Namgung Clan"]},{"title":"This Life Starts as a Child Actor","tags":["Drama","Shounen","Slice of Life","Supernatural"],"disc":["Read manhwa This Life Starts as a Child Actor, Acting the Child Role at the Start of This Life, Beginning as the Child Actor in This Life, This Life Starts as Child Actor, This Life Starts From a Child Role, 이번 생은 아역부터","This life is doomed, you say? I’d rather think it’s good!\nAfter four years of a life that seemed destined for failure no matter what, Kang Soo-hyun thought he might finally shine as an actor.\nJust when he was about to embrace the light, a truck from the opposite direction collided with his car, bringing him to the brink of death and falling into despair…\n“Wait, I’m not dead, am I?”\nWhen he came to his senses, the reflection in the mirror was his cutest self at the age of 5.\nYes, this life is starting from being a child actor!\nThus, the acting career of actor Kang Soo-hyun begins."," "]},{"title":"Romance in the Beast World","tags":["Drama","Fantasy","Magical","Manhua","Romance"],"disc":["Read manga Romance in the Beast World / When beauty meets beasts / 萌动兽世","Lin Huanhuan, a regular 20-year-old girl who just joined the workforce, suddenly transmigrated while taking a bath! What’s more, it’s a world filled with handsome men who wear loincloths and can transform into beasts! Romance with another race is bound to be difficult, but luckily, there’s a transmigration system which teaches her how to survive in this strange new world. Study hard to achieve your sweet romance, Huanhuan!"]},{"title":"Dragondaily","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Dragondaily / One Night Besides the Dragon / 하룻밤은 드래곤곁에서","A runaway noble lady, now a maid at an inn. Meryl Parte, the Count’s only daughter, escapes an unwanted marriage and flees to Harp Island to keep a promise to her late mother. After a night at the rundown inn Dragondaily, she wakes up penniless and in bed with a mysterious man! He offers to help her, but only if she works as the inn’s maid!"]},{"title":"How to Protect the Master of the Monster Mansion","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa How to Protect the Master of the Monster Mansion / 괴물 저택의 도련님을 지키는 방법","20XX, the era of virtual reality games.\nAmong them, , which I played, was a game that mixed romance simulation, horror action, and upbringing genres.","“Oh. Don’t worry, baby. I’ll definitely save you next time.”\n‘really? Then I’ll leave it to you.’","However, on the 43rd day of the death of the master who had been nurtured and nurtured, a strange voice was heard and the strange 44th episode began.","“Master Diane, a new caregiver has arrived.”","The job of a nurturer, which was not originally in the game, was automatically selected, and then the unpredictable things continued to happen in the Redford Mansion, the setting of the game.","“I like Rin the best in the world. So don’t die until I’m an adult and stay by my side.”\n“It’s said that Rin likes a man with a pretty crying face. that’s just me Would you like to check it out now?”","Even so, the cute sunfish cat worked hard to protect it, and I made a data lover like a flower deer… .","[Loading system… . Partial recovery of the system for quick deployment.] [","Favorite 2] Hey, didn’t you like me? What the hell is this petty crush?\nHowever, whenever the handsome man saw another person, the number above his head that penetrated to the inner core was even more disconcerting.","[Favorite –889/?]It turned out that this man, the subject of the game data, must have been afflicted with anthropophobia."]}]