[{"title":"Moonstruck","tags":["Mature"],"disc":["Read manhwa Moonstruck / 문스트럭","How far would you go for love? The desire to destroy even while loving, the dilemma of wanting to ruin a deepening relationship. This high-intensity romance anthology Moonstruck delves into just how dangerous the emotion of love can be."]},{"title":"Our Night Shift","tags":["Comedy","Manhwa","Romance"],"disc":["Read manhwa Our Night Shift / 야간근무","“Miss Shin, please work your night shift at my house from now on.” The workaholic vice president Jehu asks his secretary Yuna Shin four days after their company bans the night shift. Just like that, the two of them begin working together at night, but it doesn’t take long before their attention turns toward each other instead of work."]},{"title":"This Wasn’t My Plan","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa This Wasn’t My Plan / This isn’t it / 이게 아닌데 / This Isnt It / This Wasnt My Plan","This is a R-12. Kim Ro-ah is the manager for the famous actor, Chen Sih-Yeon, who mistreats her. When fatigue hits due to overwork, Ro-ah gets into an accident and dies. In her dying moment filled with revenge, she swears if she could return to the past she would trample all over Sih-Yeon to prevent him from becoming famous. It turns out that she actually did return to the past, just in time before Sih-Yeon is about to make his debut. Ro-ah tries to sabotage Sih-Yeon’s career, however her plan is not turning out as smoothly as she expects it to be."]},{"title":"Maru is a Puppy","tags":["Comedy","Drama","Fantasy","Slice of Life"],"disc":["Read manhwa Maru is a Puppy / 마루는 강쥐","Maru, my dog, has become a person. Maru is just a 5-year-old! A thoughtless puppy with infinite energy and curiosity of dogs and children ! Maruuu ! Where are you going again? [Happy neighbors and room days]"]},{"title":"Disaster Is Always Nearby","tags":["Drama","Fantasy","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa Disaster Is Always Nearby / 재난은 늘 곁에 있다","A woman named Yoon Dami wakes up to find ten years of her life suddenly gone. It all started when she got entangled with a man claiming to be a god. Despite his initial indifference, he discovers that an item he has been searching for a long time is in Dami’s family. This revelation begins to change their relationship. But can a relationship so deeply strained ever be mended?"]},{"title":"Goddess’s Way of Attacking Tigers","tags":["Manhwa","Romance"],"disc":["Read manhwa Goddess’s Way of Attacking Tigers / 여신님의 호랑이 공략법 / The Goddess’ Tiger Strategy / How a Goddess Wins Over Tigers","Moha, the sun god, was betrayed by her lover and died a miserable death. She realizes that she has returned to her past a year ago while being possessed by the body of an unknown woman. Moha struggles to prevent the tragedy of her past life. But, unexpectedly for her, her two tiger gods, who belonged to her in the past, spread their fervent courtship towards her."]},{"title":"The Way That Knight Lives As a Lady","tags":["Drama","Fantasy","Manhwa","Romance","Time travel"],"disc":["Read manhwa The Way That Knight Lives As a Lady / How the Knight Lives as a Lady / From Knight To A Lady / Lady Yang Menjadi Ksatria / 그 기사가 레이디로 사는 법\nThe sword of my closest friend and trusted adjutant pierced my body. When I opened my eyes again, I had become a noble lady of the enemy kingdom. In an unfamiliar and weak stranger’s body, three year’s time was lost, in which my homeland was brought to ruin. I was unable to come to my senses because of the pain of betrayal and confusion of my identity. However, eventually I decided to live on as ‘Luciphella Aidine’, a noble who wields a sword."]},{"title":"Maseknam – A Sexy Magician","tags":["Drama","Fantasy","Historical","Josei","Romance"],"disc":["Reaad manhwa Maseknam – A Sexy Magician / Masek man – sexy man who performs magic / 마섹남-마술하는 섹시한 남자 / Masek Man – A Sexy Man Who Does Magic / Mr. Magic Man","Idol of the magician world, Korea’s greatest magician, Ma Masung! One day in the middle of Gwanghwamun, a woman in a swimsuit fell into his sports car and shouted, “Your Highness the Crown Prince!” Chundong, who’s been living in Korea after losing the memories of her past, recognises Masung as the Crown Prince ‘Lee Ho’ from Joseon as soon as she touches Masung’s body… Chundong, a Joseon shaman, and Donggung Palace where the ‘Gate of Time’ is opened. Masung, a magician with ‘mysterious power’. A magical romance that crosses over 500 years now unfolds."," "]},{"title":"Book of the Dead","tags":["Action","Fantasy","Horror","Manhwa","Mature","Philosophical","Psychological"],"disc":["Read manhwa Book of the Dead / Kitab Kematian / 사자의 서","In the Samdochon, a river that only those who have taken their own lives at a young age go to, there are three paths for those who arrive here. The ‘Path of Death,’ where one loses consciousness forever; the ‘Path of Contentment,’ where one lives on an island; and the ‘Path of Reincarnation,’ where one is reborn into a new life. What choice will the protagonist make?"]},{"title":"Transmigrating to the Otherworld Once More","tags":["Action","Adventure","Fantasy","Magic","Shounen"],"disc":["Read manhwa Transmigrating to the Otherworld Once More / 이계진입 리로디드 / Enter the Other World Reloaded / Reincarnated in Another World / Returning to the Otherworld Once More / Transmigrating to the Otherworld Again /임경배 / Jiya","When the King’s Heart burns down, a being that transcends the fate of this world will arrive on this land!\nThe boy from Earth, Sung Sihan, brought down a tyrant and saved the world.\nHowever, his happy ending was cut short when everything was taken away from him, and he was banished back to Earth.\nAfter 10 years of gritting his teeth, he prepares for his return…\nThe hero who has already saved the world once re-enters Terranora!\nTransmigrating to the Otherworld Once More (REloaded To The Otherworld)\nTransmigrating to the Otherworld Again manhwa\nReturning to the Otherworld Once More\nEnter The Other World"]},{"title":"The Possesive Tyrant and His Sleepy Cat","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Possesive Tyrant and His Sleepy Cat / 매일 밤 집착폭군과 잠드는 고양이가 되었다","I’ve found myself trapped in a mature-rated novel as a cursed cat, whose mere existence is believed to be harmful to the empire. This place has killed every cat in every alley all because of one prophecy… The moment anyone finds me will be my last moment in this life. “What’s this?” Before I could even think of escaping, the male lead, who’s fated to become a mad tyrant, effortlessly snatches me up."]},{"title":"How Can There be a Divorce When We Haven’t Even Married, Your Majesty?","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa How Can There be a Divorce When We Haven’t Even Married, Your Majesty? / 결혼도 안 했는데 무슨 이혼인가요 | 폐하","Ten years after the end of the territorial war that engulfed half the continent, a document with a seal of pure gold arrives at the estate of the war hero, Isaac Meserin. It’s a divorce decree from the Emperor addressed to his only daughter, Clicia Meserin, who isn’t even married yet.","As if the sudden divorce wasn’t enough to drive her mad, she is ordered to be exiled for ten years according to imperial regulations!","“Is everyone crazy? I haven’t even gotten married yet! What do you mean divorce!!!”","She can’t let this slide, so she decides to go to the capital to set things straight!","However, contrary to her confident initial plans, the situation keeps getting more complicated and entangled.","Clicia barely arrives on time, but she is speechless. Not because the bank was closed or her black card was blocked. But because of the wanted posters plastered on both sides of the bank’s main entrance—dozens of them."]},{"title":"What Does That Evil Dragon Live For?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa What Does That Evil Dragon Live For? / 그 악룡은 무엇을 위해 사는가","Story: Honaran Art: Manubi Original Work by: Lemon Frog Thursdays, All Ages Elaine becomes a human sacrifice to the evil dragon Rabess, who is here to destroy the empire. But it seems that Rabess already knows her. And he offers to grant her three wishes… Elaine feels she should at least save the world, so she asks him not to destroy it. Then she ends up returning 10 years in the past, to when she was 16 years old. However, Rabess seems to have a different plan in mind…"," "]},{"title":"I Became the Mother of the Bloody Male Lead","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Mother of the Bloody Male Lead / I Became the Bloodthirsty Male Lead’s Mother / I Became the Mother of a Bloody Male Lead / 피폐물 남주의 엄마가 되었다","When I opened my eyes, I became Sheriel, the mother of the male protagonist in the novel, A Wasteland Without Blood or Tears. In the original novel, the male lead, Cardicel, was famous for being cruel, so I looked at him with trepidation, thinking he would be different from the beginning, but what was this? My son, who will soon become the lead male protagonist, is so cute.","“We can’t let such a cute child grow up to be a person who imprisons and harms the female lead!”"]},{"title":"Frozen Apocalypse: No Chance of Survival","tags":["Action","Adventure","Fantasy"],"disc":["Read Frozen Apocalypse: No Chance of Survival / The King Of Snow","As the stars shift, the blizzards rage incessantly, the icy apocalypse looms just two days away. Food! Temperature! Violence! Dependence! In this dire situation, where human nature twists, does desire spawn monsters? How can one overcome adversity and seek the path to survival?"]},{"title":"Becoming A Family With The Duke and His Dear Son","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Becoming A Family With The Duke and His Dear Son / 남주 아빠가 파혼을 거부한다 / The Male Lead’s Father Refuses To Break Off The Engagement","After being transmigrated as Ibellia the Villainess, Soyoon strives to twist the plot in order to survive in her favorite web novel. Her plan is to break off the engagement with Duke Cassis Adelhardt and live a quiet life on her own. However, the Duke and his young son Lucius would not let her go so easily. “Lady Ibellia… Will you be Lus’ mommy?”"]},{"title":"Sijin","tags":["Fantasy","Manhua","Supernatural"],"disc":["Read manhua Sijin / The Brocaded Tale of The Girl Si / Like A Brocade/似锦/사금: 동평백부 넷째 아가씨\nA noble girl traveled back in time to when she were 15 years old. Her mistakes, and those who have harmed her and done her injustice. She will get revenge from all of them! A super smart female lead shall turn all of her misfortune around!"]},{"title":"A Sneaky Blind Date [Official]","tags":["Fantasy","Romance"],"disc":["Read manhwa A Sneaky Blind Date [Official]","All Naeun Kim ever wanted was to become the best surgeon she could be. She’s satisfied, even if there’s no time for herself. But when her power-hungry father sends her on a blind date, her life is thrown into chaos. Kangjoon Cha is a legend–and not just because of his powerful family. He’s a brilliant and respected surgeon in his own right. As busy as he is, it’s no wonder he’s single–unless there’s another reason. Can this pair thread the needle? Or will this relationship end before it starts?"," "]},{"title":"Logging 10,000 Years into the Future","tags":["Action","Adventure","Fantasy","Martial Arts"],"disc":["Read manga Logging 10,000 Years into the Future / High Martial Art: Logging In 10,000 Years into the Future, Awakening 10,000 Years into the Future, 高武：登陆未来一万年","At the dawn of a revolution in the era of martial arts, hordes of terrifying monsters start invading the world, defeating humanity’s warriors one after another. One day, Lu Sheng finds himself dreaming about the world ten thousand years into the future, where even basic physical training techniques have been modified and become several thousand times more effective! Breathing techniques, body strengthening remedies, martial arts scriptures, and so on… But with humanity being extinct in the future world, these once great martial arts have no one left to carry on their legacy. No one, except for Lu Sheng!"]},{"title":"Fell Into the Arms of a Mad Villain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Fell Into the Arms of a Mad Villain  / Falling into the Arms of a Mad Villain / 狂った悪党の胸に落ちた / 미친 악당의 품으로 떨어졌다","As soon as I was possessed by a 19-golden waste novel, I fell from the sky.\nIt is also in the arms of a crazy villain called the western mad dragon and killer.\nBefore you figure out what’s going on,","“Bride? Me?”\n“It’s my bride because she fell from heaven.”","The crazy guy hugged me tightly, calling me a bride!\nmurmuring repeatedly that the ‘trust’ was correct.","Edwin Crawford received a trust that he could only survive if he married a bride who fell from heaven.\nAs a result, I was destined to live as his bride ‘Angelina’.","In addition.","“I’m Jueri?”","To make matters worse,\nI’m the fairy family that’s being chased by the royal family?\nYou must join hands with Edwin to survive the imperial family.\nStarting today, my creed is ‘As the Villains Wish’!","*","“My bride is weak, so please close your eyes and wait.”","After gently closing her eyes, he gently pulled my hand and blocked both ears.\nI think I heard a scream just now. It’s my misunderstanding, right?","“Tha…… Thank you, Ed.”\n“Just words? I hate people who try to eat anything raw.”\n“What do you want?”","Edwin came close with a bright smile that seemed to be possessed.\nMy lips touched.\nSoon after, a frighteningly sweet voice was heard.","“Rina is my bride. Forever in the future.”","It is difficult because the arms of a crazy villain are too dangerous."]}]