[{"title":"Agatha","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa Agatha\n‘It was just my sin to love you…’ Queen ‘Agatha’, who just dreamed of a free life with a loved one. In front of her, who has lived with her eyes covered, the secrets of her kingdom, which have been hidden secretly, are revealed… the end of the truth faced in the dark. Betrayal and dark struggle, longing and love, human anguish and choice… Will she be able to hold onto the end of her dawn without falling apart?"]},{"title":"Ravishing Physician: Yield To Me, Your Royal Highness","tags":["Fantasy","Historical","Isekai","Manhua"],"disc":["Read manhua Ravishing Physician: Yield To Me, Your Royal Highness / Ravishing Physician: Yield To Me, Your Royal / Stunning Doctress: Just Obey Me, Royal Prince / Taming the Arrogant Crown Prince / The Medical Consort’s Realm / Dokter Yang Memukau: Menyerahlah Padaku, Yang Mulia / Juese Nuyi: Taizi Ni Jiu Congle Wo / Juésè Nǚyī: Tàizǐ Nǐ Jiù Cóngle Wǒ / 絕色女醫：太子你就從了我 / 绝色女医：太子你就从了我 / 싸가지도 치료가 되나요? / Invincible Beautiful Doctor : Prince Be My Man manhua\nNever mind if I became a peerless beauty, but I, a modern female doctor, actually traveled back in time and transmigrated into the body of a beggar that everyone scorns after getting into a car accident. Not long after, I’m brought to a brothel, where I accidentally found out that the brothel’s owner is actually the crown prince. The physician who saved me, on the other hand, is an ascetic person. A two-faced tsundere? A gentle and warm-hearted physician? Watch how I conquer them! Adapted from the original novel “The Medical Consort’s Realm.”"]},{"title":"The Grand Duchess of the North Was Secretly a Villainess","tags":["Fantasy","Isekai","Manhwa","Romance","Shoujo"],"disc":["The Grand Duchess of the North Was Secretly a Villainess manhwa, The Grand Duchess of the North Was Secretly a Villainess / La gran duquesa del norte era una villana en secreto / Великая герцогиня Севера тайно была злодейкой / 大公の正体が悪女で黒幕でした / 恶女公爵的真面目 / 북부 대공의 정체가 흑막 악녀라 곤란하다\nEloise Wayana, the grand duchess of the North, is executed by Emperor Caien Helisis after it is revealed that she was secretly a villainess all along. This marks the end of season two of the latest trending web novel, “The Crown of Blood.” As one of its avid readers, Kim Dakyung is eagerly waiting for the next season when she is suddenly hit by a truck on her way home! But once she reawakens, she finds that she is in the body of the grand duchess herself and has been teleported back to the novel’s beginning. Already knowing what road Eloise will go down, Dakyung is desperate to change her fate and survive until season three. Lucky for her, a younger version of Caien falls right into her hands, and she is going to do whatever it takes to keep him on her side."]},{"title":"Climbing the Tower that Even the Regressor Couldn’t","tags":["Action","Manhwa"],"disc":["Read manhwa Climbing the Tower that Even the Regressor Couldn’t / Climbing a Tower Which Even Regressors Couldn’t Conquer / I Will Climb the Tower That Even Regressors Couldn’t Conquer / 회귀자도 못 깬 탑 등반합니다","A friend who passed out while drinking suddenly said something strange. “Suhyuk, I’ve regressed.” “Regressed?” “Yeah, I’ve returned to the past.” “Are you crazy?” “You’re the only hope left for mankind.” And so, he was dragged into the Tower, but… it doesn’t matter! Regressor? Tower? Trials? Whatever they are, I’ll conquer this damn tower!"]},{"title":"An Hour Of Romance","tags":["Comedy","Josei","Manhwa","Romance","Slice of Life","Supernatural","Webtoons"],"disc":["Read manga 1/24 Romance / 24분의 1 로맨스 / An Hour of Romance\nPromoted at the speed of light, the star of JK Electronics, the ultimate career woman, yet always forever alone Cha Ju An! Kind, honest, full of vitality, and with the looks and physique to rival a model, yet bumbling fool Yoo Do Jin! With such different personalities, one day these two… #suddenly #withoutwarning #during #officehours switched souls?!!! Due to this switch, their lives are made a mess!! But what is the reason for this switch? And that reason is to match these two up by force! By the same author as What’s Wrong with Secretary Kim."]},{"title":"The Vampire’s Sons","tags":["Drama","Manhwa","Romance","Shoujo","Supernatural","Vampire"],"disc":["Read manhwa The Vampire’s Sons / The Sons of Vampires / 吸血鬼的儿子们 / 뱀파이어의 아들들","Years ago, vampire Im Sooyi immersed herself in the human world and found true love that quenched her thirst for blood. Fast forward to the present, she is now the mother of three very handsome boys; the reliable oldest, Seunghyun, the playboy CEO, Yusung, and the trouble-maker youngest, Hyesung. Although they are half-human, they still have some vampire traits that are hard to shake off. Will these boys be able to find happiness amongst the humans, as their mother did?"]},{"title":"Not Knowing The Betrayal Of That Day","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Not Knowing The Betrayal Of That Day / The Lady’s Remorse / 그날의 배신을 알지 못하여","After a hasty choice, I sold the most precious thing with my own hands.\nIn exchange for this betrayal, the only price given was the position of a noble’s second wife and such cruel abuse.","Tessa did not die and instead lived.\nAnd seven years had passed.","“Long time no see, Tessa.”","Hert, who she thought had died, returned.","He became a decent man.","*","“Do you long for your husband?”","Hert took turns looking at Tessa and the portrait of the old lord he had just seen.","“What if I killed that bastard?”","Tessa sucked in her breath at the terrifyingly cold voice."]},{"title":"Who Do You Like More, Mommy or Daddy?","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Who Do You Like More, Mommy or Daddy? / The House of Diana’s Choice [Official] / 엄마가 좋아, 아빠가 좋아? / Do you like mom or dad? / Do you like mommy or daddy? / Who Do You Like More, Mom or Dad?","Diana became an orphaned maid after her mother died. “This is now your legacy.” One day, a close friend of her mother appeared in front of her and gave her an enormous inheritance. But, her deceased mother had even more secrets than just her legacy— My mother is the only child of Count Ohrid, the continent’s richest person, and my father is the Master of the Red Flames, Grand Duke of Nohibaden, you say? “Diana will, of course, succeed Ohrid, Grand Duke.” “Diana is my daughter. She must succeed Nohibaden’s name.” Do I have to choose one between the two…?"]},{"title":"Be Honest With Me","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Be Honest With Me / 솔직하게 말해줘!","“What ‘filters’ do we use when we speak?” Godam, a college student who always hides her true feelings due to her timid personality, disappeared after collapsing on the street one day. A year later, she reappeared, revealing that she has a rare condition called ‘Riley’s Syndrome’… This is the story of a young woman with a rare disease called Riley’s Syndrome, a condition that causes her to speak out of turn."]},{"title":"I Took Away the Tyrant’s Virginity","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Took Away the Tyrant’s Virginity, I Took Away the Tyrant’s Chastity, I Took Away the Tyrant’s First Time, 폭군의 순결을 빼앗아 버렸다","“aah, i like mans with big chests.”","The man whose chest was exposed in the sunlight was very handsome…… Wait, who are you? Why are you naked next to me?","“Your Majesty…… the Emperor?”","Unbelievable. It seems that she unintentionally spent a night with a tyrant at the masquerade.","“How dare you want to leave after taking the emperor’s virginity?”","No, last night, we both agreed!","“you have to take responsibility of taking my virginity!”","Did I?","Staring into those eyes that insisted on waiting for an answer, I……","“I-I will take responsibility, Your Majesty.”"]},{"title":"Damn Reincarnation","tags":["Action","Adventure","Fantasy","Shounen"],"disc":["Read manhwa Damn Reincarnation","Hamel, a warrior who traveled with his colleagues to exterminate the devil. Unfortunately, he died just before the battle with the devil started. “Yes.” What the hell? He was reborn as the descendant of his fellow warrior, Vermouth. The descendant from the bloodline of the great Vermouth, Hamel. No, he was now Eugene Lionhart. “It was already enough with me having the delusion that I was a genius in my past life. But… this… It’s… It’s incomparable.’ From a dying body to a new body, he has the achievement that he did not have in his previous life. And, a reincarnation of an unknown origin, the reality of living together with the demons. Facing a new world where everything is questionable. The journey of the unfinished previous life begins with Eugene’s body."]},{"title":"Unraveling Rumors","tags":["Drama","Romance","School Life","Shoujo"],"disc":["Read manhwa Unraveling Rumors, Law of Rumors The Law of Rumors, 谣言的法则, 루머의 법칙","“Seo-un University’s D***** A* Exposed!” Dareum An goes from a goddess to a social pariah overnight, all because of those five words, a baseless rumor, and an anonymous forum app for college students called EvCam. Just when she feels ready to give up on everything, Muyeol Lee appears and offers to help her find the person who ruined her reputation. Can Dareum clear her name and regain her perfect life? More importantly… can she really trust Muyeol?"]},{"title":"The Live","tags":["Crime","Drama","Horror","Manhwa","Psychological"],"disc":["Read manhwa The Live / 라이브","After losing his wife and daughter in a horrific accident, Yun-Jae finds himself stuck in his routine until he receives a diary from his future self. “I can see… my wife and daughter again?” Through winning the “games” in the “parallel world,” one will receive a “prize,” and using this, he could revive his dead family… but out of all the survivors of this cruel world, Yun-Jae is the only one with the knowledge of the future. Will he be able to turn his greatest wish into reality? The Live (Ant Studios)"]},{"title":"I’ll Save the Heroine!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Why Do I Have to Be the Sister-In-Law? / Why do you have to be sister-in-law? / Why Sister-in-Law? / どうして悪役小姑なんですか！？ / 改变嫂子的BE结局 / 왜 하필 시누이죠?","Imagine Lee Sangyeo’s surprise when she wakes up one day inside her favorite novel… and her horror when she realizes she’s in the body of the adorable heroine’s evil sister-in-law, Aylee Brydon! Knowing that the story will end terribly if nothing changes, Aylee is determined to save the heroine at all costs. However, her complete character reversal leads to problems in high society and causes friction with her cold fiancé, Duke Van Drave. At this rate, Aylee might be the one who needs saving!"]},{"title":"Former King","tags":["Comedy","Drama","Fantasy","Romance","Shounen Ai"],"disc":["Read Former King / 前任为王 / My Ex, The King","[Translated by Mosh Scans] After badmouthing the Gods, He Muyan was thrown into the system to be reborn infinitely. He was reincarnated as an elf in his seventh rebirth, when he realized the reality and planned to head in a bad direction before seeing a face he could never forget, his ex-boyfriend, Jin Yuanchen. How could he be here, and why had become a bandit, and kidnapped He Muyan to be Mrs. Yanzhai (Husband)? Bad show x Cynical evil","“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”"]},{"title":"Thiendavis – For The Perfect Salvation","tags":["Comedy","Drama","Fantasy","Historical","Magic","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Thiendavis – For The Perfect Salvation / 티엔다비스-완벽한 구원을 위하여"]},{"title":"The Rebellion of the Cursed Lady","tags":["Drama","Fantasy","Magic","MANGA","Manga","Romance"],"disc":["Read manhwa The Rebellion of the Cursed Lady / Noroware Reijou wa Seinaru Koushaku to Hangyaku suru / 呪われ令嬢は聖なる公爵と反逆する","Tina was born into the Valia family, a house renowned for their powerful command over magic, but when she fails to show any magical abilities, she is forced to live through daily taunts and abuse from her family. Then one day, Tina develops extremely rare dark magic powers. Unfortunately, dark magic is seen as a curse and those who wield it, abominations… Tina soon finds herself imprisoned in a shack deep in the forest. After a year of this solitary and cruel existence, Tina is barely clinging to life when a mysterious nobleman appears before her and rescues her from her prison. She awakes in the estate of the Duke of Lawliet, to find her saviour is none other than Reiner Lawliet, head of the family and wielder of Holy Magic. With the help of Reiner’s love, Tina’s wounded heart slowly begins to heal, but can she truly find happiness despite her curse?"]},{"title":"How to Get Rid of My Dark Past","tags":["Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manga How to Get Rid of My Dark Past / How to Get Rid of My Dark History / No soy yo, es mi oscuro pasado / 公女が黒歴史を消す方法 / 删除黑历史的方法 / 흑역사를 없애는 법\nReina, the only daughter of the Duke of Solei, who wears an eye patch in one eye and a black dye dragon on her left arm. The problem was that there were so many dark history committed To make matters worse, even the ones who knelt down and made me swear allegiance started running wild… and now I feel like I have to kneel down and beg. Reina’s story of struggling in earnest to clean up the dark past."]},{"title":"Reincarnation of the Suicidal Battle God","tags":["Action","Adventure","Manhwa","Martial Arts"],"disc":["Read manhwa A Battle God’s Second Chance, Reincarnation of the Suicidal Battle God / 투신전생기 / Reincarnation Of The Suicidal Battle God / To a New Life\nA time travel action fantasy of the strongest of mankind. “Even if the disgusting gods gave me this chance, an opportunity is still an opportunity. Since they want to end up dead, I will kill them.” The last survivor of mankind, Zephyr. The fight with the demons ended in defeat and the gods gave him a chance to go back 10 years in time. The demons who took everything away from humans and the gods who treated humans as beings for sightseeing. This time, I will tear them to pieces."]},{"title":"My Former Bias Can’t Find Out","tags":["Comedy","Josei","Manhwa","Romance"],"disc":["Read manhwa My Former Bias Can’t Find Out / Defend the Secret From My Former Bias! / Signé, fan incognito / 구최애로부터 비밀을 사수하라!","Like many before her, successful BL author Kwon Mina cut her teeth on fanfiction in her youth, writing sordid tales about her favorite stars in sensual scenarios with their bandmates. Now a professional novelist, Mina’s determined to write the best romance since the invention of paper and ink…and what better source of inspiration could there be than the one that started it all – her ultimate bias Kang Woobin! All is going well with her newest idol romance until – plot twist! – the very same idol-turned-editor himself is put in charge of her newest manuscript. Unsure if honesty or secrecy is the best way forward, Mina debates telling him about her past as his number one fan, but Woobin is no longer used to life as the main character and has made an effort to close the chapter on that part of his life. With Mina’s professional life hanging in the balance due to her provocative past, there is only one thing for certain: her former bias can’t find out!"]}]