[{"title":"The Blood Knight’s Villains","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa The Blood Knight’s Villains","“Dark World,” the game I, a thirty-year-old salaryman, had devoted my entire youth to. “What the fuck is this…” When I opened my eyes, Dark World had become my reality. The pouring rain, dripping hot blood, and a cold blade. At the moment of my impending death, I came into this familiar world."]},{"title":"Invincible After Shocking My Empress Wife","tags":["Action","Fantasy","Manhua"],"disc":["Read Invincible After Shocking My Empress Wife, Kaiju Zhenjing Nudi Laopo, Wo Wudile, 开局震惊女帝老婆，我无敌了","Ning Tian came to the Tianxuan World as a good-for-nothing but he somehow managed to get into the Empress’s bedroom and the extremely beautiful Empress Luo planned to marry him tonight?! Shocked! System activated! He can earn rewards by shocking others?! The beginning shocked the Empress and that was the first step for him to achieve his goal of shocking the whole world! Ning Tian looked at the countless prodigies and said, “No way… I was only cultivating casually and you guys are shocked by that already?"]},{"title":"Overlord of Insects","tags":["Action","Adventure","Fantasy","Manhua"],"disc":["Read manhua Overlord of Insects / 我，虫族主宰 / The Zerg Overlord / The King of the Insects"]},{"title":"The Skeleton Soldier Failed to Defend the Dungeon [Official]","tags":["Action","Adventure","Manhwa","Supernatural","Tragedy"],"disc":["Read manhwa The Skeleton Soldier Failed to Defend the Dungeon / Gaikotsu heishi wa Danjon o mamorenakatta / Skeletal Soldiers Could Not Protect the Dungeon / Skeleton Soldier / Skeleton Soldier Couldn’t Protect the Dungeon / 骸骨兵士はダンジョンを守れなかった / 해골병사는 던전을 지키지 못했다"]},{"title":"I Thought It’s a Common Possession","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Thought It’s a Common Possession / I Thought It Was a Common Isekai Story / I Thought It Was a Common Transmigration / I Thought It Was a Common Possession / 흔한 빙의물인 줄 알았다","I Was the Villainess Who Would Die by the Hands of the Male Lead, but I Know This Cliché! I thought it was a pretty good deal to die unjustly, as a payment for the price I paid for being the villainess. Until I realized that I couldn’t escape from the original plotline. If I was going to die anyway according to the original, then let’s give a kiss to my handsome husband! “Please satisfy me like a snake flower of Ridelhoff. You never know, it might even lead to some benefits.” … Why did the original plot start to change?"," "]},{"title":"Necromancer’s Evolutionary Traits","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Necromancer’s Evolutionary Traits"]},{"title":"Start Invincible","tags":["Action","Adventure","Fantasy"],"disc":["Read Start Invincible, La invencibilidad comienza con los cimientos, 敌从筑基开始, 無敵從築基開始","Ye Wu took just two days to build his foundation, a peerless genius. Excited to leave seclusion, he was shocked to discover that two thousand years had passed, and his sect had long ceased to exist. Helplessly stepping out of the mountains, he found a world that was terrifyingly unfamiliar. Mighty figures could ‘fly’ through the air from afar, and powerful cultivators were in control from behind the scenes through ‘mobile phones.’ Ye Wu trembled with astonishment, utterly shaken. Little did he know that he might be the last cultivator on Earth, already unmatched in the mortal realm!"," "]},{"title":"Han Dae Sung Returned From Hell","tags":["Action","Adventure","Drama","Fantasy","Supernatural"],"disc":["Read manhwa Han Dae Seong Came Back From Hell, 지옥에서 돌아온 한대성, Han Dae Sung Returned From Hell, Retumed From Hell","On the way home from the third year of middle school. Han Dae-sung falls into hell without any context. At first, he wandered in hell for about a few days and despaired, but he said that he had to live. He starts fighting with the determination to return to Earth. Hell was like a game. A UI pop-up window like an RPG game appears in front of your eyes as a hologram, there is a status window, and you learn skills and acquire items. Even though he almost lost his life several times from the ferocious beasts of hell, he persisted and continued to grow. 10 years passed, 50 years passed, and 80 years were taken. He finally defeats the demon, the absolute lord of hell, and ascends to a new seat of power. [Would you like to return to Earth? until the message pops up. Hell is worthless. Daesung returns to Earth, feeling no need to stay in this place where there is only a desolate land covered in flames and magical beasts who cannot communicate. And when he wakes up in a hospital in Seoul, he realizes that only 10 years have passed since he fell to hell. Daesung, who was in a vegetative state on Earth for 10 years, receives rehabilitation treatment. At that time, a message that could only be seen in hell appears in front of his eyes. [The advent quest has arrived.] He accepts the system provided by hell and completes his rehabilitation training at an explosive pace while carrying out his mission. While hospitalized in his hospital room, Hell gave him quests relentlessly. Daesung’s skinny body recovers the body of those days, which was solidified by living in hell for 80 years. Let Daeseong finish his descent. The system of Hell invites them to the other side of the world called ‘Pantheon’. ‘Pantheon’ Based on the diary Daeseong wrote in his selfishness, the time and space of hell are recreated. Demonic beasts imprisoned in all the English spaces of Pandaemonium beg Daesung, the absolute, to save them. However, with the cold-hearted reply, “Fuck Daesung”. He himself declares that he will not fight anymore and will live normally. However, the hometown Earth, which should be peaceful, was in a state of air raids by beings from another alien dimension, and the ‘great upheaval’ began on the day Daesung fell into hell. Since then, in the earth of cataclysm, in order to counteract the monsters that have entered the earth, a monster-specialized monster extermination certificate called ‘Hunter’ has been created. Daesung, who promised to live a normal life without fighting, makes one decision. home just returned. To protect the barely reunited family, the enemies from that extraterrestrial dimension must be exterminated. Having made up his mind to become a hunter, he ‘goes back and forth to the Pantheon and unlocks the powers of hell one by one. and your own world. He shows the real ‘hell’ as the absolute of hell to all who threaten his precious people. Daesung, who promised to live a normal life without fighting, makes one decision. home just returned. To protect the barely reunited family, the enemies from that extraterrestrial dimension must be exterminated. Having made up his mind to become a hunter, he ‘goes back and forth to the Pantheon and unlocks the powers of hell one by one. and his own world. As the absolute ruler of hell, he shows the real ‘hell’ to all who threaten his precious people. Daesung, who promised to live a normal life without fighting, makes one decision. home just returned. To protect the barely reunited family, the enemies from that extraterrestrial dimension must be exterminated. Having made up his mind to become a hunter, he ‘goes back and forth to the Pantheon and unlocks the powers of hell one by one. and his own world. As the absolute ruler of hell, he shows the real ‘hell’ to all who threaten his precious people."]},{"title":"The Dark Magician Transmigrates After 66666 Years","tags":["Action","Adventure","Fantasy","Manhwa","Reincarnation"],"disc":["Read manhwa Reincarnated Into A Warlock 66,666 Years Later / 66666년 만에 환생한 흑마법사 / A warlock reincarnated after 66666 years / A Black Wizard Reincarnated in 66666 Years / Black mage reborn after 66666 years / The Dark Magician Transmigrates After 66666 Years / 66,666 Years: Advent of the Dark Mage","The most dominant warlock, Diablo Volfir, eldest son of Earl Welton was sealed away in uncertainty for eons by all twelve gods. It’s been 66,666 years later, Diablo was released and descends back onto earth! “I’m free!” Let our journey begin!"]},{"title":"The Lost City of Alien Beasts","tags":["Action","Adventure","Fantasy"],"disc":["Read The Lost City of Alien Beasts / 异兽迷城2：麒麟工会","In the heart of the isolated island, a murderous intent surges. The city of despair reaches its end, with no escape in sight. Only by embracing death can one truly come to life, achieving ultimate mastery through nine cycles. If the blueprint of fate can be altered, even with the slightest chance—one in a million—we will fight with everything we have, battling to the very end, for the sake of hope!"]},{"title":"I Became A Part Time Employee For Gods","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa I Became A Part Time Employee For Gods / 신들의 알바나라","Devoid of professional skills, unemployed Yu Damduk, was forced to take a part-time job. Frustrated with his pathetic life he vents out on the gods, gets stricken by a lightening and passes out. [Hiring] God is waiting for you. When he wakes up he finds a status window floating before his eyes. Since I have nothing to lose anyway, let’s go with the flow… Jumping into God’s Part-time world to have a better life, the adventure of Yu Damduk who became the lowest-class God in the part-time world begins!"]},{"title":"A Blank Slate Regression for the Idol That Lost His Original Mindset","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa online A Blank Slate Regression for the Idol That Lost His Original Mindset/초심 잃은 아이돌을 위한 회귀 백서 at manhwa website","Yoon Eden lived the life of a B-tier idol who managed to get by. He is an idol of 7 years with fixed dead-fish eyes and the artist disease. [The 30,000th fan is disappointed in you!] [You have met the requirements.] [Project Regaining Your Original Mindset for the Idol that Lost His Original Mindset has started.] A day before he was withdrawing from the team, he was sent to the beginning of his debut, when he was a flop, to remember his original mindset. [※When your original mindset becomes 0, you will restart!] [※To complete the project, you must meet the requirements!] [You, who have disappointed 30,000 fans, must make 30 million fans happy! (0/30,000,000)] On top of that, to stop regressing infinitely, there’s an atrocious requirement of becoming an A-tier idol! “F*ck, my Cheongdam-dong house! My hundred millions of royalties! My savings account! My Ferrari!” [Profanity has been detected.] [Degree of Original Mindset -2] From his original mindset that is cut down just by breathing, and the pouring fan love quests, to the penalty for incompletion! A time of clearing up karma starting at the semi-basement dormitory for the idol who lost his original mindset and was hit properly by karma!"]},{"title":"The Genius Actor’s Aura","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Genius Actor’s Aura, Aura of a Genius Actor, 천재 배우의 아우라Aura, Genius Actor’s Aura","Shin Yoomyeong, an actor with a very low amount of presence.\nHe had spent his whole life on acting and had tirelessly strived to faithfully portray the small roles he was given although no one recognized his efforts.\nAfter 15 years, he found out that he had liver cancer and was unable to act anymore.\nFlooded with despair, he then met Miho, an acting spirit who told him that he could go back in time.\nOnce more, his life begins again"]},{"title":"My Husband and I Cannot Live in the Same World","tags":["Childhood Friends","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Husband and I Cannot Live in the Same World / 당신과 나는 사는 세계가 다르다","Mellie never fooled herself into believing she was more than a mere burden. Since childhood, she had been a leech to House Felton who relied on her mother’s friendship with the former Duchess Felton. Even so, it was inevitable that she came to harbor feelings for her most cherished playmate, Young Master Edric. But things start to change when Edric gets engaged. The former duchess begins treating her coldly, and her childhood friend insists that she remains by his side forever. Mellie has never had agency over her own life. But surely Edric has her best interests in mind, right…?"]},{"title":"All Football Talents Are Mine","tags":["Action","Fantasy","Manhwa","Sports","Supernatural"],"disc":["Read manhwa All Football Talents Are Mine / All Soccer Talent Is Mine / Soccer Talent Is All Mine / 축구재능 다 내꺼","Woo-hyeong dreamed of becoming a professional football player. But God didn’t give him the talent, and he died by a lightning strike without achieving his dream. Then, the demon Mammon appeared and gave him the ability to steal the talent of other players."]},{"title":"The Archmage’s Restaurant","tags":["Action","Adventure","Comedy","Fantasy","Manhwa","Slice of Life"],"disc":["Read manhwa The Archmage’s Restaurant / A Wizard’s Restaurant / The Wizard’s Restaurant / 어느 마법사의 식당","A man who was reincarnated in another world as a 9th class wizard and retired after saving the continent from a dragon war. He decides to open a small restaurant in the countryside, but his routine is anything but ordinary. On the second floor of his restaurant, there lives a black dragon who has transformed into a woman, named Rurin. She is greedy, cute and loyal to him, but also ignorant and clueless about the human world. They live a fun and warm life, serving customers, solving problems and growing violets in the garden."]},{"title":"I Can’t Wait To Eat You","tags":["Drama","Fantasy","Romance"],"disc":["Read manhwa I Can’t Wait To Eat You / I Can’t Get Enough of You / 못 잡아먹어서 안달","I have lived my life at the top, I have perfect skill, perfect appearance and I have lived a perfect life since the accident…. Everything was boringly perfect in my life until one day when I was 30 years old I suddenly met with the Daughter of the Driver who took the life of my parents working as an employee of the company of my family. “What the hell is she doing here in this place?”. I swore to resent her all my life when I was a kid, so I’m going to stick around to make her life impossible, I’ll make sure to eat her happiness away."," "]},{"title":"The World After The Fall","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read The World After The Fall manhwa, 멸망 이후의 세계 , The World After The End\nHumans were suddenly summoned to become “Walkers”, and they needed to clear the tower to save the world.\nThen, the “Regression Stone” was discovered. Walkers could now “return” to the past. And slowly… everyone left.\nHumanity’s last hope, “Carpe Diem”, was formed by people who refused to abandon the world.\nBut once the last Walker reached floor 100, he no longer knew what to believe.\nThis is the tale of the only man who didn’t regress, despite everyone else going back to the past"]},{"title":"I Will Change The Genre","tags":["Fantasy","Isekai","Romance","Shoujo"],"disc":["Read manhwa I Will Change The Genre / It’s Time to Change the Genre / Let’s Change the Genre / I Will Make an Effort to Change the Genre / It’s Time to Change the Genre / 장르를 바꿔보도록 하겠습니다","I entered the world of my favorite novel and genre through someone else’s body. Of course, out of all the characters, I just had to enter the body of the protagonist’s aunt, the woman who abused her nephew, the selfish villainess. According to the original storyline, in any case, my nephew was expected to leave my side soon. Compassion for him grew, so I put my most sincere effort into tending for him until the day we parted- “I realize it is rude in asking since you have been taking care of Luca until now, but may I take Luca to Winterwald with me?” There’s no way that won’t happen! I mean, I suppose I could’ve rushed to send him off and then live comfortably, but unexpectedly, my nephew wrapped his arms around my waist and shouted. “M-mom!” How did I become his mom all of a sudden?"]},{"title":"I Will Take The Duchy From Today","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Will Take The Duchy From Today / I’ll be Taking Over this Duchy / Hilde Takes House Arpeggio /  从今天起, 公爵府由我接管 / 公爵家は今日から私が引き受けます / 오늘부터 공작가는 내가 접수한다","I’m a princess?","Lucia Arpegio was the most powerful wizard ever.","However, she abandoned all of her power and duty because she was a terribly greedy woman, and ran away at night with her best-looking gardener.","And their daughter is me!","Strong mana is the evidence of noble blood and pride.","But in the Empire, the wizard’s blood is gradually disappearing.","With such symptoms, Duke Arpegio, the head of the four great dukes of the Empire, has suggested that I could become a member of the Arpegios if I could prove my powerful mana.","But I can’t please other nobles with the common blood flowing in me. Ignoring, cold, contempt, bullying… I aimed for a life of being a noble spirit and to live leisurely, but the path is difficult.","…Isn’t it too much where my life is threatened?","“You’re going to treat me as a dangerous person to the point where I could be eliminated, but you’re a dangerous person yourself. How does that suit morality?”","I’m at the end of my rope.","It was you who reached me when I wanted to live a nice and quiet life.","From now on, I will take this duke!"]}]