[{"title":"There’s 49 Left, Master!","tags":["Drama","Fantasy","Romance","Shoujo"],"disc":["Read manhwa There’s 49 Left, Master! / 49번 남았습니다, 스승님! / 師匠、あと49回死んでください","When the powerless thirteenth prince became emperor, he gave his tutor, Yo Yohwa, poison. His reason being his death at the hands of his own master in countless previous lives. The poisoned Yo Yohwa then regresses to an earlier time together with the prince and is determined to get on his good side this time in order to escape. However, the prince already discovered the truth… “This is crazy. You killed me in the previous lives, and you neglected me in another. Now you’re acting all nice. Are you trying to get away?”"]},{"title":"Say Ah, the Golden Spoon Is Entering","tags":["Fantasy","Josei","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Say Ah, the Golden Spoon Is Entering / Ah Yes, The Golden Spoon Has Arrived! / 아 하세요, 금수저 들어갑니다 / Oh Yes, A Golden Spoon!\n“I want to be able to fight for large property, not just those small side dishes! Let me increase the tension between parents and their children! Brother, I’m asking for a promotion!” And so, my miserable life as Korea’s number one ‘dirt spoon’ ended. Round two, and I’m back as the daughter of a chaebol! Moreover, I’m also the heir to the Sergio family, who’s gained complete control of the South! Although there’s some downsides being the sister of a villain, in the end, does it even matter? After all, I’m still fated to inherit the family at the end of the day! But things take a turn for worse, and my life goal to reach the top is jeopardized by my back-stabbing little sister. There’s two weeks until my father returns. During that time, he must somehow bring back the best groom of the empire. And that’s how the bridegroom expedition started. If you’re young, capable, and handsome, even better! Although it’ll take a little while… whatever. It’s a contract marriage anyway, so there’s no way to really confirm all those attributes. — Adelaide looks at him resentfully, not licking her lips. It may have be embarrassing in front of the statue-like Commander of Knights, but she’s already learned from the depths of her bones that this man is also a beast. “Ah… that’s it.” Killian approached her with a charming smile and locked her in his arms. A voice whispered against shoulder and into her ear. “You never said you had a problem with this.”"]},{"title":"Truly Refuse To Be A Witch","tags":["Isekai","Josei","Time travel"],"disc":["Read manga Truly Refuse to Be a Witch / I Refuse to Be a Witch / 实名拒绝做魔女[穿游戏] / Who Said I Want To Be a Witch?","After transmigrating as the ultimate villainess of an otome game, Andelle took the fact pretty well. As long as she took care of her reputation and stayed out of all the events that could awaken her witch powers, she won’t become a stepping stone for the main character. But as it turned out… her ideas were well-planned, but reality was a different matter. Andelle: I just want to quietly live my own life. As long as I stay out of the way, I won’t end up dead. But the stupid system only wants to see me suffer, forcing me to admit inferiority!"]},{"title":"Love Destiny","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Love Destiny / Bhuppae Sunniwat / บุพเพสันนิวาส","Su-yeon, a Korean girl who loves Thai culture, goes on a field trip to Ayutthaya with Ruan, a junior she secretly has feelings for. But an unexpected accident occurs, causing her to end up in the body of the villainess Mae Karaket in the Ayutthaya era. To make matters worse, she now has a fiancé, Khun Meun Sunthon Thewa, who dislikes her more than anything. “Other people get to time-travel back to the Joseon era, but I end up crossing countries?!”"]},{"title":"I Made a Deal with the Devil","tags":["Adult","Demons","Drama","Ecchi","Fantasy","Mature","Romance"],"disc":["Read manhwa I Made a Deal with the Devil","Shamelessly betrayed by her fiance and cruelly framed by her family, Eva Young swore to herself that she would make everyone who had wronged her regret. She would pay them back tenfold or more even if it means she had to make a deal with the devil himself! She was fully prepared to pay a heavy price in exchange for getting what she wanted vengeance! However, the surprisingly handsome devil only wanted one simple kiss from her every night?"]},{"title":"I Became the Villain’s Mother","tags":["Fantasy","Historical","Isekai","Manhwa","Romance"],"disc":["Read manhwa I Became The Villain’s Mother / I Became the Mother of the Villain / Me convertí en la madre de un villano / Menjadi Ibu Antagonis / Я стала матерью злодея! / คุณแม่มือใหม่ของจอมวายร้าย / 反派的继母 / 悪党の母になりました / 成为反派的继母 / 某天我成了恶棍的继母 / 악당의 엄마가 되어버렸다","I have become the mother of “Ain Spenner”, the antagonist of a novel. I was supposed to be a bad stepmother who abused him as a child and was killed by him when he became an adult. But I saw the cute look on his naive and chubby face, “No, he’s so cute. He’s so young that he’s still sucking on his tiny fingers! How could I ever hurt him?” The child was so cute that I couldn’t believe that he would become a villain. And so, I decided. I will protect him! This way, he will protect me too! ~~~~~~~~~~~~~~~~~~~~ Ain’s cute little face stared coldly at Duke Cassius, “I told you not to touch me.” “Why should I listen to you?” The tension rose between the two. “You never really even liked her.” the duke’s eyes widened, no way… did Ain think of Roselia as more than a mother? Cassius could not believe it. “Stop scaring her, she might run away.” Ain said. Ain was worried that she would leave and never come back. Duke Cassius couldn’t believe it, his only son was obsessed with Roseria."]},{"title":"I Refuse the Regrets of a Traitor","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Refuse the Regrets of a Traitor","Kasia, who married her love-at-first-sight, Douglas, is handed divorce papers and thrown out of the mansion after only three years. However, Kasia’s natural business acumen leads her to become a wealthy tycoon. One day, Douglas, having lost everything, comes crawling back on his knees, begging for forgiveness. Kasia decides to give her former husband another chance, only to have her property’s ownership transferred without her consent and suffer physical abuse. “Am I going to die like this? If only I could go back in time, I wouldn’t be deceived by such a villain… No, I’d make sure to take my revenge.” Just as her consciousness fades, she inexplicably finds herself back in the past before her divorce—ready to change her fate."]},{"title":"When Cinderella’s Magic Fades Away","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa When Cinderella’s Magic Fades Away / 신데렐라의 마법이 풀린 후","Ellenoa doesn’t dare dream of a happy ending. Treated like a lowly housemaid by her own family, she decides to rewrite her fate by approaching Duke Enoch Bayern Frederich, a jaded rake shrouded in cynicism and disillusionment, with an offer he cannot resist–a glimpse into the future in exchange for a year of companionship. He agrees to the contract, not knowing that the knowledge comes with a dreadful cost–one that could claim Ellenoa’s very life."]},{"title":"Actually, I Was the Real One","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Actually, I Was the Real One / I Am The Real One / 其实我才是真的 / 사실은 내가 진짜였다 / Sesungguhnya, Akulah yang Asli","In order to receive love from her father, Keira tried her hardest to live the life of a perfect, submissive daughter. However one day, Cosette appears claiming to be his real daughter and Kiera is executed under the assumption that she is a fake.\nIn the last moments of her life, Cosette whispers to Kiera “Truthfully, you were the real one.”\nKiera, recalling those words, returns to the past. Although revenge is important, what does it matter who is fake and who is real? Now that I have been given a life again, I will live it freely for myself! A coming age of romance of a cute female protagonist who has never made friends."]},{"title":"No Place for the Fake Princess","tags":["Action","Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa No Place for the Fake Princess / There Is No Place For Fake / Tuan putri yang salah / Philomel the Fake/ 가짜를 위한 장소는 없다","Conspiring with her mother to impersonate the princess, Philomel – a fake princess who caused the war by separating the tower and the empire – is executed when all sins are found. Truly suited to be the villain…..","“I mean, it’s not enough to kill the Philomel in the book for her mistakes!” Philomel shouted and threw the book she was reading. She was just curious about the suspicious book she picked up in the garden, but the Princess Philomel in the book, just die!","“Which big guy wrote a novel with the background of the real imperial family?”","I want to believe that it is only fiction, but somehow everything that happens after that looks exactly like the book. “As long as this happens… the only goal is survival!” 9-year-old Philomel changes her reputation to survive, finds Ellencia, the emperor’s real daughter, and leaves for a new life. But…","“Come find my daughter right now!” The emperor, who knew he’d hate her, opened his eyes and looked for her.","“I’m here. Come back with me to the Imperial Palace.” As well as her fiancé, who had seemed uninterested in her.","“What’s wrong with coming to see my daughter?” Even her biological father begins to intrude into her life?","Will Philomel be able to reveal the identity of the suspicious book and find her new life? A long romance fantasy."]},{"title":"Dangerous Dungeon Escape","tags":["Action","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Dangerous Dungeon Escape","Go Insung did not pass onto hell or heaven after suddenly dying, but instead onto a dungeon. A place in between the afterlife and the world.","And it’s no normal dungeon, but one with a system.","While being watched by the numerous dead of the afterlife, Go Insung has to clear the dungeon with the other challengers in order to escape."]},{"title":"I Am the Last Villainess He Has to Kill","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Am the Last Villainess He Has to Kill / I Am the Final Villainess He’s Required to Kill / 그가 죽여야 할 최종 악녀가 저랍니다","When people get transported into novels, they usually end up as noble ladies, even if they’re villains. But I ended up as the final monster that the male lead must kill—the daughter of the Demon King. “Here’s your favorite finger necklace, Princess!” Abduction and murder are the norm among demons. I can’t live with these creatures for 5,000 years! I just need to endure it, fulfill my role according to the original story, and move on to the next novel! Oh, God. How is this even possible? This isn’t some stray cat adoption; it’s like adopting the male lead! And the eight-year-old Kiel is saying some very ominous things. “Can I eat you?” “Well… I’ll raise you with care, so come kill the Demon King’s daughter later.”"]},{"title":"A Transmigrated Warden’s Battle for Redemption","tags":["Action","Fantasy"],"disc":["Read A Transmigrated Warden’s Battle for Redemption, The Wardern That Watches Over the Witches, The Witch-Guarding Warden, Kanshou Monvmen De Dian Yu Zhang, 看守魔女们的典狱长\nThe Puwei Iron Prison in the City of Silver is recognized as the strictest and strongest women’s prison in the entire continent. It gathers the most dangerous and vicious female criminals on the continent, and I——Aiden is the warden in charge of managing this prison. But the original “Aiden” is a strong man who is proficient in spear, sword and even black magic! I’m just an ordinary person who transmigrated to him, and I don’t even know the fighting skills mentioned above…"]},{"title":"Whose Baby is it?","tags":["Comedy","Drama","Fantasy","Shounen Ai","Webtoons"],"disc":["Read manhwa Whose Baby is it? / 哪里来的大宝贝","A fortune teller says that I was born with bad luck… Who is she trying to fool? My son is a biracial baby with super powers, who can use dreams to predict the future! But then a tyrannical CEO comes out from god-knows-where and says he’s my little treasure’s dad?! What is this, a TV drama?"]},{"title":"Movies Are Real","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Movies Are Real","While working as a small supporting actor in a movie, Ki Man Sung has nothing else going for him. However, that was when ,through mysterious circumstance, the movie set had become reality during filming. With the sound of the director’s cut, during that short take, he’s not an actor but actually thrown into the events occurring, showing the pain and emotions he faces in that moment. He can only come back if he creates that perfect take…! Can he grow to become the greatest actor?"]},{"title":"Look Here, Demon Lord!","tags":["Romance"],"disc":["Read manhwa Look Here, Demon Lord!","Though she’s illustrated many webnovels, Yejin never thought she’d wake up in one as Princess Elina following a random bike crash. Just when she’s looking for a way back to her original world, the demon lord’s butler shows up and offers her a tour of his castle. And so, Elina jumps at the opportunity to travel to the demon realm and learn magic that can transport her back to her own dimension. Little does she know that the demon lord’s servants are scheming to make her his bride so he can produce an heir and strengthen his political power…"]},{"title":"Teach Me Desire","tags":["Adaptation","Drama","Fantasy","Historical","Josei","Manhwa","Mature","Psychological"],"disc":["Read manhwa Teach Me Desire / Please Teach Me The Desire / 욕망을 가르쳐주세요","“I heard you lived as a saint… … Do you know about the night?” As a saint, Beryl has a duty to find and purify the demon family. After two lives and two deaths, she finally goes to the real demon. With a desire for revenge on humans who are more demonic than demons. “Since you said you wanted to learn about desire… I will give you a night that even gods will forget.” However, the demon she faced directly was extremely corrupt, irreverent, sweet, and addictive."]},{"title":"World Rank No. 0, Please Stop!","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa World Rank No. 0, Please Stop! / 세계 서열 0위님, 제발 그만해 주세요","[Welcome to the possession of Lee Jueun ^O^] Suddenly, a status window appeared and I found myself transmigrated as a minor antagonist in an internet novel where the female lead, ranked no. 0 in the world, goes to school disguised as an outcast! I am in charge of playing the role of the villainess’ minion no. 3 who bullies the female lead with the lines, “Hey are you ignoring me? Do you think this is a joke?” There is only one way to escape from this absurd world and role before the female lead reveals her true self and leaves me with an 8-week injury. [If you create a happy ending, I will grant you a wish! >ㅁ<] I have to give all the characters in this internet novel a happy ending to make my wish come true. But… “Are you the big shot of this school? Haha, our boss wants to see you.” “What if I refuse?” “Eek! Are we facing off against Haesung High today?!” …Can I really make these characters happy? This is truly madness."]},{"title":"It’s Just a Superficial Intention","tags":["Drama","Fantasy","Manhua","Romance","Supernatural","Time travel"],"disc":["Read manhua It’s Just a Superficial Intention / 不过是见色起意","In her previous life, Zheng Wenyan, the future star of Yongdong Group, mistakenly trusted the scumbag Zhao Yushun, married him, and cultivated him with all her strength to help him take revenge on the Li family, but she eventually discovered that Zhao Yushun had been having an affair with his second uncle’s cousin Zheng Minzhen. Zheng Wenyan was completely betrayed and died with hatred. Now, Zheng Wenyan has been reborn and returned to the day when she was about to get the marriage certificate with Zhao Yushun. She is determined to rewrite history and make the betrayers pay the price!"]},{"title":"Blade of Retribution","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Blade of Retribution / 폭력의 대가","On the day that Kendo Champion Shiho decided to help out his single mother run a Gukbap restaurant, he received news that his sister, Shiyeon, committed suicide. During the funeral, Shiho realizes that something was wrong. It wasn’t a suicide, she was murdered. In order to learn the truth and get revenge for his sister’s death, Shiho lifts up his sword once more to begin a war of his own."]}]