[{"title":"My Wicked Little Girl","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa My Wicked Little Girl / My Little Deviless / My My Little Devil / Little Villainess / My Little Wicked Girl / My Young Villainess / 나의 어린 악녀","Roe, the main character, has difficulty understanding the feelings of others. One day, she witnesses a murder scene and is branded as the culprit. Framed and called the “Diabolical Witch—Murder,” she dies by her father’s hands. However… She who definitely died before her father’s resentful gaze somehow reincarnates into her 15-year-old self, five years before her death. As a blunt person who cannot sympathize with or understand other people’s feelings, Roe only thought it to be annoying to have to repeat the same life again, and… Contrary to her expectations that it would simply be a repetition of the past, her life gets entangled with life’s events and she starts heading in a new direction…! A Romance Fantasy full of her development, as transparent watercolors slowly spread into her once grey and monotonous life!"]},{"title":"The Nerd Turned Out to Be the Tyrant","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Nerd Turned Out to Be the Tyrant / The Nerdy Man Turns Out to Be a Tyrant /  陰キャな幼馴染が実は暴君でした /  너드남이 알고 보니 폭군이라 합니다","I’ve been reincarnated into an R-19 dark romance novel where the tyrant runs amok and kills all the characters.\nBut it’s okay since this is a remote countryside village far from the imperial palace, right?","All I need to do is live a peaceful life with my quiet childhood friend, “Lev,” who loves books.\nHe’s so kind and innocent, how can anyone not love him?","…I didn’t know then. My nerdy childhood friend…\nis the tyrannical crown prince male lead in the novel?!"]},{"title":"Path of the Shaman","tags":["Action","Adaptation","Comedy","Drama","Fantasy","Historical","Manhwa","Reincarnation"],"disc":["Read manhwa Path of the Shaman / The Grand Mudang Saga / MUGANG : The Path Of Shaman / Shamanism / Wandering Warrior of Wudang / Wudang’s Cheater Martial / Mudang Gihyeob / 무당기협","On his deathbed, the supreme dark leader is given an ironic second chance at life. He’s reborn as Jinmu, a young disciple of his rival clan, the righteous Mudang. Determined to make the best of a bad situation, he resolves to plunge the clan into corruption and debauchery by becoming their master disciple. Oblivious to this nefarious scheme, the Mudang begin to fall for Jinmu’s audacious approach to life and martial arts. Will Jinmu be the Mudang Clan’s downfall or just the kick in the pants it needs?"]},{"title":"Flee if You Can’t Avoid It","tags":["Fantasy","Romance"],"disc":["Read manhwa Flee if You Can’t Avoid It / 피할 수 없으면 도망쳐라","Hoping to get rich, Eunje signs a contract for a high-paying tutoring gig, thinking she just hit the jackpot. Expecting to find a cute middle schooler, she’s shocked to discover she’ll be tutoring her former classmate and man of her nightmares, Sooin! With his harsh way of speaking and rough manners, she is doubly surprised to find that when they’re alone, he’s not so bad. Will Eunje get to teach some simple math in peace, or will Sooin’s hidden soft side give her a quick lesson in love instead?"]},{"title":"A Hero Who Is Good At Everything","tags":["Action","Drama","Fantasy","Manhwa","Sci-fi"],"disc":["Read manhwa A Hero Who Is Good At Everything / 다 잘하는 히어로 /  A Hero Who Does Everything Well"]},{"title":"Surviving the Apocalypse","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Surviving the Apocalypse / Surviving the Apocalypse / 종말에서 살아남기","A boy was locked in a basement and trained his entire life. His deranged father, the one who confined him, declared,\n“The Apocalypse is coming.”\nNow, armed with the training and survival skills he had honed over years of practice, he must survive the impending apocalypse."]},{"title":"The Strong Man From The Mental Hospital","tags":["Action","Adventure","Comedy","Drama","Fantasy","Harem","Manhua","Martial Arts"],"disc":["The Strong Man From The Mental Hospital manhua\nThis is a world where evil creatures are gradually rampaging. However, the evil creatures are strong, they all disappear after this mental hospital, and even without dignity, they are reduced to ingredients and pets. This is the green mountain mental hospital, where talents are abundant and strong people are surrounded. In this regard, the seriously ill Lin Fan, who is carrying the system, said: I am definitely not a mental patient, I am a normal person who likes to cultivate. Usually is to touch the socket, climbing high voltage box, thunder days standing on the rooftop to the heavens dance a stick method."]},{"title":"Extroversion of an Immortal","tags":["Adventure","Drama","Fantasy","Manhwa","Romance"],"disc":["Read mnhawa Extroversion of an Immortal / A Not So Fairy Tale / 선녀외전","A fairy ‘Cheon Moran’, who killed a woodcutter for stealing her wings and lived like a celebrity while trapped in the human world, was discovered by ‘Sa Jeha’, a detective in charge of a murder case in which she was involved. Meanwhile, the closer they get, the more the whereabouts of the lost wings are revealed… A story of revenge, hate and love of a 21st century fairy trying to regain her wings."]},{"title":"This Time, the Tears Were Mine","tags":["Manhwa","Romance"],"disc":["Read manhwa This Time, the Tears Were Mine / 이제는 내가 울 차례였다","A noble lady unwanted by her family. A prince unwanted by his country. There was a reason why they gravitated toward each other. Andrea always dreamed of Prince Charming coming to her rescue. And she thought she found him in Kahir–the abandoned Prince of Ragenia. But when her stepsister schemes to marry her off to an old and perverted marquis, Andrea decides to take advantage of his love by seducing Kahir and asking him to run away with her. Believing her words, Kahir does away with the dirty marquis. However, his love for Andrea turns into hatred he realizes that she had used him to escape the unwanted marriage. Andrea soon regrets her actions, but Kahir wants nothing of her. Will the star-crossed lovers be able to find their happy ending?"]},{"title":"I Got Married to a Duke Called Beast","tags":["Fantasy","Manhwa","Romance"],"disc":["Read manhwa I Got Married to a Beast Duke / I Got Married to a Beastly Duke / I Got Married to a Duke Called Beast / I Got Married to a Duke Named Beast / I Was Married to a Duke Named Beast / I Was Married to a Peacock Named Beast / Married to a Beastly Duke / 嫁给了野兽公爵 / 야수라는 공작에게 시집왔는데","Duke Staton, with his vast estate and immense wealth, proposed to me.","Why did he propose to me? I’m the daughter of a noble family with no fiefdom bearing only the name?","In addition to that, there was a terrible rumor coming from the capital…","Read at Kaiscans.com to support us.","“Duke Staton is a beast without blood or tears.”"]},{"title":"Raising My Husband","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa Raising My Husband / I Will Raise My Husband Well / 남편을 잘 키워보겠습니다","When her happy married life is thrown into turmoil with the death of her husband, Lillian travels back in time to get another shot. But her mission proves challenging when her now-teenage husband turns out to be a little more immature than she was expecting…"]},{"title":"Dear Hong Rang","tags":["Childhood Friends","Drama","Fantasy","Historical","Manhwa","Mystery","Romance"],"disc":["Read manhwa Dear Hong Rang / Hong Rang / Shallowing the Gold / Tangeum / タングム / 呑金 / 탄금","When Jaeyi’s half-brother Hongrang suddenly disappears, she bears the brunt of her wealthy family’s scorn. 10 years later, a man claiming to be Hongrang appears, with much to gain should he truly be who he claims. Though Jaeyi can feel that something is off, the two seem somehow drawn to each other."]},{"title":"I Realized Only After Losing Her","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manga I Realized Only After Losing Her / Only Realised After Losing You / The Quiet Game / 잃고 나서야 깨달았다","Ellie was a girl who couldn’t talk or even write well.\nBy chance, she begins listening to three people’s secrets.\nThe three start to develop an interest in Ellie who hearken to their words.\nHowever, a couple of days later, Ellie disappears without leaving any traces.\nWith Ellie’s disappearance,\nHaiden, who confessed that he has a crush on a man.\nLennon, who enjoys games involving riddles.\nLabrador, who has a secret fetish.\nThe three men start searching for her, yet no one comes to figure out where she had left.\nSince they would only talk about their own stories and had no clue about hers.\nVoiceless Ellie.\nThat was my name.\n***(After the tables have turned)***\nI began to speak again and by the favor of someone truly dear to me, I became an “Earl”.\nThe commoner Ellie who once couldn’t talk, can now let out a voice as “Lady Phever”.\nAnd when the time came to reunite with the three people,\n“……Ellie?”\nThe Ellie you know from the past is now gone.\n“You’ve got the wrong person.”\nPerfectly spoken, the words echoed throughout my body."]},{"title":"Loving Summer Sky","tags":["Drama","Fantasy","Manhwa","Romance","School Life"],"disc":["Read manhwa Loving Summer Sky / 사랑하는 여름 하늘","Gihoo, who likes the sky more than people, takes pictures of the sky with his camera. Then one summer, ‘Haneul’ transfers to the seat next to him."]},{"title":"Holding You Captive","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Holding You Captive / Make It Impossible For You to Escape / 달아날 수 없게 만들어","Freedom is all our heroine wants, but that isn’t what she finds when she is summoned across worlds into the body of Lady Beatrice and is newly named “Regria.” As a “divine being” who can purify the minds of “divine knights,” Regria is expected to wed the Belligram Empire’s Prince Rahich, who only sees her as a tool that will keep him from going insane. But when Beatrice’s original soul finds Regria in a moment of danger, she tells her how she can be free: by untangling Rahich’s twisted soul and making him kneel at her feet."]},{"title":"Becoming The Villain’s Family","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Becoming The Villain’s Family,I Became the Villain’s Contract Family, 악당과 계약 가족이 되었다 ,\nBecome the family of the villian,\na name derived from an ancient creature, used to describe those who could charm, lure, control, and heal others by singing. Years ago, a siren named Sophia was kidnapped by Count Cortez as his prized siren, and a girl named Aria was born soon after as their daugher. Subjected to live the life of a siren, Aria had experienced, seen, and heard many horrific things. Others would do anything to hear her sing, to the point of insanity. The emperor, who grew obsessed with her, broke her legs and locked her in a bird cage deep within the imperial palace to hide her and keep her to himself. Broken beyond repair, Aria resigned herself to death, when suddenly… The Devil Archduke, LLoyd Cardenis Valentine, arrived and whisperd, “Should I kill everyone here?” “If you need me, just call me. Your song will always reach me, wherever you are.” In the end, Aria called the devil, bringing death to all those present, except for herself. “Let’s fall down to hell together.” And with that, Aria breathed her last and died… only to return back to her 10 year old self. Now that she has a second chance at her life, Aria is determined to change her fate, as well as the cruel future of her savior, Archduke Valentine. She proposes a contract marriage to him, with a divorce planned 10 years later, but he has other plans…"]},{"title":"Doctor’s Rebirth","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read  manhwa Doctor’s Rebirth / 의원, 다시 살다"]},{"title":"1 Million Times Attack Speed","tags":["Action","Fantasy","Martial Arts"],"disc":["1 Million Times Attack Speed, Million Times Attack Speed, 我有百万倍攻速","After being reincarnated into the Tianwu Continent, Ye Yun activated the Multiverse Devouring System and received the reward of a million times attack speed in the beginner’s gift package. From then on, he became an invincible powerhouse! As the saying goes, in the world of martial arts, speed is paramount. Do you think I was just picking my nose and cleaning my ears? In fact, I just executed thirty-five thousand people with a single sword strike and eighty-seven thousand people with a single sword swing, while also unleashing various boxing techniques and secret arts."]},{"title":"Surviving as a Genius on Borrowed Time","tags":["Action","Adventure","Fantasy"],"disc":["Read Surviving as a Genius on Borrowed Time","Jung Yeonshin was born with a short fate: being unable to live past the age of twenty.\nAlthough everyone in his family looked down on him, his skills were remarkable enough for him to create his own martial arts.\nOne day, Yeonshin realized that he doesn’t have much time left to live…\nThis is where Jung Yeonshin, a terminally-ill genius, begins his desperate struggle to survive!"]},{"title":"Forget My Husband, I’ll Go Make Money","tags":["Comedy","Fantasy","Manhwa","Romance","Slice of Life","Webtoons"],"disc":["Read manga Forget My Husband, I’ll Go Make Money / I’m Done with My Husband, I’ll Go and Make Money / Forget About My Husband, I’d Rather Go Make Money / 남편은 됐고, 돈이나 벌렵","I became the wife of a man who had a mistress. Then I must have kept his innocence, right?\n“Sleep on the floor”\n“What?” The eyes say I don’t want to!\nNo matter how hard the floor is, I have no choice.\n“I’ll just hold your hand and sleep. Trust me”\nBut, why did the bed break on my first night with my husband?\n***\nAristine is a princess imprisoned all her life, not allowed to be in front of the emperor. But the fact that she was the possessor of the [Eye King], she could see both the future, the present and the past.\nShe became the scapegoat for a political marriage, marrying a fearsome barbarian…\n“The most precious things should be given to my wife.”\nThe person who will soon become my husband seems very strange, but it is much more ordinary than I thought\nHowever, he has a mistress.\n“I have to make money quickly”\nWill Aristine really achieve her dream of living freely on a pile of money?\nOr will she end up killing two birds with one arrow that hits two targets?"]}]