[{"title":"Return of the Mad Demon","tags":["Action","Manhwa"],"disc":["The Mad Demon, Jaha Lee, dreams of becoming the God of Martial Arts.\nUnfortunately, his dreams are dashed after he falls off a cliff while running from the Demonic Cult for stealing the Jade of Heaven.\nYet this is not the end for Jaha — he awakens from the fall to find himself back in his 20s.\nWith his knowledge of the future and of martial arts, he now has a chance at revenge and at getting life right this time.\nWill he be able to fulfill his dream this time around, or is he doomed to face the same fate yet again?\nThe Return of the Crazy Demon\nReturn of the Mad Demon\n狂魔回帰\n狂魔重生"]},{"title":"I created an Urban Legend","tags":["Action","Fantasy","Shounen"],"disc":["Read manhua I created an Urban Legend, Wo, Chuangzaole Dushi Chuanshuo!, Urban Legend Chronicle!, 我，创造了都市传说！,Urban Legend Maker","Yuan ZhenSi transmigrates to a Parallel reality known as Jiang City, a world filled with horror and supernatural forces. Using his journal, ‘The True Records of Urban Legends,’ he creates legends that influence reality, fighting evil and anomalies. Together with comrades, they battle an impending apocalyptic anomaly."]},{"title":"Try Begging Me","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Psychological","Romance","Smut"],"disc":["Read manhwa Try Begging Me / Beg me / 내게 빌어봐","Captain Leon Winston of the Western Command of the Kingdom of Ripon, Domestic Intelligence Division. Despite his elegant and noble appearance, he is known as the “Vampire of Campton” for his relentless torture of rebels, making him both revered and cursed by allies and enemies alike. “I always wanted to shove my pistol into your narrow little cunt and stir it around.” Oddly enough, the maid of the torture chamber, Sally Bristol, became the object of his uncontrollable desire, much like the rage he felt towards the rebels. She was just an ordinary, unremarkable woman… So why did the scent of her blood keep arousing him? The mystery didn’t last long. The moment her name slipped from the lips of a rebel spy, he realized it. He no longer needed to suppress his violent desires. “I refrained because I didn’t want to hurt a good girl, but now there’s no need to hold back. Thank you, Sally. Oh, no… Grace.” If you want to live, beg me. You never know, I might just grant your wish. *Please note that this work contains content such as violence and coercive relationships, which may be polarizing."]},{"title":"Shut up, Evil Dragon, I don’t want to raise a child with you anymore","tags":["Action","Adventure","Fantasy"],"disc":["Read Shut up, Evil Dragon, I don’t want to raise a child with you anymore","After being defeated and captured, the dragon slayer Leon became a captive of the Silver Dragon Queen. With the awareness of death, he used forbidden magic to curse the queen, but unexpectedly, the queen lost control. He thought that this would make the queen live with shame for the rest of her life, and it would be worthy of the dragon slayer’s mission. But two years later, when Leon opened his eyes, next to him was a little dragon girl with a tail…"]},{"title":"The supporting character has no counterattack","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The supporting character has no counterattack / 조연의 반격은 없다"]},{"title":"The Beginning After the End","tags":["Action","Adventure","Comedy","Drama","Fantasy","Webtoons"],"disc":["Read The Beginning After the End manhwa","King Grey has unrivaled strength, wealth, and prestige in a world governed by martial ability. However, solitude lingers closely behind those with great power. Beneath the glamorous exterior of a powerful king lurks the shell of man, devoid of purpose and will.\nReincarnated into a new world filled with magic and monsters, the king has a second chance to relive his life. Correcting the mistakes of his past will not be his only challenge, however. Underneath the peace and prosperity of the new world is an undercurrent threatening to destroy everything he has worked for, questioning his role and reason for being born again."]},{"title":"Joseon Dynasty Erotica Records","tags":["Adult","Drama","Fantasy","Manhwa","Mature","Romance","Smut"],"disc":["Read manhwa Joseon Dynasty Erotica Records / 조선춘화실록","Seo Mina, a successful adult webtoon writer, might have a thriving career, but her dating life is a disaster. One fateful night, she discovers her boyfriend cheating on her with another man. In a chaotic attempt to retrieve her unused condoms, she tumbles into the Han River and is mysteriously transported back to the Joseon Dynasty! Struggling to adapt to her new reality, Mina’s fortunes take an unexpected turn when she sketches a provocative drawing of a naked man while working in the kitchens of a gisaeng house. Her bold artwork catapults her to fame, and she seizes the opportunity to create Joseon’s very own adult webtoon: a tantalizing collection of erotic drawings. Her work becomes the talk of the capital, captivating the women of Joseon. Just as Mina basks in her newfound notoriety, a mysterious stranger approaches her with an audacious proposition: “From now on, draw erotica for the sake of Joseon.” Faced with this absurd yet thrilling challenge, Mina’s adventure in the past is just beginning."]},{"title":"Healing Life Through Camping In Another World","tags":["Action","Adventure","Comedy","Drama","Fantasy","Manhwa","Slice of Life"],"disc":["Read manhwa Healing Life Through Camping In Another World / 이세계 캠핑으로 힐링 라이프","The Star chef, KangHyun, hid in a quite countryside after losing his sense of taste where he found A pathway to another world in his grandfather’s house. Since he was on the run anyway, he planned on enjoying a relaxing camp life, but… the people in the other world keep growing interested in KangHyun! Will KangHyun really be able to heal through experiencing a slow life?"]},{"title":"I Became a Tyrant’s Maid","tags":["Adaptation","Comedy","Drama","Fantasy","Isekai","Manhwa","Romance"],"disc":["Read manhwa I Became a Tyrant’s Maid / I Became The Tyrant’s Chambermaid / 폭군의 침방 시녀가 되었다","Youour Highness- That is absurd!! “Youour Highness, did you just cough-!!!” “It’s doomed! I’ve been transmigrated to another world! As an extra chambermaid from a 19+ imperovished novel from the early 2000s!” For now, I’m trying my best not to upset the male lead’s temper so I can survive and return home… “Youour Highness! Please have mercy!” “Youour Highness! That is such an absurd thing to say!” “Could you please stop with that damn antiquated language?!” Seems like the etiquette here is a bit different from what I know… Anyway, after defeating an assassin and taking an arrow for him, I feel like I’ve become somewhat closer to the male lead. The ominous journal that seems to understand my words, and the male lead, who orders me around, seems a bit fishy too. “Can I survive here and return home?”"]},{"title":"My duke is Not Dead","tags":["Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa My duke is Not Dead / 내 공작님은 안 죽어!","When I woke up, I arrived in a completely different world. It is the world in which the book called “The End of the Abyss,” which I read to the end, is filled with a sense of waste. Hee Jeon, who chose the book for the cover, was a mad crown prince who wielded deadly tyranny, and she became an unnamed extra hunter who lived in a village where demons constantly invaded and a demon hunter couldn’t enter in the capital.","However, it would have been better to meet the mad prince even if he had to avoid it. “Without my favorite, I can’t be in this book!” I don’t want to be there until the end! So he spent three hard years clamoring for his favorite, but with mixed feelings about not seeing it better. You mean, until you meet a man who completely forgets about his favorite face, and keeps shooting to his picky taste.","“That guy…” -That guy? Do you mean the aristocrat? Because it is? -You are so handsome. Laine, who barely swallowed the last word, exhaled a sigh that she didn’t even know she was stopping."," "]},{"title":"Sigrid","tags":["Historical","Manhwa","Martial Arts","Reincarnation","Romance","Violence","Webtoons"],"disc":["Read manhwa Sigrid / Air Susu Dibalas Air Tuba / 시그리드","She always lived by the rules. She thought her life had been honorable. She was loyal to the emperor, even at the cost of her life. But the only thing she got in return was the blade of the guillotine. Why? Why is it like this? She kept asking this before her death. However, when she opened her eyes, she had returned to 5 years before she died. “Was the way I lived wrong?”, she kept thinking. Sigrid decided to change her way of life. What to eat, what to wear, what to buy, everything. The way she changed led her to be the center of everything. Although, everything eventually started to go back to the way it was. And so, Sigrid comes face-to-face with her old rival and enemy, Veramud. “It begins by making friends.”"]},{"title":"The Male Lead’s Nephew Like Me So Much","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Male Lead’s Nephew Like Me So Much / The Main Male Character’s Nephew Really Likes Me / 남주의 조카가 나를 너무 좋아한다","One day, my life suddenly come to an end, but I reincarnated as a the female Villainess of a romantic novel who is obsessed with the male lead and dies in the original story for him. I decided to try to avoid that by leaving the capital and living peacefully on the countryside, however, my dad requested me to come back to the capital because there was a huge mess going on after it was reported that the royal heir whom everyone though died 7 years ago is actually alive…that kid also results to be the nephew of the male lead and he is looking for him!! I didn’t want to get involved with that but unfortunately on my way to the capital I stumble upon a poor kid that resulted to be the lost royal heir and that now is extremely attached to me. In the original story the female lead was supposed to find him so she could have the opportunity to meet the male lead, what will happen to my dreamed peaceful life now that the original flow of the story seems to be changing?!!"]},{"title":"I Became the Tyrant’s Servant","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Became the Tyrant’s Servant / 폭군의 간신이 되었다","A former call center employee finds herself transported into a fantasy novel, where she becomes the “servant” of the male protagonist, a cruel tyrant who kills anyone he doesn’t like and lives in lust. She doesn’t want to die like the original character, so she plans to escape before the tyrant finds the female protagonist, who is the only one capable of changing his heart. To do this, she begins to do business, buy ships and train concubines for the tyrant. However, her plans are thwarted when the tyrant begins to take an interest in her and pursues her relentlessly. Will she be able to escape her fate or will she fall in love with the man she was supposed to hate?"," "]},{"title":"Friends Shouldn’t Act This Way","tags":["Adaptation","Drama","Fantasy","Historical","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Friends Shouldn’t Act This Way / 친구끼리 이러는 거 아니야 / Friends Don’t Act Like This / I Swear We’re Just Friends","Rien is a transfer student at Arena Academy who wants a peaceful life. The successor of the Lisianthus Duchy fell in love at first sight with her. Carsion, who has the face of an innocent man, is a genius in magic, who excels in both looks and family background. He only has one flaw.; he always beats up anything that irritates him. “I like kind men.” Rien’s determination with such words, Carsion’s gentle face, and even the thought that this relationship will end once they graduate all clouded her mind. However, Rien still can’t help but feel attracted to Carsion. Can this friendship proceed smoothly?"]},{"title":"The Princess Has the Constitution of an Eagle Workshop","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa The Princess Has the Constitution of an Eagle Workshop / The Duke’s Daughter Prefers Solitude / 공녀님은 독수공방 체질입니다","I found myself reincarnated in a game where, no matter which ending you reach, the final boss kills you in the end. “Has no one told you? When you lie, here and here tremble.” I was sure my life was over… But then… “But from now on, I wish this would turn into a secret affair.” “A late warning, but you should’ve been careful from the start. Once you give in to someone like me, there’s no going back.” Final Boss, why are you acting like this all of a sudden?!"]},{"title":"Materialistic Princess","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Materialistic Princess / Materialistic Lady / 公女様は物質万能主義 / 要什么男主啊，我只要钱 / 물질만능주의 공녀님","One day, I woke up from being a poor college student as Princess Roselia Kanep from the novel ‘A Sculpture of Emotion’.","And by the way, she was the daughter of a poor noble family who’d squandered their wealth under her brother’s leadership. In order to earn a fortune, she uses the original content of the novel to approach Anoch, the crown prince who lost part of his soul under the curse of a witch.","“Your Highness, I’m an expert in emotions,” she said. And so, he started wondering if she could help him.","“Come on, put feeling into it! Emotions!” Roselia kissed Anoch’s lips.","A side character somehow deviates from the original plot?!"]},{"title":"In Between","tags":["Romance"],"disc":["Read manhwa In Between / 하는 사이\nKang Si-hwa, a natural extrovert, a person who was always the centre of attention, and Lee Eun-seo, who was jealous of those around him because Si-hwa was her special childhood friend. Si-Hwa, who suddenly disappeared one day came back several years later. Eun-seo’s heart is constantly shaking and Si-hwa’s actions are unpredictable. We have a special relationship, right? You think so too, right? but… I want to ask. Just what is our relationship?"," "]},{"title":"Reincarnated Escort Warrior","tags":["Action","Fantasy","Manhwa"],"disc":["Reincarnated Escort Warrior manhwa,\nMy dream is to become an escort warrior that rides on a cool horse and transports goods. But I’ve got a limp leg and I’m unable to learn decent martial arts. I’ve lived as a porter working odd jobs for the entirety of my life. Until I died because of the mountain bandits that I met during an escort mission."]},{"title":"The S-Class Little Princess Is Too Strong","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa The S-Class Little Princess Is Too Strong / S급 아기 황녀님이 너무 강해 / The S-Class Baby Princess Is So Strong"]},{"title":"My Villain Fiancé is Interfering With My Flowery Path","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa My Villain Fiancé is Interfering With My Flowery Path / 흑막 약혼자가 내 꽃길을 방해한다"]}]