[{"title":"Saving the Villain Who was Abandoned by the Female Lead","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Webtoons"],"disc":["Read manhwa Saving the Villain Who was Abandoned by the Female Lead / Saving the Villain from the Heroine","I tried to save the sub male lead, who was poisoned by the female lead, but an accident happened! He said he would repay the favor, but he randomly sent me to the most notorious villain, the Family of Assassins?! The family that consists of the oldest brother, a knight in the Imperial Army preparing for a revolt, the second brother, a reverend with a large bounty on his head, and a father who is the greatest villain of all time… Will I be safe in this villainous family throughout my three year contract?"]},{"title":"The Reason I Have to Be a Villain","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo"],"disc":["Read manhwa The Reason I Have to Be a Villain / The Unintentional Villainess / 不得不成为恶女的理由 / 悪女になるしかない理由 / 악녀가 될 수밖에 없는 이유","I had possessed a villainess.\nThat villainess was called the great madwoman of the Kingdom of Maconia, but I cheered because Rene Blair, the evil woman, had a lot of money!\nAlthough she was a character who died in the beginning of the novel, I thought I shouldn’t do anything bad.\nI’m going to be nice to everyone from now on. Or live without being involved with the original characters.\nSo I tried to do well.\n[Today’s mission: slap the waitress on the cheek] Until the crazy translucent mission window popped up.\n‘I’m going to be the maid from now on,’ I said.\nEither way, I’m a maid from my own mouth.\nI raised my palm, muttered as if I had it memorized, and then I hit my cheek."]},{"title":"The 31st Piece Turns the Tables","tags":["Action","Adaptation","Drama","Fantasy","Manhwa"],"disc":["Read manhwa The 31st Piece Turns the Tables / The 31st Piece Overturns the Board / 31번째 말은 게임판을 뒤엎는다","As a child, I fell into a strange dimension in a dream.","In my dream, I was an adult, dressed in clothes I’d never seen before and wearing a ‘mask’.","‘Now, it’s time to roll the dice.’","And so the dream game that began with the roll of the dice, the ‘World of Eternity’, became my destiny and my life, perhaps even my world itself.","As I rolled the dice with mysterious, nameless people, I was happy and joyous."]},{"title":"The Saint Dreams Of A Secret Love","tags":["Drama","Fantasy","Manhwa","Mature","Romance","Webtoons"],"disc":["Read manhwa The Saint Dreams Of A Secret Love  / 성녀는 은밀한 사랑을 꿈꾼다","Leah, who suddenly becomes a saintess, leads a secluded life in the academy’s auxiliary shrine before being publicly announced as the saintess who reappeared after 50 years. During her time at the academy, she meets a man in the quiet third library and ends up having a one-night encounter with him…"]},{"title":"MOONLIGHT LIBRARY","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa MOONLIGHT LIBRARY / Secrets of the Mystic Moonlit Library / 달빛 도서관","“You’re beautiful. It’s getting hot in here too, so my mouth is twitching.” “… … .” “I wanted to lick my fingers and toes, from there until they were all swollen. I won’t let go of my tongue until every pore in your body hurts.” This was the first time someone had said this to Luna. My whole body was hot. It hurt. It was the first time, so it hurt. ‘You, come back to your senses. You don’t would never say something like this when you came.’ Luna pursed her lips. Yes, she knew that he was crazy now, and that this feeling was just unrequited love. Luna was in a situation where she would be. Luna had a big secret that must not be revealed to her That is to say, she knew how to speak <language> which he shouldn’t have done."]},{"title":"The Queen’s Secret Lessons","tags":["Adult","Drama","Fantasy","Historical","Manhwa","Mature","Romance","Royal family","Smut"],"disc":["Read manhwa The Queen’s Secret Lessons / Ha Is the Queen / Heavy Warfare / 하는 중전","Boasting a kempt appearance and brains to boot, Yaha seemed to have everything required to become the queen. But she lacked one very important skill – the one required upon nightfall in his majesty’s chambers. After being ignored by the king on their first night as a married couple, Yaha’s anxieties multiply amongst rumors that the gorgeous court lady Seo-kyung has been reappointed. In order to overcome this challenge, Yaha summons a famous “novelist” to the palace for some private lessons. It’s clear that Yaha has much to learn, but just how far will they take these lessons…?"]},{"title":"The Unyielding Will to Die","tags":["Action","Adventure","Fantasy"],"disc":["Read The Unyielding Will to Die, Gentleman Wei Who Sees Death as a New Beginning, I Just Want to Die, 视死如归魏君子, 希死回生〜カリスマ過ぎてレベルアップできない件〜","Wei Jun knows that he will be invincible when he is killed, so he starts to seek death like crazy.\nBut then, he found out the whole world was toxic.\nWei Jun beat a debauchee silk-pants into the ground only for Wei Jun to be complimented that it was a good fight and Wei Jun should hit him again.\nWei Jun scolded the emperor until he was puking blood, but then the emperor swore to protect him for a lifetime.\nWei Jun stood up for the goddess of Heaven’s Destruction, who said she could only give her body to repay him.\nWei Jun: Stop it! I just want to die. Why do you have to make it so hard?!"]},{"title":"Artifact Reading Appraiser","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Artifact Reading Appraiser / 유물읽는 감정사"]},{"title":"Doctor, Go to Joseon","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance","Supernatural"],"disc":["Read manhwa Doctor, Go to Joseon / 닥터, 조선 가다","Is this really Joseon?! I still need to save lives! South Korea’s top genius surgeon, Baek Kang-hyuk, falls into Joseon after touching a mysterious painting. And it just so happens to be right before… the Imjin War breaks out!"]},{"title":"The strongest assassin gets transferred to another world with his whole class","tags":["Action","Fantasy","Shounen"],"disc":["Read The strongest assassin gets transferred to another world with his whole class / 最強暗殺者 /クラス転移で異世界へ / Saikyou Ansatsusha, Class Ten’i de Isekai e","The strongest assassin gets transferred to another world with his whole class\nAn ordinary high school student by day, an assassin living in the underworld by the night. A boy with two faces, Aragi Kai.\nHis classmates hate him because of his anti-social character and weird aura.","One day, Aragi and his classmates were suddenly transferred to another world.\nIt is a world of swords and magic. A woman who calls herself Leonora appears before the confused students, and declares…\n“You are ‘Hero Candidates’ summoned here to defeat the Demon King. Please help us.”\nLeonora grants each of the students a unique ability: ‘Divine Protection’.\nWhile some powerful ‘Divine Protections’ are given like telekinesis and destructive blast, Aragi’s ‘Divine Protection’ is judgment.\nIt is a skill that allows one to see the details of the target, but since he was always a loner in class, he gets mocked by them for having a skill that is useless in battle.\nHowever, he operates behind the scenes in the parallel world with his abilities as an assassin and his calm situational assessments…"]},{"title":"I Refuse to Be Executed a Second Time","tags":["Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manga I Refuse to Be Executed a Second Time","Ella Walker looks back on her life atop a guillotine. She was forced to cancel her engagement with Prince Gil in favor of her stepsister Isabella and demoted to rule a desolate hinterland. Then, the resulting riot leads to Ella getting executed. But after the execution, she somehow ends up reincarnated ten years into the past. Having been given a chance to do it all over again, Ella is determined to live her new life freely, without being tied down. She gives up her spot as Prince Gil’s fiancee to Isabella and decides to work hard to reform the hinterland as its new lord. But fate’s guillotine doesn’t leave Ella’s throat, with the blades of many trials to come threatening to stab her. Can she escape her destined death and obtain happiness…?"]},{"title":"I’m the Villainess, but I’m Happy Because I’m Healthy","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m the Villainess, but I’m Happy Because I’m Healthy / The Fitness Villainess / 악역 영애지만 건강해서 행복합니다 / I’m the Villainess, but I’m Happy Because I’m Healthy","“I’m the villainess!!”","Aslan recalls memories of her previous life.","By the way, she was a villainess in the game.","But her biggest problem was.","“Mother! You said these were all baby fat!”","1:1 ratio of height and weight.","That was the biggest factor that frustrated her.","If you do this, you will die from obesity.","“Must be healthy and enjoy the heavenly waters!”","It was a moment when her fate changed.","“Health is the best!”"]},{"title":"Don’t Cling To The Dead Villain","tags":["Fantasy","Romance"],"disc":["Read manga Don’t Cling To The Dead Villain","Isabella, scorned as the “failure of an older sister” to her saint younger sister, lived a life getting mocked. One day, she met a young vagabond named Raven. Though they spent time together like family, Isabella’s dormant saintly powers suddenly awakened. Her sister, learning of this, set a trap, leading to Isabella’s death.","However, Isabella’s life rewinded returning her to a moment before her demise. And there she encountered Raven again, who is now the Emperor of the Empire, grown and emotionally hardened.","“I will never love you,” he declared, indifferent to her now, with no memory of their shared past. Feeling unwanted, Isabella planned to resolve a particular issue and then leave him behind.","But then…","“Don’t go, Isabella.”","“…Your Majesty?”"]},{"title":"The Couple Breaker","tags":["Comedy","Drama","Josei","Romance"],"disc":["Read The Couple Breaker / 커플브레이커","Go with the existing obvious mating program! Various lovers who want to test their love gathered in one place. Some seek revenge on their lover who has transferred, and some couples want to become more famous or to confirm their true love… Super popular hit love entertainment program A Maramat Revenge Romance unfolding on the stage!"," "]},{"title":"‏I Will Fall With The Emperor","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa ‏I Will Fall With The Emperor / 황제와 함께 타락하겠습니다","“You, too, will be corrupted. Then I will make it all come true.”","If I had then joined hands and become his mistress\ncould I have lived a little longer?\nAt least she would not know the pain of her eyes being gouged out.","“I refuse. I will not betray my country.”","I only realized it when I came back 10 in the past and stood by your side.","Falling to the point of falling"]},{"title":"When Villainess And Villain Meet","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa When Villainess And Villain Meet / 악당과 악당이 만나면","Atalanta, the boss of an organization in the underworld of the Empire that was notorious against nobles. One day, she receives a request from the emperor to assassinate the tyrant Archduke Lionel Bianque. Atalanta, who wanted to live a normal life with her gang members, accepted his request. She infiltrates the Great Siege and attempts an assassination attempt… . But why don’t you die? Can Atalanta safely escape from the Grand Duke who whispers love in an instant?"]},{"title":"I Treated The Mastermind And Ran Away","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa I Treated The Mastermind And Ran Away / 흑막을 치료하고 도망쳐버렸다","Evelyn reincarnated into her favorite novel.\nBut unfortunately for her role, she is an extra who has enormous divine powers but is only taken advantage of by her and dies her miserable death.","She was adopted by the count’s family and endured all sorts of abuse and humiliation without using her divine power.\nAll in order to be kidnapped by the male protagonist of this novel, the cursed Grand Duke of Darkness.","“I heard a prophecy, and it said you could break my curse.”\n“Yes, but there is a condition. I need money to live outside this empire.”","In order to survive, she must pretend to be Cordelia, the goddess and heroine of the prophecy.\nAll Evelyn wants is freedom, not romance.\nHer contract went smoothly.\n… … Until it was discovered that Evelyn wasn’t the heroine.","“You dare not only deceive me, more so run away? The weight of that responsibility won’t be light.”","In the end, she closed her eyes tightly, wondering if she was going to die like this.","“Marry me.”","Huh?! Something is strange about the Grand Duke of Darkness?"]},{"title":"I Raised a Villain","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read Manhwa I Raised a Villain, 악당을 업어 키웠더니","I became an extra in the novel I wrote! Except, it’s not a romantic fantasy but a martial arts novel instead…\n‘But that means I get to see the male lead of my own work, right?’\nWith that positive thought in mind, *Yeon* sets out to find her precious male lead. However, before meeting the main character *Danmokchang*, she encounters his twin brother and the future villain, *Danmokbi*.","But now, as a child in the original story, *Danmokbi* is just a frail, thin boy in his teens, physically and emotionally devastated from experiencing the villain’s backstory.","So, she makes a vow: “I’m going to raise you so you don’t become a villain.”\nShe lovingly takes care of the poor young master abandoned by his family, intending to step away from the story after watching him grow up proudly.","But then…","“Why did you run away, Yeon?”\nHis bright smile is anything but kind.","“If you raised me, you have to take responsibility, Yeon.”\nIt seems this villain has no intention of letting her go."]},{"title":"The Baby Dragon Tames the Crazy People","tags":["Drama","Fantasy","Magic","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa The Baby Dragon Tames the Crazy People / Little Dragon Princess Tames the Crazies / 아기 용태자비는 미친놈들을 길들인다","Thalassa is the Emperor of Atlantis, the Empire within the Ocean. Contrary to her belief that she would live out her days happily and peacefully, she was betrayed by her lover and friend and eventually sealed away for a millennium. When she opened her eyes again… “To think that I, who was once the Emperor of a great Empire, have now turned into a tiny baby whose size is that of a baby crab!’ Atlantis has already fallen, and Thalassa has reincarnated as the baby dragon princess also known as the duke’s daughter of the nation that her traitors founded. And what? In order to break the curse, the dragon princess must marry the Crown Prince? ‘You sea anemone-like bastards!’ Not only does she have to uncover the secrets behind Atlantis’ downfall, but she’s also fated to marry the Crown Prince regardless. ‘Oh well, I’ll just go along with this until the Crown Prince’s curse is lifted!’"]},{"title":"I Still Don’t Know About My Favourite Character’s Unwavering Obsession","tags":["Fantasy","Romance","Shoujo"],"disc":["Read I Still Don’t Know About My Favourite Character’s Unwavering Obsession"]}]