[{"title":"The Almighty Daughter Runs The World","tags":["Adaptation","Fantasy","Josei","Reincarnation","Romance","Shoujo"],"disc":["Read manga The Almighty Daughter Runs The World / 全能千金燃翻天 / Putri Yang Mahakuasa Menguasai Dunia / Quánnéng Qiānjīn Rán Fāntiān / The Almighty Daughter Burns the Heavens"]},{"title":"Why Are You Obsessed With Your Fake Wife?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Why Are You Obsessed With Your Fake Wife? / 가짜 아내에게 왜 집착하세요?"]},{"title":"The Real Daughter is Back","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Real Daughter is Back / Revenge on the Real One / The Real Daughter Has Returned /진짜 딸이 돌아왔다","Helga Yttri, a half-noble lady who inherited the blood of a lowly maid. A bastard child who was swapped by the Duke’s maid; a Fake child. Helga gave her everything to be recognised as the real daughter. “Your Grace! The real Young Miss is alive.” “Her name is Hyllian…!” Helga prayed to God countless times so that the real Young Miss never returned. ” …don’t come back, Hyllian.” “Don’t come back, please.” She wondered if her prayers failed to reach God because she was a fake daughter. “Dear God, I’ve been praying countless times.” “I asked you never to let ‘that child’ return.” The prayers she howled until her throat went hoarse was all in vain. “The real daughter of the House of Yttri, Hyllian… The child who will destroy my whole world.” The real daughter is back."]},{"title":"The Delivery Man From Murim","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Delivery Man From Murim / Delivery Man From Moorim / The Delivery Man From Moorim / The Delivery Man From Murim / 무림에서 온 배달부"]},{"title":"The Tyrant’s Loyal Warhorse","tags":["Drama","Fantasy","Isekai","Manhwa","Reincarnation","Romance"],"disc":["Read manhwa The Tyrant’s Loyal Warhorse","A webtoon in the isekai genre where you become a pet, guaranteed to make you feel like flying high. This is the story of a middle-aged man who is reincarnated as a horse in the world of a novel he once read. Along with that, he’s stuck with a system that forbids him from going OOC (out of character) in his horse form. On top of that, there are characters acting like NPCs, constantly giving him quests to complete."]},{"title":"Betrayal of Dignity","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Betrayal of Dignity"]},{"title":"Monochrome Rumor","tags":["Drama","Shounen Ai","Supernatural"],"disc":["Read manhwa Monochrome Rumor / 모노크롬 루머","When I woke up after an unexpected car accident, K ended up possessing the body of a hopeless idol… He was nicknamed “Beautiful Trash”, a man who seemingly knows nothing but money and is involved in a messed up web of sponsors. There’s also rumors discarding his fellow members of 2 years in the midst of a contract with larger agencies? I thought I’d been scammed, but the original owner of the body was far from trash and was actually just leading a soap-opera like life. Frustrated from this reality of what he’s put through so far, I’ve decided to take revenge in his stead… With every shift in behaviour, those around me have started being tamed one by one. Despite the fact that his admirers have been increasing gradually, he himself isn’t aware at all?!"]},{"title":"The Time-Limited Black Screen Supports My Breakup","tags":["Comedy","Drama","Fantasy","Historical","Manhwa","Romance"],"disc":["Read manhwa The Time-Limited Black Screen Supports My Breakup / The Terminally-Ill Villain Supports my Broken Engagement / 시한부 흑막이 내 파혼을 후원한다"]},{"title":"Starting as the Black Dragon BOSS","tags":["Action","Adventure","Fantasy"],"disc":["Read manhua Starting as the Black Dragon BOSS, 开局兼任黑龙boss，我无敌了","The game has turned into reality, the era of the changing classes came!\nSu Yang changed his class and became a simple warrior.\nBut unexpectedly, he discovered that he had turned into the Level 99 Black Dragon Boss as well?\nThe first time he tried to connect with the BOSS, he encountered a level A guild standing in front of him?\nFacing those class changers who were armed to the teeth, Su Yang casually spewed a mouthful of black fire-\n[You have wiped out the “Spirit Hunt” guild]\n[Exp gained +990,000, level 1-20 (exp overflow, please change classes as soon as possible]\n[Obtained loot: Diamond Rank: Great Sword – Storm’s Call, class change scroll…]\nSlowly, the Black Dragon BOSS changed into a level 999 Abyss Lord.\nSu Yang realized he seemed to be invincible?"]},{"title":"Baek XX","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Baek XX / 백XX"]},{"title":"Killer Peter","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Killer Peter / Killer Pedro / 킬러 배드로","The Elderly Killer that had been betrayed, returns! But…No one recognizes me?! “I’m the strongest then!”"]},{"title":"The Villainess Wants To Go Home","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Villainess Wants To Go Home / 악녀는 집으로 돌아가고 싶습니다","A friend of the heroine, Lillie, possessed by the villain Astin. What saved me from the life of the villainess was my always friendly friend, Lillie. Lily was my everything. ‘If you stay by my side, Lillie might be unhappy’ So I decided to disappear from her side. All for a perfect ending. By the way… “Lician, why are you looking for me?” Why did the male lead, Lillie’s opponent, come and grab me with her sad eyes? “Don’t leave me alone.” Talk like you know me well. “I will help you get back to your place.” I couldn’t understand his words, but somehow I was relieved."]},{"title":"The Hero Became The Duke’s Eldest Son","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa The Hero Became The Duke’s Eldest Son / Hero Becomes the Eldest Son of a Duke / 영웅, 공작가 장남 되다","The Hero Became the Duke’s Eldest Son Synopsis:","Aden Albireo was called “The Dragon Slayer,” the hero who slayed the Berserker, and the Demon Lord, who ultimately, saved the world.\nBut he was betrayed by those who swore friendship and was left for dead…","“I never thought I’d come back to life!”\n15 years before the Demon Lord’s resurrection,\nThe reckless eldest son of the Duke, who was unheard of and unseen,\n“Aden Albireo” has returned in the body of “Aden Remes”!","And what’s more…","“Long time no see, Dragon King!”\nThe Demon Lord I thought I had slain is within my soul?!","Will Aden be able to end his uncomfortable cohabitation(?) with the Demon Lord and prevent his resurrection?"]},{"title":"Informer","tags":["Action","Adventure","Fantasy"],"disc":["Read manhwa Informer / 체탐자","‘Sejong’s secret weapon, Shadow Unit informer.’\nGwiyoung, called the Ghost’s Shadow, has been wandering around the battlefield since childhood.\nVowing to get revenge, he decided to become a member of the nation’s first special forces as an informer."]},{"title":"The Lady Wants to Rest","tags":["Drama","Fantasy","Manhwa","One shot","Romance","Shoujo"],"disc":["Read manhwa The Lady Wants to Rest / 쉬고 싶은 레이디 / 公女様は休みたい / 淑女想休息 / 千金小姐想休息 / Lady Wants to Rest / La Lady veut se reposer"," "]},{"title":"Sweet love is the end of revenge","tags":["Drama","Fantasy","Romance"],"disc":["Read Sweet love is the end of revenge",":** Celia Felix, celebrated as the “War Goddess of Garosflone,” is a fierce knight marked by a tragic past. After being betrayed by the second prince, Claude, she faces execution. Miraculously, she finds herself back on her 17th birthday, granted a chance to rewrite her fate. Determined to avoid her previous mistakes, Celia resolves to take charge of her family’s legacy. To gain the support she needs, she seeks out Kai Vernon, a powerful ally and former comrade. Their reunion reveals a gentler side of Kai, who expresses a heartfelt desire to help Celia realize her dreams this time around"]},{"title":"How to Survive as a terminally-ill Dragon","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa How to Survive as a terminally-ill Dragon / 시한부 드래곤의 생존법 / Survival Guide for a terminally-ill Dragon / How to Survive as a Dragon with Time-Limit","At the end of my terminally-ill life, I found myself reincarnated as a dragon in a webtoon. Once again, a life with a terminal illness, but this time, as a dragon?! Lois, born with the heritage of the strongest creature in the world with wealth and thousands of years of lifespan as a dragon. However, facing unpredictable crises at every turn, not knowing when Ill diewhat kind of Bullshit is this?! Its too unjust to just quietly die like this. Utilizing the future knowledge I have, Ill survive like a villain and give this story a twist!"]},{"title":"Difficult Boss","tags":["Drama","Fantasy","Manhwa","Office Workers","Romance","Slice of Life"],"disc":["Read manhwa Difficult Boss / 어려운-상사","seo eun-yu, the youngest employee in her second year at baekmoon group, belongs to the TF team led by baek ki-jo. The grandson of the founder baek ki chul, known as a talented person who studied abroad, Eun-Yu true identity is a spy under the order of choi seolhwa baek ki Jo’s new mother and political enemy! However, eun-yu, who fell in love with baek ki-jo the moment they met, is flustered when baek ki-jo, unexpectedly confessed his feelings. ” Just for one month” not as a boss but as a man, date me. Unable to refuse the baek ki-jo’ offer. Eun-yu begins a tightrope walk between Choi Seolhwa , who is watching her every action and baek ki jo, who is boldly approaching her."]},{"title":"The Genius Actor Who Brings Misfortune","tags":["Drama","Fantasy"],"disc":["Read manhwa The Genius Actor Who Brings Misfortune / 불행을 몰고 오는 처개배우","“You’ll get hurt if you’re close to him.”“I don’t know why he’s so unlucky.”“Yeonjae, I’m scared of you…”“Lee Yeonjae,” avoided by everyone as if just being near him beings misfortune.Even he thinks it’s weird.Why do bad things only happen around me?I wonder how it feels to live a life of being loved and not hurting those around me.","But, was even wishing for that too much? —Bam!!After an accident, I woke up in a strange place facing a mysterious entity.“Strange. You should’ve died according to your fate, so why are you still alive?”One truth I learned after meeting that entity is,[I can avoid misfortune if I act like someone else.]To survive, I have to become an actor."]},{"title":"Heavenly Demon Cultivation Simulation","tags":["Action","Adventure","Drama","Fantasy","Manhwa"],"disc":["Read manhwa Heavenly Demon Cultivation Simulation / Cultivation of Heaven / Murim RPG Simulation / เส้นทางสู่เทพมาร / 天魔玩家 / 天魔育成 / 천마육성","A scout in the infamous Demon Cult, Seolhwi is on a routine patrol when his squad unexpectedly encounters a fearsome master of the Mount Hua Sect, the sworn enemies of the Demon Cult. Without warning, the Mount Hua Cult master slaughters the entire squad. As Seolhwi lies dying, lamenting years of service to the cult with nothing to show for it, he is suddenly faced with a video game prompt, asking if he would like to start again. Given the opportunity to start over and make different choices, Seolhwi vows to survive and become stronger so he can rise to the top of the Demon Cult."]}]