[{"title":"Vows and Bullets","tags":["Action","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhua Vows and Bullets","Agent Selene and Agent Helios had always been at each other’s throats, competing as the top agent for the secret organization “Mythos”. But that competition would have to stop as they were suddenly called to cooperate for the hardest mission there ever was. Their cover—a married couple. However, when the mysteries were uncovered, their once friendly rivalry just turned into one hell of a reality. Driven by the ghosts of their pasts, they found themselves pointing the gun toward each other."]},{"title":"Superstar From Age 0","tags":["Action","Comedy","Drama","Fantasy","kids","Magic","Manhwa","Romance"],"disc":["Read manhwa Superstar From Age 0 / 0살부터 슈퍼스타 / Gong Salbuto Syuposeuta / Korean Idol","He had lived a thousand lives… some were long and precious and some short-lived, forgotten in the back of his mind. This time, he was born as baby Lee Seojoon. Elves… fairies… slimes… gift box… devils… he’ll use the mystical abilities from his past lives to captivate and capture the hearts of the people and become an idol, a superstar. Using the memories of his life akin to a fairy tale, he’ll become an idol that will be remembered in the annals of history."]},{"title":"Love Hug","tags":["Comedy","Romance","School Life","Shoujo"],"disc":["Read manga Love Hug / 拥抱青春的勇气 / 러브허그","Tsubasa has come to dislike boys because of their relentless teasing in the past. She enters high school, but refuses to attend soon after. However, with the support of her online friend Momo, she decides to go back…","Love & Hugs (French)\nSuki Hug.\nスキはぐ。\n拥抱青春的勇气\n러브허그"]},{"title":"Please, Forget About Vivian","tags":["Drama","Fantasy","Manhwa","Reverse","Romance","Webtoons"],"disc":["Read manhwa Please, Forget About Vivian / 비비안을 잊어주세요","“We’re getting divorce, Samuel.”","It was a matter of politics, but I got married because I loved him and I dreamed about a future with him.","But Samuel tells Vivian that she shouldn’t do anything.","“Even if you give birth a child, I don’t want one. So clear your mind.”\nEven the child.","The three-year of marriage gave Vivian despair, not hope.","But I had a baby.\nVivian decides to erase her memories and leave.","” Forget me.”","Read on manhwaclan.com. And the next day, Vivian disappeared without leaving a trace.","***","Vivian, who had disappeared, is back. Before her death.","Please, will you let me live?"]},{"title":"What Should I Do If I Found A Witch?","tags":["Comedy","Drama","Fantasy"],"disc":["Read What Should I Do If I Found A Witch? / Jiǎn Dào Mónǚle Zěnme Bàn? / What Should I Do if I Find a Witch? / 捡到魔女了怎么办？","Ji Zechen, a migrant worker, met a child who claimed to be a witch after work one day, and she even asked him to take her home with him? What should you do if you found a witch one day? You prepare yourself to take care of the little cub of course!"]},{"title":"Throw the Trash in the Trash cane","tags":["Comedy","Drama","Manhwa","Mystery","Romance"],"disc":["Read Throw the Trash in the Trash cane , 쓰레기는 쓰레기통에 , Trash in the Trash can!, Put the Trash to Where It Belongs! ! Woobin’, who uses his good looks to seduce rich women and has lived like trash.He ends up falling in love with Suzy’, a chaebol heir who was only supposed to be a target of his seduction.He experiences the sweetness of love for the first time,But it lasts only for a while because what’s hidden behind Suzy’s angel-like appearance begins to slowly choke Woobin.A romance story of two trash-like humans who can’t even be recycled!"]},{"title":"Wail Of Weakness","tags":["Action","Fantasy","Supernatural"],"disc":["Read manhwa Wail Of Weakness, The Wailing Perversion, Crying Disgust, Crying Revulsion, The Old Howling, 울부짖는 역린, The Roaring Dragon’s Emblem","Ananta, a barbaric warrior cursed by a demon god. In order to punish the incarnation of the wings, who turned his fate into a tragedy, he endlessly feasts on demon gods in a story of blood, sweat, flesh, and bones that yearns for revenge."]},{"title":"SSS-Class Assassin’s Return","tags":["Action","Adventure","Fantasy"],"disc":["Read manga SSS-Class Assassin’s Return","In the chaotic world after the invasion of reality, Mo Bei, as the backbone of the human coalition,","leads the team to kill the demon king who can be resurrected again and again.","But in one battle the demon and the human lost their top power at the same time,","the demon king mixed Mo Bei’s blood with his and one day deep in the blood river regenerated a half – man and half – demon monster."]},{"title":"I Was Adored by the Monster Marquess","tags":["Drama","Fantasy","Romance"],"disc":["Read manga I Was Adored by the Monster Marquess / I’ve Been Doted Upon by the Marquis / Who Is Called a Monster / 怪物といわれる侯爵から溺愛されました","An orphan girl with no name gains divine powers at the age of five and hopes it will change her life. Surely enough, the priest of the Empire’s pantheon, discovering her powers, take her to be adopted by a prominent duke of the empire… who mistreats her, robs her of divine powers, and starves her to death in the dungeons for the next decade. The heavens give her a second lease on life, and this time, she is determined to survive. In order to do that, she must seek help from the duke that opposes her former abuser. Will she find support from the enemy of her enemy so she can survive and get her revenge? Will she, in this life, have a life that changes for the better?"]},{"title":"Born as the Daughter of the Wicked Woman","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manga Born as the Daughter of the Wicked Woman\nI was born as the daughter of a wicked woman in a novel.","At birth, my mother had already been exposed to her evil deeds and was confined to the spire, and would soon face a miserable death in the hand of the main characters.\nI looked at my mother, who was still searching for her ex-husband until the moment she died and held her hands.\nMy little hand got tangled with my mother’s rough hand and her eyes full of warmth turned to me.\n“I understand Mom.”\n“….”\n“Don’t suffer anymore, sleep tight.”\nDon’t wait for the dad who won’t come.\nTears fell from my mother’s eyes at my words, and soon she fell asleep peacefully.\nSince the novel’s “Wicked Woman” is now dead, her daughter, I will be beaten to death by people tomorrow night.\nAnd the second part of the novel will begin.\nA warm novel in which the daughter of the main characters begins her adventure full of happiness.\nBut I didn’t want to die, and I had no intention of letting the story flow that way.\n“It’s okay to be mean.”\nI decided to completely re-write the second part of the novel because it’s a life that may be killed anytime anyway.","Associated Names","The Wicked Woman’s Daughter\n악녀의 딸로 태어났다"]},{"title":"The Second Life of an All-Rounder Idol","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa The Second Life of an All-Rounder Idol / Second Life Millionaire / 인생 2회차 만능 아이돌"]},{"title":"Can’t pretend to be blind anymore","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manga Can’t pretend to be blind anymore / I decided not to pretend I don’t see it anymore/ No More Turning a Blind Eye / 더는 못 본 척하지 않기로 했다/I Can No Longer Pretend I Don’t See It\nI only found out after returning.\nMy husband had an affair, he had an affair right in front of me, I was speechless.\nThen there is no reason to wait any longer.\n***\nA sheet of paper flew over their white nudes, entangled like snakes. flutter, shake, shake\nThe falling squares of paper looked like faded wedding bouquets.\n“Let’s get a divorce.”\n“…What?”\n“You should know this when you decide to have an affair”\nI was going to go, but I seem to have forgotten.\n“Oh, I don’t have a dime to give you, so I’ll give you all the things I bought you. Everything, including the underwear, got stuck in that corner. ”\n“Why are you doing this all of a sudden?”\n“sudden?”\nA distorted smile was drawn.\n“You know better than me, you bastard”"]},{"title":"Genius Corpse-Collecting Warrior","tags":["Action","Adventure","Fantasy","Manhwa"],"disc":["Read manhwa Genius Corpse-Collecting Warrior","It has already been two years since I possessed a character in this insanely difficult game. In order to go back to Earth, I have no choice but to stop the downfall of this world and reach the ending of this game. [You have collected the body of a “pathetic soldier.” Inheriting abilities.] [Inherited rewards: Stamina +1, Proficiency +1, Dehaman’s Armored Combat (D)] I will see through to the end of this game no matter what!"," "]},{"title":"Your Wish","tags":["Comedy","Fantasy","Romance"],"disc":["Read  manga Your Wish","8 year old Yuna wished upon the Great Fairy tree for nothing else but true love, only for it to be granted by a demon that leaves her with a curse instead! Just when she finally got used to her horrible fate, she meets the same demon again years later. He claims to fulfill her wish for real this time, but he seems to be hiding something. Why does he want to grant this wish so badly?"]},{"title":"Marriage Substitute","tags":["Drama","Manhwa","Romance"],"disc":["Read manhwa Marriage Substitute / Husband Proxy / Marriage Agency / 結婚代行 / 결혼 대행","Mina’s world crumbles when her boyfriend of 9 years dumps her a month before their wedding. His shocking confession? He’s been cheating on her with her best friend, who’s now pregnant with his child. Mina’s revenge plan quickly unfolds: hold a fake wedding with Ryeohwi, her childhood friend, as her stand-in groom. As their fake marriage gains momentum, Mina begins to see Ryeohwi as more than just a little brother. Will this charade lead to unexpected love? Or is Mina just playing with fire?"]},{"title":"Little Princess Mint","tags":["Drama","Fantasy","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Little Princess Mint / 소공녀 민트","Mint, the most miserable girl in the orphanage. Everyday she received all kinds of abuses and she suffered through it, but one day a gentleman appeared in the orphanage and said, “I’ll take this child.”\nThe man that became the supporter of Mint, is a great aristocrat of Elkedonia…. ‘Is it okay for me to stay here?’ Mint who was an orphan girl turned to a little princess … Healing & Growth Romance!"]},{"title":"The Wicked Ladies in Waiting","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa The Wicked Ladies in Waiting / Bad Maids / 나쁜 시녀들 / Bad Handmaidens","Julia, who was born an orphan, was killed in exchange for falling in love with the Young Master of the Marjoram Family. But when she opened her eyes, at the same location as any other day, she was rescued by the Commander of the Imperial Army, ‘Carus’… She was hit by a curse of immortality, and this is now her eighth life. After realizing that she would be stuck in the loop forever if she didn’t take down the Marquis, she became a servant within the Palace to utilize the Royal Family’s power to demolish the Marjoram Family in her eighth life."]},{"title":"A Terminally Ill Villainess Refuses To Be Adopted","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa A Terminally Ill Villainess Refuses To Be Adopted / 시한부 악녀는 입양을 거절합니다","When the villain was young, she became Extra #1 who deceived him and sold him as a s*ave.\nThis girl, who was suffering from an incurable disease, tried to buy painkillers by selling him, but later dies miserably by the villain’s hand.","Fortunately, he had not been sold yet, so let’s kick the s*ave traders first.","Even as a 12-year-old orphan, I took great care of a 12-year-old villain.\nEven though he was young, he was wary of me until the time of parting came, perhaps because he was the villain.\nFortunately, I was able to get a promise not to be killed.","And the day the villain family came to take him back finally came.","“……Are you telling me to go away?”\n“If there is a place to return to, you have to go. Stay healthy and don’t die easily. Understand?”","After somehow sending away the villain who kept staring at me persistently, I turned around and vomited blood.","This annoying incurable disease.\nWell, it’s okay because I know how to fix it.","I would be able to start a new life if I could heal my illness and leave here.\nBut.","“You……”","……There was something strange about the villain’s prickly face that was looking at me."]},{"title":"A Tipsy Marriage Proposal for the Emperor","tags":["Drama","Fantasy","Manhwa","Romance","Royal family"],"disc":["Read manhwa A Tipsy Marriage Proposal for the Emperor / 술김에 황후가 되었습니다","Whether it’s beauty, status, or a Ph.D, Elliere has it all. But one thing she doesn’t have is luck with men, which she discovers when her prideful fiance dumps her for “being a know-it-all.” Enraged, Elliere storms to the bar and drunkenly rants about her troubles to a mysterious stranger, whose good looks inspire her to ask for his hand in marriage. Unfortunately for her, the man is none other than the cold-blooded Emperor Ropherce, who actually accepts her proposal! Poor Elliere has a feeling she’ll need more than liquid courage to survive as the tyrant’s unlucky new empress…"]},{"title":"It Turns Out You Are Like This, Secretary Zhou","tags":["Drama","Fantasy","Manhua","Romance"],"disc":["Read manhua It Turns Out You Are Like This, Secretary Zhou / 原来你是这样的周秘书","Falling in love with your boss? I, Zhou Xin, would never fall in love with him even if I jumped off the company building and died outside! Even if he is rich, calm, handsome, and loyal… Hehe, it smells so good.jpg If ordinary people’s love is emotional, it breaks through some constraints and prejudices, and is as warm and strong as the collapse of the sky and the earth."]}]