[{"title":"The Fish I Missed Was Big, but I Caught Another Fish Was Too Big","tags":["Comedy","Drama","Fantasy","Romance","Shoujo"],"disc":["The Fish I Missed Was Big but I Caught Another Fish Was Too Big manga, Nigashita Sakana wa Ookikatta ga, Tsuriageta Sakana ga Ookisugita Ken / 逃がした魚は大きかったが 釣り上げた魚が大きすぎた件 , Always a Catch\nFrom a very young age, people noticed that Maria, the youngest daughter of a duke, was filled with potential. She was raised as the heiress of her house, until the birth of her baby brother relieves her of her duties. She scrambles to find a husband, but all the eligible bachelors in her duchy are taken! At this rate, she’s doomed to the life of a spinster! Maria decides to study abroad in Rubini in hopes of finding a husband, with the help of her distant relative, Aida. But in a twist of fate, the Crown Prince breaks of his engagement with Maria, even though they’ve never met before! “Huh?! I don’t remember getting engaged!?” Enjoy this fluffy romcom with a late-blooming villainess!"]},{"title":"Divorce Me, Husband!","tags":["Historical","Reincarnation","Romance"],"disc":["Read manhwa Divorce Me, Husband! / Let’s Get a Divorce, Husband","He was possessed by a supporting actor who was swept to death by treason committed by his husband.\nShe’s trying to get a divorce from her husband Claude to survive. Why is this guy so obsessed with me?!\n“We’re getting divorced, Claude.”\n“Aila, I’m not going to let you go, I’m not going to let you go.”\n“Use as much money as you like. Just stay with me, Ayla.”\nI don’t need it all, and I want to live before I get involved in treason!\nSo please…Divorce, please, husband."]},{"title":"Living As A Madman’s Sweet Wife","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa Living As A Madman’s Sweet Wife / 달콤한 미친놈의 아내로 산다는 것은","I was really married to a madman !","Poor Irene, she had to marry the craziest man in the empire.","She was reincarnated in this world, so rather than accepting her destiny, somehow, she always thought of divorcing that crazy man after marrying him for political reasons, and living well alone.","But this crazy guy kept asking why she had to divorce him.","“I like you.”","It’s just a romantic romance between a violent woman and a man who hates everyone and everything.","Irene, the adopted daughter of a marquis, was born with the memory of her previous life.","She wondered what the Marquis was thinking of adopting her as his adopted daughter, and he intended to force her to marry the 3rd prince, who is famous for killing hundreds of people…!","Irene was heading to the northern castle where the 3rd prince lives after keeping an eye on her foster parents.","After seducing the 3rd prince and bringing him back to the Imperial castle, she entered his crazy zone, believing in the promise of her adoptive father to divorce him, but she couldn’t help but tremble with fear.","Still, if she adds up her previous life, she’s lived 40 years, she can’t give that up so easily…! Irene did not care about the prince, and went on a castle exploration of the 3rd prince.","Entering the forbidden western section, she met a beautiful man with blonde hair and dark blue eyes and fell in love at first glance.","They said the prince had black hair, so that man couldn’t be him.","Prince Melar, with dark blue eyes, was so shocked by the existence of Irene, whom he can’t read her mind unlike others…."]},{"title":"I’m Just A Supporting Role, Can You Raise Me?","tags":["Drama","Fantasy","Manhwa","Romance"],"disc":["Read manhwa I’m Just A Supporting Role, Can You Raise Me? / 무협지 조연인데 키워주실래요?","I possessed the body of a character in <The Young Masters of the Namgung Palace>, a martial arts webtoon where people die.\nI was also a supporting role who was abandoned by the family and killed first.","This is not gonna happen! I’m going to save money and leave this family before the original starts!\nAfter deciding to do that, I showed off the part-time job skills I had honed in my previous life.","Even the strongest brothers in the armed forces, the unfortunate crown prince, and the incarnation of revenge, Magyoju.\nHe’s been associated with a nine-year-old martial artist?\nAccording to the original story, it would be a bad ending where everyone dies…….","All right, I’ll save everyone from this.\nA well-raised supporting role saves several main characters!"]},{"title":"Somehow I Raised A Prince","tags":["Drama","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Somehow I Raised A Prince / Raising a Dragon Prince / 어쩌다 보니 왕자님 키워 버렸어요","When the egg was rolled in her arms, the dragon was born.\nA full-fledged baby-sitter.\nOne well-bred dragon prince of one of the ten emperors.\nAdele is a girl who grew up in an orphanage and came to her uncle’s house.","While being in charge of her aunt’s farm for nine years and taking care of all the insane things on a cow ranch, she accidentally finds a large egg in a tree hole. A child who wakes up from the egg follows Adele like a parent, and Adele gives the child the name Sigmund.\nIn fact, Sigmund, who must be the Emperor of the Empire, stays with Adele in the form of a child, sealed with his powerful mana sealed.","Grand Duke Ernest and Archmage Jensen try to find the egg of the lost dragon.\nLushen, head of the Imperial knighthood, assisted by Zion, daughter of Grand duke Ernest, who has grown up as a man since childhood helps Adele.","Adele and Sigmund finally enter the imperial palace where they were awaited.\nA magical healing love story unfolded by two people.","“You are the beginning and the end of my world, Adele.”","The all-fearing ruler of this world, the violent dragon prince Sigmund and his bride Adele."]},{"title":"Boss of the Emperor’s Harem","tags":["Historical","Manhua","Romance"],"disc":["Read manhua Boss of the Emperor’s Harem on manhwaclan\nHave you ever heard of a fertility fairy? That’s what Yun Mian is! Her mission upon descending from the immortal realm is to help the imperial concubines of Xiao Guo’s emperor bear an imperial successor. What? His Majesty is infertile?! And it’s something that even the imperial physicians and divine doctors can’t cure? Yun Mian’s under enormous pressure now! “Yun Mian, we* are dizzy. Give us your divine qi.” In order to fulfill her duties, Yun Mian throws caution to the wind! “Yun Mian, our stomach hurts. Give us more of your divine qi.” After the ninety-ninth time she gave him her divine qi, the impossible happens**! Just as Yun Mian is about to inform the imperial concubines, the devilish emperor captures her in his arms! “Yun Mian, since you’ve cured us of our affliction… we shall grant you the imperial successor!” What? She didn’t want to take on THAT duty personally! She immediately flees, but the devilish emperor’s words follow her… “Yun Mian, until you’ve fulfilled your duties, you’re not allowed to leave!”"]},{"title":"Self Salvation","tags":["Drama","Fantasy","Manhwa","Romance","Webtoons"],"disc":["Read manhwa Self Salvation","I was the red daughter of the great countess, and lived an admirable life as the most beautiful woman in the empire. I thought I got terminally ill, yet when I woke up again I had become a commoner maid serving a mansion. The mansion that’s my own house.","‘What the hell is going on here?","My parents were dead and I was an illegitimate child born from my mother’s affair, not only that I had worked as a maid for 8 years?","Is this some kind of parallel world?\n…Maybe I had possessed my own body in a parallel world of some kind","In this world, it was a plan by my uncle to steal her title that dishonored and persecuted Neria","“Wake up. You are not a Valentis, and this place isn’t your home”\nI have decided that I would bring back everything that had been taken away from me.","You better be prepared,\n‘Cause I am not the Neria Valentis you used to know!’","Neria’s mission for self-rescue,\nSalvation is achieved by oneself!"]},{"title":"Jie Jie, Take Me Away","tags":["Drama","Romance"],"disc":["Read manga Jie Jie, Take Me Away / Big Sis, Take Me Away / Jiě Jiě, Qiān Wǒ Zǒu Ba / 姐姐，牵我走吧","“Hello, do you want a boyfriend from the state?” “Miss, please sign here.” In the new era, an app called “Luan Sheng” has become a mandatory product for entertainment in life, but at the age of 30, if someone is still unsuccessful in love, they will immediately be forced to get married to an assigned partner. Xu An Nuo, a rich and charming jie jie, is someone who is 100% and idiot when it comes to love. She wanted to save enough money to pay the hefty fine in order to be exempted from the test of love, and gain freedom in life. However, after failing in yet another test, in the end, she is … More…"]},{"title":"Prince Maker","tags":["Comedy","Drama","Fantasy","Manhwa","Romance"],"disc":["Read manga Prince Maker on MANHWACLAN\nThe prince who went to save the princess turned into a five-year-old child under the witch’s curse! One day a real prince came to the princess who had been trapped in the witch’s tower for 10 years and has been waiting for the prince to save her! As soon as they go out of the castle together with a happy future, the witch’s curse turns the prince into a five-year-old child…! A project to turn the prince into the best husband begins!\n프린스 메이커 / Prince Maker [Golden Church]"]},{"title":"Savior","tags":["Drama","Fantasy","Manhwa","Shoujo Ai","Vampire"],"disc":["Read manhwa Savior","The relationship between the vampire seeking salvation and the two women surrounding her.\nVampire In Won dreams of a normal life, and learns new feelings when she meets her senior Juyi in college.\nSe Yeon, a childhood friend who is obsessed with Won, tries to separate the two, but Juyi is annoyed by Se Yeon and deliberately approaches Won. The relationship between the three is headed towards destruction."]},{"title":"Don’t Mess With The Cultivation Babysitter","tags":["Shounen Ai"],"disc":["My Daddy is a Cultivator / Don’t Mess With The Cultivation Babysitter / 修真奶爸惹不起 / Xiu Zhen Nai Ba\n“Warning: Yaoi content: This manga contains materials that might not be suitable to children under 17. By proceeding, you are confirming that you are 17 or older.”"]},{"title":"The Last Will of a Crush","tags":["Drama","Fantasy","Josei","Manhwa","Romance","Slice of Life"],"disc":["Read manhwa The Last Will of a Crush / 짝사랑의 유서","Mingyeol is a happy-go-lucky twenty-six-year-old girl who recently quit her job. With extra time on her hands, she spends her days crushing on Tae-eun, a cute boy who works at her favorite coffee shop owned by Tae-eun’s older sister Huiyeon. Mingyeol stops by every day despite Tae-eun’s lukewarm reactions. What seems like a lucky break finally arrives when he asks for a favor. He hands her a letter, asking her to give it to Huiyeon a week later. Though puzzled, Mingyeol is willing to cooperate, but her own sister tactlessly opens the letter and announces the alarming news: it’s a will! When Mingyeol confronts Tae-eun, he acts like he doesn’t remember anything at all. Mingyeol is now armed with a mission to save her crush, but will he open up to her and tell her what’s wrong?"]},{"title":"Sarang and Pyeonggang’s Ondal","tags":["Fantasy","Reincarnation","Romance"],"disc":["Read manhwa Sarang and Pyeonggang’s Ondal / 사랑과 평강의 온달","High School Teacher, Park Sarang, has a very important mission to do even if it means devoting her entire life. She has to find ‘Ondal’, the true fated partner of her cousin Pyeonggang (Princess Pyeonggang in her previous life)! But when she’s busy searching for Ondal to tie their knot, handsome guys keep appearing in front on Sarang?!"]},{"title":"My Wife is Actually the Future Tyrant Empress","tags":["Action","Adventure","Comedy","Fantasy","Historical","Martial Arts","Romance","Time travel"],"disc":["The Lady is the future tyrant, Lady Tyrant is the future empress of my wedding, 娘子竟是未來暴君女帝\nZhao Jinyu had no idea that after his rebirth, he would have the future tyrant empress who usurped the throne as his wife. He puts in his heart and soul to prevent his wife from going astray in her current life. But this beloved wife seems to be different from her previous life. How come she doesn’t care about the affairs of the court at all and only sticks to him every day?　　 It’s good, the sooner and more children I can have with my wife, the busier she will be taking care of the babies. Then, she will have no time to plot the rebellion. The plan is ready!"]},{"title":"This Refreshing Marriage","tags":["Drama","Josei","Romance"],"disc":["Read manhwa This Refreshing Marriage / Marriage Revamp / 이 결혼, 새로고침","Cha Yoo-Jung almost lost her future adopted daughter So Eun, the lovely child she was raising since she was a little baby left on the orphanage’s steps, So Eun, who was brought home by Kang Jiwoon, her biological uncle, from the orphanage where she lived with Cha Yoo-Jung. In order to stay with her daughter So Eun, Cha Yoo-Jung was even willing to accept Kang Jiwoon’s marriage proposal and become So Eun’s real mother. Kang Jiwoon, who initially underestimated Cha Yoo-jung, slowly saw the difference between Cha Yoo-jung’s sincerity and all those mother figures he had seen so far. Will Cha Yoo-Jung be able to heal Kang Jiwoon’s inner wounds and maybe make him believe in sincere love?"," "]},{"title":"Miss Not-So Sidekick","tags":["Comedy","Fantasy","Historical","Isekai","Manhwa","Romance","Shoujo","Webtoons"],"disc":["Read manhwa Miss Not-So Sidekick / Buyao Xiaokan Nüpeijue / Gugyeongha’neun Deulleoriyang / La señorita no tan compinche / Miss Second Rôle / No subestimes al personaje de apoyo / Terjebak Peran Figuran / 不要小看女配角！ / 구경하는 들러리양","Hyejung loved to read to escape her daily stress. But that’s before she woke up inside the bizarre world of her favorite novel! Instead of the main heroine who courts three eligible men, she is now Latte Ectrie – a minor villain that everyone hates?! One way or another, it’s a chance to live out her most beloved storyline, with popcorn in hand to watch all the drama! Taking charge of the narrative takes on a whole new meaning"]},{"title":"I don’t write what I should write","tags":["Drama","Josei","Manhwa","Romance"],"disc":["Read manhwa I don’t write what I should write / Writer’s Block of Romance / 쓰라는 글은 안 쓰고","By chance, Yeo-rin witnessed her boyfriend having an affair with a girl. with her is In-ha, a man she doesn’t know in the visiting room by mistake.\nYeo-rin, who kissed In-ha on a whim, wrote her novel based on that experience and made a great debut.\nHowever, her joy was short-lived, her subsequent works were destroyed one by one and she fell into a state of stagnation.\nI’m a romance writer, but I can’t write romance! In front of such a gentle girl, In-ha, the muse of the first work, appeared again!\nYeo-rin suddenly lets In-ha, who is unemployed, move into her shared house.\nAs soon as In-ha walks into the house, Yeorin receives a proposal for a project from Seok-Hyun, her editor in charge, and an upfront payment of 300 million won!\nHowever, she has to write a romance novel!"]},{"title":"All I Want is You","tags":["Manhwa","Romance"],"disc":["Read manhwa All I Want is You / 원하는 건 너 하나","His grandfather’s will says he must marry Eunyul, who left him five years ago, and live together for more than a year to inherit control of a company. Although the wound of betrayal is still there, he is forced to start an awkward cohabitation with Eun-yul, who is raising a 5-year-old child alone."]},{"title":"The Persimmon Secretary","tags":["Office Workers","Romance","School Life","Shoujo"],"disc":["Read 감 비서가 고장났다 / The Persimmon Secretary‘s Feelings Are Out Of Order / Secretary Ojima is Broken / Secretary Out-of-Order / Secretary Gam is Broken","Gam Yoo Eun won the lottery with the leftover money from buying a bungeoppang after working overtime, as always.\nShe tried to quit her job as President Chae Do Hyuk’s secretary, a boss notorious for living solely for his work…","“Lately, my head is full with thoughts of Secretary Gam.”","Something’s wrong with the boss… I mean, why has he turned so soft all of a sudden?","She tried to push him away, saying it’s no use to act so out of character, but Yoo Eun is gradually shaken by relentless attacks from the handsome man.","Does she know that Do Hyuk is thinking the same exact thing?","“Persimmon secretary Gam is acting strange. I’ll make sure she goes back to normal.”"," "]},{"title":"Heavenly Bride","tags":["Drama","Fantasy","Historical","Mystery","Romance"],"disc":["Read manhwa Heavenly Bride / 천인의 신부 / Celestial Bride","“I am the one who will be your husband.” Chae-yeon, the princess of the Chae Dynasty, lost her mother, who was the Empress. She has lived in the palace, being cosigned to death by the Emperor’s beloved warlord, Gwibi. Chae-yeon, who decided to become a priest of heaven to change the fate of her beloved and reluctant brother, Sung-jong, heads to the shrine after the ritual of Jecheon. But, Lord Gwibi sent soldiers to stop Chae-yeon from gaining new authority as a bride of heaven, so when she was heading to the shrine, the man with wings appeared to save her. He took Chae-yeon with him and went away. Later, Neil Chae-yeon opened her eyes to find herself on a luxurious bed!"]}]